{
    "lectureCode": "GE000701",
    "courseName": "サステイナブル工学特論",
    "lecturer": [
        "江頭靖幸(工学部応用化学科)",
        "野田龍介(工学部機械工学科)"
    ],
    "regularOrIntensive": "総合科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "工学研究科博士前期課程サステイナブル工学専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ３０４"
    ],
    "courceDetails": {
        "courseOverview": "サステイナブル工学とは、持続可能な社会（サステイナブル社会）の実現に貢献するために、研究や技術開発において、ライフサイクル思考に基づいてplanet（地球環境との調和）、people（生活の質の向上）、prosperity（経済の活性化）という3つの視点を同時に考慮し、それぞれを望ましい水準に保つとともに、将来に渡って維持・向上する方向での科学的なアプローチを実践するという、今後の工学のあるべき姿を示す名称である。つまり従来のいろいろな工学分野と並列して「サステイナブル工学」が存在するのではなく、全ての工学分野が「サステイナブル工学」という特徴を持つべきなのである。この点については大学院生の研究活動もまた例外ではない。本授業では、受講生各自が自らの研究について上述の「サステイナブル工学」の条件が満たされているか否かを考察し、その結果をショートプレゼンテーションの動画として発表する。教員による評価と学生相互のフィードバックを得て各自の考えを整理することで、自らの研究のサステイナブル工学から見た位置づけを明確に示すことができる様になる。",
        "outcomesMeasuredBy": "本授業科目では以下を到達目標とする。1)「サステイナブル工学」の意義と範囲について自分なりの考えを他人に説明できること2）自分の研究と「サステイナブル工学」の関係について分かり易く他人に説明できること",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力分析・評価能力",
        "teachingMethod": "本授業では各自が「自分の研究テーマ」「サステイナブル工学」「両者の関係」について簡潔で分かり易く説明するショートプレゼンテーション動画を作成する。サステイナブル工学についての講義から始まり、先輩達の事例を参考として、各自最初の動画を作成する。他の学生からのコメントを受け、同時に他の学生の動画へのコメントを返し、また教員からの評価を受けた上で内容をブラッシュアップし、修正したプレゼンテーションを動画として完成させる。なお、動画の作成、他の学生の動画へのコメント等は授業時間外に行うこととする。授業の中では各動画とそれに対するコメントを含めて、教員が講評する。",
        "notices": "本授業は東京工科大学工学部で実施されているサステイナブル工学系の授業（「サステイナブル工学基礎」「サステイナブル工学実習」「サステイナブル工学プロジェクト演習」）の履修を前提とはしないが、「サステイナブル工学基礎」などの授業内容を知ることは「サステイナブル工学」の内容理解に対して有用である。",
        "preparatoryStudy": "「自分の研究テーマとサステイナブル工学」についてのショートプレゼンテーション動画の作成、他の学生の動画へのコメント等は授業時間外に行う。必ず期日までに提出すること。",
        "gradingGuidelines": "初回版･改訂版のショートプレゼンテーション動画の提出、他学生の動画へのコメントの提出を認定要件とする。プレゼンテーション･コメントの内容について新規性･独自性を中心として加点の対象とする。",
        "textbook": "指定しない",
        "referenceMaterials": "・芝池成人編著「サステイナブル工学基礎」（コロナ社、2018）",
        "courseSchedule": "・第1回：ガイダンス･講義「サステイナブル工学」について・第2回：サステイナブル工学の研究事例・第3回：ショートプレゼンテーション動画「自分の研究テーマとサステイナブル工学」講評①・第4回：ショートプレゼンテーション動画「自分の研究テーマとサステイナブル工学」講評②・第5回：ショートプレゼンテーション動画「自分の研究テーマとサステイナブル工学」講評③・第6回：皆の考える「サステイナブル工学」･プレゼンテーションのポイント・第7回：改訂版ショートプレゼンテーション動画の講評･まとめ",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/03\/19"
}