{
    "lectureCode": "GE000201",
    "courseName": "サステイナブルマニュファクチャリング特論",
    "lecturer": [
        "高橋秀智(工学部機械工学科)"
    ],
    "regularOrIntensive": "総合科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "工学研究科博士前期課程サステイナブル工学専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ２０３"
    ],
    "courceDetails": {
        "courseOverview": "現代の製品開発は，市場競争力，そして持続可能性をも考慮し迅速に行う必要がある．そのため３D-CADシステムを中核とし，設計，解析（CAEシステム），そして製造（CAMシステム）等の複数のプロセスが同時並行（コンカレント）的に進められる．そこで本講義では，まず３D-CADシステムに関して，形状や位置姿勢表現理論について学び，次いで変形等のシミュレーションを行うための理論についても学ぶ．また，形状データから加工データを生成するための理論・技術について学ぶ．さらに３Dプリンター等の最新の加工技術についても学ぶ．これらにより，サステイナブルなものづくりを実践するために必要な理論・知識を習得することができる．また、ここで用いられる数学は、線形代数、幾何学、微分積分学といった大学の初等数学でありそれらの復習にもなる。一方でプログラミング教育は、2020年度より小学校、中学校、高等学校でも必修化されるほど、その重要性は増しており、技術者として必須の基礎能力の１つとなっている。",
        "outcomesMeasuredBy": "本授業科目では，本学の「６つのラーニングアウトカム」のうち・実学に基づく専門能力・論理的な思考力・分析・評価能力の３つを目指し，より具体的には以下を到達目標とする。本科目の修得により、設計製造支援技術に関する基本理論と実践力を身に付けることを目指す．具体的には、以下の項目ができるようになる。１）形状や位置姿勢の表現と操作理論を理解し，説明することができる．２）１）に基づくプログラムを作成し，形状を表現し操作を行うことができる．３）形状の変形シミュレーションの原理を理解し，説明することができる．４）３）に基づくプログラムを用い変形等をシミュレーションすることができる．５）１）に基づき，形状を加工するための工具経路生成理論を理解し，説明することができる．６）設計製造支援技術における持続可能性を理解し，説明することができる．",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力",
        "teachingMethod": "講義資料を事前に配布し，MicrosoftPowerpointにまとめた資料，ビデオ教材等を適宜参照し、講義中の演習課題や、その他の演習課題により、理解度を確認しながら授業を進める。",
        "notices": "講義ノートを必ず作成し，授業の要点等をまとめながら受講すること．また，授業開始時に配布される演習課題は，当日の講義の理解度チェックに役立つので必ず解答し提出すること．",
        "preparatoryStudy": "微分積分，代数を復習しておくこと．C言語等のプログラム言語を使えるようにしておくこと．毎回の予習は必要ない．毎回の授業内容を60分程度復習しておくこと．",
        "gradingGuidelines": "授業への取組み姿勢（20%）、演習課題等による理解度チェック（60%）、最終レポート課題（20%）により、総合的に評価する。なお、各％は目安である。",
        "textbook": "特に指定しない．必要な資料は配布する．",
        "referenceMaterials": "第1回：デジタルマニュファクチャリングと3D-CAD第2回：形状と位置姿勢の表現・操作１第3回：形状と位置姿勢の表現・操作２第4回：演習１第5回：弾性変形シミュレーション１第6回：弾性変形シミュレーション２第7回：サステイナブルマニュファクチャリングとまとめ・演習２",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/02\/27"
    },
    "updateAt": "2024\/03\/19"
}