{
    "lectureCode": "GE000601",
    "courseName": "研究リテラシー",
    "lecturer": [
        "古井光明(工学部機械工学科)"
    ],
    "regularOrIntensive": "総合科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "工学研究科博士前期課程サステイナブル工学専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ２０３"
    ],
    "courceDetails": {
        "courseOverview": "大学院では高度な専門教育を受けるとともに、既知の学問に新たな知見を加える研究活動に重点が置かれている。本講義では研究を実践するための基礎的な技能を学ぶ。具体的には（1）実験により得られたデータを正しく処理し分析する「データ処理技術」、（2）研究成果を正しくかつ魅力的に発表するプレゼンテーション資料の作成と英語での発表を行うための「発表技術」、（3）英語論文を読解し、また英語論文を執筆するための「英語論文技術」、（4）研究者として遵守すべき規範に関する「研究倫理」を学ぶ。",
        "outcomesMeasuredBy": "本講義を通して、授業概要に記載の内容についての基礎的かつ実践的な知識を身につける。具体的には（1）データの取得における有効数字(桁)の意味、必要性について理解する。さらに実験計画などに必要「分散」,「相関」,「検定」の基礎を理解し「分析・評価能力」を身につける。（2）プレゼンテーション資料の作成のための「発表技術」の基礎として、聴衆に伝わる発表の技法を学び、適切な「コミュニケーション能力」を身につける。（3）英語論文を読解し、また英語論文を執筆するための「英語論文技術」として英語の高次文法(パラグラフ構造)を理解し、国際的な論理の記述について理解し、「国際的な教養としての英語コミュニケーション能力」「論理的な思考力」を身につける。これにより論文の速読も可能になる。（4）工学倫理の事例の「ケーススタディ」,「ケースメソッド」から倫理的な工学研究者の姿勢を把握する。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "moodleを使用した配布資料を用いて授業を進める。第１回目のみ対面講義で実施する。２回目以降はオンデマンド講義とする。演習を毎回課す。その提出を持って、講義への参加と認める。また、課題をレポートとして課し、そのレポートを題材にさらに・講評・解説を行なう（部分的反転講義）。特に研究倫理に関しては、ケースメソッド課題を提案し、その課題へのレポートをたたき台にして、問題点の指摘を通して、講義を進める。",
        "notices": "本講義では毎回，課題を課す。この課題の提出により授業の参加状況を評価する。moodleに挙げられている配布資料を読むこと。課されたレポート課題に積極的に取り組むこと。",
        "preparatoryStudy": "moodleに挙げられている配布資料を読むこと。また関連する書籍などを読んでおくこと。",
        "gradingGuidelines": "講義中に課すレポートを元に評価する。",
        "textbook": "Moodle資料",
        "referenceMaterials": "指定しない。",
        "courseSchedule": "第1回：理系の英語(1)ボキャビルTOEICの勧め第2回：プレゼンテーション技能(1)理系の日本語修辞学基礎第3回：理系の英語(2)英語の高次文法パラグラフライティングのルールと論理第4回：プレゼンテーション技能(2)文章の校正技術の基礎第5回：工学者の倫理(1)工学者の倫理基礎、ケースメソッド提案第6回：データの取扱いデータの取扱い基礎と検定第7回：工学者の倫理(2)課題の解説",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}