{
    "lectureCode": "GE102301",
    "courseName": "錯体化学特論",
    "lecturer": [
        "森本樹(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "工学研究科博士前期課程サステイナブル工学専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ３０４"
    ],
    "courceDetails": {
        "courseOverview": "金属錯体の光物性や光化学反応を理解し、光触媒や光機能性材料に用いられている金属錯体の役割や動作原理およびその設計・改良に関する知識を身につける。まず、点群や金属錯体の電子状態についての基礎知識を学び、続いて、分子・金属錯体の性質、特に、その光物理・光化学を理解・解釈・予測できるようになる。また、これらの知識を活用して、金属錯体の特異性を利用した機能性材料の設計や改良ができるようになる。",
        "outcomesMeasuredBy": "金属錯体の性質、特に、その光物性と光化学反応を理解するために必要となる、理論や考え方を確実に身につける。分子・金属錯体の対称性と点群の理解、構造からの物性の理解・予測、各種スペクトルの解釈、金属錯体の光物理・光化学の理解、金属錯体の特徴を利用した光触媒や光機能性材料の動作原理の理解ができるようになる。また、これらの知識を活用して、金属錯体の特異性を利用した機能性材料の設計や改良ができるようになる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業は主としてプロジェクターを使用する。講義はオリジナルテキストに沿って進め、毎回まとめ・演習プリント、また、必要に応じて補助資料等を配布する。さらに、小テストを毎回行い、要点の確認と復習を行う。ノートPCを使用する場合は事前にアナウンスする。",
        "notices": "金属錯体を利用する触媒や機能性材料の理解に必須の内容を扱うので、講義内容をよく理解するように努めること。また、基本的な無機化学、分析化学、量子化学、光化学の知識は受講の前提である。",
        "preparatoryStudy": "予備知識として、学部開講の「無機化学」、「分析化学」、「無機工業化学」、「量子化学」、「光化学」の内容を復習しておくと、講義の理解に大いに役立つ。また、予習においては、テキスト、毎回配布するまとめ・演習プリントの内容を確認し、演習問題を解き、次回の講義内容を把握しておくこと。復習では、講義で扱った内容や問題を自分で考え、解き直し、その内容が定着するように努め、またノートに要点をまとめること。",
        "gradingGuidelines": "毎回の小テスト（30%）と期末試験（70％）から総合的に評価する。",
        "textbook": "特になし（オリジナルテキストを配布する）",
        "referenceMaterials": "分子の対称と群論（東京化学同人、中崎昌雄著）金属錯体の光化学（三共出版、佐々木陽一・石谷治編著）シュライバー・アトキンス無機化学（上）第４版もしくは第６版（東京化学同人）ハウスクロフト無機化学（上）（東京化学同人）",
        "courseSchedule": "第1回：ガイダンスおよび関連する化学・物理の復習第2回：点群による分子・錯体の理解(1)：分子・錯体の構造と対称性第3回：点群による分子・錯体の理解(2)：分子・錯体の対称性に注目した物性の理解第4回：点群による分子・錯体の理解(3)：分子・錯体の各種スペクトルの解釈第5回：金属錯体の光機能性(1)：分子・金属錯体の基底状態と励起状態の特徴第6回：金属錯体の光機能性(2)：分子・金属錯体の光物理と光化学第7回：金属錯体の光機能性(3)：金属錯体の特性を利用した触媒・材料",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/03/19"
}