{
    "lectureCode": "GE101301",
    "courseName": "サステイナブルデバイス工学特論",
    "lecturer": [
        "前田就彦(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水"
    ],
    "targetDepartment": "工学研究科博士前期課程サステイナブル工学専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ３０４"
    ],
    "courceDetails": {
        "courseOverview": "現代の高度な科学技術社会を支えるために必要不可欠となっている発光ダイオード、レーザーダイオード、トランジスタなどの光・電子デバイスにおいても、近年、より高機能かつ省エネの地球環境に優しい技術が求められるようになった。このような背景のもと、サステイナブル社会の実現のために今後どのような電子材料や光・電子デバイスの研究開発が必要かを、進化を遂げつつある現在のデバイスの研究開発の最前線の状況を交えて学ぶ。具体的には、半導体物性の基礎および半導体の光デバイス・電子デバイスの基礎を学修したのち、LED（発光ダイオード）、LD（レーザーダイオード）、MOS（Metal-Oxide-Semiconductor）トランジスタ、FET（電界効果トランジスタ）などの重要デバイスがどのように発展を遂げてきたかを学修し、サステイナブル社会実現のための光・電子デバイスの今後の可能性や将来展望について考える。この授業により、半導体やその他の電子材料の物性やそれらのデバイス応用についての基礎知識が得られると同時に、各々の光・電子デバイスの研究開発の経緯や最前線についての知識が得られ、サステイナブル社会の実現に向けての今後の研究開発課題を理解し、考えることができるようになるための基礎的な能力が身につく。",
        "outcomesMeasuredBy": "本科目を習得することにより、電子材料の物性やそれらのデバイス応用、各々のデバイスの研究開発の経緯や最前線、サステイナブル社会実現に向けての今後の研究開発課題に関して、実学に基づく専門能力、理論的な思考力、分析・評価能力、問題解決力が身につく。具体的には下記のことができるようになる。・半導体物性の基礎事項について説明できる。・LED、LD、MOSトランジスタ、FETなどの代表的な光・電子デバイスの動作原理や研究開発の経緯、研究の最前線について説明できる。・パワーデバイスの最近の進展について説明できる。・サステイナブル社会の実現に向けての半導体工学の重要性や今後の研究開発課題について説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "プロジェクターと黒板を用いた講義形式で行い、適宜、演習を行う。",
        "notices": "ノートPCおよび手書き用ノートを準備すること。本科目を受講するに際しては、広い意味での科学技術社会、特に半導体産業を中心としたものづくりに関心があることが望まれる。また、本科目は、数学と物理学を基礎として、電子物性、電子デバイス、電子回路、電気電子機器などの広範な理工学分野に関連するので、これらの分野のいくつかに興味を持っていることが望ましい。",
        "preparatoryStudy": "日頃から半導体産業や、サステイナブル社会の実現における半導体デバイスや電子機器の役割について関心を持つようにすると、本科目の学修がより意義深いものとなる。身近にあるエレクトロニクス関連の専門誌やweb記事等を活用して各回の授業項目に関連する予備情報を事前に得ておくこと。また、各回の授業項目に関して学部で学修した経験がある際には、その内容を復習しておくと授業での理解がより深いものとなる。各回の復習は授業スライド資料（Moodleにアップ）にて十分に行うこと。",
        "gradingGuidelines": "第１回～第７回の毎回授業における理解度チェックの演習（40%）とレポート提出（60%）により評価する。",
        "textbook": "指定しない",
        "referenceMaterials": "“SemiconductorDevices----PhysicsandTechnology----“,S.M.SzeandM.K.Lee,(WILEY),ISBN:978-0-470-87367-0「キッテル固体物理学入門第８版（上）」CharlesKittel原著、宇野良清、津屋昇、新関駒二郎、森田章訳（丸善）ISBN:978-4-621-07653-8",
        "courseSchedule": "第1回：導入（サステイナブル社会の実現に向けての半導体工学の重要性）第2回：半導体物性の基礎第3回：半導体光デバイスと電子デバイスの基礎第4回：LED（発光ダイオード）とLD（レーザーダイオード）の研究開発の進展第5回：MOS（Metal-Oxide-Semiconductor）トランジスタの研究開発の進展第6回：高周波FET（電界効果トランジスタ）とパワーデバイスの研究開発の進展第7回：まとめ（サステイナブル社会実現のための研究開発課題）",
        "courseDataUpdatedAt": "2024\/01\/08"
    },
    "updateAt": "2024\/09\/13"
}