{
    "lectureCode": "GE100501",
    "courseName": "アドバンスト制御特論",
    "lecturer": [
        "余錦華(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "工学研究科博士前期課程サステイナブル工学専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ３０４"
    ],
    "courceDetails": {
        "courseOverview": "ものづくりの高度化には制御技術が重要である。環境や状況の変化に影響されずに，高品質な製品の生産においてアドバンスト制御理論は重要な役割を果たす。本講義はアドバンスト制御の基本について説明する。制御系の設計は基本的に制御対象のモデルに基づいて行われる。しかし，制御対象のパラメータ変動，構造的変化，モデル化しきれない構造要素など不確さが存在するため，実際の制御対象とそのモデルの間につねに差が存在する。このような差を陽に考慮して系を安定化する制御器を設計する手法としてロバスト制御理論が提案されている。本講義では，数学の基本事項を復習した後，主に線形システムの構造的性質，安定論とロバスト制御について学ぶ。本授業を履修することにより，ロバスト制御の概観が理解でき，さらに，いくつかの新しい制御手法の理論と応用について深く理解する。",
        "outcomesMeasuredBy": "本授業科目では，まず，１）ロバスト制御に関する概観を理解する２）現代制御理論における各種基本概念を理解する３）講義で選んだ新しい制御トピックについて，その基本的な考え方を理解することを基本目標とする。また，４）講義で選んだ新しい制御トピックについて，その応用可能性について理解するを上位到達目標とする。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "配布資料に沿って講義を進めるが，適宜に演習問題を交えて理解を深める。授業スタイルは，板書による説明やPPTなどのマルチメディア資料によるプレゼンなどを融合したものとなる。",
        "notices": "本授業は新しい概念が多く出てくるので，遅刻せずに授業に出席すること。また，授業の内容について，復習を十分に行うこと。毎回の予習・復習時間は１時間以上が望ましい。",
        "preparatoryStudy": "本講義はラプラス変換，線形代数と制御理論基礎の知識が必要であるため，ラプラス変換と線形代数の基本事項を，事前に復習しておくことが望ましい。",
        "gradingGuidelines": "課題演習レポート（60％），少人数のグループワーク（30％）に加えて，授業態度（10％）も加味して評価を行う。",
        "textbook": "資料配布",
        "referenceMaterials": "線形ロバスト制御，劉康志著，コロナ社，ISBN4-339-03358-8，3000円FeedbackControlTheory,J.C.Doyle,B.A.Francis,andA.R.Tannenbaum,MacmillanPublishingCompanyフィードバック制御の理論―ロバスト制御の基礎理論―，藤井隆雄監訳，コロナ社，ISBN4-339-03158-5，3090円",
        "courseSchedule": "第1回：アドバンスト制御手法概観1（アドバンスト制御手法の分類と特徴）第2回：アドバンスト制御手法概観2（信号とシステムのノルム，能動的外乱抑制手法の分類と特徴）第3回：アドバンスト制御に関する特選トピック1（可制御性と最適制御）第4回：アドバンスト制御に関する特選トピック1（可観測性と最適観測）第5回：アドバンスト制御に関する特選トピック2（等価入力外乱手法の基本的な考え方）第6回：アドバンスト制御に関する特選トピック2（等価入力外乱手法の各種応用）第7回：総合演習",
        "courseDataUpdatedAt": "2024/03/02"
    },
    "updateAt": "2024/03/19"
}