{
    "lectureCode": "GGB11001",
    "courseName": "ゲノム機能解析学特論",
    "lecturer": [
        "佐藤淳(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "バイオ・情報メディア研究科博士前期課程バイオニクス専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ３０２"
    ],
    "courceDetails": {
        "courseOverview": "近年、様々な生物のゲノム構造（塩基配列）が明らかとなり、生物機能の全体像を解析するための基盤が整ってきた。このゲノム構造をもとに、遺伝子機能をゲノムスケールで解明する取り組みがゲノム機能解析学である。ゲノムスケールでの遺伝子発現は、様々な段階で様々な因子が複雑に相互作用して成り立っている。本講義では、最近新たに明らかとなってきたゲノム機能（クロマチン構造、ヒストンコード、エピジェネティックス、メチル化DNA、ゲノムインプリンティング、X染色体不活性化、環境とエピジェネティックス、ノンコーディングRNAなど）の基礎、ならびにその最新情報について学ぶ。なお、この講義は英語で授業を行うので、履修者の英語力は必須である。",
        "outcomesMeasuredBy": "本講義では、ゲノム機能についての実学に基づく専門力を身につけることを目指す。具体的には、近年進展が著しいゲノムサイエンスの基本知識や最新情報（クロマチン構造、ヒストンコード、エピジェネティックス、メチル化DNA、ゲノムインプリンティング、X染色体不活性化、環境とエピジェネティックス、ノンコーディングRNAなど）の習得を目標とする。さらに、英語で講義を行い、英語での課題提出を課すことにより、コミュニケーション能力と国際的な教養を高めることも目標としている。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力",
        "teachingMethod": "ゲノム機能解析学を学習する上で必須となる分子生物学にも触れながら、講義を進めていく。予習に基づく課題提出をお願いしている。講義を受けるのに際して、各自PCを持参の事（最新情報をインターネットで確認しながら進める）。指名した学生に課題や質問の回答を求め、その回答例を参考にしながら講義内容を確認するアクティブラーニング形式を取り入れる。なお、この講義は英語で授業を行い、英語で質問しながら理解の確認を行う。毎回、講義内容の課題を課しており、そのフィードバックは講義中に行う。",
        "notices": "本講義では、ゲノム関連の基礎事項を扱うので、履修者の専門分野については特に限定しない。事前に講義資料をダウンロードして予習し、課題を事前に提出すること。この講義は英語で行うので、履修者の英語力は必須である。",
        "preparatoryStudy": "事前に講義資料をダウンロードして、必ず予習し、課題を事前に提出すること（英語資料なので、必ず事前準備をして講義に臨むこと）。講義には印刷した資料を必ず持参すること。講義後は、講義内容についてきちんと復習を行うこと。",
        "gradingGuidelines": "講義内容の簡単なまとめを英語で提出する毎回のレポート50%と期末試験50%で評価する。課題のフィードバックは講義中に行う。",
        "textbook": "指定なし。事前に講義資料をダウンロードして予習、復習すること。",
        "referenceMaterials": "無し。",
        "courseSchedule": "Session1,IntroductiontoFunctionalGenomics,NucleusandChromosomeSession2,ChromatinstructureSession3,Epigenetics1(Histonecode)Session4,Epigenetics2,DNAmethylationSession5,Epigenetics3GenomicimprintingandXinactivationSession6,Canenvironmentinfluenceepigenetics?Session7,Term-endexamination",
        "courseDataUpdatedAt": "2024/02/29"
    },
    "updateAt": "2024/03/19"
}