{
    "lectureCode": "GGB10801",
    "courseName": "分子腫瘍学特論",
    "lecturer": [
        "岡田麻衣子(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "バイオ・情報メディア研究科博士前期課程バイオニクス専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ３０２"
    ],
    "courceDetails": {
        "courseOverview": "バイオテクノロジーの飛躍的な発展と共にがんの発症や悪性化の仕組みが分子レベルで明らかになりつつある。一方で、超高齢化社会に突入した我が国ではがんの罹患率・死亡率は増加の一途をたどっており、新たな抗がん剤の開発は急務となっている。本講義ではがん治療をテーマとした最新の研究トピックスを適宜紹介し、抗がん剤の開発の基盤となる分子生物学の知識や技術について解説する。また、これらの理解を深めることで研究遂行における論理的思考について学ぶ。",
        "outcomesMeasuredBy": "本講義では、分子腫瘍学についての実学に基づく専門力を身につけることを目指す。「がん治療」をテーマとしたトピックスの紹介を通じて、創薬研究の基盤となる分子生物学の知識や技術の理解を目標とする。また、これらの理解を通じて研究データの解釈や問題点の分析、研究計画の立案といった、研究の遂行における一連の論理的な思考を身につけることを目指す。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "パワーポイントを用いて講義をすると共に、指名－回答－解説を中心としたアクティブラーニングを適宜取り入れる。一部穴埋め形式の講義資料を事前にダウンロードして予習をしてから授業に臨むこと。また、講義課題ではPCを使用するため、PCを必ず持参すること。研究結果の解釈や問題点の分析・研究計画については、具体的な研究データを用いて解説するとともに、模擬データを提示して演習を行う。また、一部の講義では英語でのプレゼンテーションの練習やグループワークを取り入れた演習も行う。",
        "notices": "学部における生物系の講義をよく復習してから臨むこと。特に分子生物学を理解していることが望ましい。",
        "preparatoryStudy": "Moodleにアップロードした講義資料を確認すること。とくに、講義資料に記載の専門的な科学用語については、その意味を自ら調べて予習すること。講義冒頭で前回の講義回の課題を解説するので、理解が深まるよう、事前に各自の解答を見返しておくこと。",
        "gradingGuidelines": "全ての講義への出席を前提とし、講義ごとに理解度チェックを目的とした課題を課す。課題については次回の講義冒頭において解説してフィードバックする。各回の課題を50%、最終レポートを50%として評価する。",
        "textbook": "指定しない",
        "referenceMaterials": "「THECELL細胞の分子生物学」日本語版第6版・著者：B.Alberts、A.D.Johnson、J.Lewis、D.Morgan、M.Raff、K.Roberts、P.Walter・監訳：中村桂子・松原謙一・出版社：W.W.Norton「がんのベーシックサイエンス」日本語版第3版・著者：I.F.Tannock、R.P.Hill、R.G.Bristow、L.Harrington・監訳：谷口直之、大島明、鈴木敬一郎・出版社：MEDSi",
        "courseSchedule": "第1回：がん細胞における遺伝情報の発現・維持機構の破綻第2回：分子標的薬開発の意義第3回：DNA修復機構の破綻に基づくがん治療第4回：転写制御機構に基づくがん治療第5回：転写制御機構の解析手法第6回：タンパク質分解機構に基づくがん治療第7回：タンパク質分解機構の解析手法",
        "courseDataUpdatedAt": "2024/02/29"
    },
    "updateAt": "2024/03/19"
}