{
    "lectureCode": "GGB12301",
    "courseName": "化粧品設計学特論",
    "lecturer": [
        "柴田雅史(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "バイオ・情報メディア研究科博士前期課程バイオニクス専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ２０３"
    ],
    "courceDetails": {
        "courseOverview": "本授業は、界面化学技術が化粧品製品の処方設計および商品開発にどのように応用されているのかを、講義および処方解析実習を通して学ぶ。化粧品製品の題材としては、口唇スティック化粧料（リップクリーム）を用いる。前半はゲルの物性制御を中心とした界面化学の講義と、化粧品に用いることのできる成分と各種規制についての講義をおこなう。後半は履修者が選択した化粧品製品を題材に、その製品にどのような界面化学技術が用いられているのかを解析し、レポートの作成ならびに議論をおこなう。",
        "outcomesMeasuredBy": "本授業では、前半の講義部分で化粧品分野についての実学である界面化学に基づく専門力を身につけることを目指す。後半の製品解析では、界面化学の見地から各成分が配合される目的と、それが統合された処方全体の設計思想と性能を推察することで、「論理的思考力」および「分析・評価力」を身につけることを目標とする。本授業を履修することで、化粧品設計における界面化学技術の知識を習得でき、それが製品の設計にどう活かされているかを理解することができる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "前半は、界面化学の見地からの化粧品の定義と機能についての説明。油性ゲルの物性制御と界面化学を用いた持続性向上技術を中心とした油系界面化学技術についての講義をおこなう。後半は、履修者が選択した口唇スティック化粧料について、その処方の設計思想（狙いの性能）を整理することと、その性能実現のためにどのような界面化学技術が活用されているのかを推察するアクティブラーニングをおこなう。その後レポートを提出する。授業にはノートPCを持参して参加する。",
        "notices": "化粧品製品設計を題材とするが、本授業で学ぶ界面化学技術は、食品加工および医薬品製剤化技術として活用されている。したがって化粧品専攻でない学生も履修対象とし、講義および発表の仕方を工夫して化粧品分野の知識がなくても履修に問題がないようにしている。",
        "preparatoryStudy": "レポート作成のための製品調査、解析ならびに資料作成をおこなう。",
        "gradingGuidelines": "講義部分でのクイズや意見発表を20％、レポートを80%で評価をおこなう。授業の最終回でフィードバックをおこなう。",
        "textbook": "おもしろサイエンスリップ化粧品の科学日刊工業新聞社",
        "referenceMaterials": "化粧品成分検定公式テキスト実業之日本社日本化粧品工業連合会http:\/\/www.jcia.org\/n\/Cosmetic-Info.jphttp:\/\/www.cosmetic-info.jp\/その他、適宜必要書類を授業サイトからダウンロードする。",
        "courseSchedule": "第1回:化粧品とはどういう製品か？食品や医薬品との対比第2回:界面化学と化粧品への応用第3回:講義乳化とゲル化技術第4回:講義オイルゲルの硬度調整技術第5回:化粧品の各種規制とそれを踏まえた製品設計第6回:化粧品成分および処方の解析方法第7回:実習：化粧品製品の解析レポート（第1回）のフィードバック",
        "courseDataUpdatedAt": "2024\/02\/28"
    },
    "updateAt": "2024\/03\/19"
}