{
    "lectureCode": "GGB11601",
    "courseName": "環境マネジメント特論",
    "lecturer": [
        "浦瀬太郎(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "バイオ・情報メディア研究科博士前期課程バイオニクス専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ２０３"
    ],
    "courceDetails": {
        "courseOverview": "さまざまな微量化学物質による汚染や放射線，有害微生物によるリスクをどのように管理するのかについての基本的な考え方を学ぶ。さらに，水環境関連技術の最新の動向についても学ぶ。これらにより，環境分析コンサルタント業や上下水道維持管理業に就職する場合はもちろん，他の業界に就職する場合にも，地球規模の思考のできる人材を育成する。",
        "outcomesMeasuredBy": "環境分野における実学に基づく専門力をつける。具体的には企業の環境部門で働く場合の基礎知識の獲得と，環境部門以外で働く場合にも環境管理の常識的な考え方が理解できるようになることを目指す。また，基準値，環境規制に関するレポートを作成することで，予算や人的資源に制約のある中で，どの価値を優先すべきかについて判断ができるようになる(問題解決力)。また，英語の有害物データベースを参照することで化学物質の毒性情報を英語で確認することができるようになる(国際的な教養)。また，授業は，指名して質問をしながら行い(アクティブラーニング)，質問への応答ができる力を身につける(コミュニケーション力)。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力問題解決力",
        "teachingMethod": "講義形式でおこなう。少人数の場合には指名して意見を述べてもらいながら，1回の授業中に最低2回は各自が発言できるように授業をする(アクティブラーニング)。人数が多い場合には，試験や発表を課す。授業資料の一部は英語とし，LMS(Moodle)上にあらかじめ掲出しておくので参照すること。PCは資料の閲覧(資料を印刷してきた場合などは不要)，および，授業時間外のデータベースへのアクセス(宿題への解答)に使用。",
        "notices": "この科目を履修するにあたって，前もって履修すべき科目は指定しない(特定の環境分野に関する基礎知識を前提とした講義ではない)。また，しっかり授業に参加すること。「参加」とは出席だけで達成されるのではなく，授業内で発言したりすることを含む。",
        "preparatoryStudy": "レポート課題を準備することが必要である。また，講義内容の理解，用語の理解について，予習・復習教材をmoodle上で提供する。",
        "gradingGuidelines": "授業への十分な参加をしたものに対して，授業内での質問や課題への回答(50%)，レポート(50%)を総合して評価する。なお，履修人数が多数となった場合には，授業内での回答に代えて試験を実施する場合がある。授業は対話方式で行っているので，学生の発言には，授業内でフィードバックをする。提出されたレポートについても，その内容を次回の授業で紹介する。",
        "textbook": "なし",
        "referenceMaterials": "講義資料をLMS(Moodle)上に掲載するので，それを予め，ダウンロードして講義にのぞむことが望ましい。",
        "courseSchedule": "第1回:環境基準などの規制値の算出の考え方第2回:化学物質の健康への影響（無影響濃度，安全係数，耐用1日摂取量，実質安全量）第3回:環境DNAと次世代シーケンサー，新型コロナウイルスの下水疫学第4回:マイクロプラスチック問題第5回:地球温暖化のメカニズム，現状，対策第6回:水ビジネスの現状と膜分離による水処理技術第7回:管理の原則(PDCA,ISO,B\/C)",
        "courseDataUpdatedAt": "2024\/02\/27"
    },
    "updateAt": "2024\/03\/19"
}