{
    "lectureCode": "GGC12701",
    "courseName": "分散システム",
    "lecturer": [
        "串田高幸(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "バイオ・情報メディア研究科博士前期課程コンピュータサイエンス専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ３０４"
    ],
    "courceDetails": {
        "courseOverview": "分散システムは，コンピュータ間をネットワークで接続して利用できるようにするための統合化技術である．最近の大規模Webシステム，クラウド，ビッグデータ処理，IoT，ブロックチェーンは，分散システムで構築されている．この授業では，分散システムの基礎を体系立てて理解して，どのような機能を持っているのか，その特徴はどのようなものなのかを理解する（論理的な思考力）．また，分散システムが実際に利用されていることを理解する（実学に基づく専門の能力）．授業は，履修学生がディスカッションリーダーとレビューアーになって，教科書の内容についての質問や議論を行なって内容の理解を深める（コミュニケーション能力）．この授業は，企業において分散システムやクラウドの研究開発に従事した実務経験に基づき，大学院で学ぶ技術や知識が，実際の研究開発でどのように利用されているかについて習得することができる実践的科目である．",
        "outcomesMeasuredBy": "・分散システムの透過性，開放性，制約を理解して説明できるようにする．・分散システムの種類と分散情報システムを体系立てて説明できるようにする．・分散システムのアーキテクチャについて，基本的な形式と応用を理解して説明できるようにする．・プロセス，スレッド，仮想化，コンテナ化を体系立てて説明できるようにする．・クライアント・サーバモデルと，ソケット通信を理解して説明できるようにする．・同期，複製，一貫性，フォールトトレーラント性を理解して説明できるようにする．・分散ファイル，分散オブジェクト，分散Webシステムを理解して説明できるようにする．・名前づけ，排他制御，選出アルゴリズム，位置システムを体系立てて説明できるようにする．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力",
        "teachingMethod": "・授業は，指定された教科書を使って輪講形式で行なう．・授業では，学生がディスカッションリーダーとなって，教科書の各章の内容についての説明をおこなう．・ディスカッションリーダーの説明をもとにして，他の学生全員はレビューアーとなって内容に関して，質問やコメントをして議論を行なって，分散システム技術的な内容の理解を深める．",
        "notices": "・授業には，ノートＰＣと教科書を必ず持ってくること．・授業開始時間に遅刻しないようにすること．・授業開始時間から5分以上遅れた場合は，欠席とする．",
        "preparatoryStudy": "ディスカッションリーダーは，教科書で担当の章を読んで理解して，授業で説明できるようにすること．それ以外の学生は，レビューアーとして教科書の章を事前に読んで理解して，授業においてディスカッションに参加できるようにすること．(45-90分)復習は，授業中によくわからないところの教科書を読んで理解すること．また，授業中に理解ができないかあるいは疑問があるところは，課題をすることで理解を深めることと，次の授業のときに質問すること．（45-90分)",
        "gradingGuidelines": "成績評価は，以下の配分とする．１.レビューアーとして，教科書の各章の説明に対して積極的にディスカッションに参加して，活発に質問や議論したことによる評価（70点）２.ディスカッションリーダーとして，担当した箇所の説明と議論を活発にする活動に対する評価（15点）3.資料およびレポートの評価（15点）上記を合計して100点満点で評価する．60点以上を単位として認める．ただし，出席日数が足りないときは，不合格とする．",
        "textbook": "DistributedSystems(ThirdEdition)byMaartenVanSteen,AndrewS.Tanenbaumhttps://www.distributed-systems.net/index.php/books/distributed-systems-3rd-edition-2017/",
        "referenceMaterials": "デジタルシリーズ分散システム水野忠則監修共立出版社(ISBN978-4-320-12351-9)分散システム真鍋義文著森北出版(ISBN978-4-627-81071-6)",
        "courseSchedule": "第１回はじめに第２回アーキテクチャ第３回プロセス第４回通信第５回名前付け第６回協調第７回同期と複製",
        "courseDataUpdatedAt": "2024/01/08"
    },
    "updateAt": "2024/03/19"
}