{
    "lectureCode": "GGC13401",
    "courseName": "企業価値評価",
    "lecturer": [
        "山口淳(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "バイオ・情報メディア研究科博士前期課程コンピュータサイエンス専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本科目は、コーポレートファイナンスの基礎である企業価値評価の方法を知ることが目的とし、それらの評価方法の持つ意味と限界について学ぶものである。この授業は、教員の東京ガスにおける投資評価や業績評価に従事した実務経験に基づく実践的科目である。CS専攻の学生の多くは、将来的に技術開発・活用を通じて価値を生み出す仕事に従事すると考えられる。その際に、価値がおカネの視点で評価される方法を知ることは、企業を取り巻くステークホルダーの視点を理解することにつながり、よりよい技術の開発・活用のあり方を考えるための基礎となる。また、おカネの視点で企業経営を把握する世界共通のリテラシーを身に付けることも本講義の目的である。授業では、身近な事例や現実のビジネスにおける代表的な事例を取り上げ、それらと理論を一緒に考えることを通じて、使える理論を身に付けることを目指す。",
        "outcomesMeasuredBy": "本講義の到達目標は、企業価値を分析する方法に関する必要最低限の知識と、それらの方法が持つ効果と課題を理解することである。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力分析・評価能力",
        "teachingMethod": "【授業形態：講義／演習】授業は理論の講義とともに、問題演習やその解説を中心とする。毎回課す事前アサインメントによる予習・復習の問題演習とそこで出てきた典型的な解答やユニークな解答の紹介や、疑問点への解説を講義で中心的に行うアクティブラーニングである。また講義終盤の演習においては、グループワークを一部に取り入れ、企業経営に対する様々な視点を習得する。ノートPC必携。",
        "notices": "この講義は、企業経営に関する事前知識は特に必要としない。講義に出てくる用語等でわからないものがある際には参考書、インターネット等で適宜調べて授業に臨むこと。",
        "preparatoryStudy": "本講義では毎回事前アサインメントによる予習・復習の問題演習を課しており、講義前の提出を求めている。問題演習の解答内容から、典型的な解答やユニークな解答を取り上げるとともに、疑問点として提示された内容を紹介し、それらについて解説を行うことが講義の中心となる反転授業を行う。",
        "gradingGuidelines": "事前アサインメントと授業内貢献を50%，期末レポートを50%で評価を行う。フィードバックに関しては、事前アサインメントの全体的な理解状況や、典型的な誤りについて授業内で説明を行う。",
        "textbook": "指定しない。",
        "referenceMaterials": "グロービス経営大学院『新版MBAファイナンス』ダイヤモンド社,2009年リチャード・A・ブリーリー,スチュワート・C・マイヤーズ,フランクリン・アレン『コーポレート・ファイナンス第10版上・下』日経BP社,2014年",
        "courseSchedule": "第1回：企業価値評価とは？ーガイダンス、BS\/PLを知るー第2回：企業価値評価の3方法第3回：インカムアプローチによる企業価値評価の全体像第4回：フリーキャッシュフローと割引現在価値の理解第5回：永続価値と企業総価値の算定第6回：株主価値と企業総価値の関係第7回：加重平均資本コストとβ、最適資本構成、最終演習",
        "courseDataUpdatedAt": "2024\/02\/27"
    },
    "updateAt": "2024\/03\/19"
}