{
    "lectureCode": "GGM13301",
    "courseName": "ビジュアルコンピューティング特論",
    "lecturer": [
        "ノスンタク(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "バイオ・情報メディア研究科博士前期課程メディアサイエンス専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ２０３"
    ],
    "courceDetails": {
        "courseOverview": "３次元的な視覚経験を提供するには，カメラ，プロジェクタのような投影装置の仕組みに対する理解が必要である．本講義では，ビジュアルシステムに共通しているカメラモデルを理解し，その理解のもとでAR，FishtankVR，プロジェクション・マッピングといったビジュアルシステムのプロトタイピングを行う．このような基礎理論や実践と共に，３次元再構築技術基礎と最新動向にも触れる．",
        "outcomesMeasuredBy": "カメラの数理モデルを理解し，基本的なビジュアルシステムの実装法やその校正法を習得する．この基礎を活用することで，受講者の所望するビジュアルシステムのプロトタイプにまでたどり着くことを目標とする．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力問題解決力",
        "teachingMethod": "ノートPCを持参すること．基本的な進め方として，理論の説明を座学で行った上，用意されている雛型を利用して演習を行う．また，小問題として雛形に用意されているプログラムを完成させることで毎回の理解度を点検する．なお，最終課題として複数の投影装置を備えたビジュアルシステムの一事例を選んで頂き，そのコアとなる部分を実装した上，その内容についての発表を行う．",
        "notices": "-Unity(2019.3以降)をインストールしたWindowsラップトップを持参すること．授業中に用いる雛型プログラムの依存するライブラリが主にWindowsを想定しており，他OSにおいては不具合が予想される．そのような不具合に関して教員はサポートしないため，他OSは推奨されない．-最終回において，自作した複数の投資投影装置の交わったシステムのプロトタイプの実装状況を発表するため，ある程度の実装力と自主性が要求される．",
        "preparatoryStudy": "演習用としてUnityエンジン上で実装されたC#の雛型提供する（備考欄のURLを参照すること）．Unityでのスクリプトの振る舞いと作成方法に関しては授業中に必要最小限は触れる予定であるが，C#のプログラミングに関しては事前学習が必要である．授業の小問題を解くにはC\/C++\/C#\/Java\/Processing何れかのプログラミング経験があればよい程度のものとなっている．一方，最終発表するプロトタイプに関しては，学生独自で使いこなせるプラットフォーム上で実装を進めても構わない．そうでない場合，提供する雛形を使いこなす必要がある．備考欄のURLの確認をすること．",
        "gradingGuidelines": "-各回における小問題(50%)Moodleにて小問題を提出する形になる．問題は1～2行程度未実装されている部分の含まれているコードを修正するか，数行程度の文章で振る舞いを説明する問題となっている．提出された課題の間違いの度合いに応じて減点される．提出さえされていれば最小限の点数は付与されるが，提出がなかった場合はその回は０点と判定されるので注意すること．なお，各小問題に対する解説は次の回の冒頭に行う．-プロトタイプ制作物(20%)３次元ビジュアルシステムを取り上げ，その一部をプロトタイプとして実装し詳細について発表する．想定されるシステムについては１回目の授業で幾つか提示するが，それ以外のものに関しては事前に相談すること．なお，第４回目の「自主制作の提案及び検討」にて制作物の大まかな主旨と添わない内容についてはフィードバックを返す．-最終回での発表(30%)基本的にはプロトタイプは根幹となる部分が実装され，その振る舞いについて説明が出来れば良い．実装物や発表のクォリティーに応じて加点される．",
        "textbook": "指定しない",
        "referenceMaterials": "各回において提示する",
        "courseSchedule": "第1回：ガイダンス第2回：３次元座標系とカメラモデル第3回：カメラ校正と３次元計測第4回：自主制作の提案及び検討第5回：プロジェクタ-カメラ系の校正第6回：３次元再構築技術第7回：制作物の発表・講義のまとめ",
        "courseDataUpdatedAt": "2024\/03\/01"
    },
    "updateAt": "2024\/09\/13"
}