{
    "lectureCode": "GGM12301",
    "courseName": "アンバサダーマーケティング特論",
    "lecturer": [
        "藤崎実(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火5"
    ],
    "targetDepartment": "バイオ・情報メディア研究科博士前期課程メディアサイエンス専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "講義実験棟２０２"
    ],
    "courceDetails": {
        "courseOverview": "インターネットやソーシャルメディアの発展により、従来の広告がパワーを失ってきたと言われています。そのかわり現在、注目されているのが、消費者によるクチコミです。調査結果によれば、今や消費者は広告よりも消費者のクチコミを信用すると言われています。では、企業はクチコミとどのように向かい合えばいいのでしょうか。あるいはクチコミをマーケティング活用するためにはどうしたら良いのでしょうか。それらの疑問に応えてくれるのが、アンバサダー・マーケティングと呼ばれる取り組みです。本授業は、そのアンバサダー・マーケティングを専門的に学ぶ授業です。本授業では、そのメカニズムを学ぶとともに、注目の理由、実際の事例、今後の可能性、業界のガイドラインなどについても学びます。また、一歩広げて、近年のクロスメディア戦略、注目すべきソーシャルメディア戦略なども概観します。企業が自社のファンと一緒に行うマーケティング活動は、現在、実務でも注目されています。なお、教員は当科目分野において企業の支援を行ってきた「実務経験」を持ちます。当授業は当該分野のマーケティングの知識を身につける「実践的科目」です。",
        "outcomesMeasuredBy": "アンバサダー・マーケティング／アンバサダー・プログラムに関する基礎的な知識の修得を目標とします。アンバサダー・マーケティングには決まった形がありません。ですので、メカニズムや事例を知ることで今後に生かせる知識を修得していただきます。授業を通じて、今の時代に即したマーケティング思考力の習得も目標とします。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力",
        "teachingMethod": "授業は、「講義形式」と「履修生の参加型授業」を組み合わせて行います。「講義形式」ではアンバサダー・マーケティングの基本的な内容の講義の他に、最新のソーシャルメディア戦略の解説などを行います。「参加型授業」では指定した教科書を用い、全員参加での授業進行や、ディスカッションを行う予定です。ノートPC必携です。",
        "notices": "「アンバサダー・マーケティング」は、従来のマーケティングのうえに成り立っている概念であり、取り組みです。従って、「マーケティング」に関する一般的な知識を持っていることが履修の前提です。一般的なマーケティングの知識がないままでは、理解が及ばない可能性もありますので、ご注意ください。",
        "preparatoryStudy": "指定された教科書を読んでください。授業後は、授業内容を復習して講義内容の習得に努めて下さい。予習・復習にはそれぞれ120分程度の時間をかけて下さい。発展的な知識の習得には、自主的な取り組みが不可欠です。普段から身の周りを観察して、アンバサダー・マーケティングに関する知見を深める習慣を持つことが重要です。",
        "gradingGuidelines": "期末に提出していただく「課題レポート」60％。授業の途中で提出していただく「レポート」30％、授業への貢献度（授業での発言）10%で評価します。100点満点中60点以上で単位認定とします。また、学修内容の定着のため、提出物や課題などに関して、授業や授業運営のプラットフォーム（グーグルクラスルームやムードル）でフィードバックを行います。",
        "textbook": "【重要】藤崎実・徳力基彦（著）（2017）『顧客視点の企業戦略』宣伝会議★教科書は期末に提出していただく「課題レポート」で必要です。図書館に置いてありますが、中古でもいいので必ず入手してください。",
        "referenceMaterials": "ロブ・フュジェッタ(著)、土方奈美(訳)、藤崎実(監修)（2013）『アンバサダー・マーケティング』日経BP社河井孝仁・宇賀神貴宏(編集)・藤崎実、WOMJメソッド委員会（2017）『炎上に負けないクチコミ活用マーケティング』彩流社シャーリーン・リー、ジョシュ・バーノフ(著)、伊東奈美子(訳)（2008）『グランズウェル-ソーシャルテクノロジーによる企業戦略』翔泳社",
        "courseSchedule": "第1回：「オリエンテーション」（シラバスの解説）第2回：「アンバサダー・マーケティングとは」（クチコミ、WOMマーケティング）第3回：「アンバサダー・マーケティングを考える」（アンバサダー・マーケティング、アンバサダー・プログラム）第4回：「ソーシャルメディア・マーケティングの基本」（SNS・ソーシャルメディアマーケティング）第5回：「アンバサダー・マーケティングの実際」（SNS戦略、広告と広報の融合）第6回：SNSを活用したマーケティングの最新動向（ファンベース、ブランド・アドボケイツ）第７回：まとめ／ディスカッション",
        "courseDataUpdatedAt": "2024\/02\/28"
    },
    "updateAt": "2024\/03\/19"
}