{
    "lectureCode": "GGZ00201",
    "courseName": "キャリア開発特論",
    "lecturer": [
        "多田雄一(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "ジェネリックスキル科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "バイオ・情報メディア研究科博士前期課程バイオニクス専攻,バイオ・情報メディア研究科博士前期課程コンピュータサイエンス専攻,バイオ・情報メディア研究科博士前期課程メディアサイエンス専攻,バイオ・情報メディア研究科修士課程アントレプレナー専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本授業は、修士修了者に対して企業が求める人物像や選考のポイントを理解し、適切な対策をたてることで、各業界の優良企業の書類・面接選考に対応できる能力を身につけることを目標とする。まず、修士の就職活動の基本的な知識や進め方について理解し、企業に関する重要な情報源である就職四季報の読み方を学ぶ。また、自己理解や企業研究、さらに模擬面接などのアクティブラーニングをとおして、優良企業の一次面接を突破する実践的なコミュニケーション能力を身につける。さらには、各自の修士研究に関する専門的な模擬面接を行い、質疑に対して適切に応答できる論理的な思考力を獲得することを目指す。全体をとおして、バイオニクス専攻、コンピュータサイエンス専攻、メディアサイエンス専攻の3専攻とも、また日本人も留学生も、同一の混合クラスで受講してもらう。",
        "outcomesMeasuredBy": "適切な応募書類を作成できる力と優良企業の面接に対応できる能力を養うこと、さらにコミュニケーション能力と論理的な思考力を獲得することを目標とする。",
        "learningOutcomes": "コミュニケーション能力分析・評価能力",
        "teachingMethod": "第1回～第5回では、リアルタイムの遠隔講義を行う。第1回～第4回では、ガイダンスののち、大学院生の就職活動の流れ、就職四季報の読み方、自己理解、企業研究の進め方、筆記試験対策などについて学修する。受講後、指定された期限までに課題を提出する。第5回～第7回は、アクティブラーニングの一環として、数人～10人程度の少人数に分かれて、遠隔と対面を交えた模擬面接を行うことで、選考に対する実践的な対応能力を身につける。また事後課題を課すことがあるが、これらも成績評価の対象となり、講義の到達目標に必要な課題となるため、必ず取り組み、指定された方法で提出する。課題はMoodleや外部委託企業の専用サイトに提出するため、ノートPCを使用する。",
        "notices": "ジェネリックスキル科目（2単位選択必修）の一つである。",
        "preparatoryStudy": "事前に提示される課題を実施しておくこと。",
        "gradingGuidelines": "事後課題や振り返りシートなどの作成した書類（60％）と模擬面接（40％）で成績を評価する。課題の解説については、Moodle上または外部委託企業の専用サイトなどにてフィードバックを行う。",
        "textbook": "指定しない。",
        "referenceMaterials": "必要に応じて紹介する。",
        "courseSchedule": "第1回：ガイダンス、大学院生の就職活動の流れ、就職四季報の読み方（就職部長、キャリアコーオプセンター、外部講師）第2回：自己理解（外部講師）第3回：企業研究（外部講師）第4回：筆記試験（SPI）対策（外部講師）第5回：模擬面接（WEB面接対策）（外部講師）第6回：専門分野に関する模擬面接Ⅰ（各専攻就職委員会、専攻所属教員などが専攻ごとに実施する）第7回：専門分野に関する模擬面接Ⅱ（各専攻就職委員会、専攻所属教員などが専攻ごとに実施する）",
        "courseDataUpdatedAt": "2024\/01\/04"
    },
    "updateAt": "2024\/09\/13"
}