{
    "lectureCode": "11040M1",
    "courseName": "情報リテラシー[MS]",
    "lecturer": [
        "盛川浩志(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金4"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "ICT（情報通信技術）が普及した「情報社会」から、「メディア社会」への変革期である現在において、社会や生活の場で必要なる基礎的な知識と技術について学ぶ。このために、まず基本的なコンピュータの仕組みから情報の扱い方、インターネット上のさまざまなサービスなど扱う。そして、情報とは何か、ネット社会での情報の扱い方やこれらの情報を情報社会、メディア社会で活用する考え方、人の生活を豊かにするためのメディアの活用などについての理解を深める。本講義では、コンピュータ社会・情報社会・メディア社会における広い視野を身につけること、および新しいメディアが登場した際にもそこで扱われる情報を適切に利用・活用する知識とスキルを習得することを目標とする。",
        "outcomesMeasuredBy": "情報についての理解を深め、活用できる力を身に付ける。この授業を通して、情報システムを通したコミュニケーション能力を養い、情報に関する論理的な思考力を獲得する。生成AIや情報セキュリティなど、最新の情報技術についても関心を深め、今後の社会で必要となるであろう知識とスキルを見極められる素養を身に付けることも期待する。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力",
        "teachingMethod": "授業では単に講義を聞くだけではなく、ノートPCを用いて実際にソーシャルメディアの利用などの演習も行う。",
        "notices": "演習を伴う授業であるため、毎回ノートPCを持参すること。",
        "preparatoryStudy": "本授業の目的は、情報技術に関する理解を深め、将来的に必要となる情報リテラシー能力を養成することにある。この達成に向けて、以下の準備学習を心がける。予習や復習は各120分程度授業前の準備:授業に先立ち、教科書を用いて予定されている内容について事前に理解を深めておく。特に、授業で扱われる主要な概念や理論について、基本的な知識を身に付けることが重要である。授業後の復習（120分程度）:各授業終了後、講義資料を再度確認し、理解を深める。授業での議論や講義内容を振り返り、不明瞭な点や疑問に思った事柄については、次回の授業で質問する準備をしておく。継続的な学習（120分程度）:日常的に情報技術に関連するトピックに触れる機会を持ち、その知識を広げるよう努める。メディアや専門的な文献を通じて、最新の情報技術トレンドや議論について調査・分析し、それらを授業での学びに結びつけることが望まれる。",
        "gradingGuidelines": "期末試験(60%)にレポート・ミニテスト(40%)の総合評価が100点満点中、60点以上で合格とする。それぞれ授業内またはMoodleなどを用いオンデマンドでフィードバックを行う。",
        "textbook": "メディアICT（改訂版）（メディア学大系10）[コロナ社]",
        "referenceMaterials": "入門マルチメディア：ITで変わるライフスタイル[CG-ARTS協会]",
        "courseSchedule": "第1回情報リテラシー：情報とリテラシーとICT（ICTとは、メディアとリテラシー）第2回メディア学とICT（デジタルコンテンツ、メディア表現）第3回コンピュータのしくみ（ハードウェア、ソフトウェア）第4回ソフトウェアとオペレーティングシステム（アプリケーション、OSの機能）第5回コンピュータネットワーク（インターネット、サーバとクライアント）第6回インターネットの構造（プロトコル、IP）第7回インターネット上のサービス（メール、動画配信サービス）第8回モバイルメディア技術（携帯通信網、無線LAN）第9回ソーシャルネットワーキングサービス（SNS、情報拡散）第10回検索サービス（検索エンジン、対話型AI）第11回プログラミング（プログラミン的思考、プログラミング言語）第12回サーバ技術（Webアプリケーション、クラウドサービス）第13回情報セキュリティ（情報セキュリティ、認証と暗号化）第14回まとめ、理解度確認テスト基本的に教科書に沿った内容を扱う。適宜最新の技術、ICTの活用事例などを取り込んで紹介する。各回の内容は、最新事例や社会情勢の変化などから、時勢に沿った話題を扱うために、多少順序を入れ替える可能性がある。",
        "courseDataUpdatedAt": "2024/01/25"
    },
    "updateAt": "2024/08/07"
}