{
    "lectureCode": "11042M1",
    "courseName": "数学概論[MS]",
    "lecturer": [
        "松永信介(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "数学は学問の中でも最も古いものの一つであるが、今なお新たな分野を開拓しては、その裾野を広げ発展し続けている。これは、人間社会の進展とともに絶えず新たな問題が生じ、そこに数学的な問題解決の手法が要求されるからである。本講義では、近・現代の応用例を中心に、実学としての数学を理解する。具体的には、複素数とベクトルの関連性、計算機処理に欠かせない近似の考え方、現象のモデル化、線形計画・ネットワーク・組合せ最適などの数理計画アプローチについて学ぶ。いずれも、その後の各学部の専門科目や卒業研究などに必要とされる内容である。",
        "outcomesMeasuredBy": "各トピックが所属学部のどのコースあるいはどの専門分野に強く結び付いているのかを認識するとともに、その数理的アプローチの意義を理解し、実践活用できるようになる。具体的には、応用上の視点から数学を現象や状態のモデル記述のためのツールとして捉え、行列や方程式、グラフ・ネットワーク、微分方程式などの概念の抽象・客観的有用性について理解を深める。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義を中心に進める。また、講義の合間に適宜、理解度確認の演習を行う。演習には提出用のものとそうでないものとがあるが、提出用のものは他人との相談なしに取り組み、各自で提出する。一方、提出の必要がない演習に関しては、必要に応じて学生同士で自由に議論して構わない。なお、講義中に計算などでノートPCを使用することがある。",
        "notices": "多彩なトピックが盛り込まれており、個々の内容はそれだけで通年の講義に値するものであるが、いずれも深く掘り下げることはせず、数学の応用の世界を素養として知ることに主眼をおく。それゆえ、最低限の簡易な計算はあるものの、不要で煩雑な計算を求めることはしない。その一方で、思考する姿勢が暗に求められる。この“考える”姿勢を毎回保ち、講義に臨むこと。",
        "preparatoryStudy": "各回の講義前には予定されているトピックについて、指定参考書や図書館の書籍などを読んで予習しておくこと（120分程度）。また、講義後は速やかにて講義内容について自力でまとめてみるとともに、課題は必ず試みること（120分程度）。",
        "gradingGuidelines": "期末試験の成績70%、レポート・演習の成績30%の割合で素点を100点満点に換算し、成績評価を行う。60点以上が単位認定の要件となる。なお。レポート・演習については適時、解説や全体講評を行う。",
        "textbook": "指定しない",
        "referenceMaterials": "・T.Crilly著，野崎昭弘監訳：人生に必要な数学50，近代科学者（2009）・久保幹雄：インターネット時代の数学シリーズ8組合せ最適化とアルゴリズム，共立出版（2000）・河添健：数理と社会－身近な数学でリフレッシュ－（増補版），数学書房（2012）",
        "courseSchedule": "第1回ガイダンス：人間社会と数学，コンピュータと数学第2回複素数とベクトル(1)：複素数，ガウス平面，ベクトル（幾何ベクトル，数ベクトル）第3回複素数とベクトル(2)：平面図形の操作（拡大・縮小，回転，平行移動），線形変換，アフィン変換第4回関数と近似(1)：関数の近似，補間，ニュートン法第5回関数と近似(2)：種々の応用（最小二乗法，スプライン補間など）第6回現象とモデル(1)：数式によるモデル記述，微分方程式，差分方程式第7回現象とモデル(2)：確率モデル，ランダムウォーク，待ち行列第8回現象とモデル(3)：種々の応用（人口モデル，ブラウン運動など）第9回線形計画法(1)：線形計画問題，シンプレックス法第10回線形計画法(2)：種々の応用（生産管理・栄養管理，輸送計画など）第11回ネットワーク理論(1)：グラフ，ネットワーク第12回ネットワーク理論(2)：種々の応用（最短経路問題，最大流問題など）第13回組合せ最適化(1)：問題の複雑さ，計算量，厳密解と近似解第14回組合せ最適化(2)：種々の応用（ナップサック問題，巡回セールスマン問題など）",
        "courseDataUpdatedAt": "2024/01/22"
    },
    "updateAt": "2024/08/07"
}