{
    "lectureCode": "11050M08",
    "courseName": "フレッシャーズゼミI[23]MS",
    "lecturer": [
        "盛川浩志(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "この授業は､学生各自が規律のある学生生活を過ごし、主体的に学び、授業のみに関わらずさまざまなことに積極的に取り組む姿勢を身につけるように大学生活の計画策定を支援するものである。大学の４年間は自らの進むべき道をより明確にする時期であり、近い将来､社会において進もうとする進路を見据えた勉学が求められる｡各自の進路を踏まえ、大学４年間で、何を、いつ、どのように、どのくらいの時間、どのレベルまで学ぶべきかを明らかにして､各自の大学４年間の学業、サークル活動、資格取得やボランティア活動・インターンシップなどの積極的な活動の具体的な目標を立てる。授業の履修計画はもとより様々な側面において、より充実したキャンパスライフになるよう、１）自ら考え、２）計画し、３）実行し、４）大学の教員や先輩からのアドバイス・言動も参考にしながら自らをふり返ること、が１つのサイクルとなる。さらに互いに刺激し啓発し合いながら自らの計画を修正し、このサイクルを繰り返していくことにより、各自の可能性が最大限に引き出され、本当にメディア学部において必要な能力を身につける。なお、１年次から３年次前期まで、このクラスがアドバイザリー制度のグループとなる。",
        "outcomesMeasuredBy": "メディア学部において４年間適切に学びができる環境づくりを行うとともに、クラス内における自身のアイデンティティの確立およびコミュニケーション能力を修得する。",
        "learningOutcomes": "コミュニケーション能力",
        "teachingMethod": "この授業は、各回の内容により、大教室での講義形式と少人数のゼミ形式のどちらかで実施される。具体的な進め方は日程も含めてクラスによって異なるので、各教員の指示に従うこと｡また、ノートPCが必要となる回があるので、これについても各教員の指示に従うこと。メディア学キーワード研究では研究発表の回にてグループワークを行う。",
        "notices": "ガイダンス週にも全体およびクラス別授業があるので注意すること。この授業は学生が主体であるので、各自が自ら進んで考え、行動し、発言し何かを得ようとしなければ成立しない。自分なりの意義を見いだしていけるよう積極的に努力すること。また専門家になるために必要な専門以外の能力であるコミュニケーション能力を向上させるよう意識して学生生活を過ごすこと。",
        "preparatoryStudy": "各教員の指示に従うこと。",
        "gradingGuidelines": "大学４年間の最初の半年間に、これから先の４年間のプランとして、この授業の内容に主体性を持って取り組み、専門家育成関連の課題を遂行し、期日を守って発表あるいは提出をする。専門家育成関連の各課題の評価を計100％として評価する。最終回にフィードバックを行う。",
        "textbook": "東京工科大メディア学部著「メディア学キーワードブック」コロナ社、2018",
        "referenceMaterials": "各教員の指示に従うこと。",
        "courseSchedule": "第0回:【個別】ガイダンス週に、自己紹介、履修アドバイス第1回:【個別】個別面談、エティカの説明第2回:【個別】施設見学（FSクラスごとに実施日が異なる）第3回:【全体】ハラスメント教育、知的財産法教育、安全教育第4回:【全体】話し方、情報の伝え方第5回:【個別】GPS-Academicテスト第6回:【全体】大学の理念と歴史の理解、メディア専門家育成(1)メディア学部コース紹介第7回:【全体】キャリア設計、就職、大学院についての講演第8回:【個別】個別面談第9回:【全体】GPS-Academicテストのフィードバック、メディア専門家育成(2)先輩からのエール第10回:【全体】社会人マナー講座第11回:【個別】メディア専門家育成(3)メディア学キーワード研究の説明第12回:【自由学習】メディア学キーワード研究第13回:【自由学習】メディア学キーワード研究第14回:【個別】メディア専門家育成(4)メディア学キーワード研究発表会",
        "courseDataUpdatedAt": "2024\/03\/13"
    },
    "updateAt": "2024\/09\/13"
}