{
    "lectureCode": "11121M04",
    "courseName": "キャリア設計II[MS]",
    "lecturer": [
        "菊池司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火4"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "【キャリア設計Ⅰ】の内容・取り組みを踏まえ、本格化する就職活動に役立つ実践的な「就業力」の養成を図る。そのために、広い視野から職種・業界・企業をリサーチし、自身に適した職種（働き方）や希望に見合う企業（進路）を選び取る「選択力」を向上させると共に、強みを伸ばし・弱みを克服することで自らも志望企業に選ばれる「選抜力」も養うことを本講義の目的とする。具体的には、模擬応募書類の回答案の確認・添削やフォローアップを通じて各自の応募書類（履歴書・エントリーシート）の原型を完成させる。面接対策講座や体験談を通じて主な面接形式とそれぞれの特徴に加え、面接官の目線や評価観点も理解することで対応力を高める。さらに各自の就職活動の指針となる行動目標と実行計画を作成する。同時に、秋期・冬期インターンシップへの参加を推奨し、早期選考への準備も促す。尚、チャレンジクラスでは、より実践的な模擬面接を複数回実施する。",
        "outcomesMeasuredBy": "本講義の目標は、「自身の能力・適性・志向性に適う職種や企業を選択し、筆記試験を通過、文章（応募書類）や言語・非言語でのコミュニケーション（面接）を通じて自らの意見・考え方や人間性を初対面の相手（人物・組織・対象）に的確に伝え、理解と評価を得ることで就職活動を成功させる（志望企業・団体等から内定や合格を獲得する）」に足る普遍的な社会人基礎力の養成にあり、そのために必要な知識、応募書類（履歴書・エントリーシート）作成能力、筆記試験対応力、面接(対人)スキルの向上を目指す。特にチャレンジクラスにおいては、本学が推奨する優良企業や実績・知名度の高い難関企業の採用試験への挑戦・合格を目標とし、前述の能力を十分に高めることを狙う。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "■形式・履修生各自が所属する研究室単位でそれぞれの教員が本講義の一環として実施する一部の授業を軸に、履修者全員が一斉受講する全体回や100人以下のクラス別講義等を併用し、各テーマに適した形式で適宜実施する。・【キャリア設計Ⅰ】と同じく、ベーシックな内容の＜基本クラス＞の他に、年度当初に希望者を募って設置する少人数制の＜チャレンジクラス＞を存続させ、本学が推奨する優良企業や実績・知名度の高い難関企業への内定・就職を目指す。そのためチャレンジクラスの授業の進度・形式は、基本クラスと異なる場合がある。（※それぞれのクラス編成については別途指示する。）■内容・講義やパネルディスカッションの聴講を中心に、ワークシート等を活用しながら、セルフワーク・グループワークを主にディスカッションや発表等も交えて進める。・レポートやワークシート等の課題・提出物は、評価に加え、適宜添削や授業でのフィードバック等を行う。■その他・応募書類の準備・作成や、そのための情報収集の場となる学内就活イベントへの参加等を通じて、キャリアコーオプセンターの活用・連携を積極的に行う。・出席確認や課題提出等をMoodleにて行うため、ノートPCを必携とする。",
        "notices": "・3年次の必修科目である。・【キャリア設計Ⅰ】の履修を前提とする。・「各授業回でのコミュニケーションシートの提出」と「全ての課題類の提出」が単位認定の必須要件となる点に留意する。・授業回により実施形態（クラス別・全体回等）が変わると教室も変更となるため、講義用HP(Moodle)への掲示や他の案内を確認し、出席すべき教室を間違えないよう注意する。",
        "preparatoryStudy": "・毎日15～20分程、新聞やインターネット等を通じて社会・経済の情勢について広く情報収集する。特に志望業界・企業のリサーチには採用動向も含めて注力し、これらを予習とする。・授業後には、課題への対処はもちろん、教科書の講義内容に該当する箇所や講義時の投影資料、参考書等を用いて十分な復習を行うと共に、自己のキャリアビジョンに基づく自主的な就職対策（筆記試験対策やポートフォリオ作成等）も合わせて週に120分程度励行すること。",
        "gradingGuidelines": "・「各授業回でのコミュニケーションシートの提出」と「全ての課題類の提出」を単位認定の必須要件とする。・その上で「各回のコミュニケーションシート提出状況と授業における様々なワークに対する取り組み」と「評価対象とする提出物（授業で作成する模擬応募書類やそのブラッシュアップ版を始めとする課題やレポート、ワークシート、その他）」を各50％の割合で評価し、100点満点中60点以上で単位認定とする。・課題やレポート、授業時の発表等については、主に授業にて適宜フィードバックを行う。",
        "textbook": "・「MYCAREERNOTEⅢ」ベネッセｉ-キャリア・他に必要な資料は講義用HP（Moodle）にアップする。",
        "referenceMaterials": "・変更点等を含めて講義情報や補足資料は全て、講義用HP（Moodle）に掲載するので参考にすること。・「会社四季報業界地図2025年版」東洋経済新報社・「日経業界地図2025年版」日本経済新聞社・「就職四季報総合版2025-2026年版」東洋経済新報社・「就職四季報優良・中堅企業版2025-2026年版」東洋経済新報社・「就職四季報働きやすさ・女性活躍版2025-2026年版」東洋経済新報社",
        "courseSchedule": "第1回スタートガイダンス第2回講演「働くとは？」第3回Webテスト対策（非SPI模擬受検会）第4回Webテスト対策講座（解き方の解説）第5回企業研究①「広い視野から志望企業を探そう！」第6回企業研究②合同企業セミナーを活用しよう！＜研究室単位で実施＞第7回面接対策講座（チャレンジクラス：集団面接実践）第8回内定者アドバイス会（チャレンジクラス：個人面接実践）第9回4年生との「就活」交流会＜研究室単位で実施＞第10回「先輩から学べ！」就職トークセッション第11回「行動計画立案」と「GPS-Academicを活用したESブラッシュアップ」第12回ES文案確認・フォローアップ講座＜研究室単位で実施＞第13回「就活全般の確認」と「クリエイティブ産業」講座第14回「就活」本番に向けて「キックオフ！」",
        "courseDataUpdatedAt": "2024\/04\/15"
    },
    "updateAt": "2024\/08\/07"
}