{
    "lectureCode": "11120M01",
    "courseName": "キャリア設計I[MS]",
    "lecturer": [
        "菊池司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "■本講義は…本学の基本理念である「実学主義」の精神に基づき、自身の専門を活かして社会で活躍するために誰もが必要とする【社会人基礎力の涵養・育成】を目的とする。■そのために…・遠くない未来に必ずやって来る【社会人としての自立】に向けて・自身の将来、即ち「社会人としてのキャリア形成」について真剣に考える“きっかけ”と・方針を定め、その実現のため必要な知識と力を習得する“場”として役立つテーマの下、実践的に学んでいく。■具体的には…・企業研究と自己分析の仕方を学んで掛け合わせることで、広い視野から職種・業界・企業をリサーチし、自身の能力・適性・志向性に適した職種（働き方）や希望に見合う企業・職場（進路）を見出し、説得力のある志望の軸を構築する。・応募書類作成や面接対策、セルフブランディングの講座を通じて、自分の意見や考え方と人間性を的確に伝える手法を座学と実践を通じて理解し、身に付ける。中でもチャレンジクラスはグループワークとその課題発表に注力し、思考力とアウトプット力を鍛える。・これらにインターンシップ講座で得た知識を加えて準備を進め、夏季休暇中に全履修生が多様な企業のインターンシップに挑戦し、学修の実践を試みる。",
        "outcomesMeasuredBy": "本講義では、学部卒業後の進路選択の可能性に対する理解を再確認しつつ、多くの学生が学部（あるいは大学院）を卒業後の進路として希望する「企業就職」に必要な【社会人基礎力の涵養・育成】を目標とし、そのための基盤となる知識、企業研究と自己分析の進め方・活かし方、応募書類（履歴書・エントリーシート）作成の仕方、筆記試験や面接の対策方法、について実践を通じて理解・習得することを目指す。特にチャレンジクラスにおいては、本学が推奨する優良企業や実績・知名度の高い難関企業の採用試験への挑戦・合格を目標とし、前述の準備を早期に進める。併せて、全履修生に対して夏季休暇中に多様な企業のインターンシップ参加のための挑戦を推奨する。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "■形式・100人以下の中規模クラスに分かれての講義をベースに、履修者全員が一斉受講する全体回等を併用し、各テーマに適した形で行う。・クラス別講義では、ベーシックな内容の＜基本クラス＞の他に、予め希望者を募って「本学が推奨する優良企業や実績・知名度の高い難関企業への内定・就職を目指す」少人数制の＜チャレンジクラス＞を選抜設置する。（※それぞれのクラス編成や選抜方法については別途指示する。）・チャレンジクラスでは、基本クラスとは異なる進度・形式による授業を行う場合がある。■内容・ワークシート等を活用し、セルフワーク・グループワークを主にディスカッションや発表等も交えて進める。・レポートやワークシート等の課題・提出物には、評価に加えて適宜添削や授業でのフィードバック等も行う。■その他・応募書類の準備・作成やそのための情報収集の場となる学内就活イベントへの参加等において、キャリアコーオプセンターと積極的に連携する。・出席確認や課題の提出等をMoodleにて行うため、ノートPCを必携とする。",
        "notices": "・3年次の必修科目である。・「各授業回でのコミュニケーションシート提出」と「全ての課題類の提出」が単位認定の必須要件となる点に留意する。・授業回により実施形態（クラス別・全体回等）が変わると教室も変更となるため、講義用HP(Moodle)への掲示や他の案内を確認し、出席すべき教室を間違えないよう注意する。",
        "preparatoryStudy": "・毎日15～20分程度、新聞やインターネット等を通じて社会や経済の情勢について広く情報収集する。特に志望業界・企業のリサーチには採用動向も含めて注力し、これらを予習とする。・授業後には、課題への対処はもちろん、教科書の講義内容に該当する箇所や講義時の投影資料、参考書等を用いて十分な復習を行うと共に、自己のキャリアビジョンに基づく自主的な就職対策（筆記試験対策やポートフォリオ作成等）も合わせて週に120分程度励行すること。",
        "gradingGuidelines": "・「各授業回でのコミュニケーションシートの提出」と「全ての課題類の提出」を単位認定の必須要件とする。・その上で「各回のコミュニケーションシート提出状況と授業における様々なワークに対する取り組み」と「評価対象とする提出物（授業で作成するワークシートや模擬応募書類、その他レポート等の課題）」を各50％の割合で評価し、100点満点中60点以上で単位認定とする。・課題やレポート、授業時の発表等については、主に授業にて適宜フィードバックを行う。",
        "textbook": "・「MYCAREERNOTEⅢ」ベネッセｉ-キャリア・他に必要な資料は講義用HP（Moodle）にアップする。",
        "referenceMaterials": "・変更点等を含めて講義情報や補足資料は全て、講義用HP（Moodle）に掲載するので参考にすること。・「会社四季報業界地図2024年版」東洋経済新報社・「日経業界地図2024年版」日本経済新聞社・「就職四季報総合版2025-2026年版」東洋経済新報社・「就職四季報優良・中堅企業版2025-2026年版」東洋経済新報社・「就職四季報働きやすさ・女性活躍版2025-2026年版」東洋経済新報社",
        "courseSchedule": "第1回オリエンテーション第2回業界・企業研究①業界・企業研究の方法を学ぶ第3回業界・企業研究②職種研究と自己理解を深める第4回インターンシップ①概論と応募先の探し方第5回本選考応募書類を書いてみよう！①自己PRと学チカ第6回本選考応募書類を書いてみよう！②志望動機第7回SPI理解講座（模擬受検）第8回インターンシップ②応募先選定と志望動機作成第9回面接準備①個人面接・集団面接対策（チャレンジクラス：面接準備個人面接・集団面接・グループディスカッション対策）第10回面接準備②グループディスカッション対策（チャレンジクラス：内定者アドバイス「先輩の体験談を聴こう！」）第11回適性検査の模擬「MATCHplus」受検とその活用第12回併願戦略他、誰も教えてくれない「就活の知恵」第13回就活戦略プレゼンテーション第14回まとめ「夏休みに向けて」",
        "courseDataUpdatedAt": "2024/04/15"
    },
    "updateAt": "2024/12/13"
}