{
    "lectureCode": "M000401",
    "courseName": "先端メディアゼミナールI[自然言語処理]",
    "lecturer": [
        "松吉俊(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": "4",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "人工知能の1分野である自然言語処理においても、深層学習と呼ばれる機械学習技術がよく用いられるようになった。深層学習を容易にプログラミングできる環境や学習済みの言語モデルも公開されており、これらを利用して様々なアプリケーションを開発することもできる。本授業では、機械学習・深層学習の仕組みとその利用枠組みについて学修し、この枠組みを利用して自然言語処理のアプリケーションを構築する実習を行う。",
        "outcomesMeasuredBy": "深層学習の仕組みについて理解を深め、深層学習を利用した自然言語処理アプリケーションを構築することを目標とする。また、研究成果について学会・カンファレンスで発表することを目指す。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "前半では、深層学習の仕組みについて学習し、自然言語処理に関する深層学習ライブラリと日本語の言語モデルの利用方法について学ぶ。後半では、BERT、RoBERTa、GPT、Llama、Fairseq、StableDiffusionなどから1つ以上を選択し、それを用いたアプリケーションを開発する。プログラミングの開発には各自のノートPCを使用するので、毎回必ず持ってくること。深層学習の実行には研究室内の計算機サーバーやクラウドサービスを利用する。",
        "notices": "累積GPAが一定以上であることが受講資格となる（実際に必要となるGPAは掲示等で確認すること）。最大履修者数は2名とし、履修希望者が多い場合はGPAおよび演習系科目などの成績を参考に選抜を行う。",
        "preparatoryStudy": "前半に関しては、事前に授業資料を予習してくること(60分程度)。授業後は、プログラミングで用いた関数やその引数について復習すること(180分程度)。後半に関しては、自然言語処理のアプリケーションについて調査し、予習してくること(120分程度)。授業後は、授業中で取り扱った論文等について復習すること(120分程度)。",
        "gradingGuidelines": "アプリケーションのプログラミング（50%）と、開発アプリケーションに関する最終レポート（50%）で評価する。アプリケーションに関しては授業中に講評をフィードバックする。最終レポートについてはMoodleにて講評をフィードバックする。",
        "textbook": "指定しない。",
        "referenceMaterials": "・黒橋禎夫、「自然言語処理三訂版」、放送大学教育振興会、2023・岡﨑直観、荒瀬由紀、鈴木潤、鶴岡慶雅、宮尾祐介、「ＩＴＴｅｘｔ自然言語処理の基礎」、オーム社、2022・山田育矢、柴田知秀、進藤裕之、玉木竜二、「ディープラーニングによる自然言語処理」、共立出版、2023・近江崇宏、金田健太郎、「ＢＥＲＴによる自然言語処理入門Ｔｒａｎｓｆｏｒｍｅｒｓを使った実践プログラミング」、オーム社、2021",
        "courseSchedule": "第1回：全体概要・自然言語処理とは第2回：機械学習、深層学習第3回：深層学習ライブラリの利用第4回：テキスト自動分類第5回：テキスト自動生成第6回：テキストによる自動対話第7回：テキストによる画像生成第8回：アプリケーションの設計第9回：アプリケーション開発(1)第10回：アプリケーション開発(2)第11回：アプリケーション開発(3)第12回：アプリケーション開発(4)第13回：アプリケーション開発(5)第14回：開発アプリケーションの発表とまとめ",
        "courseDataUpdatedAt": "2024/01/06"
    },
    "updateAt": "2024/08/07"
}