{
    "lectureCode": "M000303",
    "courseName": "先端メディア学II[コンテンツビジュアライゼーション]",
    "lecturer": [
        "戀津魁(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水5",
        "木5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": "4",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "コンテンツビジュアライゼーションは、映画やドラマなどの映像コンテンツを中心に、その物語的特徴の可視化手法構築を目指す。物語中の時系列のグラフ化や、進行度に応じた登場人物相関図の生成手法の検討を行う。映像作品の分析を主体とし、分析結果のディスカッションを通じて可視化手法の構築を行っていく。可視化結果はHTML5及びCSS3、javascriptとそれらを利用したライブラリを用いて簡易なWebアプリケーションの形で実装し、Web上に公開を予定している。Webアプリケーション構築は教員側で行い、実例を通した構築方法についての座学を行う。特に、集めた情報のまとめ方について学ぶ。",
        "outcomesMeasuredBy": "映像コンテンツの分析・考察及び可視化手法の構築という実例を通じて、正解の存在しない課題に対する取り組み方及び研究発表に向けた成果の整頓方法の習得を目標とする。可視化結果の実装を通じ、Webアプリケーション構築に関する概要の理解も目標とする。また、得られた成果の論文化・学会発表を最終的な目標とする。ラーニングアウトカムズは、特に論理的な思考力、分析・評価能力、問題解決力を重視する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "座学とディスカッションを交えて行う。映像分析手法について原案の提示と参加者によるディスカッションを行い学生自らの主体的な学び（アクティブラーニング）を促す。分析と並行し、分析結果を考慮しながら順次手法の改善を行う。エクセルによる分析結果の共有やWebアプリケーションの閲覧を伴うため、ノートPCを必携とする。",
        "notices": "必要な技能は特に指定しないが、コンテンツを楽しむために消費するのではなく、ディレクター的視点で分析的に観る必要がある。映像作品の分析を行うため、同一作品を繰り返し複数回観ることとなる点に注意。学部既定の履修条件あり。",
        "preparatoryStudy": "授業中は分析手法や結果についての共有やディスカッションを主体とし、分析の実行は授業外の時間で予習・復習的に行う。また、授業内での発表に向けた分析結果のまとめも行う。予習としてコンテンツの分析120分、復習として分析結果のまとめを120分目安で行う。",
        "gradingGuidelines": "映像分析手法は明確な回答がないため、事前の具体的な評価基準は提示が難しい。分析時に抽出した情報量、量は少なくとも適切な質での抽出、分析方法のディスカッションでの積極性及び成果発表態度などから総合的に判断する。ディスカッションを通じ都度フィードバックを行う。配分としてはディスカッション40点・分析結果20点・成果発表40点の100点満点中60点以上で単位認定とし、分析の結果思わしい成果が得られずとも評価できるようにする。",
        "textbook": "特に指定しない",
        "referenceMaterials": "第1回オリエンテーション第2回既存可視化手法についての座学・分析対象作品のディスカッション第3回分析方法についての座学・分析対象作品のディスカッション第4回分析方法及び可視化手法についてのディスカッション第5回分析方法及び可視化手法についてのディスカッション第6回分析結果途中経過共有・分析方法についてのディスカッション第7回分析結果途中経過共有・分析方法についてのディスカッション第8回分析方法についての座学・分析対象作品（2作品目）のディスカッション第9回分析方法及び可視化手法についてのディスカッション第10回分析結果途中経過共有・分析方法についてのディスカッション第11回分析結果途中経過共有・分析方法についてのディスカッション第12回可視化手法の実装についてのディスカッション第13回可視化手法の実装についてのディスカッション第14回可視化手法の実装についての座学",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024/01/30"
    },
    "updateAt": "2024/08/07"
}