{
    "lectureCode": "M000501",
    "courseName": "先端メディアゼミナールII[先端CGクリエイション]",
    "lecturer": [
        "川島基展(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水5",
        "木5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年"
    ],
    "numberOfCredits": 4,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "CGクリエイター・ゲームクリエイターになるためには、ソフトウェアのオペレーションを身につけるだけでなく、プロの現場で培われた普遍的な知識やテクニックを学び、それを実践・応用するスキルを習得することが不可欠です。本科目では、各自の興味に応じて優れた作品制作事例の調査や有名カンファレンス等で発表された最新技術の探求を行い、そうしたスキルを培うとともに、その集大成として小規模ながらハイレベルな作品制作を行います。とくに本科目では、各自の専門分野をセミプロレベルまで伸ばすためのテーマを設定のうえ、作品制作を通じた実践指導を行います。また、国際連携を含む提携校との協同制作や産学協同プロジェクトへの参加を通じて優れた技術を身につけるとともに、クリエイターに必要なコミュニケーション能力の習得とコネクションの形成を目指します。",
        "outcomesMeasuredBy": "・CGクリエイターに必要なリサーチ能力を身につける・最新技術を探求し、作品制作に応用するスキルを身につける・制作実務に即したコミュニケーション能力を身につける",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "履修者は、少人数のセミナー形式でリサーチ・ディスカッションを行うとともに、次のいずれか１つまたは複数のプロジェクトに取り組みます。・プロの実務に沿った作品制作課題・提携校との協同作品制作・産学共同制作・開発プロジェクト協同プロジェクトに参加する場合には必ずしも授業計画に沿わず、プロジェクトの計画に応じて臨機応変に実施します。それぞれの活動につき、少人数制を活かして各工程の綿密な指導を行いますので、プロジェクト演習等では得られない高度かつ実践的なスキルを習得することができます。ミーティングでの進捗報告のため、ノートPC必携です。",
        "notices": "次のすべてを満たすことを履修条件とします。・累積GPAが学部の規定以上であること・コンテンツ制作関連のプロジェクト演習を履修のうえ、A以上の成績を取得していること・プロのCGクリエイター・ゲームクリエイターを目指す意志があること・受け身にならず、自発的に取り組む意欲があること履修希望者が多数の場合は、累積GPAや演習系授業の成績等をもとに選抜を行うこともあります。",
        "preparatoryStudy": "毎回、次のようなことにそれぞれ120分程度取り組む必要があります。予習：前回授業で確認したタスクに取り組み、進捗報告ができるよう準備する復習：授業で学んだことや得られたフィードバックをノートにまとめ、WeeklyReportとして提出する上記に加え、国内外のアニメーション、ドラマ、ゲームなどあらゆるCGコンテンツを視聴・プレイして自身の糧としてください。",
        "gradingGuidelines": "次の項目により、成績を評価します。・リサーチへの取り組み・成果物[40点]・プロジェクトへの取り組み・成果物[60点]100点満点中60点以上を単位認定要件とし、詳細については履修規定第８条に準拠します。",
        "textbook": "独自に作成したテキストを使用します。",
        "referenceMaterials": "適宜紹介します。",
        "courseSchedule": "第1回：オリエンテーション（授業概要の説明・ヒアリング）第2回：リサーチ・ディスカッション（課題設定・調査対象の検討）第3回：プリプロダクション（美術設定・仕様策定）第4回：モデリング指導（プロップモデリング・キャラクタモデリング）第5回：シェーディング指導（マテリアル設定・マッピング）第6回：プロトタイプ指導（中間チェック・リテイク指導）第7回：リギング指導（スキニング・リグデザイン）第8回：アニメーション指導（キーフレーム・モーションデザイン）第9回：ヴィジュアルエフェクト指導（エフェクトデザイン・ノード実装）第10回：シーン構築指導（カメラワーク・ライティング）第11回：インタラクションデザイン指導（プロシージャルデザイン、ロジックの実装）第12回：ポストプロダクション指導（コンポジット、映像編集）第13回：マスタリング指導（マスタリング、パッケージング）第14回：作品プレゼンテーション（最終発表・講評）",
        "courseDataUpdatedAt": "2024/02/01"
    },
    "updateAt": "2024/12/13"
}