{
    "lectureCode": "M000512",
    "courseName": "先端メディアゼミナールII[イノベーティブコンテンツプロデューシング]",
    "lecturer": [
        "三上浩司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年"
    ],
    "numberOfCredits": 4,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "メディア学部では様々なコンテンツに関する企画，制作，技術開発などにわたる多岐にわたるカリキュラムが用意されている．本科目では，それらの知識を応用し，これまでにない新しいコンテンツやプロジェクトをグローバルにプロデュースするための横断的な知識の再構築とその実践を行う．また，海外の提携校や留学生と積極的に連携して，コンテンツの分析や交流を行い，国際的なプロデュース力を身に着ける．この授業では研究テーマに関する成果をアウトプットし，学外に向けて発表できるように取り組む．",
        "outcomesMeasuredBy": "・コンテンツ制作に関わる学術研究を行う・東京ゲームショウやAnimeJapanなどの展示会などでの作品公開のプロデュースを行う・産学連携プロジェクトのメンバーとして活躍する・海外の提携校の学生と共同でコンテンツに関わる研究を行う",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ゼミ形式での授業を中心とする．各自の興味のあるテーマを掘り下げるゼミとそれに関連する知識習得のための講義を組み合わせて合計週2コマを実施する．プロデュースするコンテンツの公開時期に沿って，これらの知識を活用して実践する．2週間に1回程度発表を行い，採点の対象とする．授業計画はあくまで案であり，原則として各自が追求したいテーマによって変動する．※ノートPC必携",
        "notices": "【受講資格】累積GPAが学部の設定値以上であることが受講資格の必要条件である．加えて，次の必要条件を課す．・コンテンツに関わるプロジェクト演習でA以上の成績を取得した学生・英語でのコミュニケーションができる学生（TOEICの点数や能力に関係なく海外からの留学生との交流に積極的な人）（履修者が多数の場合、累積GPA，演習系授業の成績等をもとに選抜することもある．）",
        "preparatoryStudy": "映画，アニメ，ゲーム，演劇などあらゆるコンテンツを批判的発想をもって貪欲に視聴しする（200分程度）．授業後は授業でのフィードバックや指導をもとに，関連する調査，分析，実装を行うこと（240分程度）",
        "gradingGuidelines": "提出物の評点（70％）と最終成果物（プロジェクト，イベント）における活動（30％）を総合して評価する．100点満点中60点以上で単位認定とする．提出物，成果物は発表の際にフィードバックを行います．",
        "textbook": "とくになし",
        "referenceMaterials": "コンテンツクリエーション（コロナ社），CGとゲームの技術（コロナ社）そのほか各単元にて適宜紹介する",
        "courseSchedule": "第1回：オリエンテーション（導入，企画）第2回：研究テーマ調査（背景，現場）第3回：先行研究調査（国内，海外）第4回：新規性の確保（独自性，異議）第5回：研究テーマ設定（問題発見，発明，手段）第6回：モックアップ創作（概念図，モックアップ）第7回：モックアップ創作（クリティカルシンキング，議論）第8回：α版創作（目的の達成，デモ）第9回：α版発表（クリティカルシンキング，議論）第10回：β版創作（テスト，デモ）第11回：β版発表（クリティカルシンキング，議論）第12回：最終版の創作（QA，評価）第13回：発表のための準備（言語表現，非言語表現）第14回：発表（批評，議論）",
        "courseDataUpdatedAt": "2025/02/04"
    },
    "updateAt": "2025/03/21"
}