{
    "lectureCode": "M000504",
    "courseName": "先端メディアゼミナールII[AIによる音響分析]",
    "lecturer": [
        "大淵康成(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年"
    ],
    "numberOfCredits": 4,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "ビッグデータ分析が注目される現代においては、「データを集めること」と「集めたデータから法則を導き出すこと」の二つが益々重要になっている。本講義では、様々な音データを自ら収集したうえで、ディープラーニング・サポートベクターマシン・隠れマルコフモデルなど、総称としてAI(ArtificialIntelligence:人工知能)と呼ばれる多種多様なソフトウェアを使って分析を行う。人間の声の感情分類や騒音の種類別の分析など、実際の役に立つようなアプリケーションの作成を通じて、各種ツールの使い方と、その背景にある動作原理を理解する。また、IMRAD形式を意識したレポート執筆を通じ、対外発表ができるようなプレゼンテーション能力を身に着ける。",
        "outcomesMeasuredBy": "音データの収集方法と、基本的な分析方法を習得する。1種類以上のデータ解析ソフトの使い方をマスターする。オリジナルの観点でのデータ分析について、分析結果をまとめて発表を行う。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ノートＰＣ必携のアクティブラーニング科目である。授業前半では、音データの収集方法を学び、自ら様々なデータを集めてみる。次に集めたデータを分析する。基本的な分析の中で、自ら集めたデータの特徴を発見し、さらに詳しく分析するための専門的なソフトウェアの使い方を学ぶ。授業後半では、最終課題のまとめを目標に、適宜補充実験を行いながら詳細な分析を行い、その結果をレポートにまとめていく。",
        "notices": "GPAによる履修制限があるので注意すること。PCを使う時間が長いので、PCの基本的な操作方法に習熟していることが必要である。",
        "preparatoryStudy": "データ収集や分析については、前の週の結果を確認し(240分)、自ら追加の作業を行い、次の授業までに疑問点などを整理しておく(240分)。",
        "gradingGuidelines": "最終課題として行う発表および提出物を100点満点で評価する。評価に際しては、課題の独自性・分析の正確性・発表のわかりやすさなどが具体的な評価項目となる。最終課題および提出物に対しては、授業時間内に準備状況を確認し、適宜フィードバックを行う。ただし、毎回の授業への取り組み姿勢などにより加点/減点することがある。対外発表を行った場合には、内容に応じて加点する。",
        "textbook": "特に設けない。内容に応じて文献等を指定する。",
        "referenceMaterials": "相川、大淵「音声音響インタフェース実践」、コロナ社",
        "courseSchedule": "第1回：授業概要の説明。音データの収集方法第2回：音データの収集と基本的な分析(1)第3回：音データの収集と基本的な分析(2)第4回：音データの収集と基本的な分析(3)第5回：音データの収集と基本的な分析(4)第6回：データ分析ソフトの使用方法習得と分析実施(1)第7回：データ分析ソフトの使用方法習得と分析実施(2)第8回：データ分析ソフトの使用方法習得と分析実施(3)第9回：データ分析ソフトの使用方法習得と分析実施(4)第10回：分析結果のまとめと補充実験(1)第11回：分析結果のまとめと補充実験(2)第12回：分析結果のまとめと補充実験(3)第13回：分析結果のまとめと補充実験(4)第14回：最終課題の発表",
        "courseDataUpdatedAt": "2025/01/24"
    },
    "updateAt": "2025/03/21"
}