{
    "lectureCode": "M000419",
    "courseName": "先端メディアゼミナールI[ミュージック・アナリシス＆クリエイション]",
    "lecturer": [
        "伊藤謙一郎(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": "4",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "われわれの日常は、多種多様なメディアから流れる音楽に囲まれている。それらは、テレビや映画、ゲームなど映像コンテンツに付与されたものであったり、作者が何らかの表現や主張を意図して作った音楽作品であったりするが、いずれのものも「それがそれとして理想の形」を与えられ、構成されていることに変わりはない。これらさまざまな音楽に対し、個人的な嗜好や考えで耳を傾けるのではなく、客観的かつ分析的に聴取する行為を通して、音楽における表現のあり方を「作り手」の視点から考える。",
        "outcomesMeasuredBy": "楽曲の理解に向けた基本的な楽曲分析の手法に習熟する。分析結果を論理的に言語化できる能力を身につける。また、分析によって得られた知見を生かし、自身の創意を音楽として具現化できる高度な創作能力を養う。本科目のラーニングアウトカムの重点項目は「実学に基づく専門能力」「コミュニケーション能力」「論理的な思考力」「分析・評価能力」「問題解決力」であるが、特に「論理的な思考力」「分析・評価能力」を重視する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "音楽の聴取を通して、学生と教員が互いに多角的な視点から作品を分析し、議論を行う。また、その作品に関連する事項を調査し、理解を深める。作品制作を主とする者は、自作品に関するプレゼンテーションも行う。履修者には、授業内での積極的な発言・活発な議論を求める。ノートPCを使用するので、毎回必ず持参すること。",
        "notices": "累積GPAが学部所定の基準以上であることが受講資格の必要条件である。加えて、以下の必要条件を課す。・「音楽入門」がA評価以上であること（※編入生は「音楽入門I」または「音楽入門II」を履修すること）なお、履修の定員は各学年2名（両学年を合わせて4名）程度とし、履修希望者が定員を超える場合は履修志望理由書の内容によって選抜を行う。",
        "preparatoryStudy": "日頃から幅広くさまざまな音楽を分析的に聴くこと。それによって気づいた点を記述する習慣を身につけること。予習【120分程度】としては次回授業で扱う内容についてのリサーチ、復習【120分程度】としては授業内で取り上げられた作品、および関連作品のさらなる視聴、作者に関する情報収集を積極的に行うこと。",
        "gradingGuidelines": "授業内での発言・議論への参加【10％】、各回の授業に関するレポート【10％】、楽曲分析・作品制作【30％】、論文発表・作品発表【40％】、最終レポート【10％】で評価し、60点以上を単位認定要件とする。また、毎回の授業では研究・制作の進捗を報告してもらうが、これは上記の「授業内での発言」に含まれるものである。次のステップに向けての解決法や改善策をアドバイスしながら、各自の進捗に対するフィードバックを随時行う。",
        "textbook": "使用しない。",
        "referenceMaterials": "授業内で適宜紹介する。",
        "courseSchedule": "第1回：授業概要説明と各履修者の目標の確認第2回：音楽の聴取と分析手法に関する知識習得(1)第3回：音楽の聴取と分析手法に関する知識習得(2)第4回：音楽の聴取と分析手法に関する知識習得(3)第5回：音楽の聴取と分析手法に関する知識習得(4)第6回：各履修者の目標の再確認：分析対象作品の選定・作品制作プランの策定第7回：楽曲分析、または作品制作(1)第8回：楽曲分析、または作品制作(2)第9回：楽曲分析、または作品制作(3)第10回：楽曲分析、または作品制作(4)第11回：楽曲分析の論文発表、または作品発表(1)／ディスカッション第12回：楽曲分析の論文発表、または作品発表(2)／ディスカッション第13回：楽曲分析の論文発表、または作品発表(3)／ディスカッション第14回：最終発表・総評",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/08\/07"
}