{
    "lectureCode": "M001201",
    "courseName": "メディア基礎演習II[A]",
    "lecturer": [
        "太田高志(メディア学部メディア学科)",
        "藤澤公也(メディア学部メディア学科)",
        "飯沼瑞穂(メディア学部メディア学科)",
        "羽田久一(メディア学部メディア学科)",
        "兼松祥央(メディア学部メディア学科)",
        "戀津魁(メディア学部メディア学科)",
        "加藤邦拓(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "4",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "メディア基礎演習Iに引き続き、メディア学部の代表的な分野に関連したテーマを通じて、共通的な見識とスキルの獲得を行うと共に、学問分野への広い理解を行う。本演習では、演習やグループワークを通じて、実学に基づく専門能力およびコミュニケーション能力の習得を目指す。================================［HCI（ヒューマン・コンピューター・インタラクション）実験（3回分）］授業概要：HCIのためのプログラミング、ハードウェア作成、ユーザ評価の3つをベースに、人間とコンピュータの関係性について学び、他者を納得させることのできるレポートを作成する。================================［Webデザイン（3回分）］授業概要：HTML、CSS、JavaScript等のWebページを構成する基本的な技術について修得する。インターネット上のサーバとの通信を含めたデータのやり取りとその表示方法を通じ、Webアプリケーションの技術と表現について体験する。================================［問題発見スキル（3回分）］授業概要：グローバルな課題に関心を向け、問題発見と課題解決のスキルを身に着ける。持続可能な開発目標の紹介やディスカッションを行う。統計データの調査や、デジタル地図を使った課題理解を行い、解決に向けたアイデアの創出と発表を行う。================================「人工知能・機械学習の開発・活用（3回分）」授業概要：現在の人工知能・機械学習の中心技術である深層学習を用いた画像認識を体験する。インターネット上のサービスとPythonを用いたプログラム開発を含む。================================「ポートフォリオ化(第13、14回)」全てのテーマについてポートフォリオとしてまとめる。",
        "outcomesMeasuredBy": "メディア学部の代表的な分野に関連したテーマを通じて、共通的な見識とスキルの獲得を行うと共に、学問分野への広い理解を行う。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "20名程度の小クラスに分かれて講義と演習を行う。第1回から第12回では4つのテーマを順に扱う。その順番はクラスによって定められる。順序による差異はない。演習で用いるのでノートPCが必携である。",
        "notices": "自身が参加するクラスの週毎のテーマや教室を間違えないようにすること。",
        "preparatoryStudy": "情報リテラシー演習及び基礎演習Ⅰで修得したスキルを前提として授業を進めるため、良く復習しておくこと（１時間程度）。予習：テーマごとに与えられる予習を行うこと復習：テーマごとに与えられる復習を行うこと",
        "gradingGuidelines": "4つのテーマとポートフォリオでの評価の合算により成績を評価する。各テーマでは演習実施、提出課題、実技試験などの成績に基づいて評価を行う。テーマごとに異なるため、詳細は各テーマの実施時に伝達する。",
        "textbook": "なし。授業中にWeb等を通じて必要な資料を配付する。",
        "referenceMaterials": "なし。必要に応じて各テーマの実施中に紹介する。",
        "courseSchedule": "第1回:第1テーマ回目（羽田、戀津、飯沼、藤澤、太田）第2回:第1テーマ2回目（羽田、戀津、飯沼、藤澤）第3回:第1テーマ3回目（羽田、戀津、飯沼、藤澤）第4回:第2テーマ回目（羽田、戀津、飯沼、藤澤、太田）第5回:第2テーマ2回目（羽田、戀津、飯沼、藤澤）第6回:第2テーマ3回目（羽田、戀津、飯沼、藤澤）第7回:第3テーマ回目（羽田、戀津、飯沼、藤澤、太田）第8回:第3テーマ2回目（羽田、戀津、飯沼、藤澤）第9回:第3テーマ3回目（羽田、戀津、飯沼、藤澤）第10回:第4テーマ回目（羽田、戀津、飯沼、藤澤、太田）第11回:第4テーマ2回目（羽田、戀津、飯沼、藤澤）第12回:第4テーマ3回目（羽田、戀津、飯沼、藤澤）第13回:ポートフォリオ化回目（兼松、加藤、太田）第14回:ポートフォリオ化2回目（兼松、加藤）",
        "courseDataUpdatedAt": "2024/02/02"
    },
    "updateAt": "2024/08/07"
}