{
    "lectureCode": "M101801",
    "courseName": "メディアのための数学",
    "lecturer": [
        "松永信介(メディア学部メディア学科)",
        "渡辺大地(メディア学部メディア学科)",
        "松吉俊(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水2",
        "金"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "インターネットやSNSの普及に伴い、近年のデジタルメディアの利活用は無限ともいえるほど広がっている。そして、その裏には常に数学の下支えがある。AIやビッグデータなどの社会全体に波及する技術革新はもとより、指紋・声紋などの個人認証も，その背後で数学が機能している。本科目は、そのような急速に進化するメディア社会における数学の役割を俯瞰・認識する目的で設置している。講義の前半の数回は、数感を呼び起こすために、高校までに学んだ数学のおさらいをする。その後は，トピックを絞ることにはなるが、コンテンツコースに大きく関わるCGやゲームにおける数学の利活用、技術コースの中心テーマの一つである音声音響処理における数学の利活用、社会コースにおける人間社会の領野における数学の利活用について論ずる。多彩なトピックが盛り込まれており、個々の内容はそれだけで通年の講義に値するものであるが、いずれも深く掘り下げることはせず、数学の応用の世界を素養として知ることに主眼をおく。",
        "outcomesMeasuredBy": "応用としての数学の役割・存在意義を理解し、それを次代のメディア社会に活かす創造力を育む。また、メディア学部のコンテンツ・技術・社会という3つのコースを数学的視点から横断的に捉え、その関連性を説明できるようになる。",
        "learningOutcomes": "論理的な思考力問題解決力",
        "teachingMethod": "講義を中心に進める。授業資料は、原則として学生ポータルサイトに掲載する。また、講義の合間に適宜、理解度確認のための演習を行う。この演習課題には、提出用とそうでないものとがある。前者の提出用は、他人との相談なしに取り組み、各自で提出する課題である。後者の提出用は、必要に応じて受講者同士で意見交換しても構わないこととする。なお、授業資料の閲覧や授業内課題の提出のため、ノートPCは毎回必携とする。",
        "notices": "1年次前期必修科目である「数学基礎」あるいは「数学概論」を修得していることを前提として講義を進める。これらの科目が未修得であっても本科目を受講することはできるが、事前に学修支援センターなどで十分な復習をしておき、いつでも知識が引き出せるような備えをしておくことが望ましい。",
        "preparatoryStudy": "各回の講義前には予定されているトピックについて、指定参考書や図書館の書籍などを読んで予習しておくこと（120分程度）。また、講義後は速やかにて講義内容について自力でまとめてみるとともに、課題は必ず試みること（120分程度）。",
        "gradingGuidelines": "期末試験の成績80%、レポート・演習の成績20%の割合で素点を100点満点に換算して成績評価を行う。60点以上が単位認定の要件となる。なお、レポート・演習については適時、解説や全体講評を行う。",
        "textbook": "指定しない",
        "referenceMaterials": "・三上浩司，渡辺大地：メディア学体系2CGとゲームの技術，コロナ社（2016）・榎本美香，飯田仁，相川清明：メディア学大系4マルチモーダルインタラクション，コロナ社(2013)・平岡和幸，堀玄：プログラミングのための線形代数，オーム社（2004）・トランスナショナルカレッジオブレックス：フーリエの冒険新装改訂版，ヒッポファミリークラブ（2013）・T.Crilly著，野崎昭弘監訳：人生に必要な数学50，近代科学者（2009）・河添健：数理と社会－身近な数学でリフレッシュ－（増補版），数学書房（2012）",
        "courseSchedule": "第1回（11\/13；水2限）：イントロダクション（講義のねらいと概観，メディアと数学）（松永）第2回（11\/15；金1限）：メディア数学の基礎（数と式，関数とグラフ，確率と確率過程）（松永）第3回（11\/20；水2限）：CG・ゲームのための数学1（ベクトルの定義と法則（成分，演算，正規化））（渡辺）第4回（11\/22；金1限）：音声音響のための数学1（初等関数，微分・積分，複素数，テイラー展開）（松吉）第5回（11\/27；水2限）：CG・ゲームのための数学2（ベクトルの意義（座標系，ベクトル方程式））（渡辺）第6回（11\/29；金1限）：音声音響のための数学2（単振動，フーリエ級数展開）（松吉）第7回（12\/04；水2限）：CG・ゲームのための数学3（ベクトルの積演算（内積，外積））（渡辺）第8回（12\/06；金1限）：音声音響のための数学3（複素フーリエ級数、フーリエ変換）（松吉）第9回（12\/11；水2限）：CG・ゲームのための数学4（ベクトルによる領域表現（ベクトル不等式，線形独立））（渡辺）第10回（12\/13；金1限）：音声音響のための数学4（スペクトログラム、対数メルフィルタバンク特徴量）（松吉）第11回（12\/18；水2限）：人間社会モデルのための数学1（数理モデル，グラフ理論）（松永）第12回（12\/20；金1限）：人間社会モデルのための数学2（ネットワーク理論，種々の応用問題）（松永）第13回（01\/08；水2限）：人間社会モデルのための数学3（社会におけるゲーム，数学と戦略）（松永）第14回（01\/10；金1限）：人間社会モデルのための数学4（最適化問題，組合せ最適化）（松永）",
        "courseDataUpdatedAt": "2024\/02\/14"
    },
    "updateAt": "2024\/09\/13"
}