{
    "lectureCode": "M101001",
    "courseName": "システム基盤技術の基礎",
    "lecturer": [
        "羽田久一(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月5",
        "水2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ３０２"
    ],
    "courceDetails": {
        "courseOverview": "現代社会ではデジタル情報を中心にメディアは構築されており，その流通経路としてインターネットは欠かすことが出来ない「システム基盤」である．ネットワークを利用したサービスをおこなうためにはコンピュータに関する基礎知識の他，インターネットの仕組みを含む情報ネットワークの基礎知識とウェブサービスのような現在利用されているシステムの構成要素の知識を得る必要がある．さらに，これらのシステムが社会的にどのような影響をもち，何に注意し利用，提供すべきなのかという問題点についても考慮せねば安心してサービスを利用・提供することは出来ない．本講義では将来のサービス提供者としての視点から，ネットワークを利用したサービスの開発や提供を行う時に必要となる基礎知識を網羅することを目標に学習を行う．",
        "outcomesMeasuredBy": "ゲーム，音楽，映像などデジタルコンテンツの提供者・作成者としてインターネットを中心としたコンピュータシステムを利用する場合に必要な実践的な専門知識と技術を身につける．また，システムを安全に利用し、利用時に発生するようなトラブルを自力で解決するような問題解決力を習得することを目標としている．",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力",
        "teachingMethod": "講義を中心とし，必要に応じて質疑応答やウェブを利用したアンケートやミニテストなどを組み合わせて授業を行う．授業内ではPCを利用しての作業を指示することがあり，作業は単位習得には必須である．また，授業に対する参考資料を挙げる場合には事前にそれを読んでおく必要がある．",
        "notices": "-授業中にウェブベースでのミニテストやPCを使った作業を行うことがあるのでパソコンを持参すること．-授業中に課せられるPCを利用した作業等に関してはスマートフォンを含む携帯電話、タブレットなどの携帯端末では対応不可能である場合がある．-毎回の授業においてキーワードや文献のリストを提示するので、予習／復習としてこれらについて熟読・調査しておくこと．-各回の授業は提示された文献を読んでいることを前提として進める．",
        "preparatoryStudy": "-１年１Q科目であるインターネットシステム入門を履修している，あるいはその内容を理解していること．-ブラウザでインターネットを検索することが出来る，レポートのため簡単な文書を作成できるといった程度の基礎的なコンピュータリテラシを持っていること-毎回の講義内での課題について復習を行い，講義内容を理解しておくこと",
        "gradingGuidelines": "-授業内課題(50点)ならびに期末テスト(50点)の成績によって成績を決定する．-合計100点満点中60点以上を合格とする.-授業内課題に関しては提出期限を過ぎた後の講義で解説を行う．そのため期限に遅れた提出物は評価の対象としない．",
        "textbook": "特に指定しない",
        "referenceMaterials": "1.ガイダンス：システム基盤とコンピュータ（システム基盤，コンピュータとは）2.コンピュータのハードウェア（CPU,メモリ，入出力）3.オペレーティングシステム（OS,カーネル)4.LinuxとWindows（Linux,Windows,コマンドライン)5.プログラムとその実行(プログラミング言語，機械語，アルゴリズム）6.プログラミング言語(インタプリタ，コンパイラ）7.インターネットの成り立ちとガバナンス（インターネット，ガバナンス，ネットワーク）8.インターネットを調べる（IPアドレス，経路，プロトコル）9.Webの技術（HTML,HTTP,URL)10.Webブラウザの挙動（ブラウザ，Javascript，HTML)11.インターネットのサービス(Webアプリケーション，SNS）12.CDNとクラウド（CDN,クラウドコンピューティング)13.暗号とセキュリティ(公開鍵暗号,ネットワークセキュリティ）14.まとめと今後の展望",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/05\/10"
    },
    "updateAt": "2024\/08\/07"
}