{
    "lectureCode": "M102001",
    "courseName": "広告クリエイティブ入門[2023年以前入学者]",
    "lecturer": [
        "藤崎実(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木4"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "国内および外資系広告会社、ソーシャルメディア・マーケティング会社にて、クリエイティブディレクターとして様々な実務（マーケティング、企画、CMや映像制作、クリエイティブディレクション、プロデュース、商品開発、SNS運用など）に関わった「実務経験」に基づく「実践的科目」です。この授業では最近のバズ動画の流れに続く、バイラルムービーの歴史を学びます。全てのアドコンテンツはブランディングを意識しているため、ブランドに貢献する広告についても学びます。最近の広告の多様化も学びます。デジタルを活用したアドコンテンツやSNS時代の潮流、社会に貢献する広告や、ユーザーの体験を重視する広告なども扱います。広告はマーケティングを実践するためのマーケティング・コミュニケーションと位置付けられています。また世の中のあらゆるクリエイティブ（映像・音楽・グラフィック・デザイン・CG・Webサイト・SNS・イベント・アプリ・イノベーション等）と関連がある分野です。従って、広告を学ぶことはマーケティングやコミュニケーションやクリエイティブの重要ポイントを学ぶことになります。なお、今後に向けた応用力の修得を重視していますので、各テーマにおける「基本的な知識」や「考え方」を学ぶ授業です。広告の作り方教室ではありませんので注意してください。広告のあり方は、時代の変化と共に変化しています。しかし、いつの時代も上手な広告には、人の気持ちを動かす力があります。その源泉はどこにあるのか。広告は身近に溢れていながら、知るほど考え抜かれた奥の深い世界です。一緒に楽しみながら学んでいきましょう。",
        "outcomesMeasuredBy": "現代における広告の役割や拡がりなどに関する基本的な知識の習得を目標とする。（ブランディング広告。世界のバイラルCMに関する知識。バズ動画の歴史。20世紀と21世紀の広告の違い。広告的思考の重要性。変化に対応する広告のチカラ。柔軟な広告のあり方など）。広告の作り方教室ではありませんので注意してください。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力",
        "teachingMethod": "【授業形式：講義】授業はシラバスに沿った流れで行います。毎回違うテーマを設定し、理論と事例を行き来させて進行させます。講義が基本ですが理論に終わらせず、理解を深めて実感として修得しやすいように、事例となる国内外のCMや映像を多数紹介します。「世界のバイラルCM」では、歴史を振り返り、エポックになったCMを見て、今までの流れを体験します。時代の変化に対応したバイラルCMの流れを知ることにより、現在のバズ動画の状況を理解します。インターネットやSNSが完全に定着した今日、社会の至るところに広告コミュニケーションが見受けられます。現代の広告は広告の形をしていない所に特徴があります。「広告は時代を映す鏡」と言われます。時代の変化に対応した様々な広告のあり方を知ることにより、柔軟な思考力を育みます。ノートPC必携です。",
        "notices": "特にありませんが、普段から身の周りの広告を注意して見ていてください。「広告・広報入門」を履修していると理解がより深まります。",
        "preparatoryStudy": "予習として、シラバスに示された内容をもとに概要を把握し、キーワードや専門用語の意味を理解しておいてください。授業後は、授業内容を復習して講義内容の習得に努めて下さい。予習・復習にはそれぞれ120分程度の時間をかけて下さい。発展的な知識の習得には、自主的な取り組みが不可欠です。普段から身の周りの広告を観察して、企業の意図を分析する習慣を持つことが重要です。",
        "gradingGuidelines": "授業終了後に提出する「授業概要と感想」85％、授業期間中に行う「課題レポート」「理解度チェックテスト」など10％、授業中の発言5%で評価します。100点満点中60点以上で単位認定とします。また、学修内容の定着のため、提出物や課題などに関して、授業やムードルでフィードバックを行います。",
        "textbook": "教科書は使用せず、毎回の授業で資料を配布する予定です。",
        "referenceMaterials": "藤崎実・徳力基彦（著）（2017）『顧客視点の企業戦略』宣伝会議岸志津江・田中洋・嶋村和恵(2017)『現代広告論第３版』有斐閣アルマ石崎徹（編著)（2016）『わかりやすいマーケティング・コミュニケーションと広告』八千代出版ロブ・フュジェッタ(著)、土方奈美(訳)、藤崎実(監修)（2013）『アンバサダー・マーケティング』日経BP社ブルース・バートン（著）、小林保彦（訳）（2005）『誰も知らない男なぜイエスは世界一有名になったか』日本経済新聞社",
        "courseSchedule": "第1回目:（オリエンテーション）【ブランドに貢献する広告】①ブランディング広告（ブランディング、ブランドエクイティ）第2回目:【ブランドに貢献する広告】②企業のDNA/独自の価値（ブランド広告、ブランド価値）第3回目:【伝播性を意識した広告】①世界のバイラルCM（誕生期）（バイラルCM、バズ）第4回目:【伝播性を意識した広告】②世界のバイラルCM（発展期）（YouTube、カンヌライオンズ）第5回目:【伝播性を意識した広告】③SNSの発展/バイラルからシェアへ（ソーシャルメディア、シェア）第6回目:【生活者視点とエンパワーメント】インフルエンサーとクチコミ（インフルエンサー、クチコミマーケティング）第7回目:【伝播性を意識した広告】④グローバルインサイトの時代へ（SNS、インサイト）第8回目:（オリエンテーション）【広告を超える広告】20世紀の広告と21世紀の広告（ソーシャルメディア、コミュニケーションデザイン）第9回目:【広告を超える広告】広告的思考の重要性（ダーウィン主義、カンヌライオンズ）第10回目:【広告を越える広告】広告の拡張と可能性（AR、エデュケーション）第11回目:【社会に貢献する広告】ソーシャルグッド（ソーシャルグッド、社会貢献）第12回目:【デジタルが拡げる可能性】体験をデザインする（イベント、テクノロジー）第13回目:【広告の技術と総合力】クリエイティビティが未来を拓く（最適解、ダイナミックケイパビリティ）第14回目:【変化に対応する広告】柔軟な広告の強さ（アウフヘーベン、別解）",
        "courseDataUpdatedAt": "2025/01/06"
    },
    "updateAt": "2025/03/21"
}