{
    "lectureCode": "M200801",
    "courseName": "インターネットコミュニティ論",
    "lecturer": [
        "寺澤卓也(メディア学部メディア学科)",
        "山崎晶子(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ５０２"
    ],
    "courceDetails": {
        "courseOverview": "人はコミュニティの中で生活を行っている。中でもネットワークを通じたコミュニティのありかたが重要である。では、昨今のインターネットを通じたコミュニティにおいては、ネットワークはどのように成立しているのだろうか。本授業では、社会学や社会心理学において従来議論されてきた内容や概念を元にして、対面的ネットワークのあり方を理解し、そこから現在のインターネットを用いたネットワークとそのコミュニティのありかたを解明する。また、質問紙を作成し、現在の問題を把握する。",
        "outcomesMeasuredBy": "本授業の到達目標は以下のとおりである。（1）ネット上のコミュニティを考察するために必要な概念を理解する。（2）質問紙による調査の方法および調査票の作成方法を習得する。（3）コミュニティを作り出すネットワーキングに関して、社会学や社会心理学で議論されている概念を学び、実際の事象をその概念から理解する能力を身につける。（4）コミュニティ形成や地域活動の支援にITがどのように活用されているのかを理解する。",
        "learningOutcomes": "論理的な思考力分析・評価能力",
        "teachingMethod": "各回のテーマに応じて講義を行うが、授業内課題として小演習を毎回行う。講義資料の閲覧、授業に関連した検索、小演習等にノートPCを使用する。必要に応じて、板書やスライドの内容をノートにとること。ノートPCを利用するので必ず持参すること。",
        "notices": "1年次に『ソーシャルリサーチ』を履修していることが望ましい。グループで行う課題を課すため、授業以外の時間も学習に使う必要がある。また、第1回は寺澤と山崎の共同担当である。第2回～第7回は山崎の担当で、残りの回は寺澤の担当である。",
        "preparatoryStudy": "第2回以降は、宿題をほぼ毎回だすので、予習復習に役立てること。毎回の授業の終わりに、その回のまとめと次回の予定を説明する。復習は公開した授業資料を基にポイントを整理し、それを活かして宿題に取り組むこと（120分程度）。予習は、参考書や事前配布資料、Webサイトなどを参考に次回の授業に関する基礎的な概念を理解してくること（120分程度）。",
        "gradingGuidelines": "授業内課題（20%）、発表課題（20%）と最終試験（60%）の合計100点満点で評価し、60点以上を及第とする。全ての授業回に出席することを単位取得の前提とする。授業内課題については、その後の回の授業中に解説を行う。",
        "textbook": "なし",
        "referenceMaterials": "増田直紀『私たちはどうつながっているのか』中公新書",
        "courseSchedule": "第1回:ガイダンスとイントロダクション（寺澤・山崎）第2回:ネットワークとは何か（山崎）（コミュニティ、クラスター、グラフ）第3回:携帯電話による人間関係の変化（山崎）（固定電話、名乗り）第4回:インターネットコミュニティの会話分析（山崎）（会話分析、社会調査）第5回:質問紙を使った調査（山崎）（質問紙調査概論、ソーシャルネットワーク）第6回:調査票の作成1（山崎）（質問紙調査設計、社会調査）第7回:調査票の作成2（山崎）（質問紙調査作成、社会的事象の理解）第8回:スモールワールド実験（寺澤）（スモールワールド、6次の隔たり）第9回:人間関係とハブ（寺澤）（スケールフリー、ハブ）第10回:インターネット上のコミュニケーション（寺澤）（メール、ブログ）第11回:SNSとコミュニティ（寺澤）（X(Twitter)、Facebook、Instagram）第12回:ネットワークと教育（寺澤）（LMS、MOOCs）第13回:コミュニティ形成支援（寺澤）（リアル\/ネットコミュニティ、SNS、オフ会）第14回:ITによる地域活動支援、および、まとめ（寺澤）（電子自治体、電子町内会、地域振興）",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/08\/07"
}