{
    "lectureCode": "M200401",
    "courseName": "経営数理",
    "lecturer": [
        "小林克正(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "社会や経営・経済に関する問題を認識し、それに対処することは今後ますます重要になってくる。さらにビジネスにも数学的な知識や論理的な理解が必要な事項が増えている。この科目では、メディアやそこから得られる情報を用いて、問題を認識するための方法論と、数理的・論理的な考え方にもとづいて、社会的な問題やビジネス上の課題などに対処するための手法の基礎を学ぶ。また、情報理論やシステム理論と、その社会科学やビジネスへの応用についても学ぶ。",
        "outcomesMeasuredBy": "授業概要で述べた事項に関して、どのような問題には、どのような手法を用いればいいのかがわかるようになり（論理的な思考力）、授業で扱った範囲においてはその手法を利用できるようになること（問題解決力）が目標となる。",
        "learningOutcomes": "論理的な思考力問題解決力",
        "teachingMethod": "講義を主体とする。小演習、レポートの出題を行う。ノートPCを用いるトピックも扱い，必要な回は携行を指示する。",
        "notices": "数学的な事項が必要な場合は可能な限り解説するので、授業には毎回出席し、真剣に受講すること。1年次前期の一般教育数学科目を履修していることが望ましい。",
        "preparatoryStudy": "予習：前回授業の課題あるいは考察事項を確認・考察する（60分程度）。復習：授業内容を確認し、初めて聞いたことがらに関して文献調査等をする（60分程度）。",
        "gradingGuidelines": "小演習３０％、レポート３０％、期末の試験または課題の結果４０％の割合で成績評価を行う。６０点以上を合格とする。小演習やレポート、学修状況について、講義中に講評するなどのフィードバックを行う予定。",
        "textbook": "プリントあるいはWeb教材を配布。",
        "referenceMaterials": "第1回:イントロダクション（経営数理とは広義の経営管理）第2回:メディアと経営・ビジネス（経営・ビジネスとメディアとの関係メディアとはメディア学における経営）第3回:経営・ビジネスとメディア（経営・ビジネスへのメディアの応用経営におけるメディアメディアにかかわる経営・ビジネス）第4回:経営・ビジネスにおける数理的手法について（経営・ビジネスに用いられる数理的手法定式化数量化数理計画法線形計画法）第5回:金融工学的手法への第一歩・基礎（利率等の決定利息市場）第6回:金融工学的手法への第一歩・理論（確率統計確率論の確認統計の扱い）第7回:金融工学的手法への第一歩・実際（金融化金融工学の目的確率微分方程式）第8回:経営・ビジネスにおける意思決定（意思決定とは数理的意思決定現実的意思決定）第9回:経営・ビジネスと情報理論（情報の質と量情報理論符号化）第10回:情報理論と経営・ビジネス（経営・ビジネスでの情報の役割情報のエントロピー情報の非対称性）第11回:経営・ビジネスとゲーム理論（ゲーム理論とはゲーム理論におけるゲーム経営・ビジネスでのゲーム理論）第12回:ゲーム理論の基礎（ゲームの分類ゼロサム・ゲームノン・ゼロサム・ゲーム）第13回:ゲーム理論の実際（ゲーム理論における戦略さまざまなゲーム理論ゲーム理論の利用）第14回:まとめ（経営数理とは展望）",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/25"
    },
    "updateAt": "2024\/09\/13"
}