{
    "lectureCode": "M200201",
    "courseName": "CG制作の基礎",
    "lecturer": [
        "菊池司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "CGを制作するに当たって利用する基礎技法を説明し、論理的な思考をもとにした作品制作の演習を通じてCG基礎理論の理解とそれらの技法を習得することを目的とする。（1）2次元コンピュータグラフィックスの基本であるディジタル画像、ペイント系システム、ドロー系システム、（2）線や曲線の描画方法、（3）図形変換の方法、（4）形と色、タイポグラフィ、レイアウト、ピクトグラム、（5）CG制作に重要な形状表現のためのデッサンの基礎、（6）投影法と投影変換、（7）3次元形状モデリング、（8）3次元形状のレンダリング、マテリアルとマッピングによる質感表現、カメラワーク、ライティング手法（9）プロシージャル・アニメーション（アルゴリズムによる自動生成．アート・デザインへの応用の可能性）を扱う。このような項目を学ぶことにより、アニメーション、ゲーム、メディアアート、Webコンテンツ、ディジタル教科書などデジタルコンテンツのためのCG制作の基礎理論とそのプログラミング、CG作品制作方法を習得することを目標とする。",
        "outcomesMeasuredBy": "授業終了時の到達目標は、「アニメーション、ゲーム、メディアアートなどデジタルコンテンツのためのCG制作の基礎理論とそのプログラミング、CG作品制作方法を習得し、自らコンテンツを制作することが可能である状態」になることである。また、CG-ARTS協会の「CGクリエイター検定ベーシック」を受験した場合に合格できるようになることである。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "CG制作において用いられるさまざまな手法を解説し、アルゴリズムの解説とそれをもとにした作品制作のための演習を行う。予習、講義中の演習をもとにした課題(復習演習）をレポートとしてまとめる。講義とプログラミング演習（ノートPC必携）を交互に行う。演習については、必ず予習をすることを前提に授業を進める。前半は2次元グラフィックス、後半は3次元グラフィックスを扱う。CG技術の内容は教科書に従って解説する。プログラミングは各自の予習をもとに、授業内では例題プログラムを実行し、各種のパラメータを変更しながら試行錯誤してアルゴリズムを理解するような演習を行う。",
        "notices": "（1）CGクリエイター検定ベーシック対応の教科書を使用するが、｢受験対策｣が目的の講義ではないことに注意をすること。（2）アルゴリズムの解説とそれをもとにした作品制作のための演習を行うため、プログラミングの講義演習を受講していることが望ましい．（3）本講義ではblender、TouchDesigner、Houdiniを適宜用いる。（4）本講義は、自ら学ぶ姿勢がある学生には受講しやすい。",
        "preparatoryStudy": "予習と復習は必ず行うこと。CGやゲームに関する講義，演習等を受講していることが望ましいが，それに限るものではない．CGに関して初めて学習するという場合でも問題はない．",
        "gradingGuidelines": "課題レポート提出を70点、講義中の演習を30点として、60点以上を単位認定要件とする。課題に関しては，締め切り後の授業で講評を行う．",
        "textbook": "●コロナ社：メディア学大系11『CGによるシミュレーションと可視化』CGによるシミュレーションに必要なアルゴリズムの解説，および可視化手法が紹介された書籍である。",
        "referenceMaterials": "●CG-ARTS『入門CGデザイン』この教科書はCGクリエイター検定ベーシックの出題範囲である。●CG-ARTS協会『ディジタル映像表現』本書籍は、CGによって映像を作り出す技術だけでなく、表現技術の解説が充実している。",
        "courseSchedule": "第1回：ガイダンス、およびコンピュータグラフィックスの基礎（コンピュータビジョン，コンピュータグラフィックス）第2回：processingを利用した2DCG入門（processing，プログラミング，2DCG）第3回：2次元コンピュータグラフィックス（ピクセル，解像度，ラスタ画像，ベクタ画像）第4回：processingを利用した2DCG制作（図形の配置，アフィン変換）第5回：表現の基礎①：形と色、タイポグラフィ、レイアウト（図と地，奥行き知覚，デッサン）第6回：TouchDesignerを利用した2DCG制作①－インタラクション（イベント駆動型，インタラクティブアート）第7回：TouchDesignerを利用した2DCG制作②－アニメーション（リアルタイムアニメーション，フレームレート）第8回：表現の基礎②：3次元コンピュータグラフィックス入門（座標系，ポリゴン，拡散反射光，鏡面反射光，3灯照明）第9回：3次元CGの制作工程（3次元形状モデリング、マテリアル、マッピング、質感表現）第10回：Blenderを利用した3DCG制作①－モデリング（サーフェスモデル，ソリッドモデル）第11回：Blenderを利用した3DCG制作②－アニメーション（キーフレームアニメーション，アニメーションカーブ）第12回：Houdiniを利用した3DCG制作①－剛体シミュレーション（衝突判定，破壊シミュレーション）第13回：Houdiniを利用した3DCG制作②－流体シミュレーション（粒子ベース，グリッドベース）第14回：最終課題制作とまとめ",
        "courseDataUpdatedAt": "2024/01/28"
    },
    "updateAt": "2024/08/07"
}