{
    "lectureCode": "M200001",
    "courseName": "メディア特別講義I",
    "lecturer": [
        "三上浩司(メディア学部メディア学科)",
        "藤崎実(メディア学部メディア学科)",
        "兼松祥央(メディア学部メディア学科)",
        "戀津魁(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "ゲーム業界・広告業界を始めとするメディア業界全般から、それぞれの分野の第一線で活躍し実務経験の豊富なゲスト講師を招いて講義を行う実践的科目である。ここでいう「第一線」とは、直接的な作品制作を行う現場だけを指すわけではない。作品制作を支える技術の開発やITシステムの提供、作品を世に出すためのプロモーションや組織経営にいたるまで、さまざまな役割が含まれる。実際の仕事の現場では何が行われているのか、最新技術はどうなっているのか、技術や業界がこれまでどう変わりこれからどうなるのか、環境が変わっても活躍し続けるには学生のうちに何を学び経験しどんな能力を身につけておくべきか、各講師が率直に語る。",
        "outcomesMeasuredBy": "メディア技術を駆使する最先端の企業で何が行われているのかを理解し、メディア学部での他の講義や演習での学びがどう結びついているかを見い出すことを目標とする。また、疑問点を整理して端的に示す質問力を養うことを目標とする。さらに、実社会で活躍する人たちの言葉を自らに照らし合わせることによって、自身の進むべき進路について考えを深めることを目標とする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力",
        "teachingMethod": "【授業形態：講義】企業からの講師を迎え、各企業が1回～4回の講義を行う。60分程度の講義のあと、質疑応答とミニレポートの作成を行う。質疑応答では、受講生からのその場での発言に加えてMoodleでの質問も受け付ける。",
        "notices": "原則としてノートPCを使用する。",
        "preparatoryStudy": "予習として、講師の所属企業の会社概要や業務内容について事前にWebで調べておくこと。（100分程度）復習として、授業で出た課題を提出すること（120分程度）",
        "gradingGuidelines": "各回のミニレポート課題の内容を60%、質問の頻度と貢献度を40%の割合で評価する。100点満点で60点以上を単位認定の合格基準とする。授業中に提出された質問については、実際にゲスト講師に回答してもらう質問をその場で選抜し高評価を与えるという形でフィードバックを行う。",
        "textbook": "なし",
        "referenceMaterials": "必要に応じて授業中に参考書を提示します。",
        "courseSchedule": "第1回：ガイダンス・概要説明（担当：兼松）第2回：アーティストのためのカメラの仕組み講座（ゲスト講師：バンダイナムコスタジオ鈴木雅幸先生、溝口優子先生、小林裕先生担当：三上）第3回：LookDevについて（ゲスト講師：バンダイナムコスタジオ鈴木雅幸先生、溝口優子先生、小林裕先生担当：三上）第4回：できないことを楽しくできるようにするしくみ（ゲスト講師：中村俊介先生担当：三上）第5回：「判断」と「決断」（ゲスト講師：88株式会社CEO川上明先生担当：藤崎）第6回：CreativityasaPowerforProblemSolving課題解決のためのアイデアとストーリー（ゲスト講師：I&SBBDO執行役員クリエイティブ担当松井亘平先生担当：藤崎）第7回：特別企画「票」が変えた日本の政治（ゲスト講師：経世論研究所三橋貴明先生担当：柿本）第8回：ゲーム開発とR&D~共同研究事例紹介~（ゲスト講師：スクウェアエニックス担当：三上）第9回：ファンと一緒に行うマーケティング（ゲスト講師：AMN営業部リーダー吉永竜馬先生担当：藤崎）第10回：デジタルゲームの人工知能（ゲスト講師：スクウェアエニックス担当：三上）第11回：リアルタイムCGのテクノロジー(1)3D映像に命を吹き込むレンズエフェクト（ゲスト講師：シリコンスタジオ川瀬正樹先生担当：兼松）第12回：リアルタイムCGのテクノロジー(2)リアルな質感表現を生む物理ベースレンダリング(技術編)（ゲスト講師：シリコンスタジオ京田文人先生担当：兼松）第13回：映像制作会社のこれから（ゲスト講師：AOI加藤久哉先生担当：藤崎）第14回：リアルタイムCGのテクノロジー(3)リアルな質感表現を生む物理ベースレンダリング(アート編)（ゲスト講師：シリコンスタジオ：武藤洋介先生担当：兼松）",
        "courseDataUpdatedAt": "2024/11/08"
    },
    "updateAt": "2024/12/13"
}