{
    "lectureCode": "M2011C7",
    "courseName": "メディア専門演習I[ゲームプロデューシング]",
    "lecturer": [
        "三上浩司(メディア学部メディア学科)",
        "安原広和(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "ゲームはアニメとならぶ日本発の国際的なコンテンツとして、人材に対する社会的ニーズが高まっています。ゲームのプロデュースでは、開発だけでなく、市場へのアピールも重要な要素です。ゲームに限らずコンテンツ業界で「モノ」をプロデュースするときに、人を説得し、企画を実現し、市場に送り出す能力はとても重要です。本演習では、コンテンツプロデュースの疑似体験を通じ、ゲームの魅力を客観的に、他者に企画として説明する能力を養います。さらに、企画から実際のゲーム素材を作成し始めるまでにはシナリオ・素材表・スケジュール表・デザインなど様々な文書や図・表が必要となります。これら、コンテンツが完成するまでに作成しなくてはならない多種多様な要素を、企画からゲームを完成させる工程を通して学びます。制作するゲームはチームの力量で実現可能な範囲で自由です．ゲームは30分程度の内容で厳格な管理のもと開発し、明確な「おもしろさ」をユーザーに提示します。また、ゲームの操作説明等マーケティングに関する要素の調査や制作の他、企画のプレゼンテーションを多く行い、総合的なゲーム・プロデューシング技法を習得することを目標とします。",
        "outcomesMeasuredBy": "ゲーム制作を通じて、ゲーム開発能力、スケジュール作成能力、スケジュールどおりに進行する能力、物事を論理的に説明する能力を身につける＜本授業が到達目標とする重点ラーニングアウトカム＞・論理的な思考力・問題解決力",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本演習では6名程度でグループを構成し、各自がプロデュース、グラフィック、サウンド、プログラムなど何らかの役割を担います。ゲーム制作には統合力が重要であり、各自は個別の役割を担いつつ全体を見通す視点を持つ必要があります。授業内では、ゲーム企画及び制作技術に関するプレゼンテーションを行い、モノの特徴を分かりやすく伝えるプレゼンテーション能力を養います。ゲームの品質は難易度などゲームバランスに依存するため、α版，β版と段階的に公開・評価し、内容の検討と修正を行い、最終版を目指します。最終版は他の講義科目の授業履修者に対しプレゼンテーションを行い、多くのユーザーから評価求めます。※ノートPC必携",
        "notices": "グループによる制作を行うため履修時間以外にもグループで集まる時間が多く必要となります．また，欠席や役割の未実行などは本人だけでなくグループメンバーに迷惑がかかるので注意すること．その他，演習に際しては自分の主観や主張だけでなく客観的な視点で物事を考えたり，他人の意見を聞いて理解することが重要です．",
        "preparatoryStudy": "授業の各回の冒頭では，開発しているゲームに関する発表があります．そのための準備をチームメンバーとともに準備してください（予習120分程度）各回の講義内容に沿って，自分たちのゲームに当該部分を実装してください（復習120分程度）",
        "gradingGuidelines": "グループにより制作した作品（40％）および個人レポート（60％）により採点します．グループでは中間と最終の2回程度の作品の相互評価による採点，個人レポートは中間と最終の2回程度の課題を元に採点します．（グループ作品の評価は最高評価の作品を基準とした相対評価により採点します．グループの作品評価が最低であっても個人の評価がS評価となることもあります）毎回の発表やα版，β版，最終版などの発表に対して常に教員からのフィードバックがあります．",
        "textbook": "特に使用しない",
        "referenceMaterials": "メディア学体系CGとゲームの技術（コロナ社）随時、紹介します。",
        "courseSchedule": "第1回:オリエンテーション・グループ分け・ゲームアイデアのプレゼンテーション(全教員)第2回:プレゼン（企画），アイデアの精査，ゲームルール策定(全教員)第3回:プレゼン（企画詳細）、制作計画の作成、シナリオ作成，画像処理の基本技能習得(全教員)第4回:プレゼン（企画＋シナリオ），シナリオの精査(全教員)第5回:プレゼン（企画＋デザイン），PRポスター分析、レイアウト基本技能の習得(全教員)第6回:プレゼン（企画＋PR），画像ファイルの受け渡し，素材の受発注(全教員)第7回:進捗報告，色彩設計，素材の受発注(全教員)第8回:進捗報告，Web制作，3DCGの基礎，素材の受発注(全教員)第9回:プレゼン（企画＋プロトタイプ），エフェクト制作(全教員)第10回:α版プレゼンテーション・相互評価(全教員)第11回:進捗報告，レベルデザイン(全教員)第12回:β版プレゼンテーション・相互評価(全教員)第13回:プレゼン（企画＋ゲーム），レベルデザイン調整(全教員)第14回:最終発表・まとめ（企画＋ゲーム）(全教員)",
        "courseDataUpdatedAt": "2024/05/24"
    },
    "updateAt": "2024/12/13"
}