{
    "lectureCode": "M201901",
    "courseName": "イメージメディア処理論",
    "lecturer": [
        "竹島由里子(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ５０３"
    ],
    "courceDetails": {
        "courseOverview": "ディジタル画像処理は、もともと画像を見やすくするための補正技術であった。その後、パターン認識のような画像解析技術が研究され、適用分野が拡がった。近年では、映像制作やCG（コンピュータグラフィックス）処理のためのさまざまな要素技術が開発されている。コンテンツ創作に関わる仕事をする者にとって、画像処理の知識は重要な素養である。本科目では、ディジタル画像処理の基本となる各種技術に関して学ぶ。網羅的な内容であるが、コンテンツ創作に関連する項目にやや重点をおく。本科目の内容は最新技術ではないものがほとんどである。流行に左右されず長い間役に立つ技術知識を習得できる。",
        "outcomesMeasuredBy": "授業計画に示した各授業のキーワードに関してその目的・原理・アルゴリズムを理解し、結果として、その技術によって処理された画像がどのようになるか判定できるようになることを到達目標とする。",
        "learningOutcomes": "論理的な思考力問題解決力",
        "teachingMethod": "【授業形態：講義】ノートPC必携スライドによる講義のほか、フリーソフト（GIMP）やサンプルプログラムを用いて各自が処理を実行してみることを授業中に行う。これにより画像処理技術の正確な理解を促す。また、授業中に小テストを行い、理解度を確認する。また、何回かに分けて、レポート課題を出す。技術解説のほか、コンテンツ制作への画像処理応用研究の話題を盛り込む。CGに関する最大の学会であるSIGGRAPHにおける最新研究事例や、イメージメディア卒業研究の事例を紹介する。",
        "notices": "本科目を修得することによって、授業範囲に関してはCG-ARTS協会の画像処理エンジニア検定ベーシック相当の力がつく。ただし、実際の検定受験にあたっては授業範囲外の分野の自己学習が必要である。",
        "preparatoryStudy": "フリーソフトのGIMPを事前にインストールしておく必要がある。また、授業で配布するサンプルプログラムのためにprocessing言語を事前にインストールしておく必要がある。プログラミング経験はあった方がよいが必須ではない。授業前に、その回の授業内容を把握しておくこと（120分程度）。授業後に、キーワードの理解、小テストの復習、レポート課題（任意回に実施）を実施すること（120分程度）。",
        "gradingGuidelines": "授業時間内の小テスト、レポート課題、期末試験を2:2:6の比率で総合成績に反映する。なお、小テストについては、翌週の講義内でフィードバックを行う。",
        "textbook": "なし",
        "referenceMaterials": "「視聴覚メディア」、コロナ社、「ディジタル画像処理」、CG-ARTS協会",
        "courseSchedule": "第1回:ガイダンス、ディジタル画像処理の概要と応用分野第2回:階調変換、空間フィルタ（標本化、量子化、濃淡変換、空間フィルタ）第3回:周波数領域におけるフィルタリング（2次元フーリエ変換、ハイパスフィルタ、ローパスフィルタ）第4回:画像の幾何学的変換（2次元アフィン変換、同次座標、再標本化、バイリニア補間）第5回:カラー画像処理（表色系、等色関数、xy色度図）第6回:2値画像処理と領域分割（しきい値、連結性、ラべリング、ベクトル化）第7回:前半のまとめと復習第8回:画像の編集と合成（アルファブレンディング、イメージモザイキング、モーフィング）第9回:画像特徴量と内容検索（ヒストグラム、周波数特徴量、ハフ変換、SIFT特徴量、画像検索システム）第10回:パターンの検出と認識（テンプレートマッチング、パターン認識）第11回:動画像処理（差分法、オプティカルフロー、時空間画像）第12回:画像符号化と圧縮（各種符号化、離散コサイン変換、動き補償予測）第13回:論文紹介第14回:まとめ",
        "courseDataUpdatedAt": "2024/01/29"
    },
    "updateAt": "2024/12/13"
}