{
    "lectureCode": "M201401",
    "courseName": "音楽創作論[2023年以前入学者]",
    "lecturer": [
        "伊藤謙一郎(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "「音」が一定のまとまりをもって時間軸上にデザインされたとき、そこにはある種のイメージが形づくられ、私たちは「音楽」として認識します。これはジャンルを問わず多くの音楽に言えることであり、それらの楽曲を分析することは作曲者の創意を汲み取ることにほかなりません。このようなことから、J-POPなどのポピュラー音楽を中心に、メロディに重点を置いた分析を通して、楽曲の裏に隠された音楽表現における「仕掛け」を明らかにしていきます。",
        "outcomesMeasuredBy": "楽曲構成に関する基礎的な知識の習得とともに、さまざまな音楽表現のあり方について理解を深めることを目指します。",
        "learningOutcomes": "論理的な思考力分析・評価能力",
        "teachingMethod": "大ホールでの講義形式です。パワーポイントのスライドを示しながら授業を行い、各回の授業後にスライドを配布します。授業内容を理解し易くするために、音楽や映像作品の鑑賞も行います。ノートPCは出席登録、授業内課題の実施、前回授業のスライドを閲覧する際に使用します。",
        "notices": "1年次開講科目の「音楽入門I」「音楽入門II」を履修済みであることが望ましいです。楽典の内容（特に「音名」「音程」「和音」）が理解されている前提で授業を進めますので、「音楽入門I」「音楽入門II」を履修していない方や楽典の知識が不十分と感じている方は、事前に楽典の本に目を通しておくことを強く勧めます。授業を受けてわからないことがある場合は、授業終了後や担当教員のオフィスアワーの時間を利用して、積極的に質問してください。（※授業中の質問はSAが対応します）【禁止事項】(1)ノートPCやスマートフォンでのSNSの使用や、ゲームプレイ、動画閲覧など、授業と無関係な行為はしないでください。ただし、出席登録、授業内課題の実施、前回授業のスライド閲覧時のみノートPCの使用を認めます。（※スマートフォンはカバンなどにしまって、授業中は触れないこと）(2)私語は慎んでください。(3)授業中に無断で退室・離席しないでください。（※体調不良などで一時的に離席したい場合はSAに申し出ること）(4)配布資料、およびスクリーンに投影された授業関連資料の写真撮影・動画撮影はしないでください。上記(1)〜(4)の禁止行為を発見した場合、巡回しているSAが注意しますが、再三にわたる注意に従わない場合は、担当教員の指示によって退室してもらいます。",
        "preparatoryStudy": "授業の性質上、楽譜の使用は不可欠です。授業を進めるにあたって、楽譜が皆さんとのコミュニケーションのツールとなります。そのため、音の高さや長さが理解できる程度の読譜（音符や楽譜を読むこと）の能力が必要となります。授業での説明は音楽用語を使って行われるため、それらの知識の習得はもちろんのこと、日頃から音楽を分析的に聴くことを心がけてください。各回の授業内容に対応する教科書の項目の予習【120分程度】、授業後の復習（教科書・授業スライドの確認）および関連楽曲の鑑賞【120分程度】など、授業外での取り組みが肝要です。",
        "gradingGuidelines": "理解度チェック【40％】、授業内課題【60％】で評価し、60点以上を単位認定要件とします。期末試験は実施しません。理解度チェックは、実施後に答え合わせと解説を行います。授業内課題についても、課題内容によっては履修生へのフィードバックを行うことがあります。",
        "textbook": "大山昌彦、吉岡英樹、伊藤謙一郎著「ミュージックメディア」（コロナ社）",
        "referenceMaterials": "・石桁真礼生著「楽式論」（音楽之友社）・浦田健次郎著「新総合音楽講座4楽式」（ヤマハミュージックメディア）",
        "courseSchedule": "第1回：授業概要説明／楽曲分析について第2回：音と音楽の諸形態（音の三要素・音楽の三要素）／音の進行とその展開の原理（反復と変化・音楽におけるコントラスト）第3回：楽曲構成（部分動機・動機・小楽節・大楽節・基礎形式）第4回：動機の構成（部分動機の展開・反復型動機・変化型動機）第5回：小楽節の構成（動機の展開・反復型小楽節・変化型小楽節）第6回：メロディと拍節（強起・弱起）第7回：理解度チェック(1)と解説／第1〜7回のまとめ第8回：楽節とその諸形態（楽節内でのフレーズの展開・楽節間でのコントラスト）第9回：大楽節の構成（小楽節の展開・反復型大楽節・変化型大楽節）第10回：メロディとハーモニーの関係（和声音と非和声音・非和声音の種類・非和声音を含むメロディの創作）第11回：楽曲分析(1)（動機・メロディの構成）第12回：楽曲分析(2)（楽曲構成・楽節の反復の諸相）第13回：楽曲分析(3)（定型的構成からの逸脱・⾳組織の選択）第14回：理解度チェック(2)と解説／第8〜14回のまとめ",
        "courseDataUpdatedAt": "2025/01/31"
    },
    "updateAt": "2025/03/21"
}