{
    "lectureCode": "M2011T5",
    "courseName": "メディア専門演習I[コミュニケーション・アナリシス技法]",
    "lecturer": [
        "榎本美香(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "コミュニケーションには様々な場面がある。対面で行う会話だけでなく、コンビニやスーパーでの買い物やレストランにおける注文、ボードやネットワークを介した他者とのゲームなど、人と人が何か言葉や視線や振る舞いをやり取りする時、そこにコミュニケーションが生まれる。本演習では、こういった様々な場面における人間どうしのコミュニケーションを分析する手法を学ぶ。人は会話をするとき、言葉だけでなく、視線・姿勢・身振り・表情などさまざまな非言語情報を駆使してコミュニケーションを行なっている。それらの情報はそれぞれどのように相互にリンクして用いられているのか。(1)実際の会話を収録し、(2)その中で人々が用いている様々なコミュニケーションのための言葉や非言語行動をデータベース化し、(3)それらの情報の相互関連性を分析する方法を学ぶ。",
        "outcomesMeasuredBy": "•日常的に人々が行なっているコミュニケーションを分析する科学的手法を学習する•言語、視線、姿勢、身振り、表情などがそれぞれどのような情報を発しているかを分析する力を養う[ラーニングアウトカム重点項目：実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力、問題解決力]",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "4,5人のグループごとにあるコミュニケーション場面を収録し、そこに表れている言葉や視線・身振りの詳細をアノテーションソフトELANを用いて書き起こす。書き起こしたデータはMicrosoftAccessを用いデータベース化し、Accessを使って、視線や姿勢の変化・身振りは発話のどの部分で生じるのか、それにはどういった意味があるのかなど各自で分析項目を決め、各行動の発生順序や時間差などを分析する。毎回、演習開始時にその日習得すべき技術を解説し、それに沿って各グループで演習を行う。",
        "notices": "演習は実際に出席して毎回の課題を完成させることに意味があるので、毎回出席すること。またデータのアノテーションは非常に細かい作業が続くことになるので根気のある人材に限る。",
        "preparatoryStudy": "1年次基礎専門科目「言語コミュニケーション分析入門」を受講していることが望ましい。受講していない場合は、授業資料を見て予習しておくこと。また、毎回授業の中で課題を出すので、復習しながらそれを解くこと。",
        "gradingGuidelines": "出席状況と製作物を含むレポートの質、提出状況、最終分析に盛り込まれた機能、努力の程度、発表会でのアピールにより評価する。•レポート:35点毎回小レポートを提出してもらう•出席:45点授業開始時に出席をとる•分析結果の発表:20点最終階の発表の内容に応じて(計100点満点で60点以上を単位認定要件とする)",
        "textbook": "榎本美香・相川清明・飯田仁著メディア学大系「４巻マルチモーダルインタラクション」、コロナ社。",
        "referenceMaterials": "坊農真弓・高梨克也編(2009)「多人数インタラクションの分析手法」オーム社",
        "courseSchedule": "第1回:授業概要とコミュニケーション・アナリシス技法を用いた分析の紹介第2回:データの収集計画:どのような場面をどのような設定で収録するかを計画する第3回:データの収集:ビデオカメラを用いてコミュニケーション場面を収録する第4回:データの読み込み・編集:映像編集ツールAviutlを用いてデータをPCに取り込み、音声情報を手がかりに複数カメラの同期映像を作成する第5回:分析計画：グループ別に収録したデータの分析計画を立てる第6回:言語情報の解析：言語的単位に基づく発話の書き起こしを行う第7回:非言語情報の解析：視線・ジェスチャ・身体の向きなどの非言語情報の分節化と書き起こしを行う第8回:アノテーション作業:言語・非言語情報の書き起こしを行う第9回:アノテーションの統合:各自が書き起こしたデータをElanを用いて統合する第10回:データベース作成：MicrosoftAccessを用いてElanデータをデータベース化する第11回:データベース操作：MicrosoftAccessの基本操作を学ぶ第12回:分析・考察(1):複数の発話やジェスチャー間の生起関係を調べる第13回:分析・考察(2):複数の発話やジェスチャー間の因果関係を調べる第14回:分析結果の発表会",
        "courseDataUpdatedAt": "2024/05/29"
    },
    "updateAt": "2024/08/07"
}