{
    "lectureCode": "M201001",
    "courseName": "CG・ゲームのための数学",
    "lecturer": [
        "渡辺大地(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ４０２"
    ],
    "courceDetails": {
        "courseOverview": "近年のCGやゲームの技術は、高度な数学的処理が多く用いられている。制作現場ではプログラマは言うに及ばず、コンテンツ構成を考案するゲームデザイナーや、モデリングやアニメーション制作を担当するグラフィッカーにおいても数理的素養が求められている。本講義では、CGやゲームを制作するに当たって必要となる数学や物理の理論を体系的に学習していく。本科目の内容はCG制作、特にプログラミングを行う上で重要となる物体の運動についての理論を理解することを目標とする。内容は主に2部分に分かれている。まず前半はベクトルや行列の演算を用いた幾何や座標系に関する事項を学習する。後半は、まず序盤の内容を踏まえた上での運動記述に関する理論を学ぶ。これは微積分学の基礎的学習を含む。それに力学要素を加え、さらに物体の運動に関する実践的な理論を学ぶ。",
        "outcomesMeasuredBy": "CGやゲームのプログラミングで必要となる数学事項、特にベクトル演算と一次変換を中心とする線形代数と、力学についての基礎事項の習得を目標とする。",
        "learningOutcomes": "論理的な思考力問題解決力",
        "teachingMethod": "授業前半にて講義を行い、その内容に従って後半は演習を行う。演習は主に筆記によるものである。また、プログラミングによる演習も行う予定であるので、指示があった回についてはノートPCの持参も必要となる。",
        "notices": "特になし。",
        "preparatoryStudy": "高校数学全般、特にベクトルおよび高校物理の力学は本科目において重要な素養となるので、事前に学習を進めておくことを推奨する。1年次後期科目「メディアのための数学」の内容をある程度踏まえるため履修済であることが望ましいが、必須とはしない。本科目は、各単元ごとに内容を理解していないと、先の単元の内容の理解が困難あるいは不可能な場合が多い。毎回課す演習課題は必ず次回受講までに取り組むこと。また、わからなかった問題については必ず解答を参照し、解法を理解しておくこと。毎回あたり3時間程度を目安とする。毎回の授業ごとに、「事前学習」の項目を提示する。具体的には、事前に行う設定や入力について解説するので、毎回の授業の前に参照し、実施しておくこと。毎回1時間程度を目安とする。",
        "gradingGuidelines": "成績は演習提出物と最終試験によって判定する。まず最終試験にて基準点を満たすことを単位認定条件とする。単位認定者に対し、提出物30%、最終試験70%とした合計点を算出し、成績を算出する。最終試験を受験しなかった者は無条件にX評価とする。各課題の正解例は、課題締切後に公開する。また、最終試験の結果を知りたい学生については、問いあわせのあった学生のみに告知する。",
        "textbook": "教科書は使用しない。必要な資料は授業内で配布する。配布資料は授業用Webページ内での公開も行う。",
        "referenceMaterials": "より高度な学習を望む学生向けに、「実例で学ぶゲーム3D数学」(オライリージャパン)や「ゲームプログラミングのための3Dグラフィックス数学」(ボーンデジタル)などがある。その他も適宜紹介する。",
        "courseSchedule": "第1回:ベクトルの定義と基本演算(座標、ベクトル、内積、外積)第2回:ベクトル方程式による図形表現(座標系、ベクトル方程式)第3回:行列と連立方程式(行列、連立方程式、交換法則)第4回:線形独立性を利用した領域表現(ベクトル不等式、線形独立、線形従属)第5回:線形変換の基礎(線形変換、同次座標)第6回:合成変換と行列積(合成変換、任意位置回転)第7回:3次元での線、平面とベクトルの射影(掌性、3次元、直線、平面、射影)第8回:直線と平面の交点、3次元での線形変換(逆行列、行列式、可換性)第9回:位置、速度、加速度と微分(位置、速度、加速度、微分、導関数)第10回:ベクトルと微積分による運動記述(等速度直線運動、放物運動、円運動)第11回:力と運動の関係(運動、運動量、運動方程式、質量、重量、力の合成、均衡)第12回:垂直抗力と摩擦力(垂直抗力、斜面、積分、摩擦力)第13回:反射の物理(反射、運動量保存)第14回:干渉判定と衝突判定(干渉判定、衝突判定、境界ボリューム、距離関数)",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/09\/13"
}