{
    "lectureCode": "M2011C5",
    "courseName": "メディア専門演習I[作曲演習]",
    "lecturer": [
        "伊藤謙一郎(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "composition（作曲）は「com-（共に）ponere（置く）」を語源とするもので、もともとは「配置する」「構成する」という意味です。つまり「作曲」とは、「時間上にさまざまな音楽的事象を配置し、それを作品としてまとまりをもった総体に構成する行為」と言えます。そこで本演習では、論理的思考に重点を置いた作品創作を行います。「論理的思考」というと難しく感じるかもしれませんが、「明確な創意（何をどのように作るのかという意識）をもつこと」と考えると理解しやすいでしょう。このような姿勢は、作曲に限らず全ての「ものづくり」に共通して求められるものです。作曲にあたっては、4音程度の指定音列をもとに自身でモティーフを作出し、それを展開（反復・変化）させたメロディを含む1分半〜3分の長さの楽曲を作ることを目標とします。最終回の授業では、作曲した作品の「音出し」を行い、互いの作品を講評し合います。また、「音出し」から２週間後に作品の「楽曲データ」と「楽譜」、作品に関する「レポート」を提出してもらいます。ですので、日頃からしっかり計画を立てて取り組まないと、かなりハードな演習となります。履修にあたって音楽経験の有無や、関連授業の既習・未習は問いませんが、単に「面白そう」「楽しそう」という安易な気持ちは望ましくありません。履修希望者には、確固たる強い意思をもって取り組む覚悟を求めます。",
        "outcomesMeasuredBy": "音楽における「モティーフ」について理解し、それを適切に展開して、一つのまとまりある楽曲に仕上げるスキルの習得を目指します。本科目のラーニングアウトカムズの重点項目は「実学に基づく専門能力」「コミュニケーション能力」「論理的な思考力」「分析・評価能力」「問題解決力」ですが、特に「実学に基づく専門能力」「論理的な思考力」を重視します。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "いかなるスタイルの音楽を作曲するにしても、アイデアを「音」によって具現化するスキルが必要です。そのスキル習得のために「楽曲構成法」「和声法」「コード進行法」「楽器法」などを学ぶことが推奨されますが、半期の授業でそれらを網羅するのは困難です。そこで、本演習では「モティーフの展開」にテーマを絞り、音楽上のさまざまなコントラストを意識した作曲を行うこととします。全1４回の授業の前半では、モティーフとその展開に関する講義を行い、そこで学んだことを踏まえて、30秒〜1分の長さの小品を作曲します。作曲と並行して、シーケンスソフトへのデータ入力とエディットの方法も学びます。後半は、最終回の作品発表会に向けた作曲が作業の中心となります。単にモティーフを展開するだけでなく、楽曲全体の中での統一性と多様性、コントラストを意識することが求められるので、そのような作曲に参考となる楽曲を紹介しながら丁寧に個人指導を行っていきます。作品発表会は作品の音出しのみで終わることなく、教員や他の学生から感想やアドヴァイスをもらうことができます。それを踏まえて最終的な作品に仕上げ、「楽曲データ」「楽譜」「レポート」の形にまとめることになります。本演習は演習室のPCを使用するのでノートPCは必携ではありませんが、着席したブースの機材トラブルに備えて持参することを推奨します。",
        "notices": "1年次開講科目「音楽入門」を履修済み、および２年次開講科目「音楽創作論」を履修中であることが望ましいです。これらの科目で扱う内容の「音名」「音程」「和音」「モティーフ」について理解していることを前提に授業を進めます。また、ソフト音源やシーケンスソフトの扱いに関する基本的な知識・スキルがあると大いに役立つことでしょう。本演習では、「和声法」や「コード進行法」などには原則触れません。それは、理論は創作を助けますが、創作そのものにはなり得ないからです。半期という非常に限られた時間においては、「音楽理論」よりも「創作の本質」の部分に焦点を当てた実践的な思考を深めることが有意義であると考えた上での方針です（※もちろん、個人的に質問や相談があれば随時対応します）。以上の点を理解した上で履修してください。",
        "preparatoryStudy": "単に授業を受けるだけでは作品は完成しません。また、授業内のみの作業では時間が足りません。空いている時間に機材の操作方法を復習したり、課題や創作に取り組むなど、授業時間外での自主的な活動【120分程度】が不可欠です。本演習での説明は音楽用語を使って行われるため、それらに関する予習・復習も必要です。「音楽入門」「音楽制作の基礎」を履修していない方は、特にその点を留意してください。",
        "gradingGuidelines": "授業内課題の実施・提出【30％】、中間作品の音出し【10％】、期末作品の音出し【30％】、期末作品（楽曲データ、楽譜、レポート）提出【30％】で評価し、60点以上を単位認定要件とします。また、授業内課題の一部は添削で、中間作品・期末作品では審査と講評で履修者に対してフィードバックを行います。",
        "textbook": "使用しません。楽譜やシーケンスソフトの操作方法に関する資料を適宜配布します。",
        "referenceMaterials": "・大山昌彦、吉岡英樹、伊藤謙一郎著「ミュージックメディア」（コロナ社）・石桁真礼生著「楽式論」（音楽之友社）・浦田健次郎著「新総合音楽講座4楽式」（ヤマハミュージックメディア）",
        "courseSchedule": "第1回：授業概要説明／使用機材・ソフトウェアに関する説明／シーケンスソフトへのデータ入力練習(1)第2回：モティーフの展開(1)／シーケンスソフトへのデータ入力練習(2)／記譜（楽譜を書くこと）の練習第3回：モティーフの展開(2)／シーケンスソフトへのデータ入力練習(3)第4回：モティーフの展開(3)／シーケンスソフトへのデータ入力練習(4)／モティーフの展開による作曲［中間作品］の個人指導(1)：作曲プラン作成第5回：モティーフの展開(4)／シーケンスソフトへのデータ入力練習(5)／モティーフの展開による作曲［中間作品］の個人指導(2)第6回：モティーフの展開(5)／シーケンス・データの各種エディット(1)／モティーフの展開による作曲［中間作品］の個人指導(3)第7回：モティーフの展開(6)／シーケンス・データの各種エディット(2)／モティーフの展開による作曲［中間作品］の個人指導(4)第8回：作品発表会［中間］と講評／オーディオミックスダウン第9回：楽曲構成法(1)／モティーフの展開による作曲［期末作品］の個人指導(1)：作曲プラン作成第10回：楽曲構成法(2)／モティーフの展開による作曲［期末作品］の個人指導(2)第11回：スコアリングと記譜法第12回：楽曲構成法(3)／モティーフの展開による作曲［期末作品］の個人指導(3)第13回：楽曲構成法(4)／モティーフの展開による作曲［期末作品］の個人指導(4)第14回：作品発表会［期末］と講評",
        "courseDataUpdatedAt": "2024\/05\/24"
    },
    "updateAt": "2024\/09\/13"
}