{
    "lectureCode": "M2011C3",
    "courseName": "メディア専門演習I[CGアニメーション]",
    "lecturer": [
        "川島基展(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火",
        "火2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本演習では、既存作品の分析や作品制作実習を通じて、アニメやゲームなどのエンターテインメントコンテンツにおけるキャラクタアニメーションの本質を理解し、良質なキャラクタアニメーションを効率的に制作するための知識と技能を習得することを目的とします。アニメーション制作全体ではなく、キャラクタの演技設定について集中的に学び、こだわりの作品を目指しますので、やる気さえあれば初心者でも良い作品を作ることができますし、将来プロを目指す方にとっても良い経験となります。",
        "outcomesMeasuredBy": "モーションキャプチャ技術の基礎を理解し、それを活かしたCGアニメーション制作ができるようになる．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "グループワークで１分間程度のオリジナルアニメーション作品を制作します。キャラクタアニメーションの設定には、次世代のキー技術であるモーションキャプチャを活用します。演習では、作品制作に必要なCGソフトウェアの扱い方だけでなく、本演習の最大の目的であるキャラクタアニメーションのこだわりのポイントや、それらを実践するためのレクチャーを行います。ノートPCの持参は必須ではありません。",
        "notices": "とくにありません。プロジェクト演習等での経験は問いませんので、アニメーション制作に興味があればどなたでも参加可能です。ただし、課外時間に授業の復習やグループワーク作業にしっかり時間を割けるよう、準備をしてください。",
        "preparatoryStudy": "事前に修得しておくべき科目は、とくにありません。ただし、「ディジタル映像表現論」などの講義や、プロジェクト演習の映像コンテンツ制作系の演習を履修していると、本講義の理解がさらに深まります。毎回の授業に際しては、次のような予習・復習を合わせて120分程度行うものとします。予習：グループワーク・制作課題の取り組みにつき、作業報告と今後の計画について報告するための準備を行う復習：授業の内容を十分に復習のうえ、ソフトウェアのオペレーションについては実際に反復練習を行い、技術の定着を図ること。",
        "gradingGuidelines": "次の項目により、成績を評価します。・企画書・プリプロダクションの完成度：10点・グループワーク作品の完成度：30点・プレゼンテーション・グループワークへの貢献度：30点・レポート課題：30点総合点60点以上かつ，期限までに、企画書・仕様書どおりに作品を提出することが、単位認定の最低要件になります。",
        "textbook": "本演習で独自に作成したテキストを使用します。",
        "referenceMaterials": "新旧問わず、あらゆる映像作品、ゲームコンテンツ等を参考にしてください。",
        "courseSchedule": "第1回:オリエンテーション、企画立案、チーム編成第2回:プリプロダクション第3回:モデリング実習第4回:モーションキャプチャによるアニメーション制作体験第5回:シェーディングテクニック第6回:アニメーション実習第7回:作品企画プレゼンテーション第8回:モーションキャプチャ撮影①（前半2チームぶんの撮影）、課題制作第9回:モーションキャプチャ撮影②（後半2チームぶんの撮影）、課題制作第10回シーン構築第11回:ポストプロダクション第12回:課題制作：モーションデザイン作業第13回:課題制作：ポストプロダクション作業第14回:作品発表会・講評",
        "courseDataUpdatedAt": "2024/05/21"
    },
    "updateAt": "2024/08/07"
}