{
    "lectureCode": "M2011S6",
    "courseName": "メディア専門演習I[ユーザ体験価値デザイン]",
    "lecturer": [
        "寺澤卓也(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金",
        "金2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "21世紀の情報社会では、「こと（知識）創り」を重視する教育への転換が求められています。知識の創出（こと創り）は、工業社会で重視されてきた「ものづくり」を否定するものではなく、より良い「ものづくり」をイノベートするための基盤となります。例えば、Appleの一連の商品やサービスに代表されるように、単なる機能性の競争を越えて、わくわくするような感動なども併せて提供する個々の利用者の経験価値（ユーザーエクスペリエンス）の優劣を競う時代になってきました。そして、新しいデザイナーつまりユーザーエクスペリエンスデザイナーが求められてきています。本演習は、経験価値が価値の源泉となる時代を先取りする形で、日本の大学としては初めて、ユーザーエクスペリエンスを体系的にデザインする考え方、方法論、ツールを具体的な実践課題を通じて身につけてもらうことを目的とした本格的なものです。演習の教材や題材は、実際の社会の活きた素材やツール（MESHタグとアプリなど）を活用していきます。また、デザインを進める中で、就業力にも直結するグループワーク（議論、アイデア創出、計画的遂行など）の技法も副次的に身につけてもらうことを意図しています。",
        "outcomesMeasuredBy": "ユーザーの感情体験を理解し、デザインし、そして検証するというスキルを身に着けます。MESHタグとアプリを用いたラピッドプロトタイピング、現場現物指向のフィールドワーク、そして（希望者のみ）対外発表を行います。これらのスキルを実践的に学び、利用者を魅了する経験価値のデザイン(デザイナー)を目指します。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "企業でデザイナーやクリエータが仕事を進める方法論・環境を取り入れた極めて実践的な演習スタイルを基本とし、演習の臨場感やリアリティを感じてもらい自然にスキルを身につけてもらうことを重視しています。さらに、題材は、実際に社会的に活きた題材を用意するとともに、現場やユーザー視点を起点とした身体性を重視したアプローチを積極的に導入予定です。演習の基本サイクルは、個人で学ぶ、考え、自分なりの問題意識や意見を持ち、次いでグループメンバーと議論を進め、学び合い、内容を深め、さらに、他のグループの成果発表からも学ぶことにより、同じ課題に関して、３つの学びを経験し、学習理解を深化させる方法を取り入れています。ノートPC必携です。",
        "notices": "専門演習は2コマの授業時間を使い行われますが、事前調査課題（予習120分程度）、成果物作成（復習および発展120分程度）などについて、グループメンバーと協力して2コマ以外の時間帯を確保して議論や作業を進める必要があります。この演習のアドバンスコースとして、更に専門性を発展させる学習機会を提供する意味で、プロジェクト演習（IoTプロトタイピング）を用意しています。意欲のある方はこちらも同時に履修することを強く薦めます。",
        "preparatoryStudy": "特に、前提となる学習は必要ありませんが、関連するトピックスについて好奇心旺盛に調べて予習としてください。演習の進行とともにこの分野での知識を深め、その後の探求的な学びの基礎を身につけることを期待します。そのため、課題発表会で指摘されたことは次回の課題の際に同様の指摘を受けないよう心がけること。また、ほかの人の発表や指摘されていることを理解し、自分に当てはめて自身の力の向上につなげること。",
        "gradingGuidelines": "成績評価は、演習の全出席及び指示されたすべての課題の提出がなされることを前提に（この条件が満たされない場合はX評価となります）、演習の個人活動及びグループ活動成果物（70点）、活動量・質（30点）の配分として、60点以上を単位認定とする。詳しくは授業冒頭で再度説明予定。課題については発表会で講評する。",
        "textbook": "特になし",
        "referenceMaterials": "演習は、以下の参考書を活用して進める。参考書は、演習生には貸与の予定。UXデザイン入門―ソフトウェア\u0026サービスのユーザーエクスペリエンスを実現するプロセスと手法：川西裕幸,潮田浩,栗山進(著)、日経BP社(2012\/01)その他、演習に有益な参考資料・書籍は、随時紹介予定。",
        "courseSchedule": "第1回：オリエンテーション／機能とUXの違い機能向上ではなくUX（体験価値）向上を目指すため、機能とUXの違いを理解することから始めます。第2回：MESHに触れてみよう／MESHで楽しい遊びを考えてみようMESHの基本を、タグを用いて学びます。遊びを考案し、UXを体験的に学びます。第3回：遊びの発表会／MESHで楽しい仕掛けを考えてみよう遊びの発表と相互評価をします。第4回：仕掛けの発表会／課題１仕掛けの発表と相互評価をします。第5回：発表会＋実演／レポート作成演習課題１の発表と相互評価をします。課題１の内容を実験レポートにまとめる方法を学び、まとめていきます。第6回：レポートチェック＆修正／ネットの力で楽しい仕掛けを考えてみよう実験レポートをチェックします。GmailタグとIFTTTタグを学び、ネットの力を活かした楽しい仕掛けを考案します。第7回：仕掛けの発表会／課題２仕掛けの発表と相互評価をします。第8回：プロトタイプを比較してみよう／PVを作成してみようwith比較視点考案したプロトタイプを比較視点に基づいて実証的に検討します。プロモーションビデオ(PV)の企画を練ります。第9回：PV撮影／PV編集PVの映像の撮影と編集をします。第10回：発表会＋実演／レポート作成演習PVとポスターと実演で発表と相互評価をします。第11回：レポートチェック＆修正／課題３／フィールドワーク企画実験レポートをチェックし、フィールドワークの企画をします。第12回：フィールドワーク報告／GPIOを使ってみよう／実験準備、PV作成フィールドワークの報告と相互評価をし、プロトタイプのUX向上を図ります。実験準備とPVの企画をします。第13回：実験／レポート作成演習、発表準備比較視点に基づいて実証的に検討します。PVの撮影と編集、ポスターと実験レポートを作成します。第14回：発表会＋実演／まとめ",
        "courseDataUpdatedAt": "2024\/05\/24"
    },
    "updateAt": "2024\/09\/13"
}