{
    "lectureCode": "M201301",
    "courseName": "ゲームデザイン論",
    "lecturer": [
        "安原広和(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "「ゲーム」とは何か？「あそび」とは何か？「たのしさ」や「おもしろさ」はヒトの心になぜ起きるのか？などの基本的な問いかけから始まる現在の「ビデオゲーム」の基礎的な概念を固めながら、自分たちで一つ一つ丁寧に、ゲームの「たのしさ」を起こすヒトの認知の仕組みを通じて、インタラクティブなメディアのためのコンテンツである「ビデオゲーム」を設計、デザインするプロセスを紐解いていく実践的科目です。日本、北米、欧州のゲーム開発スタジオ、大手パブリッシャーでの開発者、監督としての実務経験に基づき、ハードウェアの進化に伴って「ゲーム」が変遷してきた過程や、国内海外とのゲームの文化的相違、全世界に市場を持つ巨大なゲーム産業、という多角的な現場からの視点も踏まえ、様々なゲームやあそびを具体的に想定しつつ、それがなぜ「たのしい」のか？というメカニズムを明らかにしながら、人が「たのしい」と感じるインタラクティブなメディアデザインとはどうあるべきなのか？、「ゲーム」をデザインするにはどのような知見が必要なのかに触れ、自分たちで「あそび」をデザインをするための基礎的な知識を学びます。",
        "outcomesMeasuredBy": "「ビデオゲーム」を作るための基礎的な常識・知識、また産業としてのゲーム業界の構造を学び、最終的に初歩的なゲームデザインのフレームを理解し、実際の業務を想定ながらゲームを設計する基礎的な知見を会得すること。自分の作りたいゲーム、自分のゲームの嗜好を批判的思考（criticalthinking）やメタ視点で客観的に見る習慣を養い、コミュニケーションを通して、他者からの意見・フィードバックを取り入れ、アイデアを企画に落とし込む手法を学びます。自分のアイデアを明瞭かつ的確に人に伝える手段を模索し、講義を通して自ら考えながら実践し、その知見を身につけます。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "動画で多くのゲームや関連参考素材の具体例を見ながらその背景を解説していく、インタラクティブなクイズ形式の教材を用いるなど、単なる通読や座学ではない講義を行います。またその授業で話した内容についての課題の回答と提出、それに関する授業内での実戦的な課題への評価を行ないます、次回の講義で課題の回答、提出された課題の評価を行います。授業内で課題ページにアクセスするために「スマートフォン」によるQRコードの読み取りが必須となります。スマートフォンを各自用意してください。PCは使用しません。",
        "notices": "本講義は、2年次後期と3年次前期のメディア専門演習「ゲームプロデューシング」、ならびに4年次のゲームコンテンツ系卒業研究を履修する上での基本となる科目です。これらの科目を履修予定の場合は、本講義を履修してください。",
        "preparatoryStudy": "準備学習：予習：ゲームやメディアを通じて提供される受け身のためのエンタティメントが好きな一般の消費者・視聴者ではなく、製作者側になるための知識を習得する目的意識を持ちながら、幅広い分野のゲーム（ボード、カードゲームも含む）をプレイして分析すること。（120分）復習：講義で聴いた内容に当てはまる事例を探したり、好きなゲームを改めて「なぜ好きなのか」「なぜたのしく、おもしろいのか」を分析する視点で見直し、講義内容とともに検証してみる。（120分）",
        "gradingGuidelines": "授業ごとに出題する「課題」に対する回答を授業時間内に提出をすることで成績を評価します。また授業内で行うアンケートへの回答、毎回のクイズへの回答も同時に評価して加点します。課題提出が30％、内容の評価が70％、課題未提出の場合は無評価、という目安で評価を行います。課題への回答が本講義で採用された場合は、随時加点します。課題に対するフィードバックは、その次の授業で行います。100点満点中60点以上で単位認定とします。（60点に満たなければ単位取得できません。）",
        "textbook": "指定しない授業中に使用する教科書を特に買う必要はありません（「参考書」に書いた書籍から引用した授業を行います。）",
        "referenceMaterials": "「あそびと人間」(ロジェ・カイヨワ)「ファスト＆スロー」（ダニエル・カーネマン）「千の顔を持つ英雄」（ジョーゼフ・キャンベル）「ゲーマーズブレイン」（セリア・ホデント）「メディア学体系２「CGとゲームの技術」、「子どもとあそび―環境建築家の眼（仙田満、岩波新書)」、「誰のためのデザイン？」（D.A.ノーマン）、「シド・フィールドのシナリオ演習」（シド・フィールド）、「あそびのひみつ―指導と理論の新展開」（河崎道夫）など",
        "courseSchedule": "第1回：ガイダンス「ゲームやインタラクティブなエンタティメント」第2回：「マーケットとクリティカルシンキング」（ゲームの歴史、ハードウェアとマーケット）第3回：「宣伝とマーケット」の考察（ゲームマーケットのデモグラフィ、地域文化によるマーケットの嗜好）第4回：「比べるとおもしろい・比較の不思議」（文化比較、宣伝広告費、DAU,MAU）第5回：「ヒトに備わる脳のシステム」（知覚perception、同定identification、認識re-cognition）第6回：「直感と思考」（ゲームのエコシステム、ヒューリスティック）第7回：「動くモノ」（ヒトの習性、制限と緊張）第8回：「制限とご褒美」（成長曲線、緊張の解放）第9回：「学習」（報酬系、学習、ナラティブ）第10回：「貢献と役割」（FixedRatio、VariableRatio、内的報酬、外的報酬、シナリオの円環構造、3幕構成）第11回：「ごっこあそび」（コミュニティへの帰属、通過儀礼、オキシトシン、模倣と進化）第12回：「ルールの成立Ⅰ」（対立のフレーム、シミュレーション、ロールモデル）第13回：「ゲームの成立Ⅱ」（緊張と対立、個の利益、集団の利益、定量化、数量、時間、成否）第14回：「ゲームとあそびの要素」（カイヨワのあそびの要素、「おもしろい」の構造と学習）",
        "courseDataUpdatedAt": "2024/01/31"
    },
    "updateAt": "2024/08/07"
}