{
    "lectureCode": "M202501",
    "courseName": "データ処理と人工知能",
    "lecturer": [
        "藤澤公也(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ３０３"
    ],
    "courceDetails": {
        "courseOverview": "この講義では、前半では、様々なデータを処理するための手法について、基本的なアルゴリズムを中心に学んでいく。ここでは、データ構造から様々なデータに対してアルゴリズムを使うことで効率的なデータ処理の仕方を学んでいく。また、後半では前半で学んだことをもとに、人工知能の中でも特に機械学習の仕組みをアルゴリズムを通して学んでいく。まずは機械学習のいくつかのアルゴリズムの基礎を身に着ける。さらに深層学習などについても扱い、データの分類や、予測、データ生成について学ぶ。これらを通してメディアコンテンツなどのデータを人工知能を通して新しい活用をしていくことを学んでいく。",
        "outcomesMeasuredBy": "アルゴリズムによるデータ処理方法を身に着ける。また、データとアルゴリズムおよび人工知能への活用方法について学ぶ。",
        "learningOutcomes": "論理的な思考力分析・評価能力",
        "teachingMethod": "講義を基盤とした授業を行うが、処理を実装・確認するためにノートPCを利用することもある。",
        "notices": "各回の講義は連動しており、そこまでの内容を理解していることが前提となるため、必ず、それまでの授業内容の復習を行ってくること。講義中、必要に応じてノートPCの利用を指示することがあるが、指示のあったとき以外はノートPCを利用しないこと。ただし、出席はオンラインシステムによってとるため、ノートPCは毎回持参すること。",
        "preparatoryStudy": "基礎演習IIで扱った人工知能・機械学習の内容を復習しておくこと。また、アルゴリズムの実装として、Java,Pythonを用いるので、これらのプログラミング言語についての予習を行っておくとよい。予習：次回に扱う教科書の範囲を読んでおく（120分程度）復習：実際に扱ったアルゴリズムやプログラムについて動かしてみる。また、入出力やパラメータを変えた際にどうなるかを確認してみる。（120分程度）",
        "gradingGuidelines": "授業中に指示するミニ課題については次の回の冒頭でフィードバックを行う。このミニ課題およびレポートをすべてこなしたことを前提に、最終レポートを課す。このレポート課題に授業中のミニ課題の結果を加味したうえで60点以上の点数を取ることで単位が取得できる。",
        "textbook": "メディアのためのアルゴリズム-並べ替えから深層学習まで-（メディア学大系18）[コロナ社]",
        "referenceMaterials": "授業中に適宜提示する。",
        "courseSchedule": "第1回:データ処理と人工知能の関係（概要、進め方、評価）第2回:データの種類とデータ構造（データ型、配列と構造）第3回:データの効率的な並び替え（並べ替え＝ソート、オーダー）第4回:データの探索（線形探索、二分木探索）第5回:経路探索（ダイクストラ、A*）第6回:データの圧縮（可逆・不可逆、ランレングス符号化、ハフマン符号化）第7回:暗号化（共通鍵暗号、公開鍵暗号）第8回:人工知能の基礎（機械学習、教師付き学習、教師なし学習）第9回:機械学習の種類（分類問題、回帰問題）第10回:ニューラルネットワークの基礎（ニューロン、バックプロパゲーション）第11回:行列演算によるニューラルネットワーク表現／画像分類（NumPy、行列演算、画像処理）第12回:フレームワークを用いた機械学習（交差エントロピー、最適化、畳み込みNN）第13回:時系列データの学習・予測（RNN、LSTM）第14回:まとめ",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/08\/07"
}