{
    "lectureCode": "M202401",
    "courseName": "情報メディア法",
    "lecturer": [
        "村上康二郎(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金4"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "現代の情報メディア社会においては、コンピュータ、ネットワーク、スマートフォンなどのメディア技術の発達によって、かつては考えられなかったような新しい法律問題が次々と生じるようになっています。プライバシーや個人情報保護の問題、音楽や画像に関する著作権の保護の問題、コンピュータウィルス、不正アクセス、迷惑メールのようなサイバー犯罪の問題などです。この講義では、このような情報メディア社会における様々な法的問題について、基本的知識から最新の議論動向にいたるまでを講義します。",
        "outcomesMeasuredBy": "この講義は、まず、情報メディア法に関する基本的知識および専門的知識を習得することを目標とします。また、情報メディア社会における法的諸問題について、自分自身の頭で分析・評価し、問題解決策を考えることができるようになることも目標とします。",
        "learningOutcomes": "実学に基づく専門能力問題解決力",
        "teachingMethod": "原則として、対面授業で実施する予定です。また、授業ではノートPCを使用しますので、必ずノートPCを持参するようにして下さい。",
        "notices": "前提として、教養教育科目の「法と社会」を履修していることが望ましいですが、これは必ずしも必須ではありません。また、授業中の私語は厳禁です。私語が絶えない学生は減点をします。場合によっては、退去を命じることもあり得るので、注意して下さい。その他の注意事項については、初回の授業の際に説明しますので、履習を考えている人は必ず初回の授業に出席して下さい。",
        "preparatoryStudy": "予習・復習をしっかり行うようにして下さい。予習については、参考書の関連部分を事前に読んでおくようにして下さい（120分程度）。復習については、授業資料やノートを見直すようにして下さい（120分程度）。また、予習・復習以外にも、日ごろから、新聞などに目を通して、法律的な問題に関心を持つようにして下さい。",
        "gradingGuidelines": "最終レポートの点数（90%）および小レポートの点数（10%）によって評価します。単位認定の条件は、60%以上とします。なお、小レポートおよび最終レポートについては、授業中またはMoodle上でフィードバックを行う予定です。",
        "textbook": "指定しません。",
        "referenceMaterials": "小向太郎『情報法入門』（NTT出版）、村上康二郎『現代情報社会におけるプライバシー・個人情報の保護』（日本評論社）、『ポケット六法』（有斐閣）など。その他は、授業中に紹介します。",
        "courseSchedule": "第1回:ガイダンス：授業の概要第2回:法の基礎：法とは何か、法の分類（公法、私法）第3回:情報法：憲法、個人情報保護法（プライバシー権、個人情報保護法）、著作権法第4回:論点１：アクセスコントロール（著作権法）、裁判管轄と準拠法（法適用通則法）第5回:論点２：コピー（著作権法）、アクセスログ（プロ責法）第6回:論点３：ネット上の名誉毀損（プロ責法）、迷惑メール（特定電子メール法）第7回:論点４：ウィルス（刑法）、ネット利用の悪徳商法（無限連鎖講防止法）第8回:論点５：データの改ざん（刑法）、なりすまし（民法）第9回:論点６：電子署名（電子署名法）、不正アクセス（不正アクセス禁止法）第10回:倫理の基礎：法と倫理（法、倫理）、倫理システム第11回:情報倫理：情報倫理学（情報技術者の職能倫理、ユーザ倫理）第12回:発展問題１：IoT社会の法的課題（RFID、センサネット）第13回:発展問題２：最新動向（情報法、メディア法）第14回:まとめ：総復習",
        "courseDataUpdatedAt": "2024\/04\/22"
    },
    "updateAt": "2024\/09\/13"
}