{
    "lectureCode": "M202201",
    "courseName": "グローバルメディア論",
    "lecturer": [
        "飯沼瑞穂(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "水2",
        "金2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "グローバルメディアとは地球規模のコミュニケーションとそれを支えるテクノロジーです。本講義では、グローバルメディアの歴史を２０世紀初頭から現代に至るまで学びます。特にメディア技術の発達とグローバル規模のコミュニケーションの基盤構築が現在に影響を与えたかについて言及して行きます。更に、グローバルニュースの発表報道の仕組みやSNSなどを使ったニュース報道についても言及します。前半ではグローバルメディアの誕生を世界大戦前まで遡り考察し、現代社会のメディアのあり方を考えます。後半では、グローバル社会が21世紀に直面している課題の数々、特に、グローバル化の抱える問題、報道の自由、国際教育開発、食や環境などのトピックスを紹介しながら、未来に通じる社会と新しいメディアの位置づけについて学びます。本授業では、１）世界史と映像メディア２）地球規模の課題に関連した映像表現の位置づけについて学ぶことを狙いとしています。",
        "outcomesMeasuredBy": "本授業の目標は１）事実の表現をどのようにメディアが行っているかを、専門的な用語やメディア論の見方を実例の分析を通じて出来るようになること２）映像表現やグローバル課題の映像表現に関するアワェアネスを身につけることです。映像表現に関する実学に基づく専門知識と分析・評価能力が身に付きます。",
        "learningOutcomes": "国際的な教養分析・評価能力",
        "teachingMethod": "授業では毎回ノートPCを使い行います。その他、授業課題の提出や、講義中のQ＆Aなどにも活用しますので、必ず毎回持参して下さい。講義だけでなく、課題の提出と授業参加が重要です。全般を通してMoodleを活用した、アクティブラーニングを行います。後半ではグループワークを行います。",
        "notices": "毎回の積極的な授業の参加が非常に大切です。グループによるディスカッションのセッションなどが設けられます。＊シラバスの後半スケジュールは前後する可能性があります",
        "preparatoryStudy": "授業毎に、講義内容に沿った課題が出ます。前半7回では授業準備のために資料作成と課題の提出を行います。個人の進捗状況に応じて、予習、復習、各120分程必要です。後半7回では、グループワークのディスカションと資料作成に平均120分ほど必要です。",
        "gradingGuidelines": "小課題提出、中間理解度チェック、最終課題と理解度チェックの結果で評価します。グループワークを行います。最終課題は映像作品の分析評価を行います。小課題30％中間理解度チェック30％最終課題と理解度チェック40％とし100点満点中の60点で単位取得とします。課題のフィードバックを授業内で、内容の優れていた課題を公表します。",
        "textbook": "講義で使う資料は、その都度紹介します。",
        "referenceMaterials": "\"グローバル・ヴィレッジ21世紀の生とメディアの転換”マーシャル・マクルーハン、ブルース・R・パワーズ、\"メディア・コントロール正義なき民主主義と国際社会”ノーム・チョムスキー",
        "courseSchedule": "第1回:全体説明（グローバル化、Hotメディア、Coolメディア）第2回:グローバル・メディアの誕生(グローバルビレッジ、メディアの法則）第3回:映像メディアと世界のイメージ（ニュース映像、ドキュメンタリー、オートクローム、プロパガンダ）第4回:映像と記憶モンタージュ技法（古典主義、編集技法、クレショフ効果）第5回:ダイレクトシネマとテレビ（ダイレクトシネマ、ナラティブ、映像フレームワーク）第6回:メディア・コントロール（監視映像、遠隔映像転送、パノプティコン）第7回:ソーシャルメディア革命（SNS,ソーシャル・ネットワーク、民主主義）第8回:オールドメディアとフェークニュース（メディアのコングロマリット化、YouTube）第9回:中間理解度チエック（グローバルメディアトピックス、デクパージュ技法）第10回:言論の自由と報道（グローバルスタンダード、報道の自由度ランキング）第11回：ドキュメンタリー映像作品紹介（貧困、教育、国際開発）第12回:グローバル課題と映像（生物多様性、絶滅する言語と文化第13回:最終課題映像作品紹介（グループワーク、映像分析シート）第14回:最終理解度チェック（まとめ、グループワーク評価）",
        "courseDataUpdatedAt": "2025/01/31"
    },
    "updateAt": "2025/03/21"
}