{
    "lectureCode": "M300301",
    "courseName": "ソーシャルデザイン論",
    "lecturer": [
        "飯沼瑞穂(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "ソーシャル・デザインとは社会に役に立つデザイン、もしくは持続可能な社会の実現のための取り組み、ビジネスやアイデアのことを指します。ここでデザインとは、意味ある秩序を構築し実社会で具体化していくことを指しています。本授業では、近年注目されている、サステナブルデザイン、ソーシャル・ビジネスや社会起業家などに注目をし取り上げていきます。例えばソーシャル・アントレプレナー（社会起業家）とは、社会に山積するさまざまな課題を、ビジネスの手法で解決する起業家（アントレプレナー）です。経済格差や貧困、地方の衰退、過疎化、福祉サービスの不足など、現代社会には多くの課題があります。ソーシャルアントレプレナー（社会起業家）は、こうした課題の解決に、ユニークな発想で能動的に取り組んでいます。その他にも社会課題の解決を目標としてソーシャルビジネスの事例や、社会課題の解決に向けた国内外のデザインについて学びます。",
        "outcomesMeasuredBy": "本授業の目標は、自分が興味を持つ社会課題を発見し、課題解決に向けて事業を立ち上げるために必要なプラニングができるようになることです。問題発見解決の能力と実学による専門性が高まります。グループワークを行います。特に後半は、学生参加が中心のアクティブラーニングを重視した授業を行います。ラーニングアウトカム：問題解決力、実学に基づく専門能力",
        "learningOutcomes": "実学に基づく専門能力問題解決力",
        "teachingMethod": "授業では、ソーシャル・デザインとは何か、概要と具体例を学びます。また社会の課題解決に向けたソーシャルデザインについて学びます。授業内で、受講生自らが身近な社会課題を発見し、その課題を自分なりにどう解決してゆくか、プランを立てます。プランの作成にあたっては、グループ内でプランをシェアし、受講生同士が学びあう機会を積極的に設け、これを通じて、受講生自身の社会課題への関心を高めるとともに、相手の意見を聞きながら、自分の意見や考え方を整理し、表明するプロセスを体験します。「ノートPC必携」",
        "notices": "積極的な授業参加が必要な授業です。",
        "preparatoryStudy": "予習と復習時間は各週、各自の進捗状況に応じて、平均で１２０分程です。特に前半7回の回は予習に資料作成と復習に授業時間内に課した課題など、後半７回はグループでのディスカションと資料作成があります。",
        "gradingGuidelines": "中間課題30％最終報告発表40％小課題30％で評価し100点満点中60点で単位取得とします。最終報告発表ではポスターセッションとPV制作発表を行います。各課題は授業中に課し、授業内でよかった課題の公表を行います。アクティブラーニングとグループワークが後半、小課題を行う際に重要な評価対象になります。",
        "textbook": "特になし",
        "referenceMaterials": "CSR検定3級テキスト",
        "courseSchedule": "第1回:イントロダクション（サステナブル社会に向けたデザイン、社会課題の解決に向けて、ソーシャルスパイラルモデル）第2回:ソーシャルデザイン（社会起業家、ソーシャルアントレプレナーシップ、コミュニティデザイン）第3回：ソーシャルビジネス（社会的企業、ソーシャルファーム、ソーシャルエンタープライズ）第4回：企業の社会的責任（CSR,NPO/NGO,）第5回:アートとデザイン（建築、アート、サステナブルデザイン）第6回:ソーシャルデザインを使った課題解決（エシカル消費、フェアトレード）第7回:マイプロジクト私のPROJECT編（ウェルビーング、世界幸福度調査）第8回:マイプロジェクトGROUPPROJECT編（ダイバーシティ、インクルージョン、ワークライフバランス）第9回:グループプロジェクト(課題背景、国内調査、コミュニティー、行政、NGO）第10回:グループプロジェクト(課題解決、国外調査、事業計画、ミッションステートメント）第11回:グループプロジェクト(PV作成と資料作成）第12回:最終報告PV発表会第13回:グループプロジェクト（ポスター作成と資料作成）第14回:最終報告ポスター発表",
        "courseDataUpdatedAt": "2024/01/31"
    },
    "updateAt": "2024/08/07"
}