{
    "lectureCode": "M3001C2",
    "courseName": "メディア専門演習II[コンピュータビジュアリゼーション]",
    "lecturer": [
        "竹島由里子(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火",
        "火2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "ビジュアリゼーション（可視化）は，コンピュータグラフィックス（CG）の技術を用いて数値データを図形に変換することにより，視覚的な解析を可能にする技術である．大規模データや複雑な構造をもつ数値データそのものから，意味のある情報を取り出すことは困難であるが，可視化することにより，そこに隠された情報を直感的に見つけ出すことが可能となる．現在，様々な分野で広く可視化が利用されているが，どのように数値データを図形化するかによって，得られる情報量も変化してしまうため，適切な可視化技法の選択と可視化パラメタ値の設定が必要不可欠である．本演習では，汎用可視化ソフトウェアMicroAVSやTableauを用いて，実際のデータを可視化しながら，内部でどのような処理が行われているのか，どのようなことに気をつけなければならないのかなどについて学習する．",
        "outcomesMeasuredBy": "解析対象のデータの性質や特性などを考慮して，可視化目的に応じて，何を，どのようにグラフィカルな情報に変換すればよいかを考える力を習得する．また，可視化結果から，どのような可視化が行われているかについて考察ができ，画像が示している情報が何であるのかを把握できるようにすることを目指す．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "【授業形態：演習】可視化に関する基礎知識の講義と，ソフトウェアを使用した実習を行う．実習は，個人で行い，工学や医療など様々な分野のデータを利用して，各自で可視化結果を作成する．実習では，単純に画像を作成するだけでなく，適切な可視化のパラメタ値や色や不透明度を調整する方法についても紹介する．（ノートPC必携）",
        "notices": "科学技術データの可視化に使用する可視化ソフトウェア（MicroAVS）は，演習室のみで使用可能である．対象として，工学や医療に関するデータを扱うが，データに関する専門的な知識は必要としない．情報可視化に使用する可視化ソフトウェアTableauは，演習室での使用の他に，各自のPCにインストールすることも可能である．",
        "preparatoryStudy": "可視化の対象として，様々な分野のデータを扱うため，世の中にはどのようなデータが存在していて，どのような情報を持っているかなど，幅広い分野の情報に興味をもつようにする．また，授業前にその回に説明する内容の把握（20分程度），授業後に実施した操作の復習（40分程度）を行うこと．",
        "gradingGuidelines": "実習への取り組み70％，最終課題での発表30％の割合で評価する．実習や最終課題については，授業内で適宜フィードバックを行う．",
        "textbook": "なし",
        "referenceMaterials": "第1回：ガイダンス/科学技術データの可視化（MicroAVSの使い方）第2回：スカラ場の可視化第3回：ベクトル場の可視化第4回：アニメーション/時系列データの可視化第5回：実習（科学技術データの可視化）第6回：情報可視化（Tableauの使い方）/基礎的なグラフ第7回：データの整形第8回：タスクの抽象化と可視化表現第9回：対話的な操作第10回：ストーリーの作成/インフォグラフィックス第11回：実習（情報可視化）第12回：最終課題第13回：最終課題第14回：最終課題・作品発表会",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024/01/08"
    },
    "updateAt": "2024/08/07"
}