{
    "lectureCode": "M3001S1",
    "courseName": "メディア専門演習II[聴覚障害理解とコミュニケーション支援]",
    "lecturer": [
        "吉岡英樹(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火",
        "火2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "新生児の約1,000人に1人から2人が、聴覚に何らかの障害を持って生まれてきます。聞こえない、もしくは聞こえにくい子どもは、早期に発見して適切な支援を開始することでコミュニケーションの形成や言語発達の面で大きな効果があります。聴覚障害は先天性（生まれつき）の障害だけでなく、だんだん聞こえなくなる進行性や、突然聞こえなくなる後天性の障害もあります。世界保健機関（WHO）の発表によると、高齢者人口の増加などで、世界的に聴覚障害に苦しむ人が増えており、2050年には現在の約4億7千万人から約9億人に達する可能性があるとされています。日本ではこの10年間で、約500万人から550万人に増加したと推定されます。聴覚障害の原因は、遺伝によるもの、はしかや水ぼうそうなどの感染症、結核などの治療剤による副作用、加齢によるものなどが考えられます。さらに近年では、若者を中心にスマートフォンなどで大音量の音楽を長時間聞く習慣があることから聴覚障害になるケースも増えています。足に障害があり車椅子に乗っていたり、視覚障害があり白杖をついているのとは異なり、聴覚障害は見ただけでは分かりにくいという特徴があります。また、補聴器や人工内耳をして聞こえが改善したとしても、健聴者と同じように聞こえることはありません。平成28年4月1日より施行された「障害者差別解消法」により、障害者に不利益がないような社会環境の整備が求められています。東京オリンピックに向けて、東京都では多目的トイレの設置や点字ブロックの設置が進みました。しかし、聴覚障害者に対する必要な配慮がまだ周知されていないため、「聞こえのバリアフリー」はまだあまり進んでいないのが実情です。この演習では、まず聴覚障害に対する理解を深めるための調査や実習を行います。指文字、手話、読話などでコミュニケーションをとり、音声に頼らないコミュニケーション手段への理解を深めます。次に聴覚障害者を支援する最新のソリューションを調査します。音声をテキストに変換するアプリ、音を振動や光に変換して伝えるデバイスなどを使用します。最後に、自らがメディア学部で学んだ知識やスキルを活かして、聴覚障害支援ソリューションの提案をします。演習を通じて、聴覚障害への理解を深め、様々なテクノロジーやコンテンツによる支援の可能性を実感することを目標とします。",
        "outcomesMeasuredBy": "本演習の主な到達目標は実学に基づく専門能力と問題解決力を身につけることです。聴覚障害への理解を深める調査や実習を通じて、実学に基づく専門能力を身につけます。また、新しいテクノロジーを活用したソリューションを提案する過程において、聴覚障害支援における課題を見つけて改善するという問題解決力を身につけます。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・ノートパソコンを使い、情報収集や資料作成を行います。・グループでの手話実習、決められたテーマについてディスカッションするグループワークを行うことがあります。・課題はGoogleClassroomから提出を行います。・最後に自らが提案する内容を口頭発表します。",
        "notices": "・ノートPCを利用するため持参して下さい。・聴覚障害に限らずあらゆる障害を持っている学生は、初回授業に必要な配慮について相談をして下さい。",
        "preparatoryStudy": "授業において、聴覚障害に関する用語を使用することがあるため、事前にホームページで伝える用語リストや参考書を予習をしておくこと。予習：次回テーマについてインターネットで調査をお行う等の予習を行うこと。復習：毎回提供する授業資料(PDF)を見直して復習する。",
        "gradingGuidelines": "毎回の授業で与える課題（70%）、最終提出課題（15%）、最終発表（15%）を評価し、100点満点のうち60点以上を単位認定要件とします。なお、提出された課題に対するフィードバックは、次回の授業で行うものとする。",
        "textbook": "特になし。",
        "referenceMaterials": "必要に応じホームページや授業中に紹介する。",
        "courseSchedule": "第1回：サイレント・コミュニケーション体験第2回：指文字によるコミュニケーション体験第3回：手話によるコミュニケーション体験（基礎）第4回：手話によるコミュニケーション体験（応用）第5回：音の性質と聴覚障害の理解第6回：補聴器に関する調査と理解第7回：人工内耳に関する調査と理解第8回：聴覚障害者を取り巻く課題の調査と理解第9回：コミュニケーション支援方法の調査と理解第10回：音声認識技術によるリアルタイム字幕の体験第11回：聴覚障害支援の考察とディスカッション第12回：提案の素案作成と発表第13回：提案の発表（リハーサル）第14回：提案の発表",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/12/13"
}