{
    "lectureCode": "M3001T3",
    "courseName": "メディア専門演習II[健康メディアと地域メディアの企画デザイン]",
    "lecturer": [
        "千種康民(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金",
        "金2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本テーマは、アプリ企画およびアプリデザインに興味があり、下記の「健康メディア」あるいは「地域メディア」に対してデザインしていくという、明確な問題意識を有している学生にとっては非常に有益な個人作業とグループワークを併用した専門演習である。問題意識を有している学生にとってはその問題の解決法に関して、問題点の社会的位置づけ（社会課題としての定義）、原因、測定法、解決法の一連の学びを実践できるため履修者本人の意識改革・環境改善・今後の進路の決定に大いに役立つものである。本テーマは人間の身体にとって最も身近なメディアであり、SDGsのゴール3に該当する「健康メディア」とそこに暮らす・学ぶ・働く人々にとって最も身近なメディアであり、SDGsのゴール8,9,11に該当する「地域メディア」の２つの「身近なメディア」にフォーカスする。この２つの身近なメディアに山積する様々な社会的課題を発見し、新たに持続可能な手法により解決していく手法を検討し、第３の「身近なメディア」であり無限の可能性を有する「パーソナルメディア」としてのスマートフォンを活用した新しい解決法を実践したアプリデザインを制作することを本演習テーマの目的とする。特に、健康メディアに関しては、そもそもほとんどの人が自身の健康状態を正確に知る手段を持たない。地域メディアに関しては、地域住民は意外に地域のことを知らないという現状があり、それら両メディアが様々な社会的課題を有していることが本テーマの発端であり、調査することにより様々な課題が見えてくる。それらの課題の解決法を検討していく過程そのものが本テーマの目的であり、それらの原因を探求し、企画案の効果を検証することを通じて、実際に本テーマに取り組む本人および同じ課題を有する潜在的ユーザである多くの人たちに役立てることが最終的な目的である。",
        "outcomesMeasuredBy": "特に「実学に基づく専門能力の養成」に重点を置く。具体的には、既存のモバイルサイトやスマートフォンアプリの評価方法を学修し、対象となったモバイルサイト・スマホアプリを改善する。さらに発想法を学びながら新しいモバイルサイト・スマートフォンアプリを活用したサービスを企画・デザイン制作を行ない、それらを評価・分析できる能力を修得する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "この演習では、ICT系技術者\/Webデザイナーとして自立できるよう、市場調査から企画立案、そしてより実践的なプロトタイプ制作やAdobeのfigmaを使用したモバイルサイトやスマートフォンアプリのデザイン制作までを一貫して学ぶ。プログラミングまでは実施しない。ノートPC必携とする。つまり、特定分野のアプリなどの調査を行ない、その中から新しいあるいは新機能を有した企画を立案し、そして簡素なページデザインとページ遷移を実現するプロトタイプの制作および評価までが本演習の枠組みであり、その過程で使用する様々な専門的スキルを横断的かつ実践的に学ぶ。",
        "notices": "この演習においては、普段から複数のモバイルサイトやスマートフォンアプリを使用していたり、あるいはそれに関連する技術習得に対して明確な熱意を有していることが望ましい。また、グループワークの作業を伴うため、無責任な行動や遅刻・欠席は他のメンバーの作業に大きな支障をきたすため、授業への取り組みには責任をもって取り組むこと。すべての演習を通じてこのような姿勢を維持することが重要である。特にグループワークの活動については、意見を出し合う時間、個人作業時間、作業をまとめる時間、のそれぞれに対して各人が適切な役割を果たすこと。",
        "preparatoryStudy": "必ず、授業前に授業予定を確認し、適宜必要な課題への回答などの調査を行ない、環境設定をした各自のノートPCにより調査あるいは制作をする。適宜、課題レポートを提示するので指定された期日までに提出すること。予習・復習あわせて120分程度が必要である。",
        "gradingGuidelines": "要求された個人課題およびグループ課題に取り組んだことを前提として、個人課題とグループ内分担課題およびグループ内課題に対する取り組み（40点）およびグループ課題およびプレゼンテーションの質（40点）に加えて、演習全体に対する取り組み態度(20点)を勘案して成績を評価する。課題取り組みの積極性・達成度やグループ内でのリーダーシップを加味して加点評価（最大20点）する。合計60点以上を合格とする。課題にはその都度コメントすることによってフィードバックを行う。",
        "textbook": "なし。",
        "referenceMaterials": "随時紹介する。",
        "courseSchedule": "第1回:モバイルサイトの評価法（コンセプトデザイン評価）第2回:モバイルサイトの評価法（ユーザビリティ評価）第3回:xdの導入学修（プロトタイプデザイン制作）第4回:モバイルサイトのリニューアルデザインとその評価（モックアップ、プロトタイピング）第5回:既存のアプリ調査（地域アプリ）第6回:既存のアプリ調査（健康アプリ）第7回:自由課題アプリの企画案検討および発表第8回:自由課題の修正案検討第9回:自由課題詳細仕様書作成第10回:自由課題アプリ中間報告第11回:自由課題のページデザイン制作第12回:自由課題のページ遷移可能なプロトタイプデザイン制作第13回:自由課題の試用実験第14回:自由課題の成果発表会",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/08\/07"
}