{
    "lectureCode": "M3001T7",
    "courseName": "メディア専門演習II[ネットワーク構築]",
    "lecturer": [
        "寺澤卓也(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "コンピュータネットワークに関する講義や演習で学んだことをより深く理解するために、実際それがどうやって動いているのか、どう機能しているのかを体験的に見てみることは非常に重要である。このテーマではPCとルータ類によるネットワーク構築を基本として、ネットワークの成り立ちを理解するのが目的である。また、応用として、サーバ構築と運用、パケットやトラフィックの観測などを通してネットワークに対する理解を深める。さらに、クラウドサービスを利用した先端的なサーバ構築・ネットワーク構築法をAmazonWebServices(AWS)を利用して体験的に身につける。",
        "outcomesMeasuredBy": "この演習の到達目標は、・適切なIPネットワークを設計・構築できるようになること・ルータを理解し設定できるようになること・クラウドサービスを用いてサーバ構築ができるようになること・ネットワークの応用分野について体験を通して考えることができるようになることである。一部の機材は貸与するので、演習時間外にも復習したり、知識を実機で確認することができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "数名でグループを結成しグループ単位で演習を行う。一部は個人作業となる。また、演習室にあるPC機材のほかに、各自のノートPCを主要なツールとして使用するので必ず持参すること。毎回の演習は、基本的な技術や操作方法の講義の後、それに基づき各回に設定されている課題に取り組むスタイルとなる。",
        "notices": "演習授業は特に出席が重要である。特別な機材を使い、グループでの作業も行うため、欠席しないこと。この演習では、仕組みを理解し、それを確かめる作業を通して得た知識をもとに、応用作業に取り組むことになるので、集中してよく考える姿勢を保つこと。また、予習と復習を行うこと。演習の時間以外は触れることのできない機器もあるので、必要に応じて各自が作業ノートを作成することを推奨する。各自のノートPCを使用するので、不調の場合は修復しておくこと。Linuxに関する知識があることが望ましいが必須ではない。",
        "preparatoryStudy": "初めの1、2回の授業では前提知識の確認を行う。「インターネットシステム入門」の内容の復習をしておくこと。以降は、予習として次回の演習内容について公開授業資料に目を通し、概要を把握し不明の点について調べておくこと（120分程度）。一度演習したことは身についている前提で次の演習が行われるので、機器の役割や設定方法については復習が欠かせない。設定等の基本的流れやなぜそのような結果になったのかについて復習すること（120分程度）。すべて記憶することは求めないが、どの資料のどこを見ればよいかすぐに対応できるようにしておくこと。",
        "gradingGuidelines": "毎回の課題の達成度や演習への取り組み姿勢、グループ内での貢献度などにより総合的に評価する。数回のレポートを含む課題の達成度が70％、その他の項目が30％の割合を占め、合計100点満点に換算した際に60点以上を合格とする。グループ作業もあるので欠席しないこと。授業期間内のレポート課題については採点後、内容について講評する。明確な誤りについては指摘する。また、その成績をグループ編成時に考慮する。",
        "textbook": "授業資料（Moodleで公開）のみ",
        "referenceMaterials": "Cisco社の資格試験用の各種市販テキスト類Linux関連書籍AWS関連書籍",
        "courseSchedule": "第1回:環境整備-自分の使用するPCの整備第2回:IPv4ネットワークの基礎-サブネット構築演習（机上演習）第3回:Ciscoルータによるサブネット構築演習-RIP(1)第4回:Ciscoルータによるサブネット構築演習-RIP(2)第5回:OSPFと大域ルーティング第6回:トラフィック観測-パケットキャプチャ第7回:パケット転送と静的ルーティング第8回:PCルーター第9回:VLAN構築(1)-ポートVLAN第10回:VLAN構築(2)-タグVLAN第11回:サーバ構築とログ解析-Webサーバの構築第12回:AWS入門第13回:総合演習の準備第14回:総合演習",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/12/13"
}