{
    "lectureCode": "M300501",
    "courseName": "ソーシャルコンテンツデザイン論",
    "lecturer": [
        "飯沼瑞穂(メディア学部メディア学科)",
        "湧井正則(兼任講師)",
        "千代倉弘明(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ４０３"
    ],
    "courceDetails": {
        "courseOverview": "現在、多くの学生はアニメ、ゲームなどのコンテンツのデザイン、制作に強い興味を持っていると思います。コンテンツは楽しみを多くの人にあたえるものであり、コンテンツ産業は日本が国際的に誇れる産業の主軸です。。一方、コンテンツは社会に大きなインパクトを与えつつあります。たとえば、アニメで登場した街に人があつまり、新しい観光地が生まれています。まさに日本の最大の課題である地域振興に対しコンテンツは大きな貢献をしています。私たちはこのような社会にインパクト与えるコンテンツをソーシャルコンテンツと呼ぶことにします。本授業ではこのソーシャルコンテンツをどうデザインし、どう制作するかを学びます。コンテンツのデザイン・制作には２つのことが要求されると思います、一つは技術的な要素であり、もう一つは社会的な応用です。技術面では３DCGを利用した立体の造形を学びます。単に３Dモデルを作る手法だけではなく、３Dモデルの原理・構造を学びます。さらに、地図SOFTの利用法を学び、地図SOFTの中に新たな３D形状を加える方法を理解します。社会的な面では、教育、歴史、地域振興に於いてコンテンツが効果的に使われた事例について学びます。このような例をもとに、新たなソーシャルコンテンツのデザインを学生は試みます。",
        "outcomesMeasuredBy": "学生は、社会貢献のためのコンテンツを作る方法を所得する。この授業により、以下にことを習得することができる。１SketchUpという３Dソフトを用い、3Dモデルを制作する手法を学ぶ。２3Dモデルの制作手法だけではなく、３Dモデルの原理構造を学ぶ。３GoogleEarthという地図SOFTの利用法を学ぶ。４GoogleEarthの中に新たな3Dモデルを加える方法を学ぶ。５GoogleEarthを用い、映像を作成する。６ソーシャルコンテンツをデザインするため、国際・歴史を学ぶ。７グループワークでコンテンツを作成し、コミュニケーション力を高める。",
        "learningOutcomes": "国際的な教養コミュニケーション能力",
        "teachingMethod": "ノートPCの持参必須：授業では毎回ノートPCを使った実習を行います。その他、毎回、授業課題の提出や、講義中のQ＆Aなどにも活用しますので、必ず毎回持参して下さい。講義だけでなく、実習課題の提出と授業参加が重要です。グループワークを行います。また、手書きノート、筆記用具の持参も必須にします。ノートの内容をスマホで撮影し画像を提出サイトにUPします。",
        "notices": "毎回の授業参加とグループメンバーとのディスカッションが、技術を身につける上で非常に大切です。",
        "preparatoryStudy": "授業の予習、復習内容が授業の終わりに提示される。各回、ビデオなどによる予習（120分程度）、レポート作成など（120分程度）を行うこと。",
        "gradingGuidelines": "最終作品を作成してもらいます。中間発表と最終発表を行います。各回の課題提出も成績の評価対象にします。グループワークで行います。中間発表２０％グループワーク２０％最終コンテンツ３０％最終試験３０％１００点が満点であり６０点以上を合格とみなす。授業課題の評価は公開される、",
        "textbook": "特になし",
        "referenceMaterials": "特になし",
        "courseSchedule": "第１回:全体説明（社会課題、技術、コンテンツ）千代倉第２回:SketchUpのインストール(3D,モデリング）千代倉第３回:GoogleEarthによる映像制作（地図、３D）千代倉第４回:SketchUpとGoogleEarthの連携千代倉第５回:企業とSDGs（社会課題、企業活動）千代倉第６回:ETIC地域ベンチャー留学（社会課題、社会起業）飯沼第７回:企業とSDGｓ（社会課題、企業活動）飯沼第８回:後半説明ソーシャルデザイン（中間課題）湧井、飯沼第９回:地域活性化とソーシャル・デザイン（地域振興、コミュニティーデザイン）湧井、飯沼第１０回:3Dモデル原理・構造（遠近法、ポアンカレ予想）湧井、飯沼第１１回:世界遺産と世界記憶遺産（ユネスコ、コンテンツ活用、教育）湧井、飯沼第１２回:ソーシャル・デザインにおけるコンテンツコンテンツ制作湧井第１３回:最終コンテンツ発表（プレゼン、映像制作）湧井第１４回:最終レポート（文章力、表現力）湧井",
        "courseDataUpdatedAt": "2024/06/18"
    },
    "updateAt": "2024/12/13"
}