{
    "lectureCode": "M300701",
    "courseName": "ゲーム制作技術論",
    "lecturer": [
        "川島基展(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "本講義では、ゲーム開発のプロフェッショナルになるために必要となる、さまざまな制作技法について学習します。ゲームコンテンツ開発の工程や産業動向の理解をはじめとして、ゲームデザイナー、ビジュアルアーティスト、ゲームエンジニアなどのクリエーターが用いる要素技術および各スタッフの連携について、実例を交えて解説します。また、技術的な側面だけでなく、スケジュール、予算、クオリティの管理などのマネージメント面や、近年のスマートフォン向けのゲーム開発など、さまざまな側面にも触れます。多くのゲームコンテンツ制作に携わってきた実務経験を踏まえ、各技術が商業作品の中でどのように活用されるかを具体的に解説する実践的科目です。演習授業やサークル等でゲーム開発を経験している方はもちろん、ゲーム開発に用いられる技術や技法に興味があり、これから理解を深めたい方にもお勧めです。",
        "outcomesMeasuredBy": "・ゲーム開発のプロフェッショナルになるために必要な基礎知識を習得する・ゲームエンジンを用いたゲーム開発の基礎オペレーションを理解する・ゲーム開発のノウハウを他業種に活用することができるようになる",
        "learningOutcomes": "実学に基づく専門能力問題解決力",
        "teachingMethod": "ゲームデザイン、グラフィックス、プログラミング、サウンドデザインなどにおける各要素技術とともに、各スタッフ間の連携についても理解しやすいように、ゲームコンテンツ開発の工程に沿って講義を進めます。また、履修者の理解を深めるため、多くのゲーム作品のデモンストレーションを行うほか、ゲームエンジンやCGソフトウェアを用いた解説を行います。また、レポート課題ではゲームエンジンを用いた簡単な実習を行い、さらなる理解を深めます。レポート課題への対応のため、ラップトップ必携です。",
        "notices": "「これまで演習授業やサークル活動でゲームコンテンツ開発に積極的に取り組んできたが、さらに専門的な知識をしっかり身につけておきたい」という方はもちろん、「ゲームコンテンツ開発に興味がある」「これからチャレンジしてみたい」という方も歓迎です。講義を聴くだけでなく、実習や課題を通じて、積極的に参加する意欲のある方の履修を期待しています。レポート課題で用いるラップトップは斡旋機で構いませんが、調子の悪い場合は、必ず、OSの再インストールや修理を済ませておいてください。課題が多く、毎回しっかり出席し、すべての課題を提出しないと、単位取得は困難です。ドラマやアニメ、ゲームは好きだけど、自分の将来には無関係だと思っている方には向かない授業です。",
        "preparatoryStudy": "プロジェクト演習「インタラクティブ・ゲーム制作」や「ディジタル映像表現論」などの映像コンテンツ制作系の授業を履修しておくと、本講義の理解がさらに深まります。近年のゲーム作品に関心を持ち、いろいろなプレイしてみることも準備学習の一環です。次の点について予習・復習それぞれ120分程度取り組む必要があります。予習：前回の授業資料および授業ページを確認し、当日の講義に備えること。復習：授業資料の内容を十分に復習のうえ、ミニレポートに取り組むこと。授業中や授業終了直後にミニレポートを提出した場合、復習が不十分であるとみなします。",
        "gradingGuidelines": "次の項目により、成績を評価します。・授業中に提示するミニレポート[各10点]・２つのレポート課題[各50点]上記のとおり、合計240点満点とし、100点満点換算したスコアをもとに成績判定します。100点満点中60点以上を単位認定要件とし、詳細については履修規定第８条に準拠します。第2回以降の授業中にミニレポート課題の提出内容に応じたフィードバックを行います。",
        "textbook": "独自に作成したテキストを使用します。",
        "referenceMaterials": "・ゲームプログラマになる前に覚えておきたい技術（秀和システム）・「レベルアップ」のゲームデザイン（オライリー・ジャパン）ほか、授業中に随時、紹介します。",
        "courseSchedule": "第1回:イントロダクション（ゲーム制作技術の変遷、現代のゲームコンテンツ制作、ゲーム産業の最新動向）第2回:ゲームコンテンツの開発環境（プラットフォーム、開発環境）第3回:プロダクションマネージメント（スケジュール、コスト）～プリプロダクション・プロトタイピング～第4回:プリプロダクション、Unityでのプロトタイピング実習スタート～アルファバージョン開発～第5回:α版達成要件、仕様書、レベルデザイン第6回:ゲームエンジニアリングの基本テクニック第7回:ビジュアルアーツの基礎、Unityでのアルファ開発実習スタート第8回:リアルタイムグラフィクス技術～ベータバージョン開発～第9回:β版達成要件、処理負荷の考慮第10回:高度なレンダリングテクニック（PBR、NormalMap、リフレクション、ライティング、レンダリング）第11回:ビジュアルエフェクト表現、Unityでのベータ開発実習スタート第12回:ゲームコンテンツのサウンド表現第13回:デバッグ・チューニング～マスターアップ～第14回:次世代のゲーム制作技術（マスターアップの要件、次世代のゲーム制作技術、総括）",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/08/07"
}