{
    "lectureCode": "M3001T8",
    "courseName": "メディア専門演習II[人工知能・機械学習システム開発]",
    "lecturer": [
        "藤澤公也(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金",
        "金2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "昨今の第三次人工知能ブームと言われているものは、深層学習（DeepLearning）と呼ばれる技術の登場とともに、それを補うGPUを中心としたハードウェアの発展によるものが強い。また、これに伴い、人工知能の機能を効果的に活用するためのライブラリやツールが出てきている。こういったものの中には、GoogleColaboratoryといった高性能なGPUを搭載したPCを所有していなくてもオンライン開発環境でGPUを用いた人工知能プログラミング開発ができるものも出てきている。本演習では、これらのツールライブラリを活用し、人工知能技術を使ったサービスの開発を行っていく。最初にはプログラムコードを使わないツールによって人工知能の仕組み・構造を学び、動作を確認していく。中盤以降は、機械学習プログラミングでは欠かすことができない、言語であるPythonを利用した人工知能・機械学習のプログラミングを行う。",
        "outcomesMeasuredBy": "人工知能・機械学習の仕組みを理解し、機械学習に適切なデータについての知識を得る。人工知能の適用対象としては実際に身の回りにあるものを用いる。概念的な理解にとどまらず、プログラミングを実際に動くものを作り上げる。数回あるプレゼンテーション・ディスカッションを通して周りに自分の意見を示す力も養う。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "実際に人工知能を利用するための環境を構築し、そのうえで人工知能アプリケーションを稼働させ実際に運用を試みる。演習に関しては、ノートPCおよび演習ラボPC以外に、サーバ・クラウド環境も活用する。",
        "notices": "専門演習すべて同じで、2コマの時間を使い行われますが、事前調査課題、成果物作成などについて、2コマ以外の時間帯を確保して議論や作業を進める必要があります。",
        "preparatoryStudy": "基礎演習IIのテーマである「人工知能・機械学習の体験」の課題およびPythonについて復習しておきましょう。また、人工知能に関する情報・ニュースの収集を日常的に行うこと。機械学習システム開発にはプログラミング言語としてPythonを用います。PythonについてJavaとの違いなどについて予習しておいてください。予習：次回授業で扱う範囲について調査を行って不明な点を確認しておく（30分程度）復習：授業で扱ったプログラミング内容について、実際にプログラムを動かして挙動を確認してみる。また、パラメータを変更して様々なパターンでどのような変化が起きるのか確認する（90分程度）",
        "gradingGuidelines": "各回の課題についてのフィードバックは次回の冒頭で行う。成績評価は、演習の全出席及び指示されたすべての課題の提出がなされることを前提に、演習の個人活動成果物(発表およびデモンストレーション）を評価し、合計60点以上を単位認定とする。",
        "textbook": "特になし",
        "referenceMaterials": "授業やWebページなどを通じて指示する。",
        "courseSchedule": "第1回:授業概要＆準備・設定／Pythonの基礎（０）／GoogleColabの使い方復習（教育目的、目標、成績要件などの説明及び準備作業）第2回:Pythonの基礎（１）／AIの基礎（１）（Pythonの文法、TensorFlow、Keras）第3回:Pythonの基礎（２）／AIの基礎（２）（関数、リスト、畳み込みニューラルネットワーク、MNIST学習）第4回:Pythonの基礎（３）／AIの基礎（３）（辞書、モジュール、転移学習）第5回:WebアプリケーションとFlask（１）／機械学習応用（１）（Flaskとは、GAN)第6回:WebアプリケーションとFlask（２）／機械学習応用（２）（ファイルアップロード、学習済み重みの利用）第7回:WebアプリケーションとFlask（３）／AIアプリ化（学習済みモデルのアプリへの組み込み）第8回:課題企画発表（企画発表とレビュー）第9回:Webアプリ／AIアプリの補足（複数ファイルアップロード、カメラの利用）第10回:プロトタイプ制作（プロトタイプ公表、チェックレビュー）第11回:個人課題制作（１）第12回:個人課題制作（２）第13回:個人課題制作（３）第14回:最終課題発表",
        "courseDataUpdatedAt": "2024/01/23"
    },
    "updateAt": "2024/08/07"
}