{
    "lectureCode": "M300401",
    "courseName": "プロダクトデザイン論",
    "lecturer": [
        "兼松祥央(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "火4"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "プロダクトデザインとは「形と色を決めることだ」という解釈が以前はありました。しかしながら、現代におけるデザインとは「人間が生活の中でモノを見たり使ったりした時に生まれる関わり全般を設計すること」とでも言えるほどに領域は広がり、プロダクトは人・物・空間をつなげるメディアの一つと解釈されることもあります。こうしたことを背景に、この授業は、プロダクトデザインの基礎知識を身につけ、理解度を深めることを目的としています。",
        "outcomesMeasuredBy": "・プロダクトデザインに必要な基本知識全体を学ぶことで、アイデア探索の糸口が分かります。・プロダクトデザインのプロセスを概観できるようになり、デザイン関連の各種コンテンツにも通底する制作過程が分かります。",
        "learningOutcomes": "実学に基づく専門能力問題解決力",
        "teachingMethod": "私達の身の回りにある様々なモノやサービスを題材に、なぜそれらが今の形になっているのか、プロダクトの裏にあるコンセプトや工夫について掘り下げていきます。また、工業デザインが始まった時代から今にかけて、どのようにデザインが変化してきたのか、その歴史を学ぶことで、新しい世代の社会で求められるデザインコンセプトを考察していきます。ノートPC必携。",
        "notices": "造形デザイン入門を履修していることを推奨します。",
        "preparatoryStudy": "各回のテーマに基づき、予習として様々なサービスや、身の回りの日用品などのデザインに関する調査・資料集めが必要です（120分程度）。また、復習として、授業内で論じた理論や手法を用いて、調査したサービスやデザインに関する考察をまとめていただきます（120分程度）",
        "gradingGuidelines": "授業内課題40点、期末レポート60点で、合計60点以上の場合に単位認定します。各課題・レポートで提出したいただいた内容は、授業の振り返りとして授業内で紹介・フィードバックを行います。",
        "textbook": "指定しない",
        "referenceMaterials": "デザインとテクノロジー（ジェームス・ガラット、コスモス）、sketching（kooseissen、bis）、プロダクトデザイン(JIDA、ワークスコーポレーション）、ユーザ工学入門（黒須正明、共立出版）など",
        "courseSchedule": "第1回:オリエンテーション（授業内容と進め方）第2回プロダクトデザインとは？（既存製品の事例、モノとサービス）第3回:工業デザインの歴史（工業デザイン，インダストリアルデザイン）第4回:工業デザインの基礎と産業革命（ウイリアム・モリス、アーツ・アンド・クラフツ運動）第5回:工業デザインの基礎を築いた人々（バウハウス、マルセル・プロイヤー）第6回:プロダクトの様式・ムーヴメント（アールヌーボー，アールデコ）第7回:歴史的に有名なプロダクトデザイン事例（モダニズム、ジャパニーズデザイン）第8回:デザインプロセス（デザイン志向、コンセプト）第9回:プロダクトに関する色についての基礎知識（マンセル，色見本）第10回:プロダクトデザインに役立つアフォーダンス（アフォーダンス，ノーマン）第11回:アートとデザイン（ファインアート、現代アート）第12回:ユニバーサルデザインに関する行政・企業の取り組み（ユニバーサルデザイン、エコデザイン、キッズデザイン）第13回:共感と問題提起（ペルソナ手法、シナリオ手法）第14回:まとめ（授業の振り返りと最終課題）",
        "courseDataUpdatedAt": "2025/01/07"
    },
    "updateAt": "2025/03/21"
}