{
    "lectureCode": "M3001S5",
    "courseName": "メディア専門演習II[相互行為分析入門]",
    "lecturer": [
        "山崎晶子(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火",
        "火2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "学習目標(1)相互行為分析の手法を身につける(2)フィールドワークなどの手法を理解する。(3）ビデオデータの社会学的な分析法を理解する。本授業は、社会の中での相互行為を捉えることを目標とする。人間は、赤ちゃんであっても高齢者であっても、人と人の相互行為の中で生きている。保育園での幼児と高齢者、仕事場での会議、友人同士の話し合いだけではなく、人を好きであったり嫌いになったりということは、われわれが相手に示し、そして相手がそれに反応するという相互行為（インタラクション）の中で行っている。本授業では、ビデオデータを実際に撮影し、分析をともに行い、分析方法を身につけることを目指す。",
        "outcomesMeasuredBy": "以下の項目を目標とする。（１）実際に関心のある事柄に館して、フィールドワークでその背景を捉え、ビデオデータを撮影する。（2）会話分析の方法を理解して、卒業後にも会社などで会話分析の基礎を踏まえて仕事ができるようにする。また、卒業研究で評価方法などに応用ができるようにする。（3）視線やジェスチャーと発話の関係を理解する。（4）トランスクリプトの基本を理解して、卒業研究などに役立てる。これらにより関心をもつ事柄とそこで行われる相互行為を理解することを目標とする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "グループディスカッションを行う。さらに、実際の現場でのフィールドワークを行って、フィールドの理解を高めて、それぞれのグループでビデオ撮影を行う。この際に、グループワークを行う。さらにそのビデオをグループで分析し、トランスクリプトを書き、最終的な分析を行う。これらすべての過程にノートPCは必携である。",
        "notices": "グループワークやフィールドワークのために履修時間以外の時間も必要とする可能性がある。『ソーシャルリサーチ』の履修が望ましい。",
        "preparatoryStudy": "予習：前もってアップされた授業資料を読むこと。また分からないことは質問をフォームに記入すること（30分）。復習：その日の課題を行うこと（30分）。",
        "gradingGuidelines": "配点は、グループディスカッション、ビデオ撮影、フィールドワークなどの活動（５０点）と、トランスクリプトやレポートなどの課題への評価（５０点）として、それぞれの得点から単位を認定する。課題等の評価基準は、合理的に分析し主張しているかどうかを最も重視する。授業内でのグループワークへの貢献が顕著な場合は、これを特別に加点する。グループディスカッションおよび個々の発言へのフィードバックを行い、最終授業でさらに個々へのフィードバックを行う。",
        "textbook": "特になし",
        "referenceMaterials": "山崎敬一・山崎晶子他編『エスノメソドロジー・会話分析ハンドブック』新曜社",
        "courseSchedule": "第1回:フィールドワークの説明エスノグラフィー)（授業概要・フィールドワーク概要・チーム分け）第2回:フィールドワーク実践エスノグラフィーに関する講義2）第3回:フィールドワークの実践何を調査するかの話し合い１）第4回:会話分析１）調査に関する話し合いと会話分析入門１）第5回:会話分析２）会話分析入門２）第6回:相互行為分析の実践ビデオ撮影の基礎（準備、用意、主題）第7回:相互行為分析の実践ビデオ撮影第8回:相互行為分析ビデオ撮影とデータの取り込み第9回:相互行為分析今までの分析例とデータの見方第10回:それぞれのデータの発表とフィードバック第11回:相互行為分析：データの分析（データセッション）第12回:相互行為分析：データの分析（データセッション）第13回:最終フィールドワークとデータ分析第14回:最終発表",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/08/07"
}