{
    "lectureCode": "M300901",
    "courseName": "感性情報処理論",
    "lecturer": [
        "榎本美香(メディア学部メディア学科)",
        "高橋秀智(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ５０３"
    ],
    "courceDetails": {
        "courseOverview": "益々豊かになるメディア社会では、対象となるコンテンツや情報などがより身近で温かみがあることが求められている。そのような人間の主観的価値観や感性・ニュアンスなどを客観的に捉え、評価することがこれからのメディア社会に望まれる。本講義では、主観的な感性情報を如何に捉え、記述・表現して、さらにその良し悪しを判断できるコンピュータ技法を学ぶ。とくに、個別的・個人的な主観に基づくデータを集積していくことにより、総体としての特性を捉える方法論を習得し、併せて曖昧さを常にもった感性・主観を表現する論理について学ぶ。後半では，品質評価、カラーデザイン・会話の”間”などを例に感性情報処理についての実践的な演習を行う。",
        "outcomesMeasuredBy": "以下4つの知識を身につけることによって、多様な感性に関わる情報を扱えるメディアの企画・編集ができる達人になる。・個人差を超えて，広く一般的に通用する感性情報を抽出する方法を知る・抽出した情報(評価)の正当性を確かめる方法を知る・抽出した情報の相互連関・因果関係を調べる方法を知る・Excelを用いて基本的な感性データ処理を行うことができる",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "概要や基礎テクニックの講義、実際に基礎テクニックを用いた演習的な作業を交互に行う。ノートPC必携。",
        "notices": "単なる直感で外界の事物を判断するのではなく、客観的で、かつ誰にも受け入れられる説明を常に求める意識改革を図ることが履修を促進する鍵となる。漫然とした態度でメディアを受け流すことがないよう意識すること。基礎的な高校レベルの数学の知識(ベクトル計算など)を身につけていることが望ましい。",
        "preparatoryStudy": "予習：参考図書の該当箇所を読んでおくこと復習：前回の資料を見直しておくこと",
        "gradingGuidelines": "３回のレポート課題（45点、各15点）、および期末のテスト（55点）により100点満点で評価し、60点以上を及第とする。なお。レポートに関しては採点後、授業内でフィードバックを行う。",
        "textbook": "なし",
        "referenceMaterials": "・井口征士、他著「感性情報処理」（オーム社）定価3,400円（1994年1月発行）・青木繁伸著「Rによる統計解析」（オーム社）定価3,990円（2009年4月発行）",
        "courseSchedule": "第1回:授業概要（感性、感性情報）榎本第2回:感性情報とそのコンピューター利用（社会との関わり、感性情報の数量化)榎本第3回:感性工学（感性情報を利用した製品、工学的展開)榎本第4回:尺度と評価の基準（心理学的尺度構成法、精神物理的測定法）高橋第5回:感性データの分析法（統計的検定の考え方，相関，SD法）高橋第6回:感性評価研究の方法（感性工学研究の流れ，実験計画）高橋第7回:感性データの視覚化（ヒストグラム，箱ひげ図，相関図）高橋第8回:感性データの操作（感性データの分析、視覚化）高橋第9回:アンケート結果の分類（クラスター分析を用いた研究、カラーデザイン）榎本第10回:クラスター分析（クラスター分析の実践、R）榎本第11回:アンケート結果の背景要因（因子分析を用いた研究、品質評価）榎本第12回:因子分析（因子分析の実践、R）榎本第13回:アンケート結果の中の因果関係（重回帰分析を用いた研究、会話の”間”）榎本第14回:重回帰分析：（重回帰分析の実践、R）榎本",
        "courseDataUpdatedAt": "2024/02/07"
    },
    "updateAt": "2024/12/13"
}