{
    "lectureCode": "M301001",
    "courseName": "3次元コンピュータグラフィックス論",
    "lecturer": [
        "柿本正憲(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０３"
    ],
    "courceDetails": {
        "courseOverview": "3次元コンピュータグラフィックス（3DCG）の理論のうち、レンダリング技術を中心として、3次元モデルをリアルに表現する手法を学ぶ。網羅的な内容であるが、一部の項目に関してはプログラムの実装など詳細を説明する。この科目を受講することによって、3DCG表現で使われる技法を深く理解することができる。流行に左右されない普遍的な技術を解説するので、受講者は長く役立つ知識を身につけることができる。",
        "outcomesMeasuredBy": "授業計画に示した各授業のキーワードに関してその目的・原理・アルゴリズムを理解し、結果として、その技術によって生成または処理された画像がどのようになるか判定できるようになることを到達目標とする。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力",
        "teachingMethod": "授業資料は予習のために事前配布する。履修生は事前に質問を提出することができる。スライドを使った講義がメインだが、履修生の事前質問への回答に重点を置く。それに加え以下のような方法で受講生の理解を深める。・授業中にCGソフトやサンプルプログラムを各自が実行し、習ったことを実際にCG表示して確かめるアクティブラーニングを実施する・小テストを行い、授業時間内に正答率を確認し講師が解説を行う・課題として、通常の文章レポートのほか簡単なCGモデル作成などを行うプログラム言語としてProcessingを用いる。また、フリーのCGソフトであるPOV-Rayを利用した形状モデリングを行う。授業にはノートPC持参のこと。",
        "notices": "本科目を修得することによって、授業範囲に関してはCG-ARTS協会のCGエンジニア検定エキスパート相当の力がつく。ただし、実際の検定受験にあたっては授業範囲外の分野の自己学習が必要である。「CG数理の基礎」を受講していることを前提として授業を行う。未受講の学生には、過去の「CG数理の基礎」授業資料で事前に自主学習しておくことを推奨する。「CG・ゲームのための数学」「CG制作の基礎」「ディジタル映像表現論」を受講しておくことが望ましい。",
        "preparatoryStudy": "各回授業の一週間前をめどに授業スライド資料を配布する。履修生は予習として資料に目を通しておくこととする。予習時に生じた疑問は事前質問として任意提出することができる。事前質問に対して教員は回答を授業時に説明する。各回授業の復習として、スライド全体を見直すほか、教科書の該当ページを読んで多角的な観点から内容を理解することを推奨する。また、小テストを再度解答し、内容理解が問題解決に結びついているかを確認すること。予習・復習それぞれ120分程度を目安とする。",
        "gradingGuidelines": "数回のレポート課題の評価と期末試験結果を50:50の比率で総合成績に反映する。100点満点で60点以上を合格とする。授業中の小テストは、教員による理解度確認と出席確認が目的で、原則として成績には反映しない。ただし、提出回数が極端に少ない場合は成績判定に影響する。フィードバックとして、小テスト実施直後に解答分布を提示し、誤答の多い部分について詳しい解説を行う。事前質問の提出頻度と内容に応じて総合成績に最大10点を加点する。",
        "textbook": "指定しない。",
        "referenceMaterials": "コンピュータグラフィックス（CG-ARTS協会）CG数理の基礎（コロナ社）メディアのための物理（コロナ社）ビジュアル情報処理（CG-ARTS協会）",
        "courseSchedule": "第1回:ガイダンス、CG技術の概要第2回:ビューイングパイプライン（座標変換、投影、クリッピング）第3回:モデリングの基礎（形状表現、曲線・曲面）第4回:モデリングシステム（CADシステム、形状入力、フォトグラメトリ―、ディジタルアーカイブ）第5回:隠面消去（奥行ソート法、スキャンライン法、Zバッファ法）第6回:シェーディング（照明モデル、反射モデル、BRDF、スムーズシェーディング）第7回:影付け・マッピング（シャドウマップ、シャドウポリゴン、テクスチャ、バンプマップ、環境マップ）第8回:CGシステムとリアルタイムレンダリング（GPU,グラフィックスパイプライン、シェーダ）第9回:レイトレーシング法（交差判定、反射・屈折、高速化）第10回:フォトンマッピング法（モンテカルロ法、k-dツリー、集光現象）第11回:ボリュームレンダリング（等値面、レイキャスティング、散乱）第12回:特殊なレンダリング（IBR,NPR）第13回:キャラクタアニメーション（インバースキネマティクス、形状変形、モーションキャプチャ）第14回:特殊効果・動きのシミュレーション（剛体、柔軟物体、流体）",
        "courseDataUpdatedAt": "2025/01/06"
    },
    "updateAt": "2025/03/21"
}