{
    "lectureCode": "M301801",
    "courseName": "コンテンツディベロッピング論",
    "lecturer": [
        "三上浩司(メディア学部メディア学科)",
        "茂木龍太(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ４０２"
    ],
    "courceDetails": {
        "courseOverview": "本講義は、映像制作のための初期段階であるシナリオ制作(第1部）とキャラクターメイキング(第2部）を主に取り扱う。第1部シナリオ制作においては、シナリオの段階的執筆手法とそれをもとにしたシナリオエンジンをもとに、プロットの書き方、13フェーズなどを扱う。また、完成シナリオの評価や各種の分析手法を紹介する。第2部キャラクターメイキングでは、第1部で制作したプロットに基づいたキャラクター設定、キャラクターをデザインするための画像収集とコラージュ手法、それをもとにしたスケッチなどビジュアル化について説明する。さらに、キャラクターの表情や動き、アニメーション制作や、キャラクターのモデリングなどについて扱う。本講義を履修することにより、映像コンテンツ制作の初期段階の各種手法を、講義と演習によって理解できる。",
        "outcomesMeasuredBy": "映像コンテンツ制作の初期段階におけるシナリオライティングとキャラクターメイキングの制作プロセスを習得し、シナリオライティングのプロット、シーンの執筆やキャラクター収集やデザイン原案を制作できるようになる.",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力",
        "teachingMethod": "【授業形態：講義】本講義は、第1部を三上が担当し、シナリオ執筆手法と分析・評価手法を主に解説する。これらの内容をもとに履修者は、シナリオの初期制作物であるプロット制作、シナリオ分析や評価の課題を行い、これらの発表会を行う。第2部では、キャラクターメイキングの各種手法を解説する。これをもとに、履修者はキャラクター設定、キャラクター画像収集、キャラクター画像制作などの課題を行う。この成果を作品発表会で履修者は発表する。※ノートPC必携",
        "notices": "メディア学部で開講している映像創作入門、コンテンツプロデュース論，視覚情報デザイン入門，CG制作の基礎，デジタル映像表現論などを履修しておくことが望ましい。",
        "preparatoryStudy": "映画、アニメーションを多数視聴して、シナリオやキャラクターに対する理解を深めておくこと。（約120分程度）授業で学んだことを利用して課題を進めてください（120分程度）",
        "gradingGuidelines": "課題と発表によって成績評価を行う。課題はすべて提出してください。レポート課題（前半50点，後半50点）を基準に100点満点中60点以上を合格とする。提出した課題については希望者の課題を授業中にレビューします．",
        "textbook": "三上浩司，戀津魁，近藤邦雄，茂木龍太，兼松祥央：コンテンツクリエーションメディア学体系3、コロナ社(2023年）",
        "referenceMaterials": "金子満、シナリオライティングの黄金則、ボーンデジタル2008金子満、近藤邦雄、キャラクターメイキングの黄金則、ボーンデジタル2010金子満、映像コンテンツの作り方コンテンツ工学の基礎、ボーンデジタル2007",
        "courseSchedule": "第1回:シナリオの内的構造，外的構造（シナリオの黄金則，ドラマカーブ分析）(三上）第2回:テーマ設定とプロット（Sプロット，Mプロット）(三上）第3回:登場人物設定とプロット（Lプロット，フルプロット）(三上）第4回:13フェイズ（13フェイズ，動的と静的）(三上）第5回:ストーリーエピソード分割（ストーリー，エピソード）(三上）第6回:シーンの描写とリマインダー（シーン，描写）(三上）第7回:シナリオの評価とシナリオエンジン（シナリオ評価，プロデュース）(三上）第8回:キャラクターメイキングの概要（キャラクターとは，キャラクター設定）(茂木）第9回:DEARM手法：設定（キャラクター設定テンプレート，キャラクタースクラップブック，表情）(茂木）第10回:DREAM手法：生成（コラージュ手法，キャラクター分類，アニメーション）(茂木）第11回:キャラクターメイキングのツール：資料から形状（リテラル資料，スクラップブック，モデリング）(茂木）第12回:キャラクターメイキングのツール：表情から色彩設計（表情、アニメーション、配色デザイン）(茂木）第13回:キャラクターメイキングの実際（制作プロセス，スケッチ，モデリング）(茂木）第14回:キャラクターの評価（作品分析，作品批評）(茂木）",
        "courseDataUpdatedAt": "2024/01/31"
    },
    "updateAt": "2024/12/13"
}