{
    "lectureCode": "M301901",
    "courseName": "サウンドデザイン論",
    "lecturer": [
        "伊藤彰教(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ３０２"
    ],
    "courceDetails": {
        "courseOverview": "音は現象にすぎないが、これらを活用することで、メディアとして機能する。本講義では、メディア・コンテンツを中心に据えつつ、「サウンドというメディア」「音を知覚・認知する人間の特性」「デザインするという行為」「これらを実現するための手法」といった総合的な理解を深める。メディア学部では、演習を中心としたアクティブ・ラーニング型学習が特徴であり、特に１，２年次では手を動かす経験によって、広大で複雑なメディア学の概略を把握してきた。本講義では、サウンドを中心に、文系・アート系、さらにはこれらに分類が難しい学術的な内容を中心とした高度な知識を集中的に提供する。これにより、演習・実習における体験学習によって培われた経験に確固たる知的裏付けをもたらし、創成課題および卒業研究におけるテーマ確定に寄与することを目的とする。さらに、サウンド・システムのデザイン力を強化するため、各種コンテンツ産業の業種・業態・ワークフローの解説、実践的な業務用音響機器やその規格、さらにはこれらに関連する映像・ゲーム等の規格について講義を行う。",
        "outcomesMeasuredBy": "■東京工科大学メディア学部の教育研究分野が国際的なメディアサイエンス研究の中でどのような位置づけなのかを説明できる■メディア学研究におけるデザインおよびサウンドの位置づけを説明できる■音楽を含むサウンドメディアデザイン系の国際的な研究分野を俯瞰し、自らの卒業研究のテーマをその中に明確に位置づけ説明できる■３年次から円滑に卒業研究に着手し、３年次のうちにサウンド系研究の予備調査・分析・実験などを完了できる研究基礎力を養う■多様な学術分野の論文フォーマットの中から、適切なフォーマットを選択・組み合わせ、自らの論文執筆を遂行できる上記を通じて、国際的な教養を身につけると共に、サウンドメディアそのものの問題解決手法はもとより、自らの大学生活におけるサウンドメディア研究の目的・手法をデザインできる問題解決能力を習得する。",
        "learningOutcomes": "国際的な教養問題解決力",
        "teachingMethod": "■座学による講義を中心に行う。ノートPC必携。■並行して、毎週予習として専門書や学術論文を中心とした資料に多数あたり、これらの抄訳をまとめる。この結果を中心としてクラス内およびオンライン上で質疑応答を行い、理解を深める。",
        "notices": "■聴講は歓迎する■本講義は３年次より円滑に音楽を含むサウンドメディア系研究の専門的な研究に着手するための講義であるため、卒業研究において関連分野をテーマにしない学生には敷居が高いことが予想される。しかし、サウンド研究を題材として、映像・デザイン・アートなどを対象とした理文芸融合分野の研究手法に触れることは可能である。そのような場合は、自らの研究対象を予めよく勘案し、置き換えて取り組むこと。単位取得が難しいと感じる場合は、履修ではなく聴講を検討すること。■学期を通じ、多数の読書およびインターネット上での情報収集を要求する。経済的に厳しい学生は本学図書館および地元の図書館などに早めにリクエストを出すこと。■情報提供・連絡・議論等には、slackおよびgoogleアカウントのアプリ群を利活用する。ITシステムの扱いには精通しておくこと。授業内にITサポートは行わないことを留意すること。",
        "preparatoryStudy": "■本学図書館における論文や研究会報告書の探し方、学術論文のディジタルライブラリの利用法を習得しておくこと。■蔵書が無い場合はどのようにすれば入手可能か、予め図書館に問い合わせて方法を理解しておくこと。■最低限、専門書から15編（章）・研究論文10編の計25の文献を読破し、最終レポートおよび自らの卒業研究テーマ策定に活かす。このため毎週数時間以上を、読書や論文購読、購読メモ作成に割くこと。■講義内容として必要とされる事前学習は特にないが、プロジェクト演習「先端音響創造」「先端ミュージッククリエイション」「サウンドデザイン」にて実際の音作りやサウンド・システム・デザインを体験できるので、本講義と並行して履修・聴講すると理解がより深まる。■論文および書籍講読・レポート執筆・可能であればプロジェクト演習による補助的学習を含め週4時間程度の時間外学習を予習・復習として行うこと。",
        "gradingGuidelines": "・最終課題40%,授業内小課題2編が各30%。60点以上を単位認定要件とする・LMSほか、授業で利用するオンラインシステムにてフィードバックを行う課題を含む。",
        "textbook": "沢口真生ほか著(2015).『サウンドデザインバイブル』.兼六館出版.",
        "referenceMaterials": "多数あるので、授業中の資料により掲示する.https:\/\/sites.google.com\/edu.teu.ac.jp\/sdbooklist\/top",
        "courseSchedule": "第1回:ガイダンス-授業方法・資料調査法など-[論文,書誌情報]第2回:エンタテインメント分野におけるサウンドデザイン[ウォルター・マーチ,ベン・バート]第3回:アート／デザイン再考-メディア学の観点から-[バウハウス,造形]第4回:映画とサウンドデザイン[diegeticsound,pointofaudition]第5回:コンテンツ構造とサウンドデザイン[楽曲分析,音楽理論]第6回:電子音楽とサウンドデザイン[ICMC,NIME]第7回:ユーザ・インタフェイスとサウンド[インタラクション,xR]第8回:サウンドデザインと西洋藝術音楽研究[表象の美,構造の美]第9回:音の知覚と音楽の認知[心理実験,カテゴリカルデータ]第10回:サウンドによるサインとアイコン[民俗音楽,文化人類学,記号論]第11回:サウンド・スケープの概念と音環境デザイン[マリー・シェーファー,AcousticScenography]第12回:AudioEngineering[空間オーディオ,AES]第13回:ゲームとサウンドデザイン[GDC,CEDEC]第14回:サウンドデザインに関連する産業分野-業務用音響・映画・放送と技術規格-[NAB,IBC]",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/08\/07"
}