{
    "lectureCode": "M301501",
    "courseName": "ソーシャルインタラクション",
    "lecturer": [
        "山崎晶子(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火4"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "本授業は、社会の中での相互行為を捉えることを目標とする。人間は、赤ちゃんであっても高齢者であっても、人と人の相互行為の網の中で生きている。われわれは常に相互行為（インタラクション）の中で生きている。本授業では、会話分析の最新の研究成果とともに、ソーシャルインタラクション（相互行為）のあり方を学ぶ。そのために以下の4点を中心的に学ぶこととする。(1)人間の相互行為（インタラクション）における発話を基本とした会話分析の概念と方法論を習得する。(2)人間同士の相互行為（インタラクション）における発話と身体の関係を探求するために、相互行為分析の行い方を理解する。(3）録画データでの発話の起こし方（トランスクリプト）の書き方を学ぶ。これらを踏まえて(4)ロボットなどのメディアやテクノロジーを媒介としたインタラクションのあり方を学ぶこれを通して人間同士の相互行為の捉え方を学ぶ。",
        "outcomesMeasuredBy": "本授業では、以下の３つを目標とする。（１）会話分析の仕方を、身につけ、卒業後にも会社などで会話分析の基礎を踏まえて仕事ができるようにする。（２）視線やジェスチャーと発話の関係を理解し、仕事や日常のコミュニケーションに利用できるようにする。（３）トランスクリプトの基本を理解して、卒業研究などに役立てる。これらにより人々のなかでの、またはメディアを介した相互行為を理解することを目標とする。",
        "learningOutcomes": "論理的な思考力分析・評価能力",
        "teachingMethod": "・各回のテーマに応じて講義を行い、授業内では演習を行う。・この授業では、アクティブラーニングを導入し、googleformでの事前質問を設定し、設問へのユニークな回答は紹介をする。・参加学生は全員、データを見て質問に答える。・PCを必携とする。・レポートや授業内課題を課す（複数回の評価をするため）。・授業の際にも質問を受け付ける。授業を理解して行った良い質問は評価の対象とする。・授業計画は、質問の状況や理解の程度によって、変更することがありうる。",
        "notices": "ソーシャルリサーチの履修が望ましい。プロジェクト演習（相互行為分析入門）を受講あるいは聴講がこの授業を理解するのに役立つのでそれを勧める。",
        "preparatoryStudy": "予習：授業前にPDFをアップするので，資料をすべて読み（40分）、質問を考えフォームに書き込んで下さい（20分）。推薦論文や記事をだすので、そちらを読む（60分）復習：授業後に今日のまとめとして授業のまとめを書いてください（20分）。授業の宿題やレポートを行う（100分）。",
        "gradingGuidelines": "単位を取得するためには、授業内で提示する授業内課題とレポート２回の提出が必須である。それぞれの割合は授業内課題（40%）とレポート２回（60%）である。授業内課題はそれぞれ授業で良いものを取り上げたり、正解を示しフィードバックをする。レポートに関しても同様に良いものを取り上げて、フィードバックをする。そして最終授業で全体に関するフィードバックを行う。",
        "textbook": "指定しません",
        "referenceMaterials": "日本人と日系人の物語山崎敬一、山崎晶子他編世織書房実践エスノメソドロジー入門山崎敬一編有斐閣（絶版なので、教科書とはしません。図書館で読んでください。）会話分析基本論集西坂仰訳世界思想社エスノメソドロジー・会話分析ハンドブック山崎敬一、山崎晶子他編、新曜社",
        "courseSchedule": "第1回:社会の中での相互行為‐ソーシャルインタラクションとは何か第2回:相互行為とは何か：エスノグラフィーと会話の順番取りシステム（会話の順番取りシステム、会話分析）第3回：会話の順番取りシステム（1）（自己選択、他者選択）第4回：会話の順番取りシステム(2)（質問、応答、視線）第5回:隣り合う発話：順番取りシステムと隣接対（隣接対、会話の順番取りシステム）第6回:トランスクリプト入門(1),会話における評価の構造（トランスクリプト、共同評価、優先構造）第7回:物語をどのように語るかストーリーテリングのありかた（ストーリーテリング、参与）第8回:相互行為における理解のありかた：トラブルと修復、カテゴリー化（修復、順番取り,カテゴリゼーション、ジェンダー）第9回:会話と視線‐志向性（視線、志向性、身体性）第10回:トランスクリプト入門(2)：身体行為と言語的行為の文字起こし（言語的行為、トランスクリプション）第11回:相互行為と身体配置（身体配置,F陣形）第12回:身体配置と空間：Ｏ空間とＦ陣形（O空間、F陣形）第13回:ロボットと相互行為（人間とロボットの相互行為、メディアと相互行為）第14回:相互行為分析による社会生活の支援（社会的支援、テクノロジー）",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/08/07"
}