{
    "lectureCode": "M301604",
    "courseName": "メディアプログラミング演習[サウンドプログラミング]",
    "lecturer": [
        "伊藤彰教(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "C言語,C++言語を用いて、サウンドを扱うプログラムを構築します。原則的にはプレーンなコマンドアプリケーションをターゲットとして演習を実施しますが、受講生の研究テーマに応じた希望・必要性を鑑み、オーディオプラグイン制作・C系言語以外での音響処理などにも触れます。NotePCを用いて行いますが、MacOS、Windowsいずれも対応します。",
        "outcomesMeasuredBy": "C言語でのサウンドデータの扱い、UNIXOSのコンセプトと活用方法について習得します。",
        "learningOutcomes": "論理的な思考力問題解決力",
        "teachingMethod": "参考書および授業中に提示する資料をもとに授業時間外にプログラムを構築し、授業時間中に進捗報告や議論を行うアクティブラーニング形式で実施します。OS、扱う言語、ターゲットアプリケーションによってチームを分け、ペアプログラミングなどの方法で習得するグループワークの機会を多く設けます。教員は学生の進捗・議題に応じて適切なトピックの講和をします。ノートPC必携です。",
        "notices": "本演習は以下のプロジェクト演習の発展的内容です。「インタラクティブ・ゲーム制作＜サウンド＞」「先端ミュージッククリエイション」「先端音響創造」サウンド技術やプログラミングに不慣れな学生は、これらのプロジェクト演習のテーマ群をあらかじめ、あるいは本演習と並行して受講することで、本演習の前段階の基礎知識や予備的スキルを獲得できます。",
        "preparatoryStudy": "反転授業形式で行います。授業時間外に資料や参考書を読み、学生同士で相談しながら実装を進め、授業時間で発表できるように週60分以上を、進捗や技術的に掘り下げたいトピックをまとめる時間として確保しておくこと。",
        "gradingGuidelines": "学期中の発表担当回数により評価します。基礎評価としては３回担当でB,４回担当でA,５回担当でSです。授業時間外活動の連絡手段としてslackなどのオンラインツールを利用します。オンラインツール内でのリアクション・発言数の多さにより加点評価とします。成功報告よりも、バグ報告・技術的疑問点・環境設定の困難点・バージョン相性不具合報告などを高く評価します。こうしたコミュニケーションを通じて教員からフィードバックを与え、対応する能力を総合的に評価します。",
        "textbook": "利用しません",
        "referenceMaterials": "小坂直敏(2012)『サウンドエフェクトのプログラミング』オーム社横山真男(2019)『やさしい音と音楽のプログラミング』森北出版青木直史(2013)『サウンドプログラミング入門』技術評論社W.Pirkle(2019)『DesigningAudioEfffectPluginsinC++』Routeledgeうつぼかずら(2020)『VSTプラグイン』工学社…ほか多数",
        "courseSchedule": "第1回：OSとサウンドドライバの概念第2回：OSに応じた開発環境構築第3回：Windowsコマンド／UNIXコマンドアプリ第4回：C／C++の類似点・相違点第5回：オーディオライブラリ第6回：ディジタルでの数値表現と音のデータ第7回：配列データの操作第8回：オーディオレンダリング・シンセシス第9回：オーディオプロセッシング・エフェクト第10回：ファイル形式とヘッダ処理第11回：オーディオプレイヤー第12回：リアルタイム処理とバッファ操作第13回：関連技術(1)computermusicresearchtool第14回：関連技術(2)VST",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/08\/07"
}