{
    "lectureCode": "M301701",
    "courseName": "映像文化論",
    "lecturer": [
        "兼松祥央(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "映像をより専門的に学ぶ学生にむけて、優れた作品を紹介しその作品の背後にある重要なポイントを体系的に学びます。ひとびとに「感動」をとどけるすぐれた映像作品について学び、すぐれた映像の「表現」に必要なものは何かを考えます。脚本とストーリー、原作にかかわる問題を考えるとともに、その物語世界を実現させる映像技術との関係を知ります。",
        "outcomesMeasuredBy": "１：すぐれた作品の脚本が持つ物語性を学ぶ。２：映画をつくる方法、オリジナリティのあるアイデアの作り方を学ぶ。３：人々の心を動かすドキュメンタリー映像を作る方法を考える。４：色彩や構図をつくるための技術、照明の方法やカメラワークについて学ぶ。５：CGやアニメーションによる、新しい表現へのチャレンジを知る。６：映像作家が身につけるべき「映像手法」について歴史的に考察する。７：現代的なデジタル技術の力、新しい時代へむけたスキルを知ります。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力",
        "teachingMethod": "ノートPC必携。毎回のテーマごとに、重要な作品を選んで上映します。映像作品の特徴とすぐれたポイント概要を解説します。随時行う、ミニレポートに応える形で、自分の考えをまとめ、深めるようにしてください。",
        "notices": "映像作品に興味を強く持ち、映像表現の素晴らしさを本当に知りたいという気持ちで受講してください。自分自身がどのような映像に興味があるのか。また、どんな作品が作りたいのか、具体的に考えてください。すぐれた映像作品に出会ったとき、感動的な作品に出会った時に、「どうしてこの作品はすごいのだろうか」と、よくよく考えを進めて、自分なりに悩み、考察を進めることが重要です。学習や課題に必要な映像は授業内で上映しますが、紹介する映画の全てを上映することも配布することもできません。したがって学習内容を深めるために、DVDレンタルや映像配信サービスなどで授業内で紹介する映画を繰り返し視聴できる環境を整えることをおすすめします。",
        "preparatoryStudy": "毎回のテーマにそって、関連する映像作品を紹介します。感心あるテーマをさらに深め学習を進めるために、授業で紹介されたリストから、自分でも映像作品を選んで鑑賞して予習してください。また、課題として各回のテーマに沿って作品に対する感想や考察をまとめていただきます。",
        "gradingGuidelines": "期末試験は行いません。中間レポート+最終レポート【70％】と、授業中に随時行うミニレポート【30％】で評価し、60点以上を単位認定要件とします。提出されたレポートは、授業において評価ポイントなどを解説します。",
        "textbook": "「メディア学大系14クリエイターのための映像表現技法」コロナ社",
        "referenceMaterials": "「クリエイティブ脚本術」フィルムアート社「巨匠たちの映画術」キネマ旬報社「マスターズオブライトアメリカン・シネマの撮影監督たち」フィルムアート社",
        "courseSchedule": "第1回:イントロダクション（授業概要、名作映画から学ぶ物語）第2回:戦争映画に見るカット編集（ブラックホークダウン、ダンケルク）第3回:戦争の悲劇に飲み込まれた人々・前半（第二次世界大戦（時代背景解説）、プライベート・ライアン）第4回:戦争の悲劇に飲み込まれた人々・後半（プライベート・ライアン（続き）、戦場のピアニスト）第5回:ストーリー・ホイールとゴールデン・パラダイム（スターウォーズ、ヒーローズジャーニー）第6回:卒業と仕事:（卒業、プラダを着た悪魔）第7回:黒澤映画の世界・現代劇編（赤ひげ、生きる、天国と地獄）第8回:黒澤映画の世界・時代劇編（蜘蛛巣城、乱、影武者）第9回:黒澤映画の撮影技法（広角・望遠、圧縮効果）第10回:伏線とエンディング（明日に向かって撃て、シェーン）第11回:チャップリンの世界（第三の男、街の灯）第12回:他人を傷つけた人生（殺人狂時代、太陽がいっぱい）第13回:キューブリックの世界（シャイニング、2001年宇宙の旅）第14回:まとめ（これからの映像作家にもとめられる想像力、企画力）",
        "courseDataUpdatedAt": "2024/01/30"
    },
    "updateAt": "2024/12/13"
}