{
    "lectureCode": "M302101",
    "courseName": "IoTデバイス論",
    "lecturer": [
        "千種康民(メディア学部メディア学科)",
        "永田明徳(メディア学部メディア学科)",
        "羽田久一(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "コンピューターと利用者を結びつけるため、多様なデバイスが存在している。また、これからも新しいデバイスが次々と生み出されていくと考えられる。唯一万能のデバイスは存在しないので、実現可能で適切なデバイスを用いることが求められることとなる。5Gの時代になり、これらのデバイスをインターネットで接続するIoT(InternetofThings)というモノとモノをインターネットを介して接続し、情報を自動かつ相互に伝達する仕組みが注目されている。これらは技術の革新によって実現可能になったり、求められるインタラクションの変化に応じて、異なったものが現れる。このようなデバイスについての理解をするため、実現技術、サービスからの要求などについてその歴史的な変遷を含めて網羅的に理解する。",
        "outcomesMeasuredBy": "技術の進歩に伴い、急速に新しい装置（デバイス）が実社会で利用されるようになっている。これらを即時に理解し、活用するために必要な知識と思考能力の獲得をこの授業の目標とする。具体的には以下の通り。多くのデバイスは入出力装置に分類できる。特にその多くはセンサーであるので、センサーを中心にその実現に必要な基礎的な電気電子～情報処理についての理解を目標とする。これにはセンサーの基礎原理、フーリエ変換などの信号処理が含まれる。更にそれらを踏まえて、実際のデバイスの特性の把握と活用について、現実の新しく身近な製品を対象に概観したり分析を行い、それらの特性の把握と活用に必要な基礎的な思考力を獲得する。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "ノートPC必携とする。全体としては講義形式で行うが、毎回、受講者からの授業参加を求めたり課題提出や小テストも実施する。第1回～第4回(信号画像処理担当：永田)、第5回～第9回(インタラクティブデバイス紹介担当：羽田)、第10回～第14回(健康アプリ＆健康デバイス紹介担当：千種)の3部構成となっており、それぞれ各教員が担当する。",
        "notices": "この授業では授業内の課題回答や調査に積極的に取り組むこと。",
        "preparatoryStudy": "毎回、事前に提示された授業資料を用いて予習すること。また次回の主題などを説明したり、復習課題を提示するので、必要に応じて事前に一般的な調査・理解をしたり、課題の解答をレポートにしておくこと。予習・復習あわせて60分程度が必要である。",
        "gradingGuidelines": "3部構成のそれぞれの授業態度(20点)・小テストおよび提出課題(80点)の評価を統一的に各担当教員が集計し、それらを４回・５回・５回の授業回数で正規化し、100点満点とし、60点以上を合格とする。ほぼ毎回の授業において、授業理解度チェックおよび小課題を提示し、次週にフィードバックする。",
        "textbook": "なし。",
        "referenceMaterials": "必要に応じて各教員から各テーマの講義中に紹介する。",
        "courseSchedule": "第1回:入出力デバイスの変遷(入出力デバイス，センサデバイス，サンプリング)：羽田第2回:ゲームと入出力（専用デバイス，身体性）：羽田第3回:VRとその技術(VRの要素，VRとセンシング)：羽田第4回:VRと視覚と聴覚（VRの出力装置,五感へのインタラクション）：羽田第5回:未来のインタラクション（タンジブル，ウェアラブル，人間拡張）：羽田第6回:インタラクティブデバイスの概要、計測に関わる信号処理の基礎（標本化、量子化、標本化定理、量子化誤差）：永田第7回:計測に関わる信号処理の応用ーフーリエ級数からフーリエ変換（フーリエ級数、フーリエ変換）：永田第8回:計測に関わる信号処理の応用ーExcelを用いたフーリエ変換（フーリエ変換、離散的フーリエ変換、2次元フーリエ変換）：永田第9回:計測に関わる画像処理の基礎ー画素とデジタル画像（空間周波数、デジタルフィルタ、平均フィルタ、ソーベルフィルタ、パターン認識）：永田第10回:生体に関わる計測技術の概要と最新事情（健康メディアデザイン、セルフケア）：千種第11回:生体に関わる活動量の計測（健康IoT、活動量計、心拍数計測）：千種第12回:生体に関わるストレス度の計測（統計解析、自律神経）：千種第13回:生体に関わる計測データの可視化（可視化、データ分析）：千種第14回:最新のヘルスケアデバイス（CES2024、CEATEC2023、IoTと5G）：千種",
        "courseDataUpdatedAt": "2024\/05\/20"
    },
    "updateAt": "2024\/08\/07"
}