{
    "lectureCode": "M302301",
    "courseName": "ソーシャルコンピューティング論",
    "lecturer": [
        "寺澤卓也(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ５０３"
    ],
    "courceDetails": {
        "courseOverview": "インターネットの時代になって以降、情報の流通の仕方に変化が訪れた。マスメディアなどによる一方的な情報を受け取るだけではなく、一般の人が情報発信をすることが簡単になり、それが流通するようになった。携帯電話やスマートフォンなどの機器が普及し、だれもがいつでも情報に接することができるようになり、それが政治体制や社会を変革する原動力の一つとなった事例も現れた。口コミがインターネット上でも行われるようになり、商品の選択の際にそれを参考にしたり、自らの感想や体験を投稿する人も増えた。メーカもまたそれらの動向に敏感に反応して商品の開発に活かすようになった。ショッピングサイトではユーザの購入履歴や、選択した商品を購入した他のユーザの購入傾向などに基づく商品推薦が行われている。このようなインターネット上の新たな情報流通や処理の仕組みはどのようになっているのか。この科目では、これらについて体系的に学び、これからの来るべき変化に対応していく力をつけることを目的としている。",
        "outcomesMeasuredBy": "この科目の到達目標は以下のとおりである。・WWWの基本的な仕組みを理解すること・インターネット上の様々なソーシャルサービスを知ること・集合知の考え方を理解すること・インターネット上のサービスと集合知の関係を理解すること・ソーシャルコンピューティングの全体像を把握し、将来の展望を考えること",
        "learningOutcomes": "論理的な思考力分析・評価能力",
        "teachingMethod": "基本的に教科書に基づいて授業を進める。予習をしておくことが望ましい。ノートPCを使用するので必ず持参すること。一部の回ではグループ作業を行うことがある。授業中には発言を求める。あてられた者は自分の考えを述べること。講義を聞くだけではなく参加する姿勢を求める。",
        "notices": "1年次科目「インターネットシステム入門」の内容の復習をしておくこと。毎回、授業時間内に提出する簡単な小レポートを課す。ノートPCを使用するので必ず持参すること。",
        "preparatoryStudy": "毎回の授業の終わりに、その回のまとめと次回の予定を説明する。復習は公開した授業資料を基にポイントを整理し、知識の定着を図ること（120分程度）。予習は、参考書や事前配布資料、Webサイトなどを参考に次回の授業に関する基礎的な概念を理解してくること（120分程度）。",
        "gradingGuidelines": "毎回の小レポート（20%）、レポート課題（20%）、期末試験（60%）の合計を100点満点換算し、60点以上を得た者に単位を与える。小レポートについては、次の回の授業中に解説を行う。",
        "textbook": "Information\u0026Computing114「ソーシャルコンピューティング入門」〜新しいコンピューティングパラダイムへの道標〜（増永良文著サイエンス社）",
        "referenceMaterials": "授業トピックに応じて適宜紹介する。技術者向けの書籍、技術者向けのWebサイトなどを紹介する。",
        "courseSchedule": "第1回:ガイダンスとイントロダクション、WWWの仕組み第2回:Webアプリケーション（動的なWebサイト、3階層システム）第3回:Webサービス（API、マッシュアップ、REST）第4回:集合知とは（群衆の英知、多様性、独立性、分散性、集約性）第5回:ソーシャルコンピューティング（フォーマルモデル、ソーシャルフィードバック）第6回:Webと集合知（Web2.0、集合知）第7回:ソーシャルメディアとは（SNS、生態系、ブロゴスフィア）第8回:ソーシャルソフトウェア（Wiki、ソーシャルブックマーキング、フォークソノミー）第9回:ソーシャルネットワーク（スモールワールド、スケールフリー）第10回:Web検索（ロボット型、ディレクトリ型）第11回:ソーシャルサーチ（PageRank、Aardvark）第12回:リコメンデーション（協調フィルタリング、相関）第13回:ウェブマイニングとビッグデータの利用（データマイニング、データベース、IoT、Hadoop）第14回:まとめ",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}