{
    "lectureCode": "M302701",
    "courseName": "社会経済シミュレーション論",
    "lecturer": [
        "榊俊吾(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ３０３"
    ],
    "courceDetails": {
        "courseOverview": "ビジネスにかかわる諸現象を、シミュレーションモデルを構築することにより、解析していくことを目的としている。",
        "outcomesMeasuredBy": "本講義の狙いは、ビジネスにかかわる諸現象を、シミュレーションモデルを構築することにより、解析していくことである。・分析ツールとしてのプログラミング言語Scilabの基本を身につける。・世の中の経済取引と意思決定の考え方を理解する。・社会をモデル化するための方法として、レプリケータダイナミクスの考え方を学び、モデル化できる能力を養う。・シミュレーションのためのモデル構築の実際と、評価の手続きを身につける。",
        "learningOutcomes": "実学に基づく専門能力問題解決力",
        "teachingMethod": "社会経済現象にかかわる幾つかのテーマに関して、モデルのコンセプト作り、モデルの実装、評価というサイクルで、講義と実習を行っていく予定である。ノートPCを必ず持参すること。",
        "notices": "社会経済論の授業を受講していることが望ましい。講義に必要な数学的な知識(微分・差分方程式、ゲーム理論)は非常に初歩的なレベルのものであり、かつその都度解説する。ただし、トピックによっては、受講生諸君には細かな論理を積み上げていく忍耐が求められる。また、最低限必要な講義資料はＷＥＢ上に掲載するが、板書がかなり多いので、毎回しっかりノートを取る姿勢が求められる。",
        "preparatoryStudy": "予習としてテキストを通読し、各モデルの概要を把握しておくこと（１２０分）。復習として、テキスト中に演習課題等を提示してあるので、実際にプログラミングを行うこと（１２０分）。",
        "gradingGuidelines": "授業中の簡単な確認課題等(20%)、不定期に出題される複数回にわたるプログラミング作成に伴う課題の達成状況(シミュレーションモデル作成等,80%)により、60%以上を合格とする。上記の課題等については、講義中に適宜解説を行う。",
        "textbook": "教科書は「ICTビジネス」コロナ社を使用する。ただし、講義に必要なテキスト、データ、サンプルコード等を講義ページを通じて配布する。",
        "referenceMaterials": "出口弘「複雑系としての経済学」日科技連等適宜指示する。",
        "courseSchedule": "第1回:イントロダクション：講義概要・講義計画の紹介（社会シミュレーション、社会情報）第2回:プログラミング環境の設定(Scilabの概要、インストール)第3回:Scilabによる時系列状態記述の基本コードの習得第4回:Scilabによる離散系ロジスティック写像のプログラミング第5回:Scilabによる離散系2次元カオスのプログラミング（グモウスキ＝ミラ写像)第6回:Scilabによる連続系3次元カオスのプログラミングと可視化の基礎(ローレンツ方程式)第7回:Scilabによる連続系3次元カオスのプログラミング演習(レスラー方程式)第8回:ゲーム理論による利得マトリクスと意思決定原理第9回:ゲーム理論の応用事例（囚人のジレンマ型、コーディネーション型等）第10回:レプリケータダイナミクスの考え方と導出原理第11回:レプリケータダイナミクスによる状態遷移の記述（囚人のジレンマ型）第12回:レプリケータダイナミクスによる応用事例（コーディネーション型）第13回:エージェントベースモデリングの考え方第14回:秩序維持の制度設計（矯正教育と社会的支援）",
        "courseDataUpdatedAt": "2024/01/24"
    },
    "updateAt": "2024/12/13"
}