{
    "lectureCode": "M302001",
    "courseName": "情報可視化",
    "lecturer": [
        "竹島由里子(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "ビジュアリゼーション（可視化）は、数値データを図形に変換することにより、視覚的な解析を可能にする技術である。大規模データや複雑な構造をもつ数値データそのものから、意味のある情報を取り出すことは困難であるが、可視化することにより、そこに隠された情報を直感的に見つけ出すことができるようになる。現在、数値計算や実験などで得られる科学技術データから、Web解析や株価変動などの抽象的な時空間構造をもつデータまで、様々な分野で広く可視化が利用されている。しかし、どのように数値データを図形化するかによって、得られる情報量も変化する。また、得られた可視化結果から正しく情報を読み取るためには、対象分野についての知識と問題意識も必要となる。本科目では、情報可視化、科学技術データの可視化、インフォグラフィックスなどの事例を取り上げながら、どのように情報を図形に変換するのか、どのように可視化結果から意義のある知識を引き出すかについて学習する。",
        "outcomesMeasuredBy": "対象とするデータ構造に適した可視化技法の理解と、可視化結果から情報を読み取る力を習得する。最終的に、具体的な事例を効果的に可視化できる力を身につけることを目標とする。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "【授業形態：講義】ノートPC必携具体的な実例を紹介しながら、可視化技術の基本について講義する。実際に、図を作成したりする時間を含める予定でである。講義はスライドを使用して行い、講義時間内に適宜理解度チェックを行う。",
        "notices": "講義を「聞く」だけのつもりではなく、課題への取り組みを積極的に行うこと。",
        "preparatoryStudy": "可視化の題材となりうる様々な分野について、多様な話題に興味をもつことが重要である。講義で学んだ可視化方法がどのような事例で利用可能か、または、具体的にどのように利用するかについての復習が必要である。授業前に、その回で学ぶ内容の把握しておくこと（120分程度）。授業後に、キーワードの確認、理解度チェックの復習、レポート課題（任意回で実施）を行うこと（120分程度）。",
        "gradingGuidelines": "授業内で行う理解度チェック、課題、期末テストを2:2:6の割合により評価する。なお、理解度チェックについては、翌週の講義内でフィードバックを行う。",
        "textbook": "なし",
        "referenceMaterials": "「CGによるシミュレーションと可視化」、コロナ社「可視化と科学・文化・社会」、コロナ社「意思決定を助ける情報可視化技術－ビッグデータ・機械学習・VR\/ARへの応用」、コロナ社「ビジュアライジング・データ」、オライリー「ビジュアル・コンプレキシティ－情報パターンのマッピング」、BNN「ビューティフルビジュアライゼーション」、オライリー「ビューティフルデータ」、オライリー「コンピュータビジュアリゼーション」、共立出版",
        "courseSchedule": "第1回:ガイダンス、イントロダクション第2回:グラフの基礎（棒グラフ、折れ線グラフ、円グラフ、帯グラフ、ヒストグラム、レーダーチャート、散布図、箱ひげ図）第3回:ピクトグラム（ピクトグラムの歴史、標識ピクトグラム）第4回：インフォグラフィックス（インフォグラフィックスの事例、インフォグラフィックスの理解）第5回:抽象的な理解・表現の工夫（抽象的な表現、メタファ）第6回:インフォグラフィックスの作成（テーマ選択、作成手順）第7回:情報可視化（情報可視化の事例、情報可視化の処理の流れ）第8回：多次元データの可視化（散布図マトリクス、平行座標法、ヒートマップ）第9回:階層型データの可視化・ネットワークデータの可視化（ノード・リンク型、ツリーマップ、ネットワーク図、マトリクスビュー）第10回:可視化の解釈（理解の手順、因果関係）第11回:科学技術データの可視化（科学技術データの事例、データ構造の分類、データフローパラダイム）第12回:スカラ場の可視化（等高線、等値面、ボリュームレンダリング）第13回:ベクトル場の可視化（矢印表示、流線、LIC、フロープローブ）第14回:ビッグデータの利用（ビッグデータ、ビジュアルアナリティクス）",
        "courseDataUpdatedAt": "2024\/01\/29"
    },
    "updateAt": "2024\/08\/07"
}