{
    "lectureCode": "M302601",
    "courseName": "サービスデザイン",
    "lecturer": [
        "中原大介(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "～デジタル協働によるサービスストーリーの価値へ。～飲食産業や旅行代理店などのサービス産業は、無形価値として長年の実績がありますが、それらは経験や勘といった属人的な範疇に留まりがちでした。一方で、ここ数十年のICT技術は目覚ましい発展を遂げ、エンドユーザーのライフスタイルやワークスタイルの外部サービス化に貢献してきました。あらゆる産業において、多機能化や購入ユーザーの選択肢が広まったことで、機能をつくりだすというよりも、そのサービスのストーリー(物語)をつくりだせるかが、大きな差別化要因になってきています。さらにAIやIoT、XRなどデジタルテクノロジーを巻き込んだ開発においては、これらを「つかう力」が必要とされます。今後のサービス開発においては、デジタルテクノロジーを使いこなしながら、そのサービスのストーリーを共有/共感していくことが大事になっていくのです。また、サービスデザインは、イノベーション分野とも切っても切り離せない関係になりつつあります。例えば、「スマートフォン」は今時ほとんどの人が持ってると思いますが、そのプロダクトとしての技術的な発明は、だいぶ以前からなされてました。画期的なのは、いつでもどこでも使えることで、世界中の人々の日常生活＝「サービス」のイノベーションであるということです。ところで、このイノベーションは今に始まったことではなく、大昔から起きてました。代表的な例は、伝統芸能です。能楽などは600年以上前から続く最古の伝統芸能として有名ですが、ただ単に固定的な価値観でその芸能を守ってきただけではなく、その都度時代に合わせてアップデートを繰り返し、時には芸能革新＝イノベーションを起こしながら、いまに続いています。反対に、いまや一般的なパソコンなどのQWERTY配列のキーボードは、必ずしも人間が使いやすいとは言えませんが、古いタイプライターのキーボード配列の名残が現在まで続いていると言われており、このように長く残ってることが必ずしもイノベーションの結果であるとは限りません。本科目では、サービスデザインの変遷や産学含めた事例を紹介しながら、イノベーションを含めた最先端のアイディア発想法やその実現化のための方法論について学びます。",
        "outcomesMeasuredBy": "・デジタルテクノロジー激動の時代において、変幻自在にこれらを使いこなしながら、サービス価値へ還元するための基本概念及びその基礎知識を習得する。・サービスデザイン領域の実践的先行事例、最先端事例、今後の行く末について、その概要を論じられるようになる。・サービスデザイン領域における従来の理論やモデルをベースとした手法及び最先端の実例を知り、アイディア創出から分析・評価能力を向上させる。",
        "learningOutcomes": "コミュニケーション能力問題解決力",
        "teachingMethod": "・講義形式を基本とします。・都度、理解度確認と実践的体験のための演習などを取り入れる予定です。・ノートＰＣ必携です。",
        "notices": "演習等、授業時間以外の学修・作業時間が必要になります。",
        "preparatoryStudy": "・事前の知識としては特に指定はありませんが、新しい分野に好奇心をもって取り組む姿勢の学生を歓迎します。・授業では、学習に関する事前調査や、得た知識をさらに発展させる課題などを実施します。・予習・復習としては、教科書の各テーマの該当箇所及び授業内で紹介した関連資料を読んでください(各60分程度)。",
        "gradingGuidelines": "単位認定要件は、次の通りです。・最終課題(レポート提出）(配点70点)・通常講義での課題（配点30点）上記各々、60％以上の成績を収め、さらに上記の得点合計が60点以上を合格とします。・適宜、授業内で全体に対するフィードバックを行います。",
        "textbook": "中原大介著「一般教養としてのプログラミング」SBクリエイティブ、2023",
        "referenceMaterials": "授業中に必要に応じて随時紹介します。",
        "courseSchedule": "第1回：授業ガイダンス（授業目標、方法、成績評価）第2回：サービス価値の変遷（ビジネス価値のシフト、デジタルを使う力）第3回：サービスの技術基盤（コンピューターの進化、AI、IoT）第4回：サービス化社会（ICTサービス、Society5.0、SDGs）第5回：IoTサービス開発（UXデザイン、サーバーフィジカル、5G）第6回：AIサービス開発（人とAIの協働、道具としてのAI）第7回：XRサービス開発（新しい現実観、VR、AR、MR）第8回：デザイン思考（気づき、ラピッドプロトタイピング）第9回：ビジョン思考（自走、越境）第10回：アート思考（「問い」をつくる、「物語」をつくる）第11回：イノベーション概論（クローズドイノベーション、オープンイノベーション、組み合わせ価値）第12回：過去のイノベーション史（道具、伝統芸能、音楽）第13回：現代のイノベーション観（ユーザインタフェース、宇宙、ロボット、新しいライフスタイル）第14回：未来のイノベーション像（ストーリーテリング、SFプロトタイピング）",
        "courseDataUpdatedAt": "2024/02/07"
    },
    "updateAt": "2024/08/07"
}