{
    "lectureCode": "M302401",
    "courseName": "情報システム設計論",
    "lecturer": [
        "藤澤公也(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義実験棟４０３"
    ],
    "courceDetails": {
        "courseOverview": "この講義では、情報システムならびにシステム環境についての基本的な概念を理解するとともに、その構築・運用に必要な情報技術、計画技法について身につける。まずは、システムの仕様設計のために必要な要件定義について学ぶ。ここでは、何が必要かを分析し実現が可能かどうかの見極め、さらには要求変更や仕様の追加などを含め、システムの実装に必要となる技術の選出するための手順について学ぶ。また、システム構築に必要となるさまざまな技術に対する理解を深め、いくつかの技術の組み合わせに関しての検討ができるようにする。これらの学習を通して、ユーザ・ベンダ双方の立場から、企画・設計、実装・構築、運用・チェック、改善といった一連のサイクルについて、ミニプロジェクトを通して身につける。",
        "outcomesMeasuredBy": "情報システムとは何か、また情報システムがどのように設計されているのか設計方法を理解し、情報システムの設計手順を学ぶことで、問題を解決するロジックを理解し活用できるようにする。",
        "learningOutcomes": "分析・評価能力問題解決力",
        "teachingMethod": "講義を基盤とした授業を行うが、システムの実装・運用を体感するためにノートPCを利用することもある。また、ミニプロジェクトではグループワークを行う。",
        "notices": "各回の講義は連動しており、そこまでの内容を理解していることが前提となるため、必ず、予習復習を行っていくこと。講義中、必要に応じてノートPCの利用を指示することがあるが、指示のあったとき以外はノートPCを利用しないこと。ただし、出席はオンラインシステムによってとるため、ノートPCは毎回持参すること。",
        "preparatoryStudy": "情報システムとは何か、情報リテラシーで学んだことを復習しておくこと。また、世の中にどのようなシステムがあるか、事前に考えて予習しておきましょう。予習：次回にかかわるキーワードについて調査してみる（120分程度）復習：扱った内容について、実際にどんなことができるか試せるものは試してみる（120分程度）",
        "gradingGuidelines": "授業中に指示するミニ課題については次の回の冒頭でフィードバックを行う。このミニ課題およびレポートをすべてこなしたことを前提に、最終レポートを課す。このレポート課題に授業中のミニ課題の結果を加味したうえで60点以上の点数を取ることで単位が取得できる。",
        "textbook": "特になし",
        "referenceMaterials": "授業中に適宜提示する。情報システム基礎（オーム社）など",
        "courseSchedule": "第1回:情報システムとは（概要、進め方、評価）第2回:情報システムの変遷（情報、コンピュータ、ネットワーク、人）第3回:情報システム事例（要素技術、データベース、Web、クライアント・サーバ）第4回:開発工程（ウォーターフォールモデル、ITスキル標準）第5回:企画と分析（要求分析、要求定義）第6回:仕様と設計（１）：外部設計（システム構成、データ調査、外部インタフェース）第7回:仕様と設計（２）：内部設計（データ処理・設計、詳細処理、エラー処理）第8回:テスト・運用（単体・結合テスト、システム・運用テスト、導入・保守）第9回:単体テスト・結合テストの実践（スタブ、ドライバ、Node-RED）第10回:反復型開発（スパイラルモデル、アジャイル開発）第11回:ミニプロジェクト概要説明・新しい（特殊な）開発（クラウドソーシング、ハッカソン・アイディアソン）第12回:ミニプロジェクト（１）（チーム分け、テーマの提示、要件定義実施）第13回:ミニプロジェクト（２）（模擬インタビュー実施、結果のとりまとめ）第14回:まとめ・発表",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/08\/07"
}