{
    "lectureCode": "M302501",
    "courseName": "調査報道論",
    "lecturer": [
        "森川美幸(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "ニュース報道は大きく「発表報道」と「独自報道」の２つに分類できる。「発表報道」とは、行政官庁や捜査機関、企業広報などが、記者会見やプレスリリース等を通し公的に発表した内容をそのまま報じることを指す。一方、「独自報道」とは、報道メディアが主体的に調査や検証を行って新たな事実を究明し、報道することである。「独自報道」には様々な種類があり、世論調査なども含まれるが、本講義では自発的な問題意識に基づいて取材を行い、社会に埋もれている真実を白日の下に晒す「調査報道」と呼ばれる報道スタイルに焦点を当てる。新聞・雑誌記事、ニュース番組、書籍およびドキュメンタリー映画、TVドキュメンタリー番組などを用い、実際に行われた調査報道の内容とその報道プロセスを辿りながら、ジャーナリストの着眼点や調査方法を学ぶ。また、権力の番犬としてのジャーナリズムの意義を考察し、ジャーナリスト的視点の発見と獲得を目指す。",
        "outcomesMeasuredBy": "世の中にはさまざまな問題や課題が存在する。しかし、それがどんなに深刻であっても、多くの問題は社会の闇に隠れ、見過ごされてしまっているのが現実である。メディアには、そういった隠されている事実を白日の下に晒し、世に問うという重大な責務がある。「調査報道」とは、まさにその責務を果たす、ジャーナリズムの精神そのものであると言えよう。本講義では、権力の番犬としてのジャーナリズムの意義を考察し、ジャーナリスト的視点の発見と獲得を目指す。また、「正義とは何か？」という、より根源的な問いに対する答えを探求する。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力",
        "teachingMethod": "基本的には講義形式で行うが、授業内で課題を出し、回答または発表する時間を設ける。課題の出題・回答にはMoodleを利用するので、ノートPC等Moodleにアクセスできる機器を必ず持参すること。",
        "notices": "本講義では積極的な履修姿勢を求める。",
        "preparatoryStudy": "予習・復習として、授業で学んだことを念頭に置きつつ、新聞やニュース番組などのスクープ記事や、報道特集といった調査報道コンテンツを幅広くレビューし、その報道が社会に与える意義やインパクトを考察すること。予習・復習時間は各120分を目安とする。",
        "gradingGuidelines": "複数回の課題40点と授業内での発言等の貢献10点および期末レポート50点の合計100点のうち，60点以上を単位認定基準とする。課題等へのフィードバックは、授業内またはMoodle等を活用して適宜行う。",
        "textbook": "特になし。",
        "referenceMaterials": "適宜指示する。",
        "courseSchedule": "第1回：調査報道とは何か（独自報道、発表報道）第2回：桶川ストーカー事件（誤報、バイアス）第3回：足利事件（冤罪、キャンペーン報道）第4回：北朝鮮拉致報道（初報、マスメディアの不報）第5回：新聞記者１（権力の番犬、記者クラブ）第6回：新聞記者２（官邸記者会見、質問妨害）第7回：原発事故（新聞報道、週刊誌報道、TV報道）第8回：#MeToo運動の原点（ニューヨークタイムズ、セクシャルハラスメント）第9回：インターネット時代の調査報道（ウィキリークス、パナマ文書）第10回：報道メディアとしての映画１（取材方法、正義とは）第11回：報道メディアとしての映画２（ドキュメンタリーの価値、インタビュー）第12回：ジャーナリストと取材対象（被取材者に与える影響、報道写真）第13回：TVドキュメンタリー（密着取材、啓発）第14回：まとめと復習",
        "courseDataUpdatedAt": "2024\/01\/26"
    },
    "updateAt": "2024\/09\/13"
}