{
    "lectureCode": "M302801",
    "courseName": "社会連携プロジェクト[ライブ・エンターテインメント動画配信プロジェクト]",
    "lecturer": [
        "山脇伸介(メディア学部メディア学科)",
        "大淵康成(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 6,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "毎年2月に行われる松任谷由実コンサートツアー「SURF&SNOWinNaeba」のインターネット・サイト「ユーミンNETRESORTY-topia」において、映像コンテンツ制作、ライブ映像配信等を行う演習である。2007年に始まったユーミンと本学との連携であるが、近年のライブ・エンターテインメント・ビジネスの多様化・巨大化に伴い、演習内容も映像制作・配信にとどまらない。実務経験の豊富な指導者のもとで、SNS戦略、グッズ紹介、販売促進等、巨大ライブ・エンターテインメント・ビジネスの包括的な企画・戦略などに関する実習を行う実践的科目である。",
        "outcomesMeasuredBy": "本演習は、インターネット放送局「インテブロ（intebro）」で学んだ映像制作技能を向上させ、実践するプロジェクトである。撮影・収録・編集においては、プロフェッショナルとの協業を通して、より高いクオリティのコンテンツ制作能力取得を目指す。その他の様々な企画については、学生ならではの斬新、ユニーク、かつ大胆な発想を求める。映像コンテンツ制作やその他の作業について、企画立案から、企画を通すための戦略作り、説得力あるプレゼン能力の習得を目指す。具体的には次の能力の習得を目指す。１：ライブ撮影時の画角構成力、判断力、瞬発力。２：複数カメラ収録時の映像・音声の調整、スイッチング、編集技術。３：撮影・編集機材の整備、移動時の扱い。４：インターネット・サーバーの構築、送信技術。５：コンテンツ制作・販促等における企画、プレゼン、交渉能力。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ノートＰＣ必携のアクティブラーニング科目であり、グループワークを行う。ライブ準備段階（プレ・プロダクション）では、アーチスト所属事務所やライブ配信担当者の指導のもと、時にアーチストやミュージシャンなど出演者と共に「Y-topia」契約者増進のための企画立案・コンテンツ制作を行う。ライブ動画配信（プロダクション）では、カメラ・スイッチング・録音・ネット配信など、それぞれの技能を習得・向上させ、その成果を実際のライブ・コンサート会場で実践する。ライブ終了後（ポスト・プロダクション）は、アーチスト事務所や映像制作ディレクターの指導を受けつつ、収録映像の編集作業を行う。",
        "notices": "本演習は、映像撮影・編集等の応用演習である。履修希望者は、プロジェクト演習「インテブロ」の履修経験者であることが望ましい。履修に際しては社会連携プロジェクト所定の選抜を経る必要がある。",
        "preparatoryStudy": "制作する映像コンテンツの下調べ、企画立案、共有、打合せ、プレゼン準備。また、苗場撮影に向けた撮影練習、機材準備、メンテナンス。過去の苗場コンサート映像・画角確認、研究。400曲以上に及ぶ松任谷由実楽曲の内容・音符確認（コンサート直前まで、演奏楽曲が決まらない為）。以上の内容を「週報」にまとめ、提出する。",
        "gradingGuidelines": "演習への参加姿勢（実習における積極性、リーダーシップ、チームワーク）や、演習作品の内容やクオリティをもとに、成績評価を行う。演習への参加姿勢40%、演習作品のクオリティ60%で評価する。参加姿勢にはついては、毎週提出する「週報」の内容も考慮する。作品へのフィードバックは、演習時の講評会等で恒常的に行う。",
        "textbook": "指定しない",
        "referenceMaterials": "武部聡志著「ユーミンの歌声はなぜ心を揺さぶるのか」集英社新書。松任谷由実の楽曲・映像作品、販売グッズ等。",
        "courseSchedule": "本演習の作業は多岐にわたるため、スケジュールも臨機応変に変更することがある。第１週苗場プロジェクトの全体作業確認。担当チーム分け、リーダー決め。カメラ音響撮影・収録・保存・編集等の作業確認・練習。第２週「Y-topia」事前制作コンテンツ企画・立案・プレゼンテーション練習。カメラ音響撮影・収録・保存・編集等の作業確認・練習。第３週事前制作コンテンツのプレゼンテーション。直し対応・内容決定。カメラ音響撮影・収録・保存・編集等の作業確認・練習。第４週事前制作コンテンツの取材・撮影・編集。プレビュー、直し、最終チェックを経て、配信。カメラ音響撮影・収録・保存・編集等の作業確認・練習。第５週「SURF&SNOWinNaeba」コンサートの撮影・収録・ネット配信。コンサート会場（撮影・配信・インターネット機材）設営、撤収。第６週「SURF&SNOWinNaeba」コンサート収録映像の編集。第７週「SURF&SNOWinNaeba」コンサート収録映像の編集・直し・搬入。講評、全体総括。",
        "courseDataUpdatedAt": "2025/01/28"
    },
    "updateAt": "2025/03/21"
}