{
    "lectureCode": "M4001161",
    "courseName": "卒業研究I[後期]",
    "lecturer": [
        "椿郁子(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": "4",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "卒業研究では4年間の学修の総まとめとして、配属された専任教員の研究室において、1年間の間、研究課題の設定、実行計画の立案・実施・評価を行なう。発表においても、論文においても、問題の提起、問題解決の方法・手順、結果（findings）という一連の研究プロセスを整合的にまとめることが最低限求められる。卒業研究Iでは研究課題の設定と実行計画立案を行う。その過程で予備実験や予備調査などの活動を行う。半年間の成果を中間報告書にまとめ、発表会で中間発表を行う。なお、以下が重要なイベントとなる。１.仮題目申告指定の期日(5月下旬頃)までに、責任指導教員名と卒業論文仮テーマをWEB上で申告する。テーマ決定にあたっては、責任指導教員や研究室担当教員とよく議論すること。なおこの時点で出されたテーマは変更可能である。２．中間発表学期末に行われる学部主催の発表会で前期の研究成果を発表する。発表会の形式は口頭発表またはポスター発表とする。３．中間報告書の執筆半年の成果をA4で5枚程度の中間報告書としてまとめ責任指導教員に提出する。報告書の締切期限は研究室内の指示に従うこと。",
        "outcomesMeasuredBy": "当該研究分野における代表的な文献を多数調査した結果、その研究分野の常識的な一連の成果に関して説明できるようになることを目標とする。さらに、それらの調査を踏まえて、新規性の主張可能な研究テーマの方向性を仮テーマとして見い出すことを到達目標とする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "各研究室において週1回以上行われるミーティングに参加して研究についての議論を行う。その他については、配属された研究室ごとの研究計画に従うこと。",
        "notices": "卒研室等学内において最低週15時間の学修・研究従事時間を確保すること。研究室で定められたミーティングに欠席する場合は、必ず事前に担当教員に連絡をし、ミーティングで必要な提出物があれば事前に提出すること。遅れた分の学修・研究があれば取り戻しておくこと。その他の点については、配属された研究室の担当教員の指示に従うこと。",
        "preparatoryStudy": "配属された研究室の担当教員の指示に従うこと。",
        "gradingGuidelines": "発表においても、論文においても、問題の提起、問題解決の方法・手順、結果（findings）という一連の研究プロセスを整合的にまとめることが最低限求められる。なお、前期研究の中間報告書と中間発表（口頭発表またはポスター発表）は全員に課される最低限の課題となる。その他の詳細は研究室の担当教員が定める。",
        "textbook": "配属された研究室の担当教員の説明を聞くこと。",
        "referenceMaterials": "配属された研究室の担当教員の説明を聞くこと。",
        "courseSchedule": "第1回：研究室の方針確認第2回：研究テーマの策定(1)第3回：研究テーマの策定(2)第4回：研究テーマの策定(3)第5回：研究の遂行(内容は研究室による)第6回：研究の遂行(内容は研究室による)第7回：研究の遂行(内容は研究室による)第8回：研究の遂行(内容は研究室による)第9回：研究の遂行(内容は研究室による)第10回：研究の遂行(内容は研究室による)第11回：中間報告書執筆および発表準備(1)第12回：中間報告書執筆および発表準備(2)第13回：中間報告書執筆および発表準備(3)第14回：中間発表会",
        "courseDataUpdatedAt": "2024\/02\/27"
    },
    "updateAt": "2024\/08\/07"
}