{
    "lectureCode": "MK06101",
    "courseName": "映像創作入門II",
    "lecturer": [
        "兼松祥央(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "映像クリエイターが必要とする映像表現に関する技法を学びます。映像を創作する上で重要な基礎知識を学び、映像クリエイターとなるための基礎を勉強します。映像の歴史を学ぶ中で、名作映像作品の素晴らしさを知り、現代に通じる重要な知識を習得する。映像表現の技法を体系的に学び、自分自身の力として身につけます。「映像創作入門II」では特に、既存の名作映画を題材に優れた編集技法や、CG・アニメーションを使った表現について学びます。",
        "outcomesMeasuredBy": "１：映画の歴史を学び著名な監督の作品について知る。２：特撮やCGをふくめてポストプロダクションの役割を知る。３：アニメーションの基礎を学び重要な作品について知る。４：映像作品における音楽の役割を知る。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力",
        "teachingMethod": "ノートPC必携。各テーマごとに、サンプルとなる映像作品を上映します。その上で、理解すべきポイントや重要な知識について考える形で授業を進めます。サンプルとなる映像の優れた点を自分で考え、関連するテーマについて、自分で掘り下げて考える力をつけます。また、クイズ形式のミニ問題を通じて、映像に関する知識を増やし、自分で考える力をつけます。",
        "notices": "「映像創作入門I」を履修していることが望ましい。「映像創作」のために必要な知識や経験は、非常に多岐にわたります。好奇心を持って、自分から知識をもとめ、新しい体験をさがす努力が重要です。自分で制作したい作品のイメージを持ち、取り組むべきテーマを見つけて、勉強をすすめる習慣を身につけてください。普段から、優れた映像作品を鑑賞するように心がけてください。学習や課題に必要な映像は授業内で上映しますが、紹介する映画の全てを上映することも配布することもできません。したがって学習内容を深めるために、DVDレンタルや映像配信サービスなどで授業内で紹介する映画を繰り返し視聴できる環境を整えることをおすすめします。",
        "preparatoryStudy": "各回の講義テーマについては、教科書の各章に対応しています。授業では教科書内で示されている事例を映像でお見せしますので、あらかじめ該当箇所をよく読んでおいてください。また、課題として各回のテーマに沿って様々な既存作品での事例に対して考察を提出していただきます。",
        "gradingGuidelines": "期末試験は行いません。中間レポート+最終レポート【70％】と、授業中に随時行うミニレポート【30％】で評価し、60点以上を単位認定要件とします。提出されたレポートは、授業において評価ポイントなどを解説します。",
        "textbook": "「メディア学大系14クリエイターのための映像表現技法」コロナ社",
        "referenceMaterials": "「映画の瞬き」フィルムアート社「マスターズオブライト」フィルムアート社「映画美術から学ぶ『世界』のつくり方」フィルムアート社",
        "courseSchedule": "第1回:[特撮技法]（SFXとVFXの世界\/映像のマジック）第2回:[CG技法]（イメージの魔法の翼\/CGを作ってみよう）第3回:[アニメーション技法]（芸術としての映像\/アニメの歴史を学ぶ）第4回:[傑作映画]（黒澤映画の世界\/キューブリック作品）第5回:[映像制作の現場1]（撮影現場の職業図鑑\/プリ・プロダクション）第6回:[映像制作の現場2]（撮影の進め方\/ポスト・プロダクション）第7回:[まとめ]（新時代の映像表現に求められるものとは）＊講義は全て兼松が担当します。",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/09\/13"
}