{
    "lectureCode": "MK06201",
    "courseName": "ゲーム学入門",
    "lecturer": [
        "三上浩司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "ビデオゲームやデジタルゲームがアカデミックな領域として認知され研究が盛んになってきたのは，2000年代に入ってからである．ゲームにかかわる研究は，大別すると2つにわけることができる．ひとつは制作者側の視点から考える「ゲーム開発研究」，もうひとつは受容者側の視点から考える「ゲーム研究」である．前者はより独創的なゲームや高品位なゲーム，効率的な開発手法などを追求する．後者はゲームをユーザーがどのように受容するのか，ゲームがどのように社会に影響を与えるのかを探求する．本講義では，これら2つを包括的に取り扱い「ゲーム学」としてとらえ，その導入的な位置づけとして，入門的な内容を扱う．メディア学部の4年間の学びを通じて，ゲームにかかわる領域に触れるものを対象に，1ユーザーとしての視点から俯瞰的な視点を持ち，開発者並びにゲームを活用する人材にある上での動機づけを行う．",
        "outcomesMeasuredBy": "ゲーム学にかかわる，国際的にも基盤となる考え方を習得しつつ，技術やメディア，社会の変遷により変化していくゲームやゲームに関連する研究に対し，クリティカルシンキング（批判的思考）を持ち，分析する力を身に着ける．",
        "learningOutcomes": "論理的な思考力分析・評価能力",
        "teachingMethod": "授業は講義と課題のレビューを組み合わせて行う．授業のたびに復讐や予習を兼ねた課題を課し，それらの中から適切なものを取り上げて議論する．",
        "notices": "ゲーム研究には実際にプレイすることは重要です・家庭用ゲーム機やスマートフォン，PCなどでゲームができる環境を各自で準備すること．授業に際して，自分の好きなゲームだけを遊ぶのではなく，あらゆるコンテンツを調査分析します．個人的な趣味ではなく，アカデミックな視点でゲームに向き合ってください．",
        "preparatoryStudy": "新旧問わず多くのジャンルのゲームに触れ，自分なりの感想をもって事業に臨んでください（120分程度）授業の各回に課題が課されますので，それらにしっかり取り組むこと（120分程度）．",
        "gradingGuidelines": "授業は課題により採点します．各回の課題を加重平均し100満点に換算し，大学の基準に沿って判定します．",
        "textbook": "三上浩司，渡辺大地「CGとゲームの技術」，コロナ社，2016年",
        "referenceMaterials": "小林信重「デジタルゲーム研究入門」ミネルヴァ書房，2020吉田寛「デジタルゲーム研究」東京大学出版会，2023セリア・ホデント「ゲーマーズブレイン」ボーンデジタル，2019",
        "courseSchedule": "第1回：ゲーム学入門（「ゲーム開発研究」，「ゲーム研究」）第2回：ゲーム学の歴史的考察（「ゲーム産業」，「ゲーム研究」）第3回：ゲームと遊び（「カイヨワ」と「ホイジンガ」）第4回：ペラ企画作成演習（「ゲームデザイン」，「メカニクスデザイン」）第5回：ゲームプレイヤーの知覚特性（「知覚」，「記憶」）第6回：知覚特性のゲームへの活用（「UI」，「UX」）第7回：ペラ企画レビュー（「ピッチ」，「評価」）",
        "courseDataUpdatedAt": "2024/01/30"
    },
    "updateAt": "2024/12/13"
}