{
    "lectureCode": "MK06601",
    "courseName": "音楽入門II",
    "lecturer": [
        "伊藤謙一郎(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "私たちの周りには、ポップスやロック、ジャズをはじめとするさまざまなジャンルの音楽が溢れていますが、それらの多くは17〜19世紀の西洋音楽（クラシック）の理論を土台にして作られています。その理論の理解には、さらに基礎的な音楽理論や楽譜の読み方・書き方のルールをまとめた「楽典」の知識が必要です。この授業では、音符や休符など楽譜に書かれる諸記号を理解していることを前提に、拍子やリズム、音程、音階、和音の構成について学びます。また、リズム打ちの実習によって読譜力とリズム感の習得・向上を目指します。",
        "outcomesMeasuredBy": "楽典の基本的な事項について理解するとともに、さまざまな音楽に対する視野を広げます。",
        "learningOutcomes": "論理的な思考力分析・評価能力",
        "teachingMethod": "大ホールでの講義形式です。授業は教科書に沿って進めます。そのほか、講義内容に関する資料や楽典の問題のプリントを随時配布します。また、実際に音楽を流して楽曲の紹介も行います。ノートPCは出席登録と授業内課題を実施する際に使用するので毎回必ず持参してください。",
        "notices": "科目名に「入門」の文字がありますが、内容が易しいわけではありません。また、単に音楽を「楽しむ」授業でもありません。大学の授業であることを踏まえて、しっかりとした意志をもって履修してください。もちろん、履修者の多くはこれまで音楽を専門的に学んでいないことに配慮し、講義にあたってはできる限りわかりやすい説明を心がけるようにします。授業を受けてわからないことがある場合は、授業終了後や担当教員のオフィスアワーの時間を利用し、積極的に質問してください。（※授業中の質問はSAが対応します）授業では音符を書きながら説明を行うことがあるので、五線紙（数枚で構いません）を用意し、毎回持参してください。【禁止事項】(1)ノートPCやスマートフォンでのSNSの使用、ゲームプレイ、動画閲覧など、授業と無関係な行為はしないでください。ただし、出席登録と授業内課題を実施するときのみノートPCの使用を認めます。（※スマートフォンはカバンなどにしまって、授業中は触れないこと）(2)私語は慎んでください。(3)授業中に無断で退室・離席しないでください。（※体調不良などで一時的に離席したい場合はSAに申し出ること）(4)配布資料、およびスクリーンに投影された授業関連資料の写真撮影・動画撮影はしないでください。上記(1)〜(4)の禁止行為を発見した場合、巡回しているSAが注意しますが、再三にわたる注意に従わない場合は、担当教員の指示によって退室してもらいます。",
        "preparatoryStudy": "各回の授業前に、その単元の教科書のページを読んでおくなど予習を心がけてください【120分程度】。また、授業で説明した単元の練習問題（教科書の巻末に掲載）を解答・自己添削し、授業内容の理解を深める復習を必ず行ってください【120分程度】。これらの予習・復習のほか、日頃から音楽を分析的に聴く習慣をもつことも大切です。",
        "gradingGuidelines": "理解度チェック【40％】、授業内課題【60％】で評価し、60点以上を単位認定要件とします。期末試験は実施しません。理解度チェックは、実施後に答え合わせと解説を行います。授業内課題についても、課題内容によっては履修生へのフィードバックを行うことがあります。",
        "textbook": "野崎哲著「新しい楽典付・問題集と解答」（音楽之友社）",
        "referenceMaterials": "・石桁真礼生ほか著「楽典―理論と実習」（音楽之友社）・大山昌彦、吉岡英樹、伊藤謙一郎著「ミュージックメディア」（コロナ社）",
        "courseSchedule": "第1回：拍子（拍子記号・拍子の種類・強起と弱起・シンコペーション・ポリリズム）／リズム打ち(1)第2回：音程(1)（旋律的音程と和声的音程・単音程と複音程・音程の名称・協音程と不協音程・幹音どうしの音程の判定方法）／リズム打ち(2)第3回：音程(2)（派生音を含む音程の判定方法・転回音程）／リズム打ち(3)第4回：音階(1)（音階各音の名称・長音階・短音階）／リズム打ち(4)第5回：音階(2)（五音音階・その他の音階）／リズム打ち(5)第6回：和音（３和音の構成・３和音の種類）／リズム打ち(6)第7回：理解度チェックと解説／まとめ",
        "courseDataUpdatedAt": "2025/01/07"
    },
    "updateAt": "2025/03/21"
}