{
    "lectureCode": "MK06701",
    "courseName": "視覚デザイン入門",
    "lecturer": [
        "菊池司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "本授業のテーマは「視覚デザイン」である。視覚デザイン（グラフィックデザイン）に必要な「文字とタイポグラフィ」、「レイアウト」、および「色彩・配色」の基礎的な知識と技術の習得を目的とする。グラフィックデザインに必要な上記の基礎理論を学習したあとに、「タイポグラフィ」・「レイアウト」・「配色」それぞれに関連した計3つの課題作品の制作に取り組み、デザイン作品を作り上げるために必要な過程について総合的かつ網羅的に解説する。本授業を通して、グラフィックデザインの専門家とコミュニケーションが可能であり、かつ自らがデザイン提案・制作ができるようになる。",
        "outcomesMeasuredBy": "授業終了時の到達目標は、「広くデザインに必要な基礎的知識を有し、特にグラフィックデザインにおいては自らが実践（制作）可能である状態」になることである。また、CG-ARTS協会の「Webデザイナー検定ベーシック」を受験した場合に合格できるようになることである。",
        "learningOutcomes": "分析・評価能力問題解決力",
        "teachingMethod": "毎回の授業で配布する資料、参考書のほかMdN「デザインを学ぶ」シリーズに基づき、スライドを使用してグラフィックデザインとWebデザインの基本事項の解説をする。授業中に解説したデザイン要素を各自のPCを用いて実装し、習ったことを実際に表示して確かめながら基本的なグラフィック作品の制作を体験する（ノートPC必携）。また、毎回授業内小テストを行い、授業時間内に答えを確認するとともに，受講生からの質問についての解説も行う。提出課題として、「タイポグラフィ」・「レイアウト」・「配色」それぞれに関連した計3つの課題作品の制作、および最終課題の制作を各自で進めるようにする。",
        "notices": "授業で強調するキーワードは、グラフィックデザイン・Webデザインの専門家とのコミュニケーション、およびデザイン作業の実践に重要であるため、必ず復習して覚えること。授業で解説する制作手法は、授業以外の時間にも自己学習で身につけること。特に、普段の生活において、自分の身のまわりにある「デザイン」を意識することが重要である。そうすることで、デザインセンスを自ら磨く努力をすること。本科目を修得することによって、授業範囲に関しては色彩検定やCG-ARTS協会のWebデザイナー検定ベーシック相当以上の力がつく。",
        "preparatoryStudy": "予習と復習は必ず行うこと。特に、計3つ出される課題に関しては、積極的に制作に挑戦すること。",
        "gradingGuidelines": "計3つの課題評価と毎回の授業で課す小テストで、計100点として総合成績とする。60点以上を単位認定要件とする。課題に関しては，締め切り後の授業で講評を行う．",
        "textbook": "特に指定はしない．授業に必要な資料は毎回配布する．",
        "referenceMaterials": "●CG-ARTS協会『入門Webデザイン』この教科書はWebデザイナー検定ベーシックの出題範囲である。●CG-ARTS協会『ビジュアル情報表現-ディジタル映像表現・Webデザイン入門-』本書籍は、知的財産権やインターネットなど周辺知識の解説も充実している。●MdN『デザインを学ぶ1～3』本書籍は、グラフィックデザインに必要な基礎的事項の解説が充実している。",
        "courseSchedule": "第1回：本授業に関するガイダンス。自己紹介とmoodleへの使用状況確認も行う。第2回：ビジュアルコミュニケーションの基本－文字組み，タイポグラフィ（タイポグラフィ作品制作，講評）第3回：グラフィックデザインの基本－レイアウト（レイアウトの4要素，グリッドデザイン）第4回：色彩と配色セオリー－色の仕組みと表色系（光の3原色，混色）第5回：色彩と配色セオリー－色彩心理（対比，同化，進出色，後退色）第6回：色彩と配色セオリー－色彩調和理論（PCCS表色系，心理4原色，トーン）第7回：グラフィックデザインのまとめ－色彩と配色",
        "courseDataUpdatedAt": "2024/05/10"
    },
    "updateAt": "2024/08/07"
}