{
    "lectureCode": "MK07101",
    "courseName": "クリエイティブリテラシー",
    "lecturer": [
        "兼松祥央(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "映画、アニメ、ゲーム等の映像コンテンツ制作では、それぞれの形態に応じた多様な制作工程を経て作品が制作されている。しかし、映像である以上、最終的には視聴者に「何をどう見せたいのか」を考えて、カメラで被写体を撮影することが必要となる。そこで本講義では、「魅力的な構図」の考え方を軸に、写真と手書きアニメーションの基礎知識を学ぶ。",
        "outcomesMeasuredBy": "撮影のための基礎知識として、カメラの基本的な構造について理解します。また、写真やアニメーションのための技術・手法の発展に関する歴史的背景および、構図設計に関する基本的な考え方を学び、映像コンテンツ制作の土台となる考え方を身につけます。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "講義では様々な既存作品を題材に、それぞれの作品のねらいやコンセプト、その裏に隠れた工夫、そしてこれらを支える技術について論じます。授業前半では主に写真撮影を題材に、撮影の基礎知識を論じます。授業後半では手書きアニメーションを題材に、構図に大きく関わるレイアウトの考え方を論じます。ノートPC必携。",
        "notices": "映像コンテンツやその撮影方法は、作品によって多様なバリエーションが存在します。また、視聴者に伝えいたいテーマやコンセプトが同じであったとしても、表現のための工夫や技術は無数に存在し、日々生み出され続けています。したがって、本講義はただ講義内容を覚えれば良いということではなく、日頃から様々な作品に対して考察することが重要です。本講義の課題では既存作品の閲覧が必要になるものがあります。DVDレンタルや配信サービス、図書館でのDVD視聴など、既存作品を視聴できる環境をご用意ください。また、授業後半では簡単な絵を描いていただく簡単な演習・課題を含みます。詳細は授業内で案内しますが、筆記用具・ノート（白紙・切り離して提出できるもの・コピー用紙などでも可。タブレットなどのデジタル機器でも可）が必要になります。",
        "preparatoryStudy": "授業内で提示されるテーマにしたがって、予習としてあらかじめ既存作品の閲覧が必要になります（120分程度）。また、復習として閲覧した作品に対する考察をまとめていただきます（120分程度）。",
        "gradingGuidelines": "授業各回で提示されるレポート課題40%+最終課題60％の100点満点とし、60点以上で単位認定します。提出されたレポート課題は一部を授業内で取り上げて解説、ディスカッションする時間を設けます。",
        "textbook": "特に指定しない",
        "referenceMaterials": "",
        "courseSchedule": "１：オリエンテーション（映像の制作工程、映画における構図）２：写真・映像・アニメの歴史（カメラ・オブスキュラ、マグナム・フォト）３：カメラの機能（絞り、シャッタースピード、ISO感度）４：撮影の基礎（カメラワークとライティング）５：レイアウト・作画の基礎（透視図法、フレーミング）６：モーションの基礎（キーフレームと中割り、パース）７：まとめ（授業の振り返りと最終課題説明）",
        "courseDataUpdatedAt": "2025/01/07"
    },
    "updateAt": "2025/03/21"
}