{
    "lectureCode": "MK07401",
    "courseName": "コンテンツ制作工程論",
    "lecturer": [
        "三上浩司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "火4"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "コンテンツ制作には企画から流通に至るまで多くの工程があります．また，完成までには膨大な時間，資金，人材が必要です．したがってコンテンツをいかに制作するか計画を立てること，そしてその計画を円滑に進めることは極めて重要です．コンテンツの制作工程は，そのジャンル（実写，CG，アニメ，Web，ゲーム，音楽・音響など）それぞれに特徴的な部分が存在します．さらに，近年はディジタル技術の進歩により，完成に至るまでの選択肢が多様化し，また最終的な提供形態も様変わりしています．本授業では，実際にさまざまなジャンルのコンテンツがどんな工程を経て制作されているのか理解し，コンテンツ制作のみならず知的制作物の工程に関する考え方を体系的に身につけます．これにより，新たな様式のコンテンツの企画や新技術の活用などの際に，適切な制作工程と管理手法を設計する能力を身につけます．そのため，コンテンツ制作を希望する学生のみならず，幅広い学生に参加を歓迎します．",
        "outcomesMeasuredBy": "制作工程全体を理解し，制作するコンテンツに的確な制作手法を選択し，適切な時間，資金，人材を配分する方法論を身に着けます．具体的には，2年次後期から始まるメディア専門演習におけるグループワークによるコンテンツ制作を実施する場合を想定し，企画立案と制作のマネジメントができるようになることを目差します．",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力",
        "teachingMethod": "講義はさまざまな分野のケーススタディにより進めます．アニメと3Dアニメーション，実写，VFXなどの制作工程と技術変遷，並びにそのマネジメントについて論じていきます．※ノートPC必携",
        "notices": "本講義では，実際のコンテンツ制作の実例をもとに，具体的な制作工程について論じていきます．コンテンツには多様なバラエティがあります．したがってその制作手法や制作工程も多様です．よって，本講義は講義内容を覚えればよいというスタイルの授業ではありません．授業の内容を十分消化してコンテンツ制作の工程を十分理解し，各自が自分の作りたいものを実現するための方法論を身に付けることを目的とします．多くの視聴覚教材を使って授業を進めるので，教材の映写中は背後の学生が見にくくなるので，ノートPCの画面を伏せてください．",
        "preparatoryStudy": "本講義では映像コンテンツやゲームなどを扱います．Youtubeや制作各社のWebサイトにコンテンツの制作メイキングなどが掲載されています．それらを閲覧したり，実際にプレイするなどして当該授業に備えてください（120分程度）．また，各回の授業では課題が提示されます．その課題に取り組むこと（約120分）．",
        "gradingGuidelines": "課題によって評価をします．課題は授業内課題を含め合計で10回程度を予定しています．採点は各課題100点満点で行い，加重平均した上で成績評価します．60点以上が単位取得の目安です．課題に関しては優れた回答や補足説明が必要なものに対し授業内で取り上げて解説します．",
        "textbook": "コンテンツクリエーション（コロナ社）（同書はコンテンツ企画論，コンテンツディベロッピング論でも使用します）",
        "referenceMaterials": "そのほかの参考書は随時提示します．",
        "courseSchedule": "第1回:「アナログアニメーションの制作工程」（フィルム，セル，紙）第2回:「ディジタルアニメーションの制作工程」（画像処理，合成）第3回：「3DCGアニメーションの制作工程」（3DCG，トゥーンレンダリング）第4回：「実写の制作工程」（VFX，デジタル撮影）第5回：「ゲームの制作工程」（リアルタイム，VR）第6回：「工程管理システムとプロダクションパイプライン」（制作管理，コスト管理）第7回：「コンテンツ制作の将来」（R&D，新技術）",
        "courseDataUpdatedAt": "2025/01/31"
    },
    "updateAt": "2025/03/21"
}