{
    "lectureCode": "MK08301",
    "courseName": "人間工学基礎",
    "lecturer": [
        "盛川浩志(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月2",
        "木2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "人間工学は、私たちの日常生活や労働環境に深く根ざした学問分野であり、その応用範囲は多岐にわたる。本講義では、人間工学の基本原理とその多様な応用に焦点を当て、ユーザーに優しい製品の設計、直感的に理解可能なインターフェースやシステムの開発、労働環境の改善など、様々な分野での人間工学の適用を検討する。また、メディアコンテンツの制作や製品設計において、人間工学がどのように役立つかについても考察を行う。この講義の目的は、人間工学の基礎知識を体系的に理解し、その理論と応用を学ぶことである。講義では、人間の身体的特性、認知機能、感覚特性に関する基礎理論の解説を行う。さらに、実際の事例研究と検証方法の紹介を通じて、理論の実践的な適用についても理解を深める。",
        "outcomesMeasuredBy": "本講義の主要な目的は、人間工学の基礎的な枠組みと原理を深く理解し、それらを未来の研究や実践に活かすための基盤を構築することである。授業の到達目標として以下の能力を習得することを期待する。人間工学の基本原理の理解：人間の身体的、認知的、感覚的特性を含む、人間工学の基本的な概念と理論の全体的な理解実験計画法とデータ分析の技術の習得：人間工学研究で用いられる実験計画法の理解と実践能力収集したデータを分析し、有意義な結果を導き出す技術の習得応用能力の養成：理論と実践の統合により、具体的な問題解決における人間工学の応用能力の習得これらの知識と技術を自身の将来的な研究や業務に適用する能力の養成",
        "learningOutcomes": "分析・評価能力問題解決力",
        "teachingMethod": "配布資料やスライドによる講義を基本として授業を行う。資料や課題はネットワーク経由での配信となるため、ノートPCを必携すること。1クォーターで14回の授業を行うため、1コマの授業を週に2回行う形式となることから、回をまたいだ調査やミニ課題などを実施する。また、模擬実験やデータ収集など、簡単な演習課題を授業内で実施する予定である。",
        "notices": "授業内容によっては事前に準備するデータや道具を指示することがある。教員からの連絡を見逃さないように注意すること。",
        "preparatoryStudy": "週2回の授業となるため、復習の重要性が高い。また、次の授業に向けての調査や準備などが必要となる場面も多いことから、継続した取り組みが必要となる。授業資料を見直すなどの復習や、授業内で紹介する事例の調査などの予習などが必要となる。予習復習それぞれ120分程度を想定している。",
        "gradingGuidelines": "授業時に課す調査課題やミニ課題（40%）、期末試験（60%）の合計によって評価する。60点以上で単位認定とする。ミニ課題については適宜授業内でフィードバックを行う。",
        "textbook": "特に指定するものは無い。適宜、資料などを共有する。",
        "referenceMaterials": "「人間工学の基礎」石光俊介・佐藤秀紀（養賢堂）「人間工学ガイド」福田忠彦・福田亮子監修（サイエンティスト社）「心理学基礎実習マニュアル」宮谷真人・坂田省吾代表編集（北大路書房）「誰のためのデザイン？増補・改訂版」D.A.ノーマン著（新曜社）",
        "courseSchedule": "第1回：授業概要説明、人間工学の紹介（ガイダンス、人間工学）第2回：人間の身体的特性（身体寸法、生体計測）第3回：人間の機能的特性（運動機能、作業特性）第4回：身体特性からのデザイン（身体寸法データベース、設計）第5回：人間の知覚特性：視覚（生理的特性、視野）第6回：人間の知覚特性：視覚（応答特性、弁別）第7回：人間の知覚特性：聴覚（生理的特性、音知覚）第8回：人間の知覚特性：その他（触覚、味覚、嗅覚）第9回：知覚特性からのデザイン（認知特性、錯覚）第10回：評価実験（心理物理実験、実験計画法）第11回：評価実験の実践（主観評価、客観評価）第12回：評価実験の解析（分散分析、因子分析）第13回：ユニバーサルデザイン（バリアフリー、プロダクトデザイン）第14回：インタフェースデザイン（メディア、コンテンツ）授業の進度、理解度などから、多少内容を変更する可能性もある。",
        "courseDataUpdatedAt": "2024/01/25"
    },
    "updateAt": "2024/08/07"
}