{
    "lectureCode": "MK09201",
    "courseName": "広告・広報論",
    "lecturer": [
        "藤崎実(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火4"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "国内および外資系広告会社、ソーシャルメディア・マーケティング会社にて、クリエイティブディレクターとして様々な実務（マーケティング、企画、CMや映像制作、クリエイティブディレクション、プロデュース、商品開発、SNS運用など）に関わった「実務経験」に基づく「実践的科目」です。この授業は実務で重視されている「統合マーケティグコミュニケーション（IMC）」に基づき、「広告」や「広報（PR）」に関する基礎的で実践的な知識を養います。広告はマーケティングを実践するためのマーケティング・コミュニケーションと位置付けられています。また世の中のあらゆるクリエイティブ（映像・音楽・グラフィック・デザイン・CG・Webサイト・SNS・イベント・アプリ・イノベーション等）と関連がある分野です。また、広報はパブリック・リレーションズ（PR）と呼ばれ、近年、広告と広報は融合しています。広告や広報を学ぶことはマーケティングやコミュニケーションやクリエイティブの重要ポイントを学ぶことになります。授業で重視しているのはテクニックではなく「知識」や「考え方」の修得です。これからを考えるためには、これまでを知ることが重要です。時代と共に変化してきた広告コミュニケーションや広報（PR）の歴史も学びます。この分野には世界中の先人による知恵が凝縮しています。「広告」や「広報（PR）」を学ぶことは、コミュニケーションの技術を学ぶことです。授業を通じて、あらゆる表現分野に応用できる「考え方」を身につけます。一緒に楽しみながら学んでいきましょう。",
        "outcomesMeasuredBy": "「広告」「広報」分野における基礎的な知識（用語、歴史、体系、事例など）の修得を目標とします。また、普段から身の回りの「広告」「広報」に興味・関心を持ち、授業で得た知見を通じて、それらを分析する習慣（デコンストラクション）を身につけること、コミュニケーション分野における思考力の深耕を目標とします。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力",
        "teachingMethod": "【授業形式：講義】授業は毎回違うテーマを設定し、理論と実務、歴史と現在を行き来させていきます。講義が基本ですが理論に終わらせず、理解を深めて実感として修得しやすいように、事例となる国内外のCMや映像を多数紹介します。日本に加え、広く海外の事例を取りあげて紹介することで、世界的な広告コミュニケーションと広報（PR）の潮流を知っていただきます。世界の事例・CMなどは、インターネット検索で、学生のみなさんも授業後にアクセスして再度、閲覧できるはずです。「広告は時代を映す鏡」と言われます。時代の変化に伴う広告や広報（PR）の変化を知ることにより、柔軟な思考力を育みます。ノートPC必携です。",
        "notices": "「統合広告コミュニケーション論」を履修していると理解がより深まります。",
        "preparatoryStudy": "予習として、シラバスに示された内容をもとに概要を把握し、キーワードや専門用語の意味を理解しておいてください。授業後は、授業内容を復習して講義内容の習得に努めて下さい。予習・復習にはそれぞれ120分程度の時間をかけて下さい。発展的な知識の習得には、自主的な取り組みが不可欠です。普段から身の周りの広告を観察して、企業の意図を分析する習慣を持つことが重要です。",
        "gradingGuidelines": "授業終了後に提出する「授業概要と感想」85％、授業期間中に行う「課題レポート」「理解度チェックテスト」など10％、授業中の発言5%で評価します。100点満点中60点以上で単位認定とします。また、学修内容の定着のため、提出物や課題などに関して、授業やムードルでフィードバックを行います。",
        "textbook": "教科書は使用せず、毎回の授業で資料を配布する予定です。",
        "referenceMaterials": "藤崎実・徳力基彦（著）（2017）『顧客視点の企業戦略』宣伝会議岸志津江・田中洋・嶋村和恵(2017)『現代広告論第３版』有斐閣アルマ石崎徹（編著)（2016）『わかりやすいマーケティング・コミュニケーションと広告』八千代出版ロブ・フュジェッタ(著)、土方奈美(訳)、藤崎実(監修)（2013）『アンバサダー・マーケティング』日経BP社ブルース・バートン（著）、小林保彦（訳）（2005）『誰も知らない男なぜイエスは世界一有名になったか』日本経済新聞社",
        "courseSchedule": "第1回：（オリエンテーション）【IMCと広告コミュニケーション】タッチポイント（タッチポイント、顧客接点マネジメント）第2回：【IMCと広告コミュニケーション】コンシューマーインサイトを知る（インサイト、USP）第3回：【IMCと広告コミュニケーション】コンシューマーインサイトに基づく広告（コンシューマーインサイト、デプス・インタビュー）第4回：【広告と広報の融合】広報（PR）の基礎知識（パブリック・リレーションズ、広報）第5回：【広告と広報の融合】戦略PR\/メディアニュートラル（戦略PR、メディアニュートラル）第6回：【広告と広報の融合】PRのフロンティア（マーケティングPR、パブリック・リレーションズ）第7回：【IMCと広告コミュニケーション】クリエイティブディレクションの重要性（クリエイティブディレクション、クリエイティブディレクター）",
        "courseDataUpdatedAt": "2024\/01\/24"
    },
    "updateAt": "2024\/08\/07"
}