{
    "lectureCode": "MK10101",
    "courseName": "デジタルジャーナリズム入門II",
    "lecturer": [
        "森川美幸(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木4"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "研究棟Ａ３０３"
    ],
    "courceDetails": {
        "courseOverview": "インターネットの普及により、誰もがジャーナリストになれる時代が到来した。新聞やテレビといった旧来のメディアは徐々に衰退し、その存在意義を問われるようになっている。しかし一方で、デジタルニュースの信頼性については疑問符がつくことが多い。殊に個人がSNSなどを使って流布する情報には、誤報や虚報が混ざっていることもある。また、デジタルメディアの多くは広告モデルを基本として収益を得ているため、広告主への忖度が生じる可能性もある。そのような状況で、デジタルジャーナリズムは果たしてジャーナリズムの使命を全うすることができるのであろうか。本講義では、デジタルならではのテクノロジーを使った新たな取材方法やニュースの見せ方を紹介しつつ、デジタルメディアと広告との関係性や、一見正しく見えるビッグデータを用いた情報を鵜呑みにすることの危険性についても言及していく。",
        "outcomesMeasuredBy": "大手メディアから個人発信のものまで、さまざまな情報が溢れている現在、どの情報が正しく、どの情報が間違っているかを判断するのは至難の業である。しかし、ジャーナリズムに関する知識があれば、メディアリテラシーを高める足掛かりとなるのは間違いない。本講義では、普段触れているジャーナリズムの裏側を学ぶことで、ニュースの信頼性を見極めるスキルを獲得することを目指す。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力",
        "teachingMethod": "基本的には講義形式で行うが、授業内で課題を出し、回答する時間を設ける。課題の出題・回答にはMoodleを利用するので、ノートPC等Moodleにアクセスできる機器を必ず持参すること。",
        "notices": "本講義では積極的な履修姿勢を求める。",
        "preparatoryStudy": "予習として、普段自分か見ているメディアの情報が、果たしてどのような意図で書かれ、どの程度信頼が置けるものなのか考えながら見てみること。さらに、海外メディアを含め、普段自分が見ないメディアの情報も積極的に見るようにすること。復習として、毎回宿題を課すので、自分の意見を自分の言葉で書いて提出すること。生成AIの使用不可。予習・復習時間はあわせて60分を目安とする。",
        "gradingGuidelines": "授業内で課す複数回の課題40点と宿題20点、授業内での発言等の貢献10点および期末レポート30点の合計100点のうち，60点以上を単位認定基準とする。課題等へのフィードバックは、授業内またはMoodle等を活用して適宜行う。",
        "textbook": "指定しない。",
        "referenceMaterials": "佐々木和郎・羽田久一・森川美幸「メディア学大系14クリエイターのための映像表現技法」コロナ社その他、適宜指示する。",
        "courseSchedule": "第1回：デジタルジャーナリズムのコンテンツ（ニュースルーム、報道価値、モバイルジャーナリズム）第2回：ジャーナリズムとテクノロジー（AI、ボット、ドローン・ジャーナリズム）第3回：データジャーナリズム（ビッグデータ、データビジュアライゼーション、インフォグラフィックス）第4回：メディアと広告（ネイティブ広告、アドバトリアル、インフィード広告）第5回：起業ジャーナリズム（ビジネスモデル、クラウドファンディング、フリーランス）第6回：報道メディアとしてのラジオ（ラジオ・ジャーナリズム、ポッドキャスト、タイムシフト）第7回：まとめと復習（デジタルジャーナリズム、総括）",
        "courseDataUpdatedAt": "2025/01/20"
    },
    "updateAt": "2025/03/21"
}