{
    "lectureCode": "MK10001",
    "courseName": "デジタルジャーナリズム入門I",
    "lecturer": [
        "森川美幸(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木4"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "研究棟Ａ３０３"
    ],
    "courceDetails": {
        "courseOverview": "デジタル時代の到来と共に、従来のビジネスモデルや勢力図が一変したのはテレビや映画といったエンタテインメントメディアだけではない。新聞をはじめとするニュースメディアも同様である。インターネット普及前は、新聞記者やジャーナリストら、マスメディアに従事する少数の送り手が、多数の受け手に対してニュースコンテンツを提供していた。しかし、誰もがSNSや動画共有サイトを使って無料でコンテンツを発表できるようになった今、マスメディアの存在価値は見え辛くなり、新聞・雑誌といった旧来メディアの市場規模は下降の一途を辿っている。そんなデジタル時代に、組織としてのニュースメディアが生き残る道はどこにあるのか。一方で、テクノロジーの進化を背景に、新しく誕生したネットメディアや個人ジャーナリストは、どのような形でその存在意義を高めていくのだろうか。本講義では、デジタルへとシフトしていく現代ジャーナリズムの状況を俯瞰しながら、これからのジャーナリズムの意義と可能性を考える。",
        "outcomesMeasuredBy": "ジャーナリズムのデジタル化は非常に今日的なテーマであり、メディアの情報が世論形成に与える影響を鑑みても極めて重要なトピックである。本講義を通し、新聞やテレビといったレガシーメディアから、インターネットを利用するデジタルメディアに移行しつつある現代ジャーナリズムの基本的な知識を学び、ジャーナリズムという観点から我々が生きる社会について深い洞察ができるようになることを目指す。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力",
        "teachingMethod": "基本的には講義形式で行うが、授業内で課題を出し、回答する時間を設ける。課題の出題・回答にはMoodleを利用するので、ノートPC等Moodleにアクセスできる機器を必ず持参すること。",
        "notices": "本講義では積極的な履修姿勢を求める。",
        "preparatoryStudy": "予習として、日常的に新聞やテレビといった旧来のマスメディアと、ウェブメディアとの違いを意識しながら、ニュース記事や報道番組、X（旧Twitter）等SNSで話題になっているトピックとその報道方法を見てみること。また、毎回復習を兼ねて宿題を出すので、自分の意見を自分の言葉で書いて提出すること。さらに、学んだことを整理すると共に、日常生活の中でデジタルジャーナリズムがどのように活用されているか意識的に観察すること。予習・復習時間はあわせて60分を目安とする。",
        "gradingGuidelines": "授業内で課す複数回の課題40点と宿題20点、授業内での発言等の貢献10点および期末レポート30点の合計100点のうち，60点以上を単位認定基準とする。課題等へのフィードバックは、授業内またはMoodle等を活用して適宜行う。",
        "textbook": "指定しない。",
        "referenceMaterials": "佐々木和郎・羽田久一・森川美幸「メディア学大系14クリエイターのための映像表現技法」コロナ社その他、適宜指示する。",
        "courseSchedule": "第1回：デジタルジャーナリズムとは何か（ジャーナリズムの定義、コメント・スレッド、報道倫理）第2回：デジタル報道メディア１（レガシーメディア、デジタル・シフト）第3回：デジタル報道メディア２（新興メディア、市民ジャーナリズム、非営利ジャーナリズム）第4回：バイラルメディア（BuzzFeed、SNS、クリックベイト）第5回：ジャーナリズム文化の変容（X、Facebook、フェイクニュース）第6回：デジタルジャーナリスト（ソーシャルメディア、ブログ、ウィキリークス）第7回：デジタルジャーナリズムの顧客（エンゲージメント、デ・コレスポンデント、サブスクリプションモデル）",
        "courseDataUpdatedAt": "2025/01/20"
    },
    "updateAt": "2025/03/21"
}