{
    "lectureCode": "MS02307",
    "courseName": "メディア専門演習II[CreatewithAI]3Q",
    "lecturer": [
        "菊池司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本授業のテーマは「AIのしくみと活用方法をしっかりと理解する」ことである。最初にAIの定義と基礎知識を学び，GANを中心とした生成モデルについてアルゴリズムを含めて学ぶ．その後，画像生成AIとChatGPTのしくみとビジネスへの応用法に関して学ぶ．画像生成AIの全体像をわかりやすく理解できるように，画像生成AIの歴史，技術的なしくみと使い方，著作権に関する議論に関しても解説する．またStableDiffusionといった個別のサービスを実際に使用しながら，その特徴などを把握する．ChatGPTでは，Excelと組み合わせることによってビジネスに活用できる手法を紹介する．本授業を通して，AIと共生する未来のイメージを持ち，自分の仕事や生活がより便利に，より楽しくなる活用術を身に付けることを目指す．",
        "outcomesMeasuredBy": "本授業の到達目標は「プロンプトエンジニアリング」の能力を身に付け，実務を効率的に遂行できるようになることである．人間がAIに命令や依頼をする文章のことを「プロンプト」という．AIを上手に使いこなせる人は，プロンプトを作るのが上手な人ともいえる．AIから適切な回答を得られるようにプロンプトを工夫することを「プロンプトエンジニアリング」という．本授業は，AIへの命令文を考える力を身に付け，AIをより効果的に活用することができるようになることが目標である．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本授業のテーマは「AIのしくみと活用方法をしっかりと理解する」ことである。最初にAIの定義と基礎知識を学び，GANを中心とした生成モデルについてアルゴリズムを含めて学ぶ．その後，画像生成AIとChatGPTのしくみとビジネスへの応用法に関して演習を通して学ぶ．すなわち，演習のみではなく，アルゴリズムの学習も通して，AIの活用方法を身に付ける．",
        "notices": "演習で使用するソフトウェアは，日常から頻繁に使用する（トレーニングする）ようにすること．授業で解説する手法は、授業以外の時間にも自己学習で身につけること．",
        "preparatoryStudy": "復習は必ず行うこと．また，適宜課題を課すので，必ず次回の授業までに行ってくること，および事前調査を行うこと．事前に配布されている授業資料を使用し，予習を30分程度以上の準備学習を行うこと．また，受講した内容に関しては30分程度以上の復習や課題に取り組むこと．",
        "gradingGuidelines": "第3回授業で課す中間課題（40点），第7回授業で課す最終課題作品（60点）を合計100点満点として評価する．中間課題，および最終課題作品に関しては，授業中に適宜講評を行う．",
        "textbook": "特に指定はない．本演習用に作成した資料を配布する．",
        "referenceMaterials": "特になし．",
        "courseSchedule": "第1回：担当講師の紹介，およびシラバスに基づき講義内容を説明する．また，授業内で使用する予定であるソフトウェアなどの確認も行う．第2回：AIの定義：AIには決まった定義はないため，「大量のデータからパターンを見つけ出す技術」というイメージを押さえたうえで，幅広い分野にわたる技術であることを解説する．第3回：自然言語処理の手法とモデル：人間が用いる曖昧な表現や複数の意味やニュアンスをもつ言葉などを，コンピュータで適切に扱うための手法に関して解説する．第4回：画像生成AIサービス演習：MidjourneyやStableDiffusionなどの代表的な画像生成AIサービスの特徴や具体的な使い方について，演習を通して解説する．第5回：ChatGPT演習：ChatGPTを使用して，実際に文章を作成する．自身が求める文章を得るための質問の仕方，生成された文章のファクトチェックの重要性，および画像生成AIなどとの連携について解説する．第6回：ExcelとChatGPT演習：Excelを使用する際に知りたいことをChatGPTに質問する方法を演習を通して解説する．第7回：最終課題制作と講評",
        "courseDataUpdatedAt": "2025/03/03"
    },
    "updateAt": "2025/03/21"
}