{
    "lectureCode": "MS02101",
    "courseName": "メディア専門演習II[コミュニケーション・データの作成法]1Q",
    "lecturer": [
        "榎本美香(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "コミュニケーションには様々な場面がある。対面で行う会話だけでなく、コンビニやスーパーでの買い物やレストランにおける注文、ボードやネットワークを介した他者とのゲームなど、人と人が何か言葉や視線や振る舞いをやり取りする時、そこにコミュニケーションが生まれる。本演習では、こういった様々な場面における人間どうしのコミュニケーションを分析する手法を学ぶ。人は会話をするとき、言葉だけでなく、視線・姿勢・身振り・表情などさまざまな非言語情報を駆使してコミュニケーションを行なっている。それらの情報はそれぞれどのように相互にリンクして用いられているのか。(1)実際の会話を収録し、(2)その中で人々が用いている様々なコミュニケーションのための言葉や非言語行動を記号情報として書き起こす。",
        "outcomesMeasuredBy": "•日常的に人々が行なっているコミュニケーションを分析する科学的手法を学習する•言語、視線、姿勢、身振り、表情などがそれぞれどのような情報をビデオデータや音声データとして収録する手法を学ぶ。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "4,5人のグループごとにあるコミュニケーション場面を収録し、そこに表れている言葉や視線・身振りの詳細をアノテーションソフトELANを用いて書き起こす。毎回、演習開始時にその日習得すべき技術を解説し、それに沿って各グループで演習を行う。ノートPC必携。",
        "notices": "演習は実際に出席して毎回の課題を完成させることに意味があるので、毎回出席すること。またデータのアノテーションは非常に細かい作業が続くことになるので根気のある人材に限る。",
        "preparatoryStudy": "1年次メディア基礎科目「言語コミュニケーション分析入門」を受講していることが望ましい。受講していない場合は、授業資料を見て予習しておくこと(120分程度)。また、毎回授業の中で課題を出すので、復習しながらそれを解くこと(120分程度)。",
        "gradingGuidelines": "毎回提出してもらう課題の質、提出状況、並びに最終発表の精錬度により評価する。なお各回の問題の解答例などのフィードバックは毎回締切後に行う。•提出課題:80点•最終発表:20点(計100点満点で60点以上を単位認定要件とする)",
        "textbook": "榎本美香・相川清明・飯田仁著メディア学大系「４巻マルチモーダルインタラクション」、コロナ社。",
        "referenceMaterials": "坊農真弓・高梨克也編(2009)「多人数インタラクションの分析手法」オーム社",
        "courseSchedule": "第１回:データの収集計画:どのような場面をどのような設定で収録するかを計画する第２回:データの収集:ビデオカメラを用いてコミュニケーション場面を収録する第３回:データの読み込み・編集:映像編集ツールAdobePremiereを用いてデータをPCに取り込み、音声情報を手がかりに複数カメラの同期映像を作成する第４回:書き起こし計画:グループ別に収録したデータの書き起こし計画をたてる第５回:言語情報の付与：言語的単位に基づく発話の書き起こしを行う第６回:非言語情報の付与：視線・ジェスチャ・身体の向きなどの非言語情報の分節化と書き起こしを行う第７回:作成データの発表:グループごとに作成したコミュニケーション・データの発表を行う",
        "courseDataUpdatedAt": "2025/02/20"
    },
    "updateAt": "2025/03/21"
}