{
    "lectureCode": "MS03317",
    "courseName": "メディア専門演習III[ゲームドキュメンテーション]3Q",
    "lecturer": [
        "三上浩司(メディア学部メディア学科)",
        "安原広和(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "ゲーム内容を説明するドキュメントは、ゲームをプレゼンテーションする時の極めて重要な制作物の一つです。手短かな説明文と絵で直感的にクライアント、コンシューマの人々にビデオゲームの骨格を伝えるドキュメントの制作手法や企画書などのテンプレートが存在します。ゲームアイデアのコンペティションに用いられるペラコンなど1枚の企画書でゲームの大まかな概要を説明する方法や、その次の段階となる具体的な操作方法、画面構成やUI、世界設定などを加えた5ページほどの企画書類の用意などがゲームデザイナーに課せられた初歩的な業務となります。近年のゲームを取り巻く環境の変化から、コンシューマゲーム専用機用のゲームの説明書類や、スマートフォン向けのゲームなどの説明書類に求められるMAU値の推定など、ゲームを発信するメディアによりドキュメントに求められる内容も多様になってきています。本演習ではゲームデザイナーとしての実務経験を活かし、ゲームの説明に求められる内容を簡潔にドキュメント化する手法、書かれていなければならない内容、図版の特性などを理解し、直感的に先方に伝わるゲームのドキュメンテーション手法を、自らデザインしたゲームをプレゼンテーションするために実際に自らが制作して、参加者全員で評価しあう実践的なゲームドキュメンテーション制作の授業です。",
        "outcomesMeasuredBy": "クライアントやコンシューマの方々、見る側からの視線の移動、適切な図版の用法、使うフォントの選定、文字数などを理解し、ゲーム業界で働くことを前提にゲーム企画の基礎的な伝達すべき要素を組み入れながら、自らのゲーム企画アイデアを高いクオリティのドキュメントにまとめることを目標としています。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本演習は，個人が自分のゲーム企画をドキュメントにまとめる実際の企画書制作を行います。その過程で、グループ内でブレインストームを行うことや、参加者からのフィードバックを受けて、企画に仕立てるなどのアクティビティを取り入れます。授業内では、ゲーム企画に関するパワーポイントによるプレゼンテーションを行い、ゲームの特徴と、内容、世界観などの要素を分かりやすく伝えるプレゼンテーション能力も同時に養います。想定として，東京ゲームショウや各種ゲームエベントに出展するためのゲームの複数の企画を提案し，参加者はそれらを評価、分析，議論を経て，ブラッシュアップしながら授業を進めます。※ノートPC必携",
        "notices": "短い期間でゲームの企画書を作り上げていく演習なので、自分の主観や主張だけでなく、大勢の人がプレイするゲームのアイデアとしての評価も加わります。他の参加者からのフィードバックを聞いて自分の企画を批評的視点から改善していくことになります．各回の授業の冒頭では，発案したゲーム企画のプレゼンテーションを行ってもらうので、そのための準備をしてください（予習120分程度）各回の講義内容に沿って，自分のゲーム企画書を改善する作業があります（復習120分程度）",
        "preparatoryStudy": "日ごろから様々なエンタテインメントコンテンツや説明している文章、図版に興味を持ち，それらを分析して他の履修者にプレゼンできるようにすること。(120分以上）Unity社が提供しているチュートリアルと「あそびのデザイン講座」、またはYouTubeに上がっているUnityのチュートリアルなどを見ておくとよいです。(120分以上）",
        "gradingGuidelines": "提出された課題のプレゼンテーション作品で授業の成績評価とします。課題とされた要点を踏まえた資料としての評価（40％）ゲームとして成り立つアイデアとしての評価（40％）、授業での積極的な発言などの評価（20％）として100点満点中60点以上で単位認定とします。",
        "textbook": "特にないが、市販のゲーム企画書の参考書など適宜指示します。",
        "referenceMaterials": "",
        "courseSchedule": "第1回：「ゲーム企画の発想」第2回：「ゲームの発展性ーブレインストーム」第3回：「ゲームを具体化してまとめる（レベルデザイン）」第4回：「様々なメディアに対しての企画」第5回：「企画書の画面構成」第6回：「マーケティングを考える」第7回：「プレゼンテーション」",
        "courseDataUpdatedAt": "2025/03/05"
    },
    "updateAt": "2025/03/21"
}