{
    "lectureCode": "MS03406",
    "courseName": "メディア専門演習III[プロフェッショナルモーションデザイン]4Q",
    "lecturer": [
        "川島基展(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火",
        "火2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本演習では、アニメやゲーム、バーチャルライブなどの商業アニメーションコンテンツ制作を前提とし、モーションキャプチャを用いて良質なキャラクタアニメーションを制作するための知識と技能を習得することを目的とします。アニメーション制作全体ではなく、キャラクタのモーションデザインについて集中的に学び、こだわりの作品を目指します。",
        "outcomesMeasuredBy": "モーションキャプチャ技術とモーションデザインの基礎を理解し、それを活かしたCGアニメーション制作ができるようになる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "グループワークで30秒程度のショートアニメーション作品を制作します。演習では、作品制作に必要なモーションキャプチャシステムやCGソフトウェアの扱い方だけでなく、キャラクタアニメーションのこだわりのポイントや、それらを実践するためのレクチャーを行います。プロジェクト演習等でのCG制作経験の有無に応じてグループワークでの役割分担をしますので、各自の力量に応じたスキルアップをはかることができます。アニメーション工程に集中しますので、原則としてモデリングなどは行いません。ノートPCの持参は必須ではありません。",
        "notices": "必須ではありませんが、メディア専門演習[バーチャルライブコンテンツ制作]と併せて履修することで、モーションキャプチャを活用した映像コンテンツ制作について深く学ぶことができます。また、「ディジタル映像表現基礎論」などの講義や、プロジェクト演習の映像コンテンツ制作系の演習を履修していると、本演習の理解がさらに深まります。プロジェクト演習等でのCG制作経験は問いません。アニメーション制作に興味があれば、どなたでも履修可能です。ただし、課外時間に授業の復習やグループワーク作業にしっかり時間を割けるよう、準備をしてください。決して楽に取り組める授業ではありません。",
        "preparatoryStudy": "毎回の授業に際しては、次のような予習・復習を合わせて120分程度行うものとします。予習：グループワーク・制作課題の取り組みにつき、作業報告と今後の計画について報告するための準備を行う復習：授業の内容を十分に復習のうえ、ソフトウェアのオペレーションについては実際に反復練習を行い、技術の定着を図ること。",
        "gradingGuidelines": "次の項目により、成績を評価します。・企画書・設定書の完成度：20点・作品の完成度：50点・授業態度・グループワークへの貢献度：30点総合点60点以上かつ，期限までに、企画書・仕様書どおりに作品を提出することが、単位認定の最低要件になります。",
        "textbook": "本演習で独自に作成したテキストを使用します。",
        "referenceMaterials": "新旧問わず、あらゆるアニメーション作品、ゲームコンテンツ等を参考にしてください。",
        "courseSchedule": "第1回:オリエンテーション、企画立案、チーム編成第2回:モーションキャプチャによるアニメーション制作体験、プリプロダクション第3回:モーションデザイン実習第4回:モーションキャプチャ撮影①（前半2チームぶんの撮影）、課題制作第5回:モーションキャプチャ撮影②（後半2チームぶんの撮影）、課題制作第6回:シーン構築第7回:作品発表会・講評",
        "courseDataUpdatedAt": "2025/02/25"
    },
    "updateAt": "2025/03/21"
}