{
    "lectureCode": "MS03102",
    "courseName": "メディア専門演習III[ストーリー構造設計]1Q",
    "lecturer": [
        "兼松祥央(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月",
        "月2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "映画やアニメといったエンターテイメントを目的とするメディアコンテンツにおいて、ストーリー・物語はコンテンツの根幹をなす非常に重要な要素である。クリエイターがコンテンツを通じて視聴者に伝えたいテーマや印象は、企画意図・演出意図として作品制作に反映されるが、そのほとんどはストーリーを中心に設計され、キャラクターを通じて視聴者に伝達される。したがって、シナリオライターとして制作に参加する場合はもちろん、その他の役割で参加する場合であっても、ストーリーの構造を的確に把握できる能力は、作品に対して深く理解するためにも重要な素養である。また、物語の構造は、ほとんどのエンターテイメント作品で共通的に見られる構造と、作品のジャンルやテーマによって使い分けられる構造の２種類に分類できる。共通的な構造とは、視聴者が物語を理解しやすくするための工夫である。また、使い分けられる構造とは、それぞれのジャンルに求められるニーズに応えるための工夫であり、作品ごとの特徴を表現するための工夫であるとも言える。そこで本演習では、さまざまなジャンルの映像作品における物語の構造的特徴を学び、これを活用した物語作りの手法を身につける。",
        "outcomesMeasuredBy": "既存作品における物語の構造を理解し、作品のジャンルやテーマを踏まえた物語上の工夫を見抜く力を養うことを目標とする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "各回のテーマごとに該当する既存作品の物語やその構造の解説と、解説した構造を用いた物語制作の実習を行う。実習パートは個人作業が主体ではあるが、一部グループディスカッションやグループ作業を含む。",
        "notices": "各回の課題は授業内でも制作時間を確保するが、授業時間以外での作業も必要になることを念頭におくこと。また、各回の授業内ではテーマに合わせた既存作品を確認しながら講義する。しかし、課題に取り組むためには授業時間外でも”授業で指定する作品”を視聴することが必要になる。作品自体の貸し出しは不可能であるため、あらかじめ大手配信サービス（アマプラ、Netflix等）、またはDVDレンタルなどの手段を確保・これに関する利用料金などの想定をしておくこと。ただし、指定作品が全ての大手配信サービスで視聴可能ではない場合もあるため、受講生が契約している配信サービスなどで視聴可能な代替作品の検討などは、受講生と相談の上で行う",
        "preparatoryStudy": "予習として授業で指定する作品の視聴（120分程度）、復習として授業内で解説した物語構造を用いたストーリー制作の実践・授業時間内で完成しなかった資料制作（120分程度）が必要となる",
        "gradingGuidelines": "授業内での実習への取り組み：40%、最終発表：30％、最終課題（提出物）：30%で評価し、100点満点中60点以上で単位認定する。演習で制作した作品・課題については、授業内で適宜講評・フィードバックを行う。",
        "textbook": "指定しない。",
        "referenceMaterials": "三上浩司、戀津魁、近藤邦雄、茂木龍太、兼松祥央：メディア学大系３コンテンツクリエーション（改訂版）、コロナ社",
        "courseSchedule": "第1回：オリエンテーション・物語構造の基礎第2回：アクション・ミステリーの構造第3回：SF・ファンタジーの構造第4回：悲劇の構造第5回：恋愛・ラブコメの構造第6回：オリジナル作品制作第7回：最終発表",
        "courseDataUpdatedAt": "2025/03/03"
    },
    "updateAt": "2025/03/21"
}