{
    "lectureCode": "MS03424",
    "courseName": "メディア専門演習III[3Dプログラミング]4Q",
    "lecturer": [
        "渡辺大地(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火",
        "火2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "このテーマでは、リアルタイム3Dグラフィックスアプリケーションをプログラム言語を用いて開発する技術を習得することを目的とする。近年、PC上のグラフィックスハードウェアは目覚ましい発展を見せ、リアルタイム3D処理が安価なPC上で動作することが当たり前となっている。また、コンシューマ用ゲーム機にも高性能な3Dハードウェアが搭載されるようになり、3Dグラフィックスプログラミングは(特にゲームにおいて)一般的な技術となっている。しかし、3Dプログラミングはある程度高度な数学的素養とAPIに関する知識が要求されるため、決して敷居の低いものではない。本テーマでは、リアルタイム3DCGで要求される素養の初歩を学び、C#クラスライブラリを用いて実際に演習を行う。なお、本テーマを選択する前に「C#プログラミング」を履修しておくと、より効果的な学習効果が期待できる。",
        "outcomesMeasuredBy": "3Dクラスライブラリの基本的な利用方法を習得し、それを用いて自ら企画したコンテンツを制作できるようになることを目標とする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "学期前半では、基礎技術の習得と演習を各自所有のノートPCを用いて行う。具体的には、開発環境の習得、座標系と座標変換、CGにおける質感表現法、三次元形状表現法といったものが主な学習内容である。学期後半では、これらの技術を用いて自分なりの独自アプリケーションの構築を試みる。最終週では作品の発表会(プレゼンテーション)を行う。授業参加の際には毎週必ずノートPCを持参すること。",
        "notices": "事前にPCの空き容量を10G程度確保しておくこと。",
        "preparatoryStudy": "本科目は、各単元ごとに内容を理解していないと、先の単元の内容の理解が困難あるいは不可能な場合が多い。毎回課す演習課題は必ず次回受講までに取り組むこと。また、わからなかった問題については必ず解答を参照し、解法を理解しておくこと。毎回あたり90分程度を目安とする。毎回の授業ごとに、「事前学習」の項目を提示する。具体的には、事前に行う設定や入力について解説するので、毎回の授業の前に参照し、実施しておくこと。毎回30分程度を目安とする。本科目で使用するC#言語については、あまり授業内で解説は行わないので、C#言語に関する知識が不足している場合は自身での独習が必要となるかもしれない。C#言語の知識に自信がない学生については、このテーマの履修前に「C#プログラミング」テーマの履修を推奨する。",
        "gradingGuidelines": "前半に出す課題を30%、最終作品に対し70%の割合で総合点を算出する。総合点が基準点を満たした場合に単位を認定する。また、総合点により成績評価も決定する。提出物に対しては、授業内でフィードバックを行う場合もある。",
        "textbook": "授業中に配布する。",
        "referenceMaterials": "特に指定しないが、C#や数学に関する参考書を各自で調達しておくこと。(Webによる解説でも構わない。)",
        "courseSchedule": "第1回:演習内容解説と環境構築第2回:3Dプログラミングの基礎第3回:干渉判定演習第4回:運動のプログラミング第5回:最終作品企画第6回:最終作品開発第7回:最終課題発表",
        "courseDataUpdatedAt": "2025/02/19"
    },
    "updateAt": "2025/03/21"
}