{
    "lectureCode": "MS03306",
    "courseName": "メディア専門演習III[バーチャルライブコンテンツ制作]3Q",
    "lecturer": [
        "川島基展(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火",
        "火2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本演習では、バーチャルライブコンテンツの制作実習を通じて、モーションキャプチャ、リアルタイムCG、xRなどの技術を次世代のライブエンターテインメントに活用するための知識と技能を習得することを目的とします。",
        "outcomesMeasuredBy": "バーチャルライブコンテンツ制作の基礎技術を理解し、それを活かしたCGアニメーション制作ができるようになる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "グループワークで小規模なバーチャルライブコンテンツを制作します。演習では、ゲームエンジン(Unity)上でリアルタイムに動作するCGキャラクタを構築し、透過スクリーン、プロジェクタ、モーションキャプチャなどの機器を用いてリアルタイムバーチャルライブを実現するための技術を学習します。作品制作に必要なCGソフトウェアや機器の扱い方だけでなく、訴求力のあるライブ演出のためのこだわりのポイントをレクチャーします。ノートPCの持参は必須ではありません。",
        "notices": "事前に修得しておくべき科目は、とくにありません。プロジェクト演習等での経験は問いませんが、あくまでクリエイターとしてモーションキャプチャ、リアルタイムCG、xRなどの表現技術を習得するための演習授業です。コンテンツ制作は決して楽ではありませんし、相応の専門技能を身につける必要があります。単にVTuberコンテンツやバーチャルライブコンテンツが好きだという方には全く向きませんのでご注意ください。課外時間に授業の復習やグループワーク作業にしっかり時間を割けるよう、準備をしてください。",
        "preparatoryStudy": "プロジェクト演習の映像コンテンツ制作系の演習を履修していると、本講義の理解がさらに深まります。同時期に開講される「ディジタル映像表現基礎論」の履修もお勧めします。毎回の授業に際しては、次のような予習・復習を合わせて120分程度行うものとします。予習：グループワーク・制作課題の取り組みにつき、作業報告と今後の計画について報告するための準備を行う復習：授業の内容を十分に復習のうえ、ソフトウェアのオペレーションについては実際に反復練習を行い、技術の定着を図ること。",
        "gradingGuidelines": "次の項目により、成績を評価します。・企画書・設定書の完成度：20点・作品の完成度：50点・授業態度・グループワークへの貢献度：30点総合点60点以上かつ，期限までに、企画書・仕様書どおりに作品を提出することが、単位認定の最低要件になります。",
        "textbook": "本演習で独自に作成したテキストを使用します。",
        "referenceMaterials": "新旧問わず、あらゆるライブ事例、映像作品などを参考にしてください。",
        "courseSchedule": "第1回:オリエンテーション、企画立案、チーム編成第2回:バーチャルライブ体験、プリプロダクション第3回:バーチャルキャラクタ制作実習①Unityの基礎学習第4回:バーチャルキャラクタ制作実習②キャラクタセットアップ、モーションキャプチャ設定第5回:バーチャルキャラクタ制作実習③ステージ設定、インタラクションの実装第6回:バーチャルキャラクタ制作実習④バーチャルライブシステムの構築第7回:作品発表会・講評",
        "courseDataUpdatedAt": "2025/02/25"
    },
    "updateAt": "2025/03/21"
}