{
    "lectureCode": "MS10501",
    "courseName": "ヒューマンコンピュータインタラクション論",
    "lecturer": [
        "太田高志(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "月4"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "ヒューマンコンピューターインタラクションとは、人がコンピューターを使用するときの相互作用の様々な局面を扱うものです。例えば、マウスやキーボードなどのコンピューターを操作するための装置や、ソフトウェアを操作するための画面のデザインなどをコンピューターのユーザーインターフェースと呼びますが、本講義では、それらを介してのやりとりにどのような意味があり、どのように設計するかという面に重きをおいて解説します。また、そうしたやりとりのデザインによって実現できるアイデアを議論いたします。コンピューターは登場以来、サイズや性能の変化と共にその用途も大きく変化をしてきました。それに伴ってコンピューターと人との関わりかたも大きく変わり、いまやタブレットPCやスマートフォンとして、いつでも、どこでも、色々な用途で利用されるようになりました。このような変化は、コンピューター自体の変化だけでなく、生活における様々な場面や対象に対する人の意識にも影響を与えています。本講義では、そうしたものがどのように変遷してきたのか、またどのように進んでいくのかについても扱います。",
        "outcomesMeasuredBy": "デジタル機能のデザインについて、UX（ユーザーエクスペリエンス）の観点から分析したり議論したりできる能力を育むことを目標とする。また、そうした考察の視点は、コンピューター以外の様々な事象に対しても有効であり、そうした応用ができる視点の獲得も期待する。将来のコンピューターの利用について自分なりのビジョンを描けるような教養を身につけることも目標のひとつである。",
        "learningOutcomes": "国際的な教養分析・評価能力",
        "teachingMethod": "講義形式の授業を行います。また、授業中にワークシート課題に取り組むことで、講義の理解の確認をしながら進行いたします。ワークシート課題はGoogleFormを利用するため、ノートPCが必要です。ワークシートの内容については翌週の講義中に、回答のいくつかを紹介しながらその問に対する考え方を解説いたします。",
        "notices": "講義を受け身的に「聞く」だけではなく「考え」てください。授業はこの授業専用の手書きのノート一冊を用意し、授業の内容を自分の理解や考察内容を交えて書いてください。",
        "preparatoryStudy": "前回までの講義内容の理解を背景として、新しい回の講義内容の位置づけができるように準備してきてください（予習120分程度）。受講後は、自分自身の理解によってノートに再構成して図解すると良いでしょう。また、講義でとりあげられた概念について、具体的な事例を探し、あてはめて自分なりの説明ができるか試してください（120分程度）。",
        "gradingGuidelines": "ワークシート（講義時間内に記入し、講義の最後に提出する：３０点満点）、講義内容の理解度チェックへの記入（オンラインで実施、７０点満点）の合計により評価いたします。６０点以上で単位認定といたします。",
        "textbook": "指定しない",
        "referenceMaterials": "＊「人とコンピュータの関わり」太田高志、コロナ社＊「融けるデザイン」渡邉恵太、BNN＊「誰のためのデザイン？」D.A.ノーマン、新曜社等",
        "courseSchedule": "第1回:ガイダンス、イントロダクション、ユーザーインタフェースとは（UI、入力、出力）第2回:インタラクティブとは（インタラクション、インタラクティブ性の活用）第3回:対話性の拡張（人間中心の対話方法、VR）第4回:インタフェース化する世界（センサー、AR、タンジブルインタフェース）第5回:対話から体験へ（UX、コンテキスト、UXの評価)第6回:体験を創る（メディアアート、広告、楽しさの利用）第7回:持ち運ぶコンピュータ（モバイルデバイス、ウェアラブル・コンピュータ）",
        "courseDataUpdatedAt": "2025/01/28"
    },
    "updateAt": "2025/03/21"
}