{
    "lectureCode": "P0229181",
    "courseName": "プロジェクト演習III[デジタルキャラクターメイキング]",
    "lecturer": [
        "兼松祥央(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "アニメーションにおけるキャラクターは、絵を描くという行為において、よくイラストと混同されます。しかし、キャラクターはある世界観の中に生きる存在であり、そのビジュアルの背景には設定やストーリーが存在します。本演習では、既存キャラクターの分析・評価を通じて、キャラクターの構造を理解するとともに、実際にキャラクターを制作することを目的としています。本演習を通じて、映像コンテンツのためのキャラクター制作の手法と制作技術を身に付けるとともに、キャラクター制作ができることを目標とする。",
        "outcomesMeasuredBy": "本学で研究開発し，学外のセミナー等でも活用実績のある手法を用いたキャラクターメイキングを学ぶ．制作の途中経過を含めて授業内で発表・ディスカッションを繰り返し，テーマやニーズに基づいたキャラクターづくりを学ぶ．また、ただキャラクターを作るだけではなく，既存のキャラクターの魅力を分析し，キャラクター制作に活用する手法を習得する．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "【授業形態：演習】前半はキャラクターの研究や構造を学び、分析・調査を行います。後半は、実際にプロットや登場人物設定を作成して、独自のキャラクター制作を行います。毎週１回、授業・ミーティングを行います。ノートPC必携授業は基本的に「授業計画」欄の流れで実施しますが、過年度からの継続履修者など、すでにプロット制作を十分に習熟している履修者には、別途シナリオ執筆用の演習・課題を提供します。",
        "notices": "本演習の課題は授業時間内で終わるわけではないため、しっかりと時間を取り、予習・復習・制作を十分に行うこと．また，既存映像作品を分析するため，オンライン配信サービスやDVDレンタル，図書館での映像コンテンツ視聴など，既存作品を繰り返し視聴する環境を受講生自身で用意する必要があります．本演習は全てのセメスターで開講していますが，特に履修の順番に制限はありません（後期からでもスタートできます）．ただし，前期では制作手法の解説や既存作品の分析を多めに実施し，シナリオ執筆の途中段階であるプロット完成を目指します．後期では制作時間を多めにとり，プロットおよびシナリオの完成を目指すように授業を進行します．したがって，特にシナリオ執筆未経験者は前期から受講することをお勧めします．また，しっかりとオリジナルシナリオを書き上げたい方は通年・継続受講をお勧めします．",
        "preparatoryStudy": "事前にイラストや画像を制作するためのソフトウェアの取り扱いをあらかじめ学んでおくと課題などがスムーズに取り組めます。また、各回のテーマに沿って、予習として履修者が選んだ作品の閲覧および分析用・制作用テンプレートへの記入、復習として授業内フィードバックを踏まえた分析・制作内容の修正が必要です。",
        "gradingGuidelines": "授業内で行うプレゼンテーション・ディスカッションへの参加・貢献(50%)，制作した作品の最終提出および発表会(50%)で評価します．100点満点中60点以上で単位認定します。なお，授業内で課す課題は一部を除き，プレゼンテーションによって提出とみなします．また，プレゼンテーションに対しては教員からのフィードバックとして，個々に講評を行います．",
        "textbook": "授業内で適宜資料を配布します。",
        "referenceMaterials": "三上浩司、戀津魁、近藤邦雄、茂木龍太、兼松祥央：メディア学大系３コンテンツクリエーション（改訂版）、コロナ社",
        "courseSchedule": "第1回オリエンテーション演習講師紹介・成績評価方法の説明第2回キャラクターアナリシス１（キャラクターの構造1）第3回キャラクターアナリシス２（キャラクターの構造2）第4回キャラクターアナリシス３（キャラクターの制作方法事例）第5回キャラクターアナリシス４（キャラクターの魅力1）第6回キャラクターアナリシス５（キャラクターの魅力2）第7回キャラクターアナリシス６（キャラクターの分析・分類）第8回キャラクターアナリシス７（分析・分類の発表）第9回キャラクターメイキング１（リテラル資料の制作）第10回キャラクターメイキング２（設定に基づくキャラクタービジュアル）第11回キャラクターメイキング３（ポージングと表情）第12回キャラクターメイキング４（分析結果を用いたキャラクター制作1）第13回キャラクターメイキング５（分析結果を用いたキャラクター制作2）第14回キャラクターメイキング６（作品発表・提出）",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/08\/07"
}