{
    "lectureCode": "P022930",
    "courseName": "プロジェクト演習III[インタラクティブ・ゲーム制作＜ゲームデザイン＞]2023年以前入学者",
    "lecturer": [
        "安原広和(メディア学部メディア学科)",
        "三上浩司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "ゲームデザインはビデオゲームの骨格を設計する極めて重要な工程です。近年のゲームを取り巻く環境の変化から、ゲーム専用機のゲームの高度な表現や、スマートフォン向けのゲームなどの継続的なプレイを促す仕組みなど、考慮すべき点も多様になってきています。本演習では今まで培った世界市場で通用するゲームデザイナーとしての実務経験を活かし、ゲームや遊びの歴史からヒトの特性を理解し、新規性（未見性）がありながらどこか既視感があり、自然にあそべるゲームデザインを提案できるように、ゲーム作品の分析、それに基づくゲームの提案を行えるようにゲームデザインの基礎を学びプロトタイプを作成する実践的科目です。Unityを使いながら小さな単純なスクリプトを使ってヒトが「たのしい、おもしろい」と感じるゲームレベルを実際に作りながら、参加者全員で評価し学び合います。最終的には東京ゲームショウに向けて開発するゲームのゲームデザインを行うために行う演習です。",
        "outcomesMeasuredBy": "ゲームデザインの基礎技術を学び、ターゲットユーザを考慮したうえでどのようなゲームプレイができるのか、論理的に設計できる能力を身に着けます。市場で評価されたり、話題となったゲームを題材に、そのゲームデザインを分析しどのような要素が作用しているのか理解します。またUnityの基礎的な操作を習得し、ヒトがたのしいと感じる操作、ゲームデザイン、レベルデザインの基礎を理解できること。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本演習は，「プロジェクト演習＜インタラクティブゲーム制作（プロデューシング）＞」の補助的な演習で、ゲームデザインの役割を担うためのゲームデザインの知識やスキルの習得を目指します。Unityの基礎的なエディタ操作を毎回教えます。それを使ったレベルを自分でデザインして、Unity上で動かしてあそべるように実装します。各参加者の制作した作品を見ながら評価しあい、ゲームデザインの基本技術を理解し，各自でゲームを分析し、ディスカッションしたり、それらを組み込んだ新しい企画を提案したりします。最終的には，東京ゲームショウで開発するゲームの企画を提案し，それらを分析，議論を経て，ブラッシュアップしながら授業を進めます。ノートPC必携です。",
        "notices": "業時間のほかに多くの時間が，作品制作、調査や分析に必要になります。事前準備をしっかりできる時間を確保してください。また、Unityを学びたいだけの学生ではなく、ゲームを作る、デザインしたいという熱意がある学生を対象にしています。",
        "preparatoryStudy": "日ごろから様々なエンタテインメントに興味を持ち，それらを分析して他の履修者にプレゼンできるようにすること。Unity社が提供しているチュートリアルと「あそびのデザイン講座」、またはYouTubeに上がっているUnityのチュートリアルなどを見ておくとよいです。（120分以上）",
        "gradingGuidelines": "提出された作品で授業の成績評価とします。課題とされた要点を踏まえたものになっているか？自分なりの工夫やアイデアが加えられているか？などを評価します。課題提出は原則毎回とします．毎回の自作のプレゼンを行ってもらいます。また事前に工夫した点、参考にしたページなど、授業用のDiscordに書き込んでもらいます。提出で50点、プレゼンと作品の内容と書きこんだ内容で50点、100点満点中60点以上で単位認定とします。",
        "textbook": "指定しない",
        "referenceMaterials": "「CGとゲームの技術」（コロナ社）「Unity2020入門」SBCreativeをはじめ、あればよいものです。市販のUnityの使い方の参考書など適宜指示します。",
        "courseSchedule": "第1回：「使いやすいもの」(担当：安原広和)第2回：「跳ねるボール」(担当：安原広和)第3回：「ゲームのレベル」(担当：安原広和)第4回：「制限」(担当：安原広和)第5回：「回転とめまい」(担当：安原広和)第6回：「移動」(担当：安原広和)第7回：「撃つ」(担当：安原広和)第8回：「スコア」(担当：安原広和)第9回：「プレイヤー」(担当：安原広和)第10回：「鍵」(担当：安原広和)第11回：「エフェクト」(担当：安原広和)第12回：「エネミー」(担当：安原広和)第13回：「索敵」(担当：安原広和)第14回：「アイテムとカメラ」(担当：安原広和)",
        "courseDataUpdatedAt": "2024/01/31"
    },
    "updateAt": "2024/12/13"
}