{
    "lectureCode": "P022727",
    "courseName": "プロジェクト演習I[インタラクティブ・ゲーム制作＜イントロダクション＞]",
    "lecturer": [
        "三上浩司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "メディア学部",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "この演習は，全体を通じてコンピュータを使ったゲームを「作る」ために必要となる工程を理解しそのスキルを実体験を通じて身に付けることを目的としています．チームを形成し企画したゲームを3年後期までに展示会などに出展できるレベルまで完成させることを目的とします．その目的のために，他の演習で学んだ技術を終結させ，チーム一丸となって完成させます．年次は「遊び」のアルゴリズム演習と題して，2年時以降は個別に開催する「プロデューシング」，「プログラミング」，「グラフィックス」，「サウンド」が合同で「イントロダクション」として実施します．",
        "outcomesMeasuredBy": "ゲーム開発に興味を持つ，多様な素養を持った学生たちと円滑なコミュニケーションができ，建設的なディスカッションをできるようになる．ユーザーとしての視点ではなく作り手側の視点をもってクリティカルシンキングができるようになる．＜本授業のラーニングアウトカム重点項目＞「コミュニケーション能力」「論理的な思考力」",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1年次はあえてコンピュータを使わず，伝統的なゲームや身近な道具を使いながら，ゲームの骨格にあたる部分を自ら考え，遊びながら学びます．単にゲームを作って遊んで終わりではなく，作成したゲームの面白さをディスカッションし，文章や図・表にまとめ，ゲームにおける面白さの構造を客観的に探ります．授業はグループワークによって行います．グループは課題ごとに変更します．※ノートPC必携",
        "notices": "演習時間以外にも多くの準備が必要です．他の履修教科との時間配分に充分留意してください．自ら問題にとりくみ，仕組みを作り出し，工夫をする意欲のある学生を歓迎します．あらかじめ用意されている答えを知りたいタイプの学生には向きません．また基本的に継続して履修することを前提とします．",
        "preparatoryStudy": "自分が制作したい思うゲームに関連するコンテンツはゲームに限らず，必ず分析すること．その際にユーザの視点ではなく，それを自分で作ることを意識して分析してください．（60分程度）授業では課題が出ますので提出すること（60分程度）",
        "gradingGuidelines": "試験は行わず、授業中の下記課題の評価で決定する。個人課題60％チーム課題40％100点満点中60点以上で単位認定とする．提出物，成果物は発表の際にフィードバックを行います．",
        "textbook": "CGとゲームの技術（コロナ社）",
        "referenceMaterials": "特になし",
        "courseSchedule": "第1回:「ガイダンス」第2回:「トランプを題材にした遊びのデザイン1」議論と個人企画第3回:「トランプを題材にした遊びのデザイン2」チーム内発表とチーム企画第4回:「トランプを題材にした遊びのデザイン3」発表第5回:「レトロな遊びの改良1」議論と個人製作第6回:「レトロな遊びの改良2」チーム内発表とチーム企画第7回:「レトロな遊びの改良3」発表第8回:「レトロな遊びの改良4」改良版の発表第9回:「ボードゲームの分析1」試遊と分析第10回:「ボードゲームの分析2」発表と試遊と分析第11回:「ボードゲームの開発1」第12回:「ボードゲームの開発2」第13回:「ボードゲームの開発3」第14回:最終発表",
        "courseDataUpdatedAt": "2025/01/06"
    },
    "updateAt": "2025/03/21"
}