{
    "lectureCode": "P0229281",
    "courseName": "プロジェクト演習III[インタラクティブ・ゲーム制作＜イントロダクションII＞]",
    "lecturer": [
        "渡辺大地(メディア学部メディア学科)",
        "三上浩司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "前期ではコンピュータを使わずに「遊び」の本質を追究するための演習を行ったが、後期では逆に「コンピュータによるゲーム制作」について学ぶ。コンピュータ上で動作するソフトウェアを構築するには「プログラミング」という手段を用いる必要がある。この演習では、今後のゲーム制作を行う上で基本となるプログラミング、特にリアルタイム3DCGプログラミングについての基礎を学ぶ。前半は個別に学習を進めていき、最終的には自由作品を作成する。なお、当コースは2年次においてプロジェクト演習「インタラクティブ・ゲーム制作」の「プロデューシングコース」または「Unityコース」を履修したい学生は必ず履修すること。また、その他のコースの履修を希望する学生であっても、2年次から始まる東京ゲームショウ展示に向けたプロジェクト演習ゲーム制作に参加したい学生は、当コースを履修あるいは聴講することを強く推奨する。",
        "outcomesMeasuredBy": "本演習は、共通の到達目標を定めることは想定していない。各自で目標を設定した上で、自身の向上に生かせる部分を能動的に学んでほしい。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "毎回、授業開始時に資料を配付し、その内容に基づいて各自のノートPCでプログラミングの演習を行う。ノートPCは必携とする。",
        "notices": "当コースでは、ゲーム制作で根幹的な工程となる「プログラミング」を学習することを目的としている。プログラミングは単に授業を受講しただけでできるものではなく、自発的な学習を行わなければ習得することはできない。毎回の講義後の自習が不可欠であるということを前提として履修すること。当コースの受講は、2年次以降に「プロデューシングコース」または「Unityコース」の受講を希望する学生は必須とする。また、その他のゲーム制作コースを希望する学生も強く聴講をすすめるものである。「先端メディア学II（アドバンスドゲームプログラミング）」の履修は、当科目で優秀な成績を取得することが条件となる。",
        "preparatoryStudy": "本科目は、各単元ごとに内容を理解していないと、先の単元の内容の理解が困難あるいは不可能な場合が多い。毎回課す演習課題は必ず次回受講までに取り組むこと。また、わからなかった問題については必ず解答を参照し、解法を理解しておくこと。毎回あたり90分程度を目安とする。毎回の授業ごとに、「事前学習」の項目を提示する。具体的には、事前に行う設定や入力について解説するので、毎回の授業の前に参照し、実施しておくこと。毎回30分程度を目安とする。",
        "gradingGuidelines": "個人別による毎週課題で50%、最終作品で50%とし、得点が基準点を満たした学生に単位を認定する。単位認定者に対し、得点により成績評価も決定する。提出物に対しては、授業内でフィードバックを行う場合もある。",
        "textbook": "授業中に配布する。",
        "referenceMaterials": "授業中に適宜紹介する。",
        "courseSchedule": "第1回:ガイダンス第2回:セットアップ第3回:はじめてのC#プログラミング第4回:配列と繰り返し第5回:条件分岐とアニメーション第6回:キー操作と座標系第7回:物体の消去と干渉判定第8回:親子関係と運動第9回:テクスチャマッピングとスプライトモデル第10回:メソッド第11回:サウンドプログラミング第12回:ゲームサンプルの紹介と最終課題解説第13回:個別作業第14回:最終発表とまとめ",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/08\/07"
}