{
    "lectureCode": "P022740",
    "courseName": "プロジェクト演習I[健康メディアデザイン]",
    "lecturer": [
        "千種康民(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "メディア学部",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "近年のスマートフォンとIoTの急速な発展に連動して、健康改善が世界的なブームとなっている。また、働き方改革が叫ばれており、またストレスや睡眠不足等による労働生産性の低下も問題視されている。これに対処するためには、社会の仕組みを変革するだけでなく、労働や生活スタイルそのものを改善していくアプローチも必要不可欠である。本授業では、スマートフォンアプリなどを活用して、人間を最も身近である健康メディアとしてデザインし、これに対して新しい健康PDCAサイクルとして改善する、という健康メディアデザインを学生個人ごとにオーダーメイド的に実施する。具体的には、個人が対象とする健康テーマの改善や向上させていく手法である。睡眠改善により集中力10%向上、学習法改善による集中力10%向上、時間帯の工夫による集中力10%向上できれば、1日8時間の労働生産性が30%改善し、1日で144分約2時間の新たな余裕時間を確保できる。つまり、非効率で無駄なだらだら作業をなくし、ストレスレスな十分の長さの快眠を得ることも可能になる。本授業の対象は、集中力やストレス・睡眠に限らず、食事や運動・筋力アップ・ダイエットなど学生本人がもっとも興味ある健康テーマを対象にするため、具体的なテーマは多岐にわたる。そして実際に得られた健康テーマとそれらの改善法を組み合わせて、データの計測法や記録したデータの可視化法についても学び、その成果を新しい健康アプリとして企画デザインする新しい学問分野「健康メディアデザイン」に取り組む。改善指針を定める際にChatAIの積極活用を行なう。",
        "outcomesMeasuredBy": "学生自身の健康テーマについて、振り返りを実施して、取り組むべき健康テーマについて検討する。その健康テーマに対して健康PDCAにより改善し、最終的にはより良い健康状態であることを目指す。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ノートPC必携とする。第1回～第３回では、自分自身が問題を感じたり、もっと改善したい健康テーマについて、ディスカッションし、健康テーマを設定する。それ以降は、この健康テーマを健康PCDAサイクルを通じて、例えば集中力改善法を計画(PLAN)する。そして調べた対策実践(DO)し、その効果を記録する。記録したデータを俯瞰し、Excelのグラフなどを用いて分析法を学修しながら、どのような実践がどのような効果になったのかを分析・検討(CHECK)していく。そして、これまでのPLAN-DO-CHECKを通じて、次はどのようにしていくかを考え(ACTION)、それらを継続的に実施していく。",
        "notices": "この授業では毎回の授業外に健康メディアとしての実践と記録という課題に取り組むことが必要となる。第１セメスターおよび第２セメスターを通じて改善を行うとより的確な健康改善が実現できる。講義内では、意見を出し合う時間、個人作業時間、作業をまとめる時間、のそれぞれに対して各人が積極的かつ適切に自身の役割を果たすこと。",
        "preparatoryStudy": "ほぼ毎回、課する宿題により予習または復習を行なっておくこと。予習・復習あわせて60分程度が必要である。",
        "gradingGuidelines": "個人課題（40点）、個人発表（30点）、発展課題（30点）の合計により成績評価を行なう。また演習に対する積極的な取り組み態度（最大20点）を勘案して成績に加点評価をする。合計60点以上を合格とする。課題にはその都度コメントすることによってフィードバックを行う。",
        "textbook": "なし。",
        "referenceMaterials": "随時紹介する。",
        "courseSchedule": "第1回:健康メディアデザインとは[健康PDCAサイクル、セルフケア]第2回:健康メディアデザインにおける睡眠力[睡眠障害、入眠と起床]第3回:健康メディアデザインにおけるストレス[ストレッサー、コーピング]第4回:健康メディアデザインにおける集中力[ポモドーロ法、環境改善]第5回:第1健康PDCAサイクルの実施[経過観察、数値化]第6回:第1健康PDCAサイクルの次期ACTION[分析]第7回:第2健康PDCAサイクルの実施[エクセル、カラーチャート]第8回:第2健康PDCAサイクル次期ACTION[散布図]第9回:第3健康PDCAサイクルの実施[平均、標準偏差]第10回:第3健康PDCAサイクルの次期ACTION[相関係数、相関行列]第11回:第4健康PDCAサイクルの実施[散布図、ヒストグラム]第12回:第4健康PDCAサイクルの次期ACTION[改善の数値化]第13回:成果発表のための発表資料作成[相関係数を用いた分析法]第14回:健康PDCAを通じた成果発表",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/08\/07"
}