{
    "lectureCode": "P022919",
    "courseName": "プロジェクト演習III[クリエイティブ・アプリケーション]2023年以前入学者",
    "lecturer": [
        "戀津魁(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "メディア学は、現代社会における諸課題の解決のため幅広い分野を結びつけ、いかに前進する力へ変えていくかを模索する学問です。たとえばネットワーク社会は通信技術だけでは成り立ちません。通信と他分野がメディアを介して結びついて我々の生活に欠かせないインフラとなり得ています。このように現代社会では専門性の習得と合わせて他分野と連携できる複数の専門性への造詣が望まれています。そのことから分野交流を促進させるメディア学の感性は大きな強みとなります。これを踏まえ本演習では2つのテーマを取り扱います。まず分野交流とメディア学の意義を知るため、メディア史と美術思想史を紐解き議論を通してメディアの理解を深めます。これらの歴史はすなわち人類の分野交流と試行錯誤の記録であり、表現者たちの試行錯誤を辿ることで現在に通底する進歩的な感性を獲得します。次にメディア学の知見を技術分野と連携する練習としてiOS視覚プログラミングに導入します。プログラムを作るだけでなく視覚メディアが他分野に与える影響を思索しながら分野連携を試行します。2テーマを基盤として本格的なiOSApp開発と公開を目指します。演習講師は渡邉賢悟が担当します。二年前期は特に基礎的な科目との交差を意識しながらキーワードの理解をする。",
        "outcomesMeasuredBy": "メディア学の基礎知識の習得、その実践としての視覚プログラミングの基礎、本格的なApp開発の実践を目指します。習得した知識と技術を、自己表現や目標実現に応用する俯瞰的な観察力、論理的な思考力、判断力を育成します。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "座学のメディア学講座と、演習の技術表現演習を、合わせて2コマ開講します。いずれか一方の参加でも受講可能です。また演習外活動としてのApp自主制作、メディアに関する議論などの支援を随時おこないます。ノートPCを必携とします。・メディア学講座メディア学を修めるにあたり有益な知識の広げ方とつなげ方、継続性のある能動的な学び方をメディア史の知識習得を通じて触れていきます。Wikiを用いた知識の記録と共有、議論の進め方などを実践します。・技術表現演習プログラミング初学としてPlaygroundBooks教材でグラフィクスプログラムに導入します。メディア表現の模索を実践します。また、その発展としてMacとiPadを用いた本格的なApp開発技能を習得し、自作Appの公開を目指します。",
        "notices": "本演習では修士1年次相当の内容を、学部１年生向けに行います。毎週の授業についての不明点や理解が難しい点などを整理し、受講の効果を自主的に高めるよう努めてください。必要に合わせて講師に質問、相談して補ってください。",
        "preparatoryStudy": "演習開始前の事前学習は不要です。回が進むごとに過去の回の演習内容を前提とする内容が増えるため、必要に応じて復習するようにしてください。",
        "gradingGuidelines": "期末のWikiレポート【50％】と制作作品の提出【25％】、演習内議論への参加【25％】で評価し、60点以上を単位認定要件とする。Wikiレポートの講評でフィードバックします。",
        "textbook": "なし。演習内で必要な資料を提示します。",
        "referenceMaterials": "初期不要。随時、演習内で紹介します。",
        "courseSchedule": "第1回：説明会第2回：メディア史1:はじめに思考ありき第3回：メディア史2:思考とメディアあるいは主客と世界第4回：メディア史3:メディアサイクル-場,表現,創発そして場第5回：Wikiの導入・メディア史ふりかえり第6回：美術思想史1:観察の変遷–表現者の思考第7回：美術思想史2:美の諸説-表現者の追うもの第8回：思想と哲学1:ゼロという概念第9回：思想と哲学2:存在・実在・リアリティ第10回：東洋思想史1:自己内の探究・我と私と存在第11回：東洋思想史2:東西思想の考察と日本第12回：美のメディア論1:メディアモデル–存在と美第13回：美のメディア論2:メディアと社会第14回：総論",
        "courseDataUpdatedAt": "2024/02/05"
    },
    "updateAt": "2024/12/13"
}