{
    "lectureCode": "P022716",
    "courseName": "プロジェクト演習I[キッズアニメーションCG制作]",
    "lecturer": [
        "川島基展(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "メディア学部",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "キッズアニメーションCG制作プロジェクトでは、子供向け3DCGコンテンツ制作の知識と技能を、実践的に学ぶことができます。この演習はCGアニメーションディベロップメントプロジェクトと連動して実施します。原則として、先学期にキッズアニメーションディベロップメントで決定したアニメーション企画のパイロットフィルムやプロトタイプを制作します。3DCGの学習は、より日本のアニメーション制作現場に近い技術習得を目指し、キャラクタデザインから3DCG化、モーション作成などアニメーション制作に関る全工程を体験し、学習します。学習する3DCGツールはアニメスタジオでも利用されているプロフェッショナルツールのひとつであるAutodeskMayaです。制作したパイロットフィルムはAnimeJapanなどアニメ系の展示会イベントに企画として出展し、アニメーションのプロモーション手法についても実体験をもとに学習します。本科目では、おもにAutodeskMayaなどのCGツールの基礎を学びます。",
        "outcomesMeasuredBy": "・3DCGと映像制作の基礎技術の習得・日本のアニメ特有の制作工程と表現手法の習得・継続履修によるより高等なテクニックへの理解を深める・3Dプリンタ、ヘッドマウントディスプレイなど最新の3DCG作品のアウトプット技術にふれる",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業前半に3DCG初級技術（トレーニングコース）学習と、後半に3DCG中級技術（モデリング、マッピング、ライティング、パーティクル、ダイナミクス、アニメーションなどから毎期１コース選択制）学習を行います。同時にキッズアニメーションディベロップメントで立案された企画の映像化をグループワークで行います。教室のPCを使いますので、ノートPCの持参は必須ではありません。",
        "notices": "本演習は日本のアニメコンテンツ制作工程を企画段階から全て学習するため、週一回の授業時間の他、グループワークを行うための、十分な時間を確保してください。原則として、他のプロジェクト演習等との重複履修や聴講はできません。他の授業を多く履修していたり、アルバイトに忙しい方は、履修説明会の際にあらかじめ相談してください。なお、本演習はキッズアニメーションディベロップメントと連動していますが、キッズアニメーションディベロップメントを履修済みでなくとも参加可能です。",
        "preparatoryStudy": "アニメーション制作に関する知識などを各自で深めておくことをお勧めします。毎回の授業に際しては、次の通り予習・復習を合わせて60分程度行ったうえでグループワーク・制作課題に取り組むものとします。予習：グループワーク・制作課題の取り組みにつき、作業報告と今後の計画について報告するための準備を行う。復習：授業の内容を十分に復習のうえ、作品制作に役立てるためのノートを作成する。また、ソフトウェアのオペレーションについて反復練習を行う。",
        "gradingGuidelines": "企画書（30点）、デザイン（30点）、プレゼンテーション（40点）として評価をします。特に、完成度、技術、表現をもとに評価します。合計60点以上が単位認定の最低要件になります。",
        "textbook": "授業時間内に配布する他、ウェブページで公開します。",
        "referenceMaterials": "随時、紹介します。コンテンツ工学の基礎（金子満・ボーンデジタル社）三上、近藤：コンテンツクリエーション、コロナ社(2014年）",
        "courseSchedule": "第1回オリエンテーション\/AutodeskMaya初級トレーニング第１回第2回シナリオ演習１\/AutodeskMaya初級トレーニング第２回第3回シナリオ演習２\/AutodeskMaya初級トレーニング第３回第4回絵コンテ制作１\/AutodeskMaya初級トレーニング第４回第5回絵コンテ制作２\/AutodeskMaya初級トレーニング第５回第6回アニマティクス制作１\/AutodeskMaya初級トレーニング第６回第7回アニマティクス制作２\/AutodeskMaya初級トレーニング第７回第8回企画チーム制作１\/AutodeskMaya中級トレーニング第１回第9回企画チーム制作２\/AutodeskMaya中級トレーニング第２回第10回企画チーム制作３\/AutodeskMaya中級トレーニング第３回第11回企画チーム制作４\/AutodeskMaya中級トレーニング第４回第12回企画チーム制作５\/AutodeskMaya中級トレーニング第５回第13回企画チーム制作６\/AutodeskMaya中級トレーニング第６回第14回企画チーム制作７",
        "courseDataUpdatedAt": "2024\/04\/10"
    },
    "updateAt": "2024\/08\/07"
}