{
    "lectureCode": "P022752",
    "courseName": "プロジェクト演習I[先端音響創造]",
    "lecturer": [
        "伊藤彰教(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "メディア学部",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "空間音響表現、立体音響表現、アトモスフェアリックサウンド、xRサウンドなど、先端的な音響デバイス環境を活用した表現と技術の習得に取り組みます。初学者から学べるよう、DAW操作・音響プログラミングツールによるサウンド制作・MATLABなどを用いたエンタテインメントに必要となる工学・知覚研究にも接します。レコーディング、ミキシング、SR（音楽PA）スキルの習得のほか、楽器音響・エフェクターなど、多様な文化のサウンド表現に接し、文化的素養を深めることでテクノロジーを適切に表現に活用する手法やコンセプトを学びます。音楽だけではなく、映像やアニメに付与するサウンド、ゲームサウンド、ネット配信の音響などにも深く関わる内容を習得します。プロジェクト演習は以下のような履修登録の構成になっています。1セメスター(1,2クォータ連続)：プロジェクト演習IおよびII2セメスター(3,4クォータ連続)：プロジェクト演習IIIおよびIV3セメスター(1,2クォータ連続)：プロジェクト演習VおよびVI4セメスター(3,4クォータ連続)：プロジェクト演習VIIおよびVIII5セメスター(1,2クォータ連続)：プロジェクト演習IXおよびX6セメスター(3,4クォータ連続)：プロジェクト演習XIおよびXII前期にあたる今学期は、1,3,5セメスターが開講されます。この演習テーマは、学生の習熟度に合わせて3クラスが開講されます。初学者の学生は、学年を問わず1セメスター目の開講時間に参加し、後期以降に本格化する高度な内容の習熟に向けた準備学習を行います。本シラバスは、1セメスター目の内容につき説明します。",
        "outcomesMeasuredBy": "メディアコンテンツに関わるサウンドに専門的に取り組む準備として、以下の点の習熟を深めます。・コンテンツサウンドに含まれる多種多様な音を聴取するための聴覚形成・NotePCで操作可能なサウンドツール群の基本操作と概念習得・多種多様な音楽・音響表現の聴覚的経験・音量・周波数成分の理解と操作",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "NotePCを利用した演習と座学を中心に構成します。音響制作の演習にとどまらず、高品位なスタジオモニタスピーカを活用し、繊細に音を聴きとる聴取演習も行います。",
        "notices": "【2024年度新入生(1年生)向け留意点】他に履修登録したいプロジェクト演習のテーマがある場合、以下の2つの受講方法があります。＜方法1：2つ目の履修登録＞他のプロジェクト演習のテーマを「プロジェクト演習I」として履修し、このテーマも履修したい場合は「プロジェクト演習II先端音響創造」を選択してください。（「II」はローマ数字の「2」を意味します）＜方法2：聴講＞履修登録しなくても受講は可能です。公式な成績はつきませんが、その他は履修登録生と全く変わらない演習体験をすることができますが、履修生と同様に課題などを提出してください。今後必要となる選抜に向けて、聴講でも受講歴として認めます。---【在校生向および2024年度新規編入生向けの留意点】1セメスター目の演習内容に参加する場合でも、2年生は「プロジェクト演習III」、3年生は「プロジェクト演習V」に履修登録してください。なお、1セメスター目に限り聴講は歓迎しますので、履修登録しなくても受講は可能です。2セメスター目以降の参加に関しては選抜があります。---※：全学年とも履修に関する前提条件などはありません。この分野に初めて接する学生でも受講可能です。",
        "preparatoryStudy": "本演習では授業時間外での円滑な情報交換と豊富な資料提示のため、discordなどのICTツールを利用します。出版物、視聴覚資料、最新のweb資料などはその中で随時提示するため、オンラインを活用して主体的に情報取得する生活習慣を身につけておきましょう。オンライン提示した資料の講読・視聴などで、週1時間以上の予習・復習を行ってください。",
        "gradingGuidelines": "期末創作課題およびレポート【60％】・授業内での小課題【40％】で評価し、60点以上を単位認定要件とします。課題や達成度に関するフィードバックは授業で利用するICTツールにて行います。",
        "textbook": "使用しません",
        "referenceMaterials": "多岐にわたるため、演習で利用するICTツール内で掲示します",
        "courseSchedule": "第１回：ガイダンス：音楽の不思議第２回：多様な国・地域の音楽第３回：多様な時代の音楽第４回：環境音の聴取実習第５回：生活音の聴取実習第６回：映像作品と音：視覚と聴覚第７回：解説：音とは何か第８回：解説：倍音とスペクトル第９回：解説：アナログ＆ディジタルサウンド第10回：テクノロジと音楽表現第11回：クリエイティブな現場のテクノロジ第12回：世界の先端研究事例第13回：錯覚と音楽表現第14回：ディジタルサウンドの未来",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/08/07"
}