{
    "lectureCode": "P022946",
    "courseName": "プロジェクト演習III[ProceduralAnimationBasic]2023年以前入学者",
    "lecturer": [
        "菊池司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本演習では、CG映像のなかでも「ビジュアルエフェクト（VFX）」分野に焦点を当て、近年世界中のプロダクションから注目を集めている「Houdini」を使用したノードベース，かつPythonによるプログラマブルカスタマイズによって映像を制作するプロシージャル（Procedural：手続き型）な映像制作手法を習得することを目標とする。Houdini特有のUI（ユーザ・インタフェース）の学習から始まり、ノートベースでのモデリング、有限要素法によるソリッドオブジェクトのシミュレーション、RigidBodyDynamics、パーティクルシステム、流体シミュレーション、Fur、シェーディングとレンダリングなどのVFX映像制作に必要な各種シミュレーションとワークフローに関して、1人1台のPCを使用して学習していく「ハンズオン」形式で演習を進める。本演習の後半では、各自の作品テーマを決定して「課題作品制作」を行い、個人でVFX映像を完成させる制作体験を行う。これにより、VFXに特化した得意分野を身につける（エキスパート）と同時にCG映像制作に関する「ジェネラリスト」になることを目指す。",
        "outcomesMeasuredBy": "授業終了時の目標は、「VFXに特化した得意分野を身につける（エキスパート）と同時に、CG映像制作に関する“ジェネラリスト”になれる基礎を身につける」である。グループワークではなく，個人としてVFX映像制作のワークフローを経験し作品を完成させることで、個人としてプロの現場で通用する技術力を身につける。ラーニング・アウトカムの「実学に基づく専門能力」、「コミュニケーション能力」、「論理的な思考力」、「分析・評価能力」、「問題解決力」を養う。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "毎週の演習でHoudiniによるプロシージャルなCG映像制作技術を学んだ上で、個人作品として課題作品制作を行う。演習は毎回「ハンズオン」形式（1人1台のPCを使用しての個人作業）とし、講師、およびTA・SAが可能な限り個人対応ができるようにするため、少人数制で行う。ノートPCは必携とする。Houdiniのオペレーションを前半で学んだ上で、演習後半では個別のテーマを設定して、就職活動で使用できるクオリティの作品制作に挑戦する。演習場所は、研究棟C「519号室」とする。",
        "notices": "本演習はHoudiniを使用したVFX映像の制作に特化したものであるため、Autodesk3dsMaxやMAYAなどは取り扱わない（授業内で解説や演習の時間は設けない）。そのため、課題作品制作に必要な技術としてそれらのソフトウェアのオペレーションに関しては、他のプロジェクトで経験済みか，それと同等の知識と制作スキルを有していることが望ましい。また、各自のノートPCにHoudiniのノンコマーシャルライセンスをインストールし、授業で解説された技術に関して授業時間以外でも自己学習を行うこと。",
        "preparatoryStudy": "予習と復習、および授業時間以外での自主制作は必ず行うこと。また、日頃から身のまわりで起きる様々な現象に興味を持ち、観察するように心がけること。さらに、映画などで表現されている「VFX」の“魅せかた”や“誇張表現”などを分析するようにすること。現実とプロの作品から多くのことを学び取る努力をすること。",
        "gradingGuidelines": "毎週提示する達成目標課題と最終課題作品をそれぞれ30％・70％の割合で、計100点として総合成績に反映する。60点以上を単位認定要件とする。最終課題に関しては、作品自体のクオリティはもちろんのこと、提出期限を厳守することが必須である。課題のフィードバックは、提出締め切り後の授業で講評会を行う。",
        "textbook": "特に指定はない。本演習用に作成した資料を使用する。",
        "referenceMaterials": "新旧問わず、あらゆる映像コンテンツが参考資料となる。特に「構図」や「カメラワーク」、「カット」に関してはプロが制作した作品や様々な解説書から学び取ること。「ボーンデジタル：クライマックスまで誘い込む絵作りの秘訣」などは是非自主的に勉強して欲しい。",
        "courseSchedule": "第1回：本授業に関するガイダンス。講師自己紹介など第2回：Houdiniユーザ・インタフェースの解説と基本操作第3回：ジオメトリの操作、コピーとインスタンスの解説第4回：アニメーションの解説と操作第5回：RigidBodyDynamics第6回：変形アニメーション第7回：パーティクルシステム第8回：カメラとライティング第9回：レンダリングとシェーディング第10回：コンポジット技法の解説第11回：最終課題制作－テーマの決定と絵コンテの制作第12回：最終課題制作－モデリング第13回：最終課題制作－シミュレーションの実装第14回：最終課題制作－レンダリングとコンポジット",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/08/07"
}