{
    "lectureCode": "P022932",
    "courseName": "プロジェクト演習III[インタラクティブ・ゲーム制作＜サウンド＞]2023年以前入学者",
    "lecturer": [
        "伊藤彰教(メディア学部メディア学科)",
        "三上浩司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本演習は東京ゲームショウ出展にむけたチーム制作に伴い、プロフェッショナルスタイルのゲームサウンド制作手法と質的水準を体験的に学ぶことで、ゲームの音楽・サウンド全般のクオリティを高めるための演習です。ゲームサウンドに関わる幅広い分野をカバーするため、演習は大きく２つのテーマに分かれます。【表現設計クラス＜選抜なし＞】【実装管理クラス＜選抜あり＞】Unity,ADXIILEなどのゲーム制作用ミドルウエア群を用いて、音を制御するプログラミングとこれを活用したゲームサウンド特有の表現手法を実践的に学習します。このコースはADXIIの開発企業であるCRIミドルウエア社の社員を演習講師として招聘して実施します。プロジェクト演習は以下のような履修登録の構成になっています。1セメスター(1,2クォータ連続)：プロジェクト演習IおよびII2セメスター(3,4クォータ連続)：プロジェクト演習IIIおよびIV3セメスター：プロジェクト演習III(2023年度以前入学者向け表記)4セメスター：プロジェクト演習IV(2023年度以前入学者向け表記)5セメスター：プロジェクト演習V(2023年度以前入学者向け表記)6セメスター：プロジェクト演習VI(2023年度以前入学者向け表記)前期にあたる今学期は、1,3,5セメスターが開講されます。このシラバスでは、2024年度の2年生向けである「表現設計クラス＜選抜なし＞」について説明します。",
        "outcomesMeasuredBy": "前期の表現設計クラスでは、Unityの多様なAudio機能を一通り学ぶとともに、C#スクリプトによってゲーム内で制御する方法を習得します。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "２コースは別の曜日・時限に開講します。１学期のうちに片方だけでも両方でも受講できます。いずれもNotePC必携です。表現設計クラスは主に、チーム内でサウンド、ゲームデザイン、Unity、プロデューシングを担当する学生を対象としています。前期である今学期は、Unityの多様なAudio機能についてNotePCを用いて学びます。実装管理クラスは主に、チーム内でサウンドとプログラミングを担当する学生を対象としています。実施内容は本演習のV（３年前期）のシラバスを参照してください。",
        "notices": "本演習単独での受講は認めていません。本テーマを履修する学生は、「インタラクティブ・ゲーム制作IIIプロデューシング」を聴講し、TGSに向けたチーム制作に参加することが必須です。1年後の東京ゲームショウ出展にあたり、実装管理クラスの履修者がチームに１名以上在籍することが必須です。これを踏まえてインタラクティブ・ゲーム制作内のどのテーマを履修するかを年単位で上手に計画しましょう。2年前期である今期は、原則的にすべての受講生は表現設計クラスを受講してください。実装管理クラスは原則として表現設計クラスを1年後期・2年前期の最低２学期受講し、一定の成績以上の学生が受講できます。本演習ではゲーム音楽や効果音の作り方自体は取り扱いません。個別の音楽・音響制作スキルを学びたい学生は、プロジェクト演習「先端音響創造」「先端ミュージッククリエイション」を、本演習と並行して履修してください。2年後期以降に実装管理クラス＜選抜あり＞に進みたい学生は、「先端音響創造」「先端ミュージッククリエイション」のいずれか・あるいは両方の継続的な受講実績が必要となります。できるだけ1年前期のうちから受講しておきましょう。※：2024年度2年次編入生については、来期以降の選抜条件を別途定めています。説明会に参加の上、伊藤彰教と相談・確認しながら今期・来期の履修計画を立てるようにしてください。",
        "preparatoryStudy": "授業時間外に、週60分以上を目安として、以下の活動を予習・復習として行ってください。授業時間外の円滑な情報提供のため、discordなどのICTツールを活用します。提示された資料群にも目を通し十分なコミュニケーションを通じて専門的知識を得てから演習に臨んでください。加えて、教科書・参考書は一通り目を通し、自習できる技術習得は自主的に進めて毎回の授業に臨んでください。",
        "gradingGuidelines": "期末レポートおよび制作【60％】、授業内での小課題およびプレゼンテーション【40％】を目安で評価し、60点以上を単位認定要件とします。課題や達成度に関するフィードバックは演習時間内およびslack,discordといった授業で利用するICTツールにて行います。",
        "textbook": "北村愛美『Unityの教科書Unity2023完全対応版』SBクリエイティブ",
        "referenceMaterials": "・一條貴彰ほか『Unityサウンドエキスパート養成講座』ボーンデジタル(2019)・ウィニフレッド・フィリップス『ゲームサウンド制作ガイド―インタラクティブな音楽のための作曲技法』オライリージャパン(2015)",
        "courseSchedule": "【表現設計クラス】第1回:イントロダクション（三上・伊藤）第2回:Unityセットアップ（伊藤）第3回:サウンドアセットの準備（伊藤）第4回:インタラクティブサウンドメカニクスの基本３パターン（伊藤）第5回:ユーザインタラクションに応じたサウンド再生（１）（伊藤）第6回:ユーザインタラクションに応じたサウンド再生（２）（伊藤）第7回:衝突判定の実装（伊藤）第8回:衝突判定に応じたサウンド再生（伊藤）第9回:状態管理メカニズムの実装（伊藤）第10回:状態管理メカニズムと衝突判定の組み合わせ（伊藤）第11回:状態管理に応じたサウンド再生（１）（伊藤）第12回:状態管理に応じたサウンド再生（２）（伊藤）第13回:ゲームデザインクラスでの課題との融合（伊藤・三上）第14回:Unityクラスでの課題との融合（伊藤・三上）",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/08/07"
}