{
    "lectureCode": "P022836",
    "courseName": "プロジェクト演習II[シナリオアナリシス]",
    "lecturer": [
        "兼松祥央(メディア学部メディア学科)",
        "三上浩司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "メディア学部",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本演習は、メディアコンテンツ（映画、TVドラマ、アニメ、漫画、ゲーム、など）を制作するための仕様書ともいうべきシナリオの構造を理解し、メディアコンテンツの実作および評価に役立てることが目的である．構造主義から始まるシナリオの基礎理論・構造論の歴史側面とその執筆手法や研究を学習し、シナリオを構造的に捉えるスキルを身につける．次に実際に既存のメディアコンテンツの分析・評価およびシナリオ制作の実習で、シナリオ執筆のためのプロット作成スキルを身に着ける．本演習では、シナリオ執筆プロセスの中でもストーリー構成の理解を重視し、「箱書き」の執筆法を重点的に学びます。",
        "outcomesMeasuredBy": "既存の映像コンテンツ作品の分析・評価を題材にシナリオの基礎理論，構造論を学習する．これを通じて，映像コンテンツの分析・評価能力，シナリオの段階的かつ構造的な理解力を習得することが目標．この演習では，本学で研究開発し，学外のセミナー等でも活用実績のある手法を用いたプロット作成手法を学ぶ．また，制作の途中経過を含めて授業内で発表・ディスカッションを繰り返し，制作者自身のテーマとコンテンツの仕様書としての要件を満たしたストーリー作りを学ぶ．そして，魅力的かつ，他人に伝わる物語の構造を理解する．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "【授業形態：演習】前半はシナリオの研究や構造を学び、分析・調査を行います．後半は、実際に世界観や登場人物設定を作成して、独自のストーリー制作を行います．課題は授業内で必ずレビューを行い議論の場を設けるため，提出必須です．ノートPC必携．",
        "notices": "本演習の課題は授業時間内で終わるわけではないため、しっかりと時間を取り、予習・復習・制作を十分に行うこと．また，既存映像作品を分析するため，オンライン配信サービスやDVDレンタル，図書館での映像コンテンツ視聴など，既存作品を繰り返し視聴する環境を受講生自身で用意する必要があります．本演習は全てのセメスターで開講していますが，特に履修の順番に制限はありません（後期からでもスタートできます）．ただし，前期では制作手法の解説や既存作品の分析を多めに実施し，シナリオ執筆の途中段階であるプロット完成を目指します．後期では制作時間を多めにとり，プロットおよびシナリオの完成を目指すように授業を進行します．したがって，特にシナリオ執筆未経験者は前期から受講することをお勧めします．また，しっかりとオリジナルシナリオを書き上げたい方は通年・継続受講をお勧めします．",
        "preparatoryStudy": "事前に修得しておくべき科目は，とくにありません．ただし，本演習の中で既存の映像コンテンツ作品を分析しますので，あらかじめ映画・アニメ・ドラマなどを繰り返し視聴できる環境を用意し，様々な物語の中で自分が魅力的だと思えるポイントをピックアップしておくと，講義や課題への理解が深まります．また、各回のテーマに沿って、予習として履修者が選んだ作品の閲覧および分析用・執筆用テンプレートへの記入、復習として授業内フィードバックを踏まえた分析・執筆内容の修正が必要です（合計60分程度）。ただし、作品制作の要素が強い演習ですので、予習復習以外にも制作時間が必要になります。",
        "gradingGuidelines": "授業内で行うプレゼンテーション・ディスカッションへの参加・貢献(50%)，制作した作品の最終提出および発表会(50%)で評価します．100点満点中60点以上で単位認定します。なお，授業内で課す課題は一部を除き，プレゼンテーションによって提出とみなします．また，プレゼンテーションは教員からのフィードバックとして，個々に講評を行います．",
        "textbook": "指定しない．授業内で適宜資料を配布します．",
        "referenceMaterials": "三上浩司、戀津魁、近藤邦雄、茂木龍太、兼松祥央：メディア学大系３コンテンツクリエーション（改訂版）、コロナ社",
        "courseSchedule": "第1回：オリエンテーション演習講師紹介・成績評価方法の説明第2回：映像コンテンツの制作及びシナリオの役割（映像制作工程、シナリオとプロット）第3回：既存作品の分析方法（ヒーローズジャーニー、昔話の形態学、シナリオライティングの黄金則）第4回：作品分析演習1（作品テーマ、S・Mプロット）第5回：作品分析演習2（フェイズポイント、ミッドポイント）第6回：作品分析演習3（13フェイズ前半）第7回：作品分析演習4（13フェイズ後半）第8回：オリジナルプロットの執筆1（企画，S・Mプロット）第9回：オリジナルプロットの執筆2（キャラクター・世界観設定）第10回：オリジナルプロットの執筆3（13フェイズ前半）第11回：オリジナルプロットの執筆４（13フェイズ後半）第12回：オリジナルプロットの執筆5（シーン分けフルプロット）第13回：オリジナルプロットの執筆6（プロットの評価、シナリオ執筆手法）第14回：作品発表会授業当日の実施担当は全ての回で兼松および演習講師が担当します．",
        "courseDataUpdatedAt": "2025/03/03"
    },
    "updateAt": "2025/03/21"
}