{
    "lectureCode": "P022956",
    "courseName": "プロジェクト演習III[実践的プログラミング基礎]2023年以前入学者",
    "lecturer": [
        "寺澤卓也(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本科目は、プログラミング未経験者が主な対象である。まず、初学者向けに開発したプログラミング学習システムを使用して、各自が自分のペースでプログラミングの基礎知識及び基本的な考え方を習得する。具体的には、簡単なサンプルゲームの作成を通してゲーム制作に必要な基礎を学ぶ。次に、プログラミングの学習方法、学習のコツ、初学者がハマりやすいポイント等について毎回テーマを決めて全体講義を行う。ここでもプログラミングは全くの初心者を想定している。この全体講義においては、講師との相互ディスカッションが中心となる。希望のUnity機能を見つけ出し活用できることを目指す。",
        "outcomesMeasuredBy": "この演習の到達目標は、以下のとおりである。・Unityの基本的な操作ができるようになる。・C#の基本的な知識および考え方が身につく。・ゲーム制作に必要な考え方が身につく。・簡単なエラー処理を自分でできるようになる。・エラー処理を通して問題発見力と問題解決力を高める。・自分の考えを整理し、相手にわかりやすく伝える力を養う。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "まず、指定カリキュラムに沿って、サンプルプロジェクト（ゲーム）を作成する。この段階では、作成作業中心の授業となる。演習を実施する上で「ノートPCの持参は必須」である。次に、サンプルプロジェクトが完成した段階で、各自工夫した点等について発表を行う。さらにそれに続き、指定カリキュラムをどのように改善していけば良いかについてディスカッション等を行う。",
        "notices": "各自、自分のノートPCに指定されたソフトウェア（Unity）のインストールを完了して授業に臨むこと。またUnityアカウントも事前に取得しておく必要がある。これらについては別途指示する。質問は原則として「授業時間内のみ」受付ける。その前提として、まずは「自分で調べる習慣」を身につけること。",
        "preparatoryStudy": "演習課題は各自のペースで進めることができる。ただし、作品の発表時期は決まっているので、各自自宅等で復習しキャッチアップする必要がある（30分程度）。予習は提供されるWeb上のテキストに沿って各自進めること（30分程度）。",
        "gradingGuidelines": "以下の基準により評価を行う。合計60点以上で単位取得となる。・演習課題への取組姿勢とその内容（60点）・作品発表（10点）・議論及びディスカションへの貢献（30点）",
        "textbook": "（オンラインのシステムを活用）",
        "referenceMaterials": "『Unityではじめるおもしろプログラミング入門』（リックテレコム）ほか適宜、講義内にて紹介する。",
        "courseSchedule": "第1回：講義（Unityの基本的な操作方法）第2回：ゲーム制作1（1）第3回：ゲーム制作1（2）第4回：ゲーム制作1（3）第5回：作品発表1第6回：ディスカッション1（改善提案（1））第7回：ディスカッション1（改善提案（2））第8回：ゲーム制作2（1）第9回：ゲーム制作2（2）第10回：ゲーム制作2（3）第11回：ゲーム制作2（4）第12回：ゲーム制作2（5）第13回：ディスカッション2（改善提案）第14回：作品最終発表および提出",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/08\/07"
}