{
    "lectureCode": "P022801",
    "courseName": "プロジェクト演習II[デジタルコンテンツ表現＜インスタレーション＞]",
    "lecturer": [
        "太田高志(メディア学部メディア学科)",
        "羽田久一(メディア学部メディア学科)",
        "加藤邦拓(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "メディア学部",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "今日、デジタル技術を利用したインタラクティブなアート作品が多く創られている。なかでも、インスタレーションと呼ばれる分野の作品は、チームラボを代表として色々な展示会でも利用されるようになっている。投影されたCG映像とインタラクションを持つようなものを始めとして、多様な作品が考案されている。本演習は、そうした作品を作ることを目標に、技術の調査や検証からスタートして、作品を制作する。インタラクションの面白さだけでなく、セットやビジュアルなどの美しさも追求し、対外的に展示できるような完成度のものを目指す。初めて受講する場合、半期で作品を完成することは容易ではないため、通年もしくは複数年に継続して進めることを推奨する。技術面では、Processing、openFrameworks,,Unityなどによる制作を習得していると有利である。センサーを利用するにあたってArduino等を用いる。Processingによる基礎的なプログラミングから始める。",
        "outcomesMeasuredBy": "制作する作品のアイデアを作り、利用技術を確認し、最終的には、実際に展示できる程度の作品を完成させることを目標とする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "はじめに基本的なインタラクティブコンテンツの作成について演習形式の授業を行う。その後、各自（もしくは各グループ）によって、個別の作品作成に取り組む。制作については、講義実験等の８Fのラボで、３Dプリンター等の機材を使用することが可能である。ノートPC必携。",
        "notices": "参加者によって作品の内容が異なるであろうことから、授業形式で技術を教えるような形式ではなく、自分達の作品に必要となるものを自ら調べて進めることが必要である。技術面と同時にアート的な要素の完成度も要求されることから、個人プロジェクトとしてだけでなく、グループによる制作形態も可能とする。面白い作品や凄い作品を創りたい、という意思を持って参加して欲しい。",
        "preparatoryStudy": "演習で行った内容を良く理解することと、プログラムに変更を加えて試すなどを行う。また、個々の作品に取り組みはじめたら、ある程度の作業は演習時間外にも行う必要がある。（２時間〜）",
        "gradingGuidelines": "アイデアの内容と企画書の完成度（30%）、作業への取り組み（40%)、およびコンテンツの完成度（30％）の合計によって評価する。60点以上で単位認定とする。コンテンツ作成が複数学期や複数年度に渡る場合は、完成度はその学期の範囲内で期待されるものを基準として判断する。",
        "textbook": "特に設定するものは無い",
        "referenceMaterials": "決定したテーマに合わせて演習中に適宜紹介する",
        "courseSchedule": "第1回:ガイダンス（太田、羽田、加藤、須田：演習講師）第2回:既存作品の調査とテーマの選定（太田、羽田、加藤、須田：演習講師）第3回:技術・ツールの調査と検証（太田、羽田、加藤、須田：演習講師）第4回:技術の検証（継続）（太田、羽田、加藤、須田：演習講師）第5回:作品アイデアのデザイン（太田、羽田、加藤、須田：演習講師）第6回:プロトタイプの作成（太田、羽田、加藤、須田：演習講師）第7回:プロトタイプの作成（継続）（太田、羽田、加藤、須田：演習講師）第8回:プロトタイプ発表と企画の確定（太田、羽田、加藤、須田：演習講師）第9回:企画案発表（太田、羽田、加藤、須田：演習講師）第10回:コンテンツの開発（太田、羽田、加藤、須田：演習講師）第11回:開発作業の続行（太田、羽田、加藤、須田：演習講師）第12回:開発作業の中間報告、開発の続行（太田、羽田、加藤、須田：演習講師）第13回:開発の継続、企画書の最終版とプレゼンテーションの用意（太田、羽田、加藤、須田：演習講師）第14回:最終発表会（太田、羽田、加藤、須田：演習講師）",
        "courseDataUpdatedAt": "2024/02/13"
    },
    "updateAt": "2024/12/13"
}