{
    "lectureCode": "P022947",
    "courseName": "プロジェクト演習III[サーバー構築・管理(前期、advanced)]2023年以前入学者",
    "lecturer": [
        "寺澤卓也(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "サーバーのオペレーションやシステム、サービスの構築と運用に興味を持つ学生を対象に実践的に演習を行う。後期に開講する「サーバ構築・管理」に続いて、コンテナ環境の構築や外部サービスを利用した新たなサービス構築の方法について実践的に学ぶ。実物のPCを使った演習のほかクラウドサービス上の仮想環境でのサービスの提供方法などを学ぶ。",
        "outcomesMeasuredBy": "この演習の到達目標は、以下のとおりである。・コンテナ環境を構築し運用できるようになる・外部のサービスを利用して目的のサービスを新たに構築する・IPv6ネットワーク利用の基礎知識を習得する",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "各個人が個別にデスクトップPCを利用して実際にサービス環境を構築する。PC機材のほかに、各自のノートPCを主要なツールとして使用するので必ず持参すること。毎回の演習は、基本的な技術や操作方法の講義の後、それに基づき各回に設定されている課題に取り組むスタイルとなる。",
        "notices": "集中してよく考えること。また、トラブルシューティングは格好の演習材料である。解決できるまで粘り強く取り組む姿勢が大切である。基本事項と手順、調べ方の解説のほかは、細かいことは教えない。各自が調べ、考えて進めることを期待しているので、趣旨をよく理解して履修すること。プログラミングの知識と経験があることが望ましい。後期に開講するサーバ構築・管理II（IV・VI）を先に履修していることを前提としている。また、欠席しないこと。「インターネットシステム入門」の内容の復習をしておくこと。各自のノートPCを使用するので、不調の場合は修復しておくこと。Linuxに関する基本知識と経験があることを前提としているので、操作等を復習しておくこと。",
        "preparatoryStudy": "授業時間外にも作業を行うことになるため、授業時間中に生じた疑問や不都合は時間内に解消すること。そのため、あらかじめ、利用する外部サービスについてWeb上の情報等も用いて予習しておくこと（30分程度）。演習はそれまでの内容を理解していることを前提に進めるので、不明な点は必ず復習し、解消しておくこと（30分程度）。",
        "gradingGuidelines": "毎回の課題の達成度や演習への取り組み姿勢、演習への貢献度などにより総合的に評価する。数回のレポートを含む課題の達成度が70％、その他の項目が30％の割合を占め、合計100点満点に換算した際に60点以上を合格とする。",
        "textbook": "授業資料（Moodleで公開）のみ",
        "referenceMaterials": "Linux関連書籍サーバ関連書籍クラウド関連書籍",
        "courseSchedule": "第1回：Linux入門第2回：仮想化技術概論第3回：コンテナ入門（1）第4回：コンテナ入門（2）第5回：コンテナ入門（3）第6回：オーケストレーション（1）第7回：オーケストレーション（2）第8回：オーケストレーション（3）第9回：クラウド概論第10回：AmazonWebServices（1）第11回：AmazonWebServices（2）第12回：AmazonWebServices（3）第13回：IPv6演習（1）第14回：IPv6演習（2）",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/12/13"
}