{
    "lectureCode": "P022938",
    "courseName": "プロジェクト演習III[相互行為分析入門]2023年以前入学者",
    "lecturer": [
        "山崎晶子(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "相互行為（インタラクション）を捉えるために実践的な演習を行う。その為に、以下の3つを学ぶ。1)人間のコミュニケーションにおける発話を基本とした会話分析の概念と方法論を習得する。2)人間のコミュニケーションにおける発話と身体の関係を探求するために、相互行為分析の行い方を理解する。3)トランスクリプトの書き方を学ぶ。これらを踏まえて,インタラクションのあり方を把握する。この授業は、社会の中での相互行為を捉えることを目標とする。人間は、赤ちゃんであっても高齢者であっても、人と人の相互行為の中で生きている。本授業では、これらの相互行為を理解するために、会話分析を踏まえて最新の研究成果とともに、ソーシャルインタラクションのあり方を学ぶ。特に会話の流れ、シークエンスについて学ぶ。",
        "outcomesMeasuredBy": "この授業においては、ビデオデータを自ら撮影することを通じて、次のようなテクニックを身につける。（１）トランスクリプトの書き方を学ぶ。（２）ビデオデータの撮影方法を学ぶ（３）人間のコミュニケーションにおける発話と身体の関係を学ぶ。（４）フィールドでの撮影を学ぶ。（５）相互行為分析を行う。以上のことにより、相互行為分析を身につけて、特に適切な時に適切なことをいえるようにシークエンスを理解することを通じて就職活動などでも応用できるるようになることを目標とする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ノートPCは必携です。ゼミ方式で文献講読とデータの分析、収集、発表を行う。.文献講読を行う。2.データの分析を行う。3.実験などでデータの採取を行う。",
        "notices": "ソーシャルリサーチを受講が望ましい（必須ではない）授業ではデータセッションを行うため、積極的に参加すること。また、フィールドワークに行くことがある。",
        "preparatoryStudy": "予習：指定された資料を読むこと（30分）復習：授業中使用したビデオ資料を再度見ること（30分）",
        "gradingGuidelines": "授業内での活動を、レジュメ作成と実験計画への参与、授業での発言などの姿勢（具体的にはデータセッションの参加）を30%,トランスクリプト作成を40%、分析のプレゼンテーションとそれに伴うレポートを30%の割合で得点を換算し単位認定する。受講者の理解度により、シラバスとは若干の進行が異なることがあることがある。授業の最後に個々人にコメントを行うことでフィードバックする。",
        "textbook": "配付資料を利用すること。",
        "referenceMaterials": "『エスノメソドロジー・会話分析ハンドブック』山崎敬一他編、2023",
        "courseSchedule": "第1回:社会の中での相互行為第2回:会話の順番取りシステム会議場面とミュージアムでの相互行為（文献講読１）第3回:トランスクリプト入門会話分析の為の発話の起こし方第4回:評価‐連れが良いと言った時、悪いと言いづらいのはなぜか：優先構造（文献講読２）第5回:活動にどのように加わるか1：ストーリーテリングのありかた（文献講読３）第6回:活動にどのように加わるか2：立ち位置を理解する（文献講読４）第7回:お互いをどのように区別するかー相互行為におけるカテゴリー（文献講読５）第8回:会話と視線‐志向性第9回:トランスクリプト入門（２）：身体行為と言語的行為の文字起こし第10回:相互行為と身体性ー視線と移行に適切な場第11回:相互行為と身体性ー身体配置第12回:Ｏ空間とＦ陣形第13回:ロボットと相互行為第14回:データ分析",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}