{
    "lectureCode": "P022753",
    "courseName": "プロジェクト演習I[先端ミュージッククリエイション]",
    "lecturer": [
        "伊藤彰教(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "メディア学部",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "インタラクティブ・ミュージック、ジェネラティブ・ミュージック、ライブ・コーディング、など、テクノロジーを活用した先端的な音楽制作の手法を広く演習します。初学者から学べるよう、３音楽理論・楽曲分析・作曲技法・ミュージックテクノロジー・DAW操作などを学ぶと共に、藝術音楽・民族音楽・テクノミュージックなど、多種な文化の音楽に接します。映像音楽（フィルムスコアリング）・ゲーム音楽の創作のほか、サウンドデザインに有用なミュージックエフェクトへの応用にも取り組みます。プロジェクト演習は以下のような履修登録の構成になっています。1セメスター(1,2クォータ連続)：プロジェクト演習IおよびII2セメスター(3,4クォータ連続)：プロジェクト演習IIIおよびIV3セメスター(1,2クォータ連続)：プロジェクト演習VおよびVI4セメスター(3,4クォータ連続)：プロジェクト演習VIIおよびVIII5セメスター(1,2クォータ連続)：プロジェクト演習IXおよびX6セメスター(3,4クォータ連続)：プロジェクト演習XIおよびXII前期にあたる今学期は、1,3,5セメスターが開講されます。この演習テーマは、学生の習熟度に合わせて3クラスが開講されます。初学者の学生は、学年を問わず1セメスター目の開講時間に参加し、後期以降に本格化する高度な内容の習熟に向けた準備学習を行います。本シラバスは、1セメスター目の内容につき説明します。",
        "outcomesMeasuredBy": "今後必要となる高度な演習に向けて、以下の基礎的なスキル・知識を養います。・初歩的な楽典の理解・多様な音楽様式と楽器使用法の実例・MIDI信号を中心とした音楽と情報処理の関連に関する基礎知識",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "NotePCを利用した演習と座学を中心に構成します。音楽ツールの演習にとどまらず、ITCツールを活用し、多彩な音楽要素を聴きとる聴取演習も行います。",
        "notices": "【2024年度新入生(1年生)向け留意点】他に履修登録したいプロジェクト演習のテーマがある場合、以下の2つの受講方法があります。＜方法1：2つ目の履修登録＞他のプロジェクト演習のテーマを「プロジェクト演習I」として履修登録し、このテーマも履修したい場合は「プロジェクト演習II先端ミュージッククリエイション」を選択してください。（「II」はローマ数字の「2」を意味します）＜方法2：聴講＞履修登録しなくても受講は可能です。公式な成績はつきませんが、その他は履修登録生と全く変わらない演習体験をすることができますが、履修生と同様に課題などを提出してください。今後必要となる選抜に向けて、聴講でも受講歴として認めます。---【在校生向および2024年度新規編入生向けの留意点】1セメスター目の演習内容に参加する場合でも、2年生は「プロジェクト演習III」、3年生は「プロジェクト演習V」に履修登録してください。なお、1セメスター目に限り聴講は歓迎しますので、履修登録しなくても受講は可能です。2セメスター目以降の参加に関しては選抜があります。---※：全学年とも履修に関する前提条件などはありません。この分野に初めて接する学生でも受講可能です。",
        "preparatoryStudy": "本演習では授業時間外での円滑な情報交換と豊富な資料提示のため、discordなどのICTツールを利用します。出版物、視聴覚資料、最新のweb資料などはその中で随時提示するため、オンラインを活用して主体的に情報取得する生活習慣を身につけておきましょう。オンライン提示した資料の講読・視聴などで、週1時間以上の予習・復習を行ってください。",
        "gradingGuidelines": "期末創作課題およびレポート【60％】・授業内での小課題【40％】で評価し、60点以上を単位認定要件とします。課題や達成度に関するフィードバックは授業で利用するICTツールにて行います。",
        "textbook": "使用しません",
        "referenceMaterials": "多岐にわたるため、演習内で利用するICTツール内にて掲示します",
        "courseSchedule": "第１回：ガイダンス：履修・聴講と6セメスターの内容第２回：演習環境の解説と操作キックオフ第３回：ジャンルとスタイルの違い第４回：オーケストラ音楽とアンダースコア第５回：スコアの仕組みと楽器第６回：音楽ツールのインストール・設定第７回：20世紀の藝術音楽と映画音楽第８回：ミニマル・ミュージック第９回：Jazzの技法第10回：ロック・ポップミュージックの技法第11回：テクノミュージックとアニメ・ゲーム第12回：MIDI信号(1)NoteON/OFF第13回：MIDI信号(2)PC/CC第14回：音楽理論研究概説",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/08/07"
}