{
    "lectureCode": "P023241",
    "courseName": "プロジェクト演習VI[地域創生SDGsカードゲーム企画運営を通じたファシリテーション技法]2023年以前入学者",
    "lecturer": [
        "千種康民(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本プロジェクト演習は、カードゲームを通じてSDGs的な思考スタイルを学修しながら実践に役立てる部分と、多くの関係者とのコミュニケーションを通じて、対話ベースのシナリオの構築を実現するファシリテーションが重要となる。この両者を学修できるのがこのプロジェクト演習である。ファシリテーションは、グループやチームのプロセスを円滑に進め、効果的な意思決定や問題解決をサポートするための手法であり、様々な職種で役立つスキルである。以下にファシリテーションが特に役立つと考えられる職種を列挙する：プロジェクトマネージャー：プロジェクトチームをまとめ、コミュニケーションや協力を促進するためにファシリテーションが重要。プロジェクトの進捗ミーティングや意思決定プロセスで活用。トレーナー・教育者：グループ学習やワークショップでファシリテーションは効果的。参加者との対話を促進し、学習プロセスを支援。チームリーダー：チームビルディングや意思決定のサポートにおいて、ファシリテーションはリーダーシップの重要な要素。コンサルタント：問題解決や意思決定のプロセスをクライアントと一緒に進める際、ファシリテーションはコンサルタントにとって有益。企画会議：チームビルディング、コンフリクト解決、意思決定のサポートなど、様々な人間関係の側面でファシリテーションが活用。ビジネスアナリスト：要件定義やプロセス改善のためのワークショップでファシリテーションが重要。コーチ：個人やチームの成長を促進する際に、ファシリテーションはコーチングの手法として採用。",
        "outcomesMeasuredBy": "本演習では、企画・営業・開発などの職種における会議の運営に必須とされるファシリテーションに関する学修を行なう。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ノートPC必携とする。毎回、トピック的な小テーマを与え、そのテーマに対して、事例調査および企画案の発表を実施していく。",
        "notices": "授業では積極的に参加し発言すること。",
        "preparatoryStudy": "普段から多種多様なリアルカードゲームに興味を持つこと。予習・復習あわせて60分程度が必要である。",
        "gradingGuidelines": "個人課題（50点）、自由課題（50点）の合計により成績評価を行なう。また演習に対する積極的な取り組み態度（最大20点）を勘案して成績に加点評価をする。合計60点以上を合格とする。演習中に作成した課題について、学生間および教員からのフィードバックを行なうことにより、より深い考察を実践する。",
        "textbook": "なし。",
        "referenceMaterials": "なし。",
        "courseSchedule": "第1回:まずSDGsカードゲームをプレイしてみよう１[SDGs]第2回:まずSDGsカードゲームをプレイしてみよう２[SDGs]第3回:ファシリテーション入門１第4回:ファシリテーション入門２第5回:ファシリテーション入門３第6回:ファシリテーション実践１第7回:ファシリテーション実践２第8回:ファシリテーション実践３第9回:ファシリテーション実践１第10回:イベントプロモーション法１第11回:イベントプロモーション法２第12回:SDGsカードゲームの実施１第13回:SDGsカードゲームの実施２第14回:最終の振り返り",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/08\/07"
}