{
    "lectureCode": "P023402",
    "courseName": "プロジェクト演習VIII[先端ミュージッククリエイション]",
    "lecturer": [
        "伊藤彰教(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "インタラクティブ・ミュージック、ジェネラティブ・ミュージック、ライブ・コーディング、など、テクノロジーを活用した先端的な音楽制作の手法を広く演習します。初学者から学べるよう、３年間継続して、音楽理論・楽曲分析・作曲技法・ミュージックテクノロジー・DAW操作などを学ぶと共に、藝術音楽・民族音楽・テクノミュージックなど、多種な文化の音楽に接します。映像音楽（フィルムスコアリング）・ゲーム音楽の創作のほか、サウンドデザインに有用なミュージックエフェクトへの応用にも取り組みます。この演習テーマは、学生の習熟度に合わせて3クラスが開講されます。＜学年問わず初めて本テーマを受講する学生向けクラス＞初学者の学生は、学年を問わず前期1セメスター目の開講時間に参加し、後期以降に本格化する高度な内容の習熟に向けた準備学習を行います。この履修と単位習得をもって選抜とします。後期から本テーマに興味を持ってもらった学生さんは、次年度まで待ち、2026年度前期に１セメスター目の演習に参加してください。＜MuTeKクラス(選抜有)＞DAWや先端的なディジタル音楽ツールを用いて実際に音楽を制作するクラスです。後期→前期がワンセットの内容です。＜Analyseクラス(選抜有)＞作編曲に必要な基礎的な音楽の知識,音楽理論,楽曲分析の方法を学びます。後期→前期がワンセットの内容です。本シラバスは【MuTeKクラスおよびAnalyseクラスの後期】につき説明します。１年生のプロジェクト演習IIIにて、どちらか片方を受講した経験がある場合は、今学期はもう片方のクラスを受講することを推奨します。",
        "outcomesMeasuredBy": "DAWを用いた基礎的な楽曲制作手法を学びます。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "NotePCと演習室の音響機器群の両方を使って演習を実施します。学期中にアクティブラーニングとして作品発表会を実施します。これは審査や評価をするものではなく、学生同士が新たな表現を刺激し合う機会として開催します。教員からの一方的な押し付けではなく、若いみなさんが着目する音楽・音響表現を積極的に採りあげます。後述するICTツールで多数の情報を寄せることを「オンラインでのプレゼン演習」と位置付け、アクティブラーニングとします。",
        "notices": "【選抜あり】本テーマの後期はいずれも事前選抜があります。後期（3,4クォータ）からの無条件の履修はできませんので注意してください。選抜の第一条件として、履修・聴講を問わず、１年前期（1,2クォータ）の先端ミュージッククリエイションを受講する必要があります。詳細な選抜内容については本テーマの個別説明会および前期の演習内にて説明します。【2025年度＜編入生＞向けの留意点】選抜をクリアしていない人は、2026年前期の１セメスター目の演習に参加し、選抜を受けてください。事前相談の結果、例外的に今期から演習に参加を許可された場合は、2年生は「プロジェクト演習VIIあるいはVIII」、3年生は「プロジェクト演習VI」に履修登録してください。※：2・3年次編入生は、別途選抜条件を設けています。説明会に参加し、伊藤彰教と確認・相談の上、履修・聴講および受講内容を決めてください。",
        "preparatoryStudy": "本演習では授業時間外での円滑な情報交換と、数回程度実施予定の反転授業用準備のため、slackやdiscordといったICTツールを利用します。最新のweb資料、出版物などはその中で随時提示するため、オンラインを活用して主体的に情報取得する生活習慣を身につけておきましょう。オンラインの情報取得・交換と、課題を進める作業のため、毎週最低60分以上は時間外学習に費やしてください。",
        "gradingGuidelines": "期末創作課題およびレポート【60％】・授業内での小課題【40％】で評価し、60点以上を単位認定要件とします。課題や達成度に関するフィードバックはslack,discordといった授業で利用するICTツールにて行います。",
        "textbook": "使用しません",
        "referenceMaterials": "【両クラス共通】小鍛冶邦隆ほか(2019).『楽典音楽の基礎から和声へ』.アルテスパブリッシング.池辺晋一郎(2017).『オーケストラの読みかた:スコア・リーディング入門』改訂版.学研.【MuTeKクラス】大津真.(2024).『MASTEROFLogicPro[改訂第3版]』.ビーエヌエヌ.永野光浩.(2025).『新・DTMオーケストラサウンドの作り方〜実践的作編曲のテクニック』.スタイルノート.【Analyseクラス】野平一郎(監修)(2022).『音楽アナリーゼのための実践ガイド:実習図説・音楽用語集図表』.音楽之友社.山本裕之ほか(2023).『和声を理解するバス音からの分析』.アルテスパブリッシング.",
        "courseSchedule": "【MuTeKクラス後期】第1回：ガイダンス-演習環境の取扱い-第2回：シンセサイザおよびDAWの基本操作第3回：ステップ入力とリアルタイム入力第4回：ヴェロシティーによる表情付け第5回：楽譜打ち込み実践(1)-弦楽合奏-第6回：オーケストラスコアの構造と楽器第7回：MIDIエフェクトとトランスポーズ第8回：サスティンペダルの入力第9回：リズムと連符第10回：MIDI打ち込み実践(2)-オーケストラ-第11回：ソフトウェアシンセサイザ応用第12回：サンプラー応用第13回：オートメーション第14回：エフェクトとミキシング【Analyseクラス後期】第１回：ガイダンス第２回：MajorScale/MinorScale第３回：Interval/Degree第４回：DiatonicChord第５回：7thChrod第６回：和音の機能とカデンツ第７回：リダクション第８回：アナリーゼの実施-J.S.Bach-第９回：非和声音の種類と判別第10回：楽曲の形式第11回：アナリーゼの実施-Mozart-第12回：アナリーゼの実施-単旋律とハーモナイズ推定-第13回：Tonalityと調性第14回：ポピュラー音楽への応用と限界",
        "courseDataUpdatedAt": "2025/03/03"
    },
    "updateAt": "2025/03/21"
}