{
    "lectureCode": "P023008",
    "courseName": "プロジェクト演習IV[AudioEngineering]2023年以前入学者",
    "lecturer": [
        "伊藤彰教(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "録音・ミキシング・MA・SoundReinforcement（俗称PA）などの技術は「オーディオ・エンジニアリング」と総称されます。個別機材の操作・個別業務に高い専門性が求められる一方で、全てに共通した工学的原理のもとでのシステム設計・運用力も必要になります。本演習では業務用の音響機材を用いて、声・効果音・楽器音を対象としたオーディオ・エンジニアリングのスキルを実践的に学びます。録音・ミキシング・エフェクト・空間音響表現など、多様な分野の機器を個別に習得する他、電気・ディジタル音響工学、ネットワーク技術、音響知覚の理論を用いて、フルディジタル・ネットワークオーディオ環境にも対応できる総合的な音響システム構築・設定・運用管理作業にあたります。音楽スタジオはもとより、映像音響業務、オーディオドラマ制作、ゲームオーディオ、音響設備設計・敷設など、音響に関連する幅広い業界を目指す学生のための演習です。",
        "outcomesMeasuredBy": "録音・ミキシング・空間音響制作・音響プロジェクション環境構築といった、AudioEngineeringという活動が包括的に示す多種多様な作業内容・クオリティ向上のためのチェックポイントなどを実践的に習得します。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本演習では、学外公開を前提とした高品位な音響映像コンテンツ制作にグループワークとして取り組み、その質的側面で責任を持ちます。あらかじめ与えられた課題・タスクを学生自身で管理・実現するアクティブラーニング形式で授業を実施します。受講生はミクロ面・マクロ面双方で最低１つ以上の担当に責任を持ちます。授業時間以外に多くの時間を、ソフトウエアの習得、コンテンツの企画・設計、音響制作に充て、演習時間はその成果発表と助言を与えられる時間として使います。ノートPC必携です。課題と技術資料がICTツールにて先行して与えられ、演習時間は課題の成果を示す反転授業形式で実施します。",
        "notices": "プロジェクト演習「先端ミュージッククリエイション」「先端音響創造」両方を受講し、一定の成績以上を修めることで選抜とします。",
        "preparatoryStudy": "課題と技術資料がICTツールにて先行して与えられ、演習時間は課題の成果を示す反転授業形式で実施します。音響機器のほか、IPネットワークの敷設・設定作業も必要になります。演習講師に音響・映像制作現場での経験豊富な実践講師をお招きし、インターンと同様のレヴェルで評価をお願いしています。毎週の演習時間は制作現場への入社技能試験のつもりで毎回60分以上の準備活動を経て臨んでください。不足する経験・知識は別のプロジェクト演習やICTツールを自主的に活用して補ってください。スタジオのホストPCはMacOSのため、MacOSに慣れておくことが望ましいです。",
        "gradingGuidelines": "プロジェクトにおける担当部門を完成させれば60点・作業記録ドキュメントの量と質で最大20点・自主的な勉強会開催の主催の多さで最大20点の100点満点で評価し、60点を単位取得条件とします。作業記録ドキュメントと勉強会主催は加点評価なので、担当部門作業を完成させなければ単位は取得できません。課題や達成度に関するフィードバックは演習時間内およびslack,discordといった授業で利用するICTツールにて行います。",
        "textbook": "『映像音響設備マニュアル2023年改訂版』リットーミュージック",
        "referenceMaterials": "日本音楽スタジオ協会『サウンドレコーディング技術概論2023年版』沢口真生『サラウンド入門』東京藝術大学出版会(2010)杉山勇司『レコーディング／ミキシングの全知識』リットーミュージック(2013)安斎直宗『新・エフェクターの全知識』リットーミュージック(2013)小瀬高夫・須藤浩『PA入門三訂版』(2019)",
        "courseSchedule": "第1回:ガイダンス・プロジェクト選定第2回:業務用音響機器の信号と配線第3回:音声信号とケーブル第4回:ディジタル音響制作のルーティングデザイン第5回:ルーティング実施演習第6回:マイクの種類と設置第7回:プロジェクトでの企画立案第8回:環境設定・機器テスト演習第9回:レコーディングとサラウンドのルーティングデザイン第10回:レコーディング・エフェクタによる制作演習第11回:サラウンドの設定と制作第12回:3Dオーディオの設定と制作第13回:環境設定・機器テスト演習第14回:成果発表プレゼン・長期休暇中の活動計画発表",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/08\/07"
}