{
    "lectureCode": "P023054",
    "courseName": "プロジェクト演習IV[コンテンツデータアナリシス]2023年以前入学者",
    "lecturer": [
        "伊藤彰教(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本演習では「メディアコンテンツに対するアンケートの実施」を実例として、以下の一連のフェーズを総合的に学習します。(1)視聴覚・インタラクションに関する印象評価実験の計画と準備(2)評価実験・アンケートの適切な実施方法とデータ基礎集計(3)カテゴリカルデータを含むデータアナリシスと考察(4)分析手法と考察結果に応じたプレゼンテーション想定している対象者は以下のような学生です。・コンテンツが人の印象や行動に与える影響に興味がある・コンテンツには興味があるが大学の研究活動にうまく結び付けられない・授業や研究などでコンテンツに関するアンケートを実施・分析せねばならない・職場でデータ分析やプログラミングが得意な人と協業できるクリエイター、ディレクタになりたい本演習では、主に人文系やコンテンツ系を研究したい学生を想定しますので、数理統計面の理解や処理はソフトウエアに任せ、分析の計画からプレゼンテーションまでの全体の運用面や流れを練習します。",
        "outcomesMeasuredBy": "カテゴリカルデータを対象とし、ノン・パラメトリック検定を中心に、データ分析ソフトウェアJASPを利用したコンテンツに対する印象評価の企画立案・データ分析を習得するとともに、Officeソフトウェアによる結果のまとめ方・考察手法について習熟します。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ワークショップ形式を中心に、一部座学やソフトウエアのチュートリアルを行います。データアナリシスのさまざまな事例を体験するため、学期中に２回の実践を繰り返します。ノートPC必携です。データアナリシスの手法は、みなさんの調査対象・興味などによって10程度の中から１つを選んでもらいます。このため、特定の手法を順次習うという方法はとりません。みなさんの知りたいことを提案してもらい、それに応じて適切な分析手法を選ぶというところから始めます。このため、全員が同じ内容を学ぶというよりも、複数の分析手法や事例を並行して学習する形式となります。",
        "notices": "授業中は、活動成果の発表や意見交換、複数名がいないと体験できない演習を中心に実施します。個人で進められる基礎知識の学習、データ整形、プレゼン準備などは演習時間外に進めてください。聴講、特に４年生以上の聴講も歓迎しますが学期中の途中離脱は認めません。聴講する人も履修生と同様に、最終回までしっかりと受講し課題も全て提出しましょう。就職活動などで欠席することは構いませんが、オンラインの情報交換をチェックして欠席分の内容をしっかりとフォローしてください。なお、聴講に関する事前許可などは不要です。直接第１回目のガイダンスに足を運んでください。",
        "preparatoryStudy": "毎回60分程度を目安として、MSOffice（Excel,Powerpoint,Word）を十分に練習しておいてください。特にExcelとPowerpointを多用します。いずれも、図表の作成、アプリケーション間での図表のインポート・エクスポート、フォントや体裁の調整などを頻繁に行います。",
        "gradingGuidelines": "MSOffice（Excel,Powerpoint,Word）を十分に練習しておいてください。特にExcelとPowerpointを多用します。いずれも、図表の作成、アプリケーション間での図表のインポート・エクスポート、フォントや体裁の調整などを頻繁に行います。参考文献・授業中に示す資料の講読・JASPの操作練習を含めて、週60分以上を準備にあててください。",
        "textbook": "使用しません",
        "referenceMaterials": "",
        "courseSchedule": "【イントロダクション】第１回：カテゴリカルデータとその分析法・演習環境の整備【レッスン１：グループ間・属性間の差を測る】第２回：調査対象の計画第３回：実験刺激の制作手法と留意点第４回：アンケートの実施手続き第５回：データ整形と基礎集計第６回：データアナリシスの実際と考察第７回：報告書のまとめかた第８回：プレゼンテーション【レッスン２：大量のデータを分類して関係をさぐる】第９回：調査対象の計画・データ分析手法の選定第10回：データ取得の実施手続き第11回：データ整形とクレンジング第12回：データアナリシスの実際と考察第13回：報告書のまとめかた第14回：プレゼンテーション",
        "courseDataUpdatedAt": "2024/01/30"
    },
    "updateAt": "2024/12/13"
}