{
    "lectureCode": "P023117",
    "courseName": "プロジェクト演習Ｖ[キッズアニメーションディベロップメント]2023年以前入学者",
    "lecturer": [
        "川島基展(メディア学部メディア学科)",
        "三上浩司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "3年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "キッズアニメーションディベロップメントは、商業展開を想定した子供向けCGアニメーション作品の企画を立案する演習授業です。この演習はキッズアニメーションCG制作プロジェクトと連動して実施します。演習では、履修者それぞれが持っている『面白さ』の価値観を、これまでの体験と照らし合わせて分析・発表し、授業内で共有することから始めます。次に、自分は何を面白いと感じるのか？他の人との共通点や異なる点に対する認識を深め、自分の『面白さ』の追求のための作品鑑賞と分析を行います。その上で自分が表現したい『面白さ』の本質を見定め、それを軸とした個人企画案を作成し発表します。商業アニメーション作品を商品としてとらえ、企画から完成に至るまでのプロセスを学び、商業作品として成功させるための付加価値や商品展開について調査して企画案に取り入れます。発表と意見交流を繰り返し、より多くの人を惹きつける内容にすべく改良を重ね、個人企画としての選抜を行います。数回の選抜を経て代表企画を決定します。大学での模擬的な企画立案にとどまらず、企業と連携し、実際の商業作品での企画採用を目指していきます。本科目では、おもに商業作品レベルの企画立案を行うための実践スキルについて学びます。",
        "outcomesMeasuredBy": "アニメーションコンテンツの企画から実制作までの制作工程の理解し，制作ができるようになります．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業前半に好きな作品や関連作品を調査分析し、自分にとっての『面白さ』や人を惹きつける作品の魅力について考察を深めます。授業後半では一人一つアニメーション企画を立案し、プレゼンとディスカッションを重ねて共感を得られる魅力的な企画にブラシアップしていきます。前年度の選抜によって実制作が決定した企画に参加し、制作内容の詳細を会議で決定し、割り振られたタスクを通じてアニメーション制作に取り組みます。通常授業に加え、任意参加となりますが、春季休業中週一回程度CTCに集まり、ディスカッション、ワークショップ、作品鑑賞を行います。なお、本演習はキッズアニメーションCG制作プロジェクトと連動しており、キッズアニメーションCG制作プロジェクトではCG制作技術を学習しつつ、本演習で立案した企画のパイロットフィルム制作を行います。教室のPCを使いますので、ノートPCの持参は必須ではありません。",
        "notices": "本演習は週一回の授業時間の他、課題をこなしグループミーティングを重ねるための時間が必要になるので、原則として多くの時間を要する他のプロジェクト演習等との重複履修・聴講はできません。特別な事情がある場合は、個別説明会等で必ず相談に来るようにしてください。",
        "preparatoryStudy": "アニメーション作品に限らず、映画、漫画、音楽、スポーツ等、自分が愛好している趣味を掘り下げて考察しておくことをお勧めします。毎回の授業に際しては、次の通り予習・復習を合わせて60分程度行ったうえでグループワーク・制作課題に取り組むものとします。予習：グループワーク・制作課題の取り組みにつき、作業報告と今後の計画について報告するための準備を行う復習：授業の内容を十分に復習のうえ、グループワーク・制作課題に取り組むこと。",
        "gradingGuidelines": "成果物として提出された企画案の完成度（50点）、共同企画に対する取り組み（50点）によって評価します。合計60点以上が単位認定の最低要件になります。",
        "textbook": "授業時間内に配布する他、ウェブページで公開します。",
        "referenceMaterials": "随時、紹介します。コンテンツ工学の基礎（金子満・ボーンデジタル社）三上、近藤：コンテンツクリエーション、コロナ社(2014年）",
        "courseSchedule": "第1回オリエンテーション\/授業概要説明第2回自己紹介チーム編成第3回企画制作会議第4回チーム企画案発表・ディスカッション（１）第5回チーム企画案発表・ディスカッション（２）第6回チーム企画案ディスカッション（１）第7回チーム企画案ディスカッション（２）第8回企画制作制作会議第9回ブレストトレーニング\/即席企画立案第10回チーム企画案ディスカッション（３）第11回共同企画制作会議第12回チーム企画案ディスカッション（４）第13回春季活動計画会議第14回チーム企画案発表",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/09\/13"
}