{
    "lectureCode": "P023209",
    "courseName": "プロジェクト演習VI[サウンドデザイン]2023年以前入学者",
    "lecturer": [
        "伊藤彰教(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "3年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "「サウンドデザイン」という用語は通例としてミクロ・マクロの２つの意味を含みます。ミクロな意味でのサウンドデザインは、生音を忠実に録音・再現することで効果音や状況描写音を作成するfoleyに対し、シンセサイザ・エフェクタ・サウンドプログラミング・インタラクティブな道具作成といったテクノロジーを駆使して架空や空想の状況の音を作成する営為を指します。マクロな意味では、音楽・効果音・声・その他コンテンツに必要なすべての音のクオリティと配置に責任を持ち、音響の側面からコンテンツの責任をもつ音響監督のような営為を指します。本演習では、ミクロ面では先端的音楽・音響制作ツールと様々なDAWソフトを用いて、多様なクリエイティブな音響制作に取り組みます。マクロ面では「AudioEngineering」と共同で学外発表用コンテンツ制作に取り組み、そのクリエイティブな面について責任を持ちます。フィルム・スコアリングやゲーム音楽制作に取り組みたい学生も歓迎します。",
        "outcomesMeasuredBy": "メディアコンテンツ制作における＜サウンドデザイン＞という活動が包括的に示す多種多様な作業内容・クオリティ向上のためのチェックポイントなどを実践的に習得します。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本演習では、学外公開を前提とした高品位な音響映像コンテンツ制作にグループワークとして取り組み、その質的側面で責任を持ちます。あらかじめ与えられた課題・タスクを学生自身で管理・実現するアクティブラーニング形式で授業を実施します。受講生はミクロ面・マクロ面双方で最低１つ以上の担当に責任を持ちます。授業時間以外に多くの時間を、ソフトウエアの習得、コンテンツの企画・設計、音響制作に充て、演習時間はその成果発表と助言を与えられる時間として使います。ノートPC必携です。課題と技術資料がICTツールにて先行して与えられ、演習時間は課題の成果を示す反転授業形式で実施します。",
        "notices": "プロジェクト演習「先端ミュージッククリエイション」「先端音響創造」両方を受講し、一定の成績以上を修めることで選抜とします。",
        "preparatoryStudy": "取り組むコンテンツに応じて、映像・ゲーム制作などの知識とスキルも必要になります。週60分以上を準備にあてて臨んでください。不足する経験・知識は別のプロジェクト演習やICTツールを自主的に活用して補ってください。スタジオのホストPCはMacOSのため、MacOSに慣れておくことが望ましいです。",
        "gradingGuidelines": "プロジェクトにおける担当部門のミクロ面を完成させれば30点・マクロ面を完成させれば30点・作業記録ドキュメントの量と質で最大20点・プロジェクト進捗会議主催の多さで最大20点の100点満点で評価し、60点を単位取得条件とします。作業記録ドキュメントと進捗会議主催は加点評価なので、担当部門作業を完成させなければ単位は取得できません。課題や達成度に関するフィードバックは演習時間内およびslack,discordといった授業で利用するICTツールにて行います。",
        "textbook": "日本ポストプロダクション協会『ポストプロダクション技術マニュアル[第9版]』(2023)",
        "referenceMaterials": "沢口真生ほか『サウンドデザインバイブル』兼六館出版(2015)小川哲弘『サウンドエフェクトの作り方』工学社(2015)",
        "courseSchedule": "第1回:ガイダンス・プロジェクト選定第2回：ドラマ的打楽器群第3回：擬態語の音表現第4回：効果音としての声・声としての効果音第5回：UIサウンド第6回：diegetic\/non-diegetic\/meta-diegetic表現第7回：DAW・商用プラグインの限界と学術的コンピュータ音楽ツールの利点第8回：音を操作するUI群第9回：奥行き・広がり表現第10回：ステレオ・ハードセンター・水平サラウンド表現第11回：3Dオーディオ表現第12回：バイノーラル第13回：空間音響の収録と付与第14回：成果発表プレゼン・長期休暇中の活動計画発表",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/08\/07"
}