{
    "lectureCode": "P023332",
    "courseName": "プロジェクト演習VII[企業・団体のプロモーション技法]",
    "lecturer": [
        "永田明徳(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本プロジェクト演習では実際の営業用名刺、イベントや販売促進用ポスター・チラシ・POPなどのデザインを通じてより実践的なデザイン手法を学ぶ。２年次になるとインターンシップを想定した取り組みも重要となるがここでの学修は社会を知ってデザインを活かす、というスタンスで非常に有益である。現在、企業やボランティア団体・大学サークルの大多数はマンパワー不足等により適切な情報発信ができていない。この授業では、そういった企業や団体をピックアップし、営業・販売促進グッズとしての名刺デザインやイベントや販売促進用ポスターのみならずロゴやInstagramやFacebook等SNSのデザイン制作を通じて、商用デザインを学ぶ。デザインする際、情報発信元と情報発信相手の理解と発信方針の策定(PLAN)、情報発信のデザイン制作(DO)、そして、デザイン専門家による制作物のレビュー(CHECK)と専門家によるデザイン制作事例に直接触れること(ACTION)により、デザイン制作におけるPDCAサイクルを実践していきながら、学生自身のレベルアップを達成する。そして、実践的なデザイン法を学びながら個人のデザインポートフォリオを充実させていき、優秀なデザインは実際に商品化されることになる。デザイン中で使用するキャッチコピーはChatAIを活用し、画像イラスト素材はcanvaの画像生成AIの機能を使用する。",
        "outcomesMeasuredBy": "前半では主に名刺サイズのデザイン手法を学修し、後半ではポスターデザイン手法を学修する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ノートPC必携とする。毎回、トピック的な100分間プロジェクトを与え、そのプロジェクトのテーマに従ったポスター・リーフレット・名刺・プロモーショングッズなどのデザインを実施する。最初は簡単な名刺などのデザインからスタートし、レベルアップを図りながら最終的には多種多様な14個のプロジェクトに対する成果物(ポートフォリオ)が学生本人の成果物となる。最初の5～10分間でプロジェクトの説明、中盤の70分間は与えられたプロジェクトのデザイン、終盤の25分間でプロデザイナーによるデザインレビューを実施する。",
        "notices": "授業では積極的に参加すること。",
        "preparatoryStudy": "普段から多種多様なポスター事例に興味を持つこと。レビューを反映して予習・復習あわせて60分程度が必要である。",
        "gradingGuidelines": "個人課題（50点）、自由課題（50点）の合計により成績評価を行なう。また演習に対する積極的な取り組み態度（最大20点）を勘案して成績に加点評価をする。合計60点以上を合格とする。課題にはその都度コメントすることによってフィードバックを行う。",
        "textbook": "なし。",
        "referenceMaterials": "随時紹介する。",
        "courseSchedule": "第1回:簡単なポスター・名刺デザイン第2回:企業用ショップカードのデザイン第3回:ボランティア団体用ショップカードのデザイン第4回:Instagram用デザイン制作第5回:イベント招待用はがきデザイン制作第6回:イベントポスター用デザイン制作①第7回:イベントポスター用デザイン制作②第8回:企業用パンフレットのデザイン制作第9回:Facebookカバー用デザイン制作第10回:春イベント応じたデザイン制作第11回:夏イベント応じたデザイン制作第12回:秋イベント応じたデザイン制作第13回:冬イベント応じたデザイン制作第14回:プロモーション用ポスター制作",
        "courseDataUpdatedAt": "2025/01/07"
    },
    "updateAt": "2025/03/21"
}