{
    "lectureCode": "P023242",
    "courseName": "プロジェクト演習VI[プロフェッショナル背景CG]2023年以前入学者",
    "lecturer": [
        "三上浩司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "3年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "CGは映画のVFX，アニメ，ゲームなど様々な分野で広く利用される技術となっている．その中でも，背景は作品の世界観を創成する重要な役割を担っている．基本的なモデリング技術は，有機物のモデリングと比較すると身につけやすいが，反面，その基礎スキルをもとに，作品にに求められる世界を構築するには，モデリング技術に限らず，様々な知識や素養が要求される．本演習では，一通り背景モデリングの技術を習得した学生を対象に，様々な演出的な要素を含む背景CG制作に必要なスキルをプロジェクトベースで学ぶ演習である．将来作品の背景制作をディレクションするにあたって，必要となる表現力を高めることを重視する．(授業は演習講師の鈴木卓矢氏が担当します)この授業では，より発展的な内容を学び質の高いポートフォリオ作品を完成させます．",
        "outcomesMeasuredBy": "実現する作品の世界観を理解し，それを背景によって実現できる観察力，分析力，創造力の習得それらを具現化する背景CG制作スキルの習得＜本授業のラーニングアウトカム重点項目＞「実学に基づく専門能力」「論理的な思考力」",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本演習ではMayaとPhotoshopを用いて学習を行う。授業は各自が実現したいCGの背景をプレゼンテーションしながら作成する．その過程で，観察力，分析力，想像力を養う．※ノートPC必携",
        "notices": "授業は，作品のレビューや質の向上のための技法の指導などを行うため，授業時間以外に作品を制作する時間を確保すること．履修にあたってはポートフォリオ等で履修の可否を判断します．基本的に継続履修を必要とします．",
        "preparatoryStudy": "事前に基本的なモデリング技術を習得しておくこと．目標とする作品などをよく視聴し，レファレンスを集めておくこと．（約60分）フィードバックを受けて制作物をブラッシュアップすること．（約60分）",
        "gradingGuidelines": "最終課題（作品）の質（70％）と分析資料等（30％）により評価します．100点満点中60点以上で単位認定とする毎回の課題に対して常に教員からのフィードバックがあります．",
        "textbook": "特に使用しない．",
        "referenceMaterials": "授業において適宜指示する．",
        "courseSchedule": "第1回：オリエンテーション・課題プレゼンテーション（目標設定）第2回：プロフェッショナル背景アニメーション概論（座学）第3回：背景映像表現課題プレゼンテーションとレビュー①（コンテ）第4回：背景映像表現課題プレゼンテーションとレビュー②（レイアウト）第5回：背景映像表現課題プレゼンテーションとレビュー③（モデリング①）第6回：背景映像表現課題プレゼンテーションとレビュー④（モデリング②）第7回：背景映像表現課題プレゼンテーションとレビュー⑤（モデリング③）第8回：背景映像表現課題プレゼンテーションとレビュー⑥（モデリング④）第9回：背景映像表現課題プレゼンテーションとレビュー➆（ライティング）第10回：背景映像表現課題プレゼンテーションとレビュー⑧（テクスチャリング・質感設定①）第11回：背景映像表現課題プレゼンテーションとレビュー⑨（テクスチャリング・質感設定②）第12回：背景映像表現課題プレゼンテーションとレビュー⑩（テクスチャリング・質感設定③）第13回：背景映像表現課題プレゼンテーションとレビュー⑪（ブラッシュアップ①）第14回：最終発表会",
        "courseDataUpdatedAt": "2024\/01\/31"
    },
    "updateAt": "2024\/09\/13"
}