{
    "lectureCode": "P0230101",
    "courseName": "プロジェクト演習IV[IoTプロトタイピング演習]",
    "lecturer": [
        "寺澤卓也(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "私達の日常生活においてインターネット環境が欠かせないものになっている中で、IT技術を活用したサービスへの需要が増えてきました。そのため世の中の多くの場面において、短時間で良質なサービスを提供できる人材（サービスクリエーター）が必要とされています。このような社会のニーズに応えるため、本演習ではユニークなスマートサービスをタイムリーに創出できるサービスクリエーターの卵を早期に育成することを目的としています。スマートサービスを実現するには、これまで高度なプログラミング技術が必要でした。しかし、最近ではプログラミングの専門家でなくても、実践的なスマートサービスを構築・提供できる環境が出来つつあり、個人でもサービスの企画から構築、提供までを短期間で実現できるようになりました。そのような状況を背景として、ワークショップ型の少人数教育により知識とスキルを深め、ユニークなサービスのデザインを考案し、それを自らの手で実装・運用できる能力を身につけることを目指すのが本プロジェクト演習の目的です。特に実用的な仕組みの構築を目指します。",
        "outcomesMeasuredBy": "IoT（モノ・コトのインターネット化）を意識したスマートサービスのアイデアを考案し、それを自らの手で実装・運用するスキルを身につけることを目指します。また、そのスキルレベルとしては、MESH公式サイトや、各種のmicro:bitコミュニティにおいて公開可能なものとします。そのため、成果物をインターネット上で広く公開したり、アプリコンテストへの応募をゴールのひとつとして設定します。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本演習ではIoT時代の新しいデバイスであるMESH、micro:bit、RaspberryPiなどをプラットフォームとして用い、身のまわりの「あったらいいな」を実現するスマートサービスを構築します。演習を進めるにあたって、導入時にプログラミング技術は必ずしも必要ではありませんが、より高度なサービスを構築するにはJavaScriptまたはPythonのスキルに加えて、簡単な電子工作のスキルも必要となる場合があります。しかし、プログラミングや電子工作が未経験であってもこの演習を通して習得することが可能です。なお、演習で使用する機材はこちらで用意しますが、受講者はノートPCを必携とします。受講者はIoTを意識したスマートサービスを自分自身の手で実践していきます。講師からのアドバイスや指導を受けつつ、他の受講メンバーと協力して切磋琢磨してゆくスタイルで学習を進めていきます。",
        "notices": "IoTを意識したスマートサービス作成への強い意思があれば、経験を問わずに、本プロジェクト演習への参加を歓迎します。",
        "preparatoryStudy": "JavaScriptの初歩的知識があることが望ましいですが、これらの知識が無くても履修を通して習得することは可能ですのでぜひ挑戦してください。なお、サービスを試作し完成度を高めるには、授業外の活動時間が必要になります。micro:bitなどの機材は授業期間中は持ち帰ることを認めます。ノートPCと接続することで、予習・復習ができます。授業前には提供する資料を参照し基本的な概念や操作を確認してください（30分程度）。復習としては授業資料のほかWebサイトや書籍等を参考に授業で実現したことの発展を試みてください（30分程度）。",
        "gradingGuidelines": "演習課題として実際に稼働するIoTを意識したスマートサービスを一通り完成させることが単位認定の要件となります。成績評価は演習課題として取り組むサービスの独自性と実際に稼働するIoTサービスの完成度など（50%）、演習への取り組み状況（30%）、中間レビューと総合レビューの内容（20%）から総合的に判断し100点満点換算で60点以上を取得した場合単位を認定します。また、成果物をMESH公式サイトやmicro:bitコミュニティーなどに公開することや、各種コンテストへの応募とそこでの受賞結果なども上乗せ評価ポイントとなります。",
        "textbook": "特にありません。",
        "referenceMaterials": "演習中に必要に応じて紹介します。",
        "courseSchedule": "第1回：オリエンテーション（演習の進め方）第2回：MESHで日常を良くしよう！（1）第3回：MESHで日常を良くしよう！（2）第4回：MESHで日常を良くしよう！（3）第5回：micro:bitの基本的な使い方の習得（1）第6回：micro:bitの基本的な使い方の習得（2）第7回：micro:bitの基本的な使い方の習得（3）第8回：RaspberryPiを使ってみよう（1）第9回：RaspberryPiを使ってみよう（2）第10回：RaspberryPiを使ってみよう（3）第11回：中間レビュー（サービスアイデアおよび開発計画プレゼンテーション）第12回：サービス構築作業第13回：サービス構築作業第14回：総合レビュー（プレゼンテーションおよびデモンストレーション）",
        "courseDataUpdatedAt": "2024/02/14"
    },
    "updateAt": "2024/08/07"
}