{
    "lectureCode": "P023257",
    "courseName": "プロジェクト演習VI[地域創生アプリデザイン]2023年以前入学者",
    "lecturer": [
        "千種康民(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "近年のスマートフォンゲームやスマートフォンアプリを活用した地方創生やゲーミフィケーションを活用した教育コンテンツが注目されている。実際にアイデアをデザイン化する際に、既存の優れたアイデアや優れたデザインを参考にして取り組んでいくことにより、アイデアを優れたアイデアにし、デザインを優れたデザインにしていくプロセスが重要である。その時点では発見的なアプローチでなく、PDCAサイクルを用いて、アイデア→レビュー→より良いアイデア、、、、という改善プロセスと、デザイン→デザイン評価→より良いデザイン、、、、という改善プロセスというアプローチにより、優れたアイデアとは何か、優れたデザインとは何か、を学修する。以上を踏まえて、実際の事例調査することにより、地域課題発見から解決策の試行錯誤を通じて、アイデアを洗練させていく。そしてそのアイデアを実際のデザインとして制作していく。これらの過程においてはICT技術のみならず、社会学・教育学・心理学的なアプローチも採用するとさらに効果的である。本プロジェクト演習では、既存の様々な地域創生に役立っている課題解決アプリあるいはWebサービス等の事例調査をおこない様々な課題や解決法を理解していく。そして、グループディスカッションを通じて、オリジナルな企画・デザインに取り組んでいく。ここでのデザイン制作はadobe社figmaを用いる。終盤では、プロトタイプを制作した作品に対してユーザインタビューやユーザテストおよび専門家レビューを行ない、より良いデザインを完成させていく。",
        "outcomesMeasuredBy": "既存のWebサイトや情報システムの評価方法を修得し、新しいWebサイトやWebサービスを企画・開発する能力を修得する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ノートPC必携とする。授業の序盤では、地方創生を解決する事例を広く調査する。中盤ではアプリデザインやWebサービスの評価法とモバイルアプリのデザイン法を学び、最終的には身近な課題を解決する手法として企画デザイン案を策定し、デザイン制作に取り組む。つまり、受講生がICT系技術者として広く活躍できるよう、モバイルアプリ等の評価法および企画デザインができるよう横断的かつ実践的に学ぶ。",
        "notices": "この演習においては、HTML,javascript,jQueryMobileなどのプログラミング知識は一切不要である。しかしモバイルサイトやスマートフォンアプリのデザインの技術習得に対して強い意欲としっかりとした熱意を有していることが望ましい。また、グループワークの作業を伴うため、授業の履修には責任をもって取り組むこと。グループワークの活動については、意見を出し合う時間、個人作業時間、作業をまとめる時間、のそれぞれに対して各人が適切な役割を果たすこと。",
        "preparatoryStudy": "ほぼ毎回、課する宿題により予習または復習を行なっておくこと。予習・復習あわせて60分程度が必要である。",
        "gradingGuidelines": "個人課題（40点）、個人発表（30点）、発展課題（30点）の合計により成績評価を行なう。また演習に対する積極的な取り組み態度（最大20点）を勘案して成績に加点評価をする。合計60点以上を合格とする。課題にはその都度コメントすることによってフィードバックを行う。",
        "textbook": "なし。",
        "referenceMaterials": "随時紹介する。",
        "courseSchedule": "第1回:地域創生の事例調査（SDGs）第2回:地域創生ゲームの事例調査（ゲーミフィケーション）第3回:課題発見とfigmaデザインスキル第4回:課題解決（PDCAサイクル改善）第5回:コンセプトデザイン評価とxdデザインスキル第6回:洗練された課題解決法とその効果第7回:関連する事例調査とfigmaデザインスキル第8回:課題解決法のPDCAサイクル改善第9回:自由課題アプリの企画案第10回:自由課題アプリの企画改良版第11回:自由課題アプリのサイトデザイン制作第12回:自由課題アプリのサイトデザインの試験第13回:自由課題アプリのドキュメント作成第14回:自由課題の成果発表会",
        "courseDataUpdatedAt": "2024/01/30"
    },
    "updateAt": "2024/08/07"
}