{
    "lectureCode": "P023161",
    "courseName": "プロジェクト演習Ｖ[コンテンツデータアナリシス]2023年以前入学者",
    "lecturer": [
        "伊藤彰教(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "3年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "メディアコンテンツの構成要素を主な実例として、以下の一連のフェーズを総合的に学習します。(1)コンテンツの構成要素・構造の理解(2)分析したい対象（構造・関連・傾向）に応じた尺度化と分析手法の設計(3)カテゴリカルデータを含むデータアナリシスと考察(4)分析手法と考察結果に応じたプレゼンテーション想定している対象者は以下のような学生です。・コンテンツの制作手法に興味がある・コンテンツには興味があるが大学の研究活動にうまく結び付けられない・授業や研究などでコンテンツに関するアンケートを実施・分析せねばならない・職場でデータ分析やプログラミングが得意な人と協業できるクリエイター、ディレクタになりたい特に事前学習は不要なので、上記のうち「ひとつでもあてはまれば」受講できます。単位はつきませんが、卒研生や院生の聴講も歓迎します。本演習では、主に人文系やコンテンツ系を研究したい学生を想定しますので、数理統計面は処理はソフトウエアに任せ、分析の計画からプレゼンテーションまでの全体の運用面や流れを練習します。",
        "outcomesMeasuredBy": "カテゴリカルデータを対象とし、ノン・パラメトリック検定を中心に、コンテンツそのもののデータ分析・考察手法について習得します。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ワークショップ形式を中心に、一部座学やソフトウエアのチュートリアルを行います。データアナリシスのさまざまな事例を体験するため、学期中に２回の実践を繰り返します。ノートPC必携です。データアナリシスの手法は、みなさんの調査対象・興味などによって10程度の中から１つを選んでもらいます。このため、特定の手法を順次習うという方法はとりません。みなさんの知りたいことを提案してもらい、それに応じて適切な分析手法を選ぶというところから始めます。このため、全員が同じ内容を学ぶというよりも、複数の分析手法や事例を並行して学習する形式となります。",
        "notices": "授業中は、活動成果の発表や意見交換、複数名がいないと体験できない演習を中心に実施します。個人で進められる基礎知識の学習、データ整形、プレゼン準備などは演習時間外に進めてください。聴講、特に４年生以上の聴講も歓迎しますが学期中の途中離脱は認めません。聴講する人も履修生と同様に、最終回までしっかりと受講し課題も全て提出しましょう。就職活動などで欠席することは構いませんが、オンラインの情報交換をチェックして欠席分の内容をしっかりとフォローしてください。なお、聴講に関する事前許可などは不要です。直接第１回目のガイダンスに足を運んでください。",
        "preparatoryStudy": "MSOffice（Excel,Powerpoint,Word）を十分に練習しておいてください。特にExcelとPowerpointを多用します。いずれも、図表の作成、アプリケーション間での図表のインポート・エクスポート、フォントや体裁の調整などを頻繁に行います。参考文献・授業中に示す資料の講読を含めて、週60分以上を準備にあててください。",
        "gradingGuidelines": "学期中の課題２回をそれぞれ25点、期末最終レポートを50点の計100点とし、60点以上を単位取得条件とします。課題や達成度に関するフィードバックは演習時間内およびslack,discordといった授業で利用するICTツールにて行います。",
        "textbook": "使用しません",
        "referenceMaterials": "藤井良宜・金哲明『カテゴリカルデータ解析』共立出版(2010)豊田秀樹『データマイニング入門』東京図書(2008)",
        "courseSchedule": "【イントロダクション】第１回：ガイダンス：コンテンツとデータアナリシス第２回：カテゴリカルデータとその分析法・演習環境の整備【レッスン１：名義・順序尺度でのデータアナリシス】第３回：コンテンツの構成要素・構造の理解第４回：データアナリシスの目標設定と手法の選定第５回：分析の実施と考察第６回：報告書のまとめかた第７回：プレゼンテーション【レッスン２：数的・量的要素が混在したデータアナリシス】第８回：コンテンツの構成要素・構造の理解第９回：データアナリシスの目標設定と手法の選定第10回：予備分析の実施と改善案の立案第11回：本分析の実施と考察第12回：報告書のまとめかた第13回：プレゼンテーション【総合課題】第14回：論文サーベイの手法・実例を「読む」",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/12/13"
}