{
    "lectureCode": "P023317",
    "courseName": "プロジェクト演習VII[インタラクティブ・ゲーム制作＜ゲームデザイン＞]",
    "lecturer": [
        "安原広和(メディア学部メディア学科)",
        "三上浩司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "ゲームデザインはビデオゲームの骨格を設計する極めて重要な工程です。近年のゲームを取り巻く環境の変化から、ゲーム専用機のゲームの高度な表現や、スマートフォン向けのゲームなどの継続的なプレイを促す仕組みなど、考慮すべき点も多様になってきています。本演習では今まで培った世界市場で通用するゲームデザイナーとしての実務経験を活かし、ゲームや遊びの歴史からヒトの特性を理解し、新規性（未見性）がありながらもどこか既視感があり、直感的にあそべるゲームのデザインを提案できるようになるために、ゲームエンジン「Unity」を使い３Dゲームのプログラムを作りながら、ヒトがなぜ「たのしい、おもしろい」と感じるのかを自らが実装して、参加者全員で評価しあうことでゲームデザインの気づきを得る授業です。ⅦではUnityを用いて自分のゲームプロトタイプを制作することを主眼に置いています。",
        "outcomesMeasuredBy": "ゲームデザインの基礎技術を使いながら、ターゲットユーザを考慮したうえで、どのようなゲームプレイ体験がふさわしいのか？、論理的にゲームを提案できる能力を身に着けます。市場で評価されたり、話題となったゲームを題材に、自ら制作することでどのような要素が、「たのしさ、おもしろさ」に作用しているのかを学習し、理解します。またUnityの基礎的な操作を習得し、ヒトがたのしいと感じる操作、ゲームデザイン、レベルデザインの基礎を理解したプロトタイプを制作できるようになることを目標としています。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本演習は，「プロジェクト演習＜インタラクティブゲーム制作（プロデューシング）＞」の補助的な演習で、ゲームデザインの役割を担うためのゲームデザインの知識やスキルの習得を目指します。Unityの基礎的なツール操作、C#スクリプトを毎回教えます。それらを使ったレベルを自分でデザインして、Unity上で動かしてあそべるように実装します。各参加者の制作した作品を見ながら評価しあい、ゲームデザインの基本技術を理解し，各自でゲームを分析し、ディスカッションしたり、それらを組み込んだ新しい企画を提案したりします。最終的には，東京ゲームショウで開発するゲームの企画を提案し，それらを分析，議論を経て，ブラッシュアップしながら授業を進めます。ノートPCを使用します。",
        "notices": "授業時間のほかに多くの時間が，作品制作、調査や分析に必要になります。事前準備をしっかりできる時間を確保してください。また、Unityを学びたいだけの学生ではなく、プログラムを書く、ゲームを作る、デザインしたいという熱意がある学生を対象にしています。",
        "preparatoryStudy": "日ごろから様々なエンタテインメントコンテンツに興味を持ち，それらを分析して他の履修者にプレゼンできるようにすること。Unity社が提供しているチュートリアルと「あそびのデザイン講座」、またはYouTubeに上がっているUnityのチュートリアルなどを見ておくとよいです。(120分以上）",
        "gradingGuidelines": "提出された作品で授業の成績評価とします。課題とされた要点を踏まえたものになっているか？自分なりの工夫やアイデアが加えられているか？などを評価します。課題提出は原則毎回とします．毎回の自作のプレゼンを行ってもらいます。また事前に工夫した点、参考にしたページなど、授業用のDiscordに書き込んでもらいます。提出で50点、プレゼンと作品の内容と書きこんだ内容で50点、100点満点中60点以上で単位認定とします。",
        "textbook": "特に指定しない",
        "referenceMaterials": "特にないが、ゲームとCGの技術（コロナ社）市販のUnityの使い方の参考書など適宜指示します。",
        "courseSchedule": "第1回：「Unityのガイダンス」第2回：「たのしいは学ぶことから始まる」第3回：「自由度を増やす」第4回：「UI-計測」第5回：「UI-時間」第6回：「カウントダウン」第7回：「戦略」第8回：「カメラ」第9回：「トップダウンメニュー」第10回：「追いかけっこ」第11回：「Ray」第12回：「放物線」第13回：「攻撃と移動」第14回：「プロトタイプ品評会」",
        "courseDataUpdatedAt": "2025/01/23"
    },
    "updateAt": "2025/03/21"
}