{
    "lectureCode": "P023232",
    "courseName": "プロジェクト演習VI[インタラクティブ・ゲーム制作＜サウンド＞]2023年以前入学者",
    "lecturer": [
        "伊藤彰教(メディア学部メディア学科)",
        "三上浩司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "3年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本演習はグローバルゲームジャムなど学外ゲーム制作にむけたチーム制作に伴い、プロフェッショナルスタイルのゲームサウンド制作手法と質的水準を体験的に学ぶことで、ゲームの音楽・サウンド全般のクオリティを高めるための演習です。音楽・声・効果音・オーディオエンジニアリング・サウンドデザイン・プログラミングなど、ゲームサウンドに関わる幅広い分野をカバーするため、演習は大きく２つのテーマに分かれます。【表現設計クラス：1年後期以降＜選抜なし＞】ゲームメカニクスの分析に基づき、ゲームサウンドの要素・動き・配置などを設計する手法や専門用語をゲームプレイとプレイヤー観察の学術的手法を踏まえて実践します。これを理解するために必要なプロの方法を、社会人研修などに活用されている手法を用いて体験的に学びます。【実装管理クラス：2年後期以降＜選抜あり＞】Unity,ADXIILEなどのゲーム制作用ミドルウエア群を用いて、音を制御するプログラミングとこれを活用したゲームサウンド特有の表現手法を実践的に学習します。このコースはADXIIの開発企業であるCRIミドルウエア社の社員を演習講師として招聘して実施します。プロジェクト演習は以下のような履修登録の構成になっています。1セメスター(1,2クォータ連続)：プロジェクト演習IおよびII2セメスター(3,4クォータ連続)：プロジェクト演習IIIおよびIV3セメスター：プロジェクト演習III(2023年度以前入学者向け表記)4セメスター：プロジェクト演習IV(2023年度以前入学者向け表記)5セメスター：プロジェクト演習V(2023年度以前入学者向け表記)6セメスター：プロジェクト演習VI(2023年度以前入学者向け表記)後期にあたる今学期は、2,4,6セメスターが開講されます。このシラバスでは、主要な受講対象者である、2024年度3年次編入生である「表現設計クラス＜選抜なし＞」について説明します。",
        "outcomesMeasuredBy": "今期（3,4クォータ）の表現設計クラスでは、以下を学びます。・ゲームサウンドの構成要素・構成手法を知る・ゲーム産業におけるゲームサウンドの業種・業態を知る・ゲームサウンドの研究分野について知る",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "表現設計クラスは主に、チーム内でサウンド、ゲームデザイン、プロデューシングを担当する学生を対象としています。毎回50分程度、調査やディスカッション・制作に関する予備知識について、様々なコンテンツや資料を紹介して講義を行います。その後教員を交え、ゲームをプレイしながらのサウンド構成分析を行い、ゲーム特有のサウンドデザイン手法を学びます。NotePC必携です。",
        "notices": "本演習ではゲーム音楽や効果音の作り方自体は取り扱いません。個別の音楽・音響制作スキルを学びたい学生は、プロジェクト演習「先端音響創造」「先端ミュージッククリエイション」を、本演習と並行して聴講してください。※：2024年度3年次編入生が実装管理クラス＜選抜あり＞の参加として履修を希望する場合は、別途参加条件を設けています。説明会に参加の上、伊藤彰教と確認・相談をして参加するコースを決定してください。",
        "preparatoryStudy": "授業時間外に、週60分以上を目安として、以下の活動を予習・復習として行ってください。授業時間外の円滑な情報提供のため、discordなどのICTツールを活用します。提示された資料群にも目を通し十分なコミュニケーションを通じて専門的知識を得てから演習に臨んでください。加えて、教科書・参考書は一通り目を通し、自習できる技術習得は自主的に進めて毎回の授業に臨んでください。",
        "gradingGuidelines": "期末レポートおよび制作【60％】、授業内での小課題およびプレゼンテーション【40％】を目安で評価し、60点以上を単位認定要件とします。課題や達成度に関するフィードバックはdiscordなどのICTツールにて行います。",
        "textbook": "セリア・ホデント『ゲーマーズ・ブレイン』ボーンデジタル(2019)",
        "referenceMaterials": "掌田津耶乃『見てわかるUnity2019C#スクリプト超入門』秀和システム(2019)一條貴彰ほか『Unityサウンドエキスパート養成講座』ボーンデジタル(2019)ウィニフレッド・フィリップス『ゲームサウンド制作ガイド―インタラクティブな音楽のための作曲技法』オライリージャパン(2015)",
        "courseSchedule": "【表現設計クラス】第1回:イントロダクション第2回:ゲームメカニクスとサウンドアナリシス（１）（伊藤・三上）第3回:ゲームメカニクスとサウンドアナリシス（２）（伊藤・三上）第4回:UI・UXアナリシスとサウンド（１）（伊藤・三上）第5回:UI・UXアナリシスとサウンド（２）（伊藤・三上）第6回:インゲーム／シネマティクスとサウンド（１）（伊藤・三上）第7回:インゲーム／シネマティクスとサウンド（2）（伊藤・三上）第8回:ゲームサウンド制作の基礎概念と技法（１）（伊藤・三上）第9回:ゲームサウンド制作の基礎概念と技法（２）（伊藤・三上）第10回:サウンド制作ツール（伊藤・三上）第11回:サウンド編集とエフェクト（伊藤・三上）第12回:受発注ロールプレイ（１）（伊藤・三上）第13回:受発注ロールプレイ（２）（伊藤・三上）第14回:打ち合わせ・会議・業務資料作成演習（伊藤・三上）",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/12/13"
}