{
    "lectureCode": "P0230641",
    "courseName": "プロジェクト演習IV[先端ミュージッククリエイション]",
    "lecturer": [
        "伊藤彰教(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "インタラクティブ・ミュージック、ジェネラティブ・ミュージック、ライブ・コーディング、など、テクノロジーを活用した先端的な音楽制作の手法を広く演習します。初学者から学べるよう、３年間継続して、音楽理論・楽曲分析・作曲技法・ミュージックテクノロジー・DAW操作などを学ぶと共に、藝術音楽・民族音楽・テクノミュージックなど、多種な文化の音楽に接します。映像音楽（フィルムスコアリング）・ゲーム音楽の創作のほか、サウンドデザインに有用なミュージックエフェクトへの応用にも取り組みます。プロジェクト演習は以下のような履修登録の構成になっています。1セメスター(1,2クォータ連続)：プロジェクト演習IおよびII2セメスター(3,4クォータ連続)：プロジェクト演習IIIおよびIV3セメスター(1,2クォータ連続)：プロジェクト演習VおよびVI4セメスター(3,4クォータ連続)：プロジェクト演習VIIおよびVIII5セメスター(1,2クォータ連続)：プロジェクト演習IXおよびX6セメスター(3,4クォータ連続)：プロジェクト演習XIおよびXII後期にあたる今学期は、2,4,6セメスターが開講されます。この演習テーマは、学生の習熟度に合わせて3クラスが開講されます。本シラバスは＜2セメスター目＞の内容につき説明します。",
        "outcomesMeasuredBy": "DAWを用いた基礎的な楽曲制作手法を学びます。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "NotePCと演習室の音響機器群の両方を使って演習を実施します。学期中にアクティブラーニングとして作品発表会を実施します。これは審査や評価をするものではなく、学生同士が新たな表現を刺激し合う機会として開催します。教員からの一方的な押し付けではなく、若いみなさんが着目する音楽・音響表現を積極的に採りあげます。後述するICTツールで多数の情報を寄せることを「オンラインでのプレゼン演習」と位置付け、アクティブラーニングとします。",
        "notices": "【2024年度新入生向け留意点】他のプロジェクト演習のテーマを「プロジェクト演習III」として履修し、このテーマも履修したい場合は、「プロジェクト演習IV先端音響創造」を選択してください。（「IV」はローマ数字の「4」を意味します）【在校生および2024年度編入生向けの留意点】2セメスター目の演習内容に参加する場合でも、2年生は「プロジェクト演習IV」、3年生は「プロジェクト演習VI」に履修登録してください。※：2・3年次編入生は、別途選抜条件を設けています。説明会に参加し、伊藤彰教と確認・相談の上、履修・聴講および受講内容を決めてください。",
        "preparatoryStudy": "本演習では授業時間外での円滑な情報交換と、数回程度実施予定の反転授業用準備のため、slackやdiscordといったICTツールを利用します。最新のweb資料、出版物などはその中で随時提示するため、オンラインを活用して主体的に情報取得する生活習慣を身につけておきましょう。オンラインの情報取得・交換と、課題を進める作業のため、毎週最低60分以上は時間外学習に費やしてください。",
        "gradingGuidelines": "期末創作課題およびレポート【60％】・授業内での小課題【40％】で評価し、60点以上を単位認定要件とします。課題や達成度に関するフィードバックはslack,discordといった授業で利用するICTツールにて行います。",
        "textbook": "使用しません",
        "referenceMaterials": "アクティブラーニングの準備用、反転授業の準備用として多数の資料をICTツール内にて随時紹介します。",
        "courseSchedule": "第1回：ガイダンス第2回：シンセサイザおよびDAWの基本操作第3回：ステップ入力とヴェロシティーによる表情付け第4回：リアルタイム入力／クオンタイズ／マーカー／キーボードショートカット第5回：プログラムチェンジによる楽器選択およびプロジェクト設定管理第6回：コントロールチェンジ信号による表情付け第7回：サイクル入力-ドラム＆パーカッション-第8回：グルーブクオンタイズ-ベース-第9回：コントロールチェンジとピッチベンド信号による表情付け-ギター-第10回：トラックオートメーション-パッド系サウンド-第11回：ポリリズム／複雑な連符第12回：移調／アレンジ／オーケストレーション第13回：ソフトウエアシンセサイザ第14回：エフェクトとミキシング",
        "courseDataUpdatedAt": "2024/02/14"
    },
    "updateAt": "2024/08/07"
}