{
    "lectureCode": "P023167",
    "courseName": "プロジェクト演習Ｖ[映画配給／宣伝プロデュース]2023年以前入学者",
    "lecturer": [
        "森川美幸(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "3年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "映画ビジネスは大きく分けて「製作」、「配給」、「興行」の３つで成り立っている。本演習ではその中でも「配給」におけるターゲット分析、ポスタービジュアル開発、予告編制作、メディア戦略、タイアップといった宣伝プロデュースについて学ぶ。前期では最終的に、自ら選んだ映画の上映企画を立案し、「興行」を見すえた上で映画館運営会社の(株)ヒューマックスシネマへ企画プレゼンを実施する。",
        "outcomesMeasuredBy": "本演習の大きな特徴は“大学と映画館との共同プロジェクト”だということである。映画宣伝に関して豊富なキャリアを持つ実務家の指導の下、映画上映の“企画立案→配給宣伝→興行”に、実践的に取り組むことで、実社会でも通用するスキルを習得する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本講義は以下の3つの方法を用いて進める。①講義：映画宣伝を通じてマーケティングコミュニケーションの手法・戦略を学ぶ。②グループワーク：チームに分かれて上映企画を立案することでグループ内コミュニケーション能力を得る。③プレゼンテーション：上映企画の映画館へのプレゼンで外部コミュニケーションを経験する。企画立案にはインターネットの検索やデジタルでの資料作成が必須となるため、ノートPCを必ず持参すること。",
        "notices": "企画立案とプレゼンテーション準備は時間のかかる作業である。殊に外部企業への提案を行うため、授業外の時間を使って活動しなくてはならない可能性があることを考慮した上で履修を決めること。",
        "preparatoryStudy": "ジャンル問わず、邦画・洋画問わず、古いものから新しいものまで、さまざまな映画作品を見てみること。さらに、社会状況やトレンドにもアンテナを張っておくこと。",
        "gradingGuidelines": "講義・演習時の積極的な参加姿勢や、グループへの貢献、企画内容とプレゼンテーションを考慮して評価する。評価の比率は以下の通りとする。講義、演習時の参加姿勢（教員評価＋グループ内評価）20%グループへの貢献（教員評価＋グループ内評価）30%企画内容およびプレゼンテーション50%合計60%以上を合格とする。提出物や課題へのフィードバックは、授業内または提出物にコメントを入れて返却するなどの方法で適宜行う。",
        "textbook": "特になし",
        "referenceMaterials": "佐々木和郎・羽田久一・森川美幸「メディア学大系14クリエイターのための映像表現技法」コロナ社その他、適宜指示する。",
        "courseSchedule": "第1回：講義「昨年の映画興行総括」「昨年度プロジェクト演習実績」第2回：講義「買付とは？」「今年の映画館上映ラインナップ」／グループ立ち上げ第3回：配給企画プロデュースワーク１第4回：配給企画プロデュースワーク２第5回：配給企画プロデュースワーク３第6回：プレゼンリハーサル第7回：配給企画プロデュースワーク４第8回：配給企画プレゼンテーション第9回：採用企画発表／講義「配給宣伝とは？」第10回：宣伝プランプロデュースワーク１第11回：宣伝プランプロデュースワーク２第12回：プレゼンリハーサル第13回：宣伝プランプレゼンテーション第14回：採用プラン発表／後期の説明",
        "courseDataUpdatedAt": "2024/01/23"
    },
    "updateAt": "2024/08/07"
}