{
    "lectureCode": "P023062",
    "courseName": "プロジェクト演習IV[VRコンテンツデザイン]2023年以前入学者",
    "lecturer": [
        "盛川浩志(メディア学部メディア学科)",
        "太田高志(メディア学部メディア学科)",
        "羽田久一(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "バーチャルリアリティ（VR）の特性を理解しVRならではの体験を提供するコンテンツの設計、制作を目指す。単体で動作するヘッドマウントディスプレイ（HMD）のMetaQuest2をプラットフォームとして、Unityを使った簡単なサンプル作成を通じてHMDで体験できるVRコンテンツ制作手法を習得し、各自でコンテンツを作成していく。VRならではユニークなアイデアを考えるために、VRを用いた作品やプロジェクトについての調査を行ったり、コンテンツのアイデアをワークショップとして考えることを行い、それぞれ発表をする。最終課題として、実際に動作するコンテンツを企画書と合わせて作成し提出する。ただし、演習II、IV、VIにおいては、始めてVRコンテンツを経験する学生については、基本的な機能の実現を学習した後にそれを利用した応用作品を作成することを繰り返し行う。受講が2回目以降の学生については、独自のアイデアによるコンテンツ作成を行う。1年を通じて受講できる場合、外部への展示が可能な完成度を目指して欲しい。",
        "outcomesMeasuredBy": "HMDで実際に動作するコンテンツを作成するため、VRコンテンツ作成の技術的なプロセスを習得することを目標とする。コンテンツのアイデアを考案し実装計画を含めた企画書としてまとめることや、プレゼンテーションをする力も養う。外部発表できる程度の完成度を目標とする。良いアイデアについては国際VRコンテスト（IVRC）などの対外発表への参加も目指す。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "基本的には個人毎に作品を制作する。そのためノートPC必携とする。アイデアの考案は教員からの指導を受けた後、発表会で互いに議論を行うことを繰り返して進行する。VRコンテンツの制作に関しては、基本的な部分を学び、それを基本として応用作品を制作することを繰り返していく。制作技術についてはSNSで調査項目を記入しあい共有する。作業は演習時間内だけでは足りないので課題として行ってくることを想定している。履修上の注意演習授業であるので、課題に毎週取り組んでくること。",
        "notices": "演習授業であるので、課題に毎週取り組んでくること。個人でHMDを所持している場合は、持参しての受講も可能である。プログラムのインストールやファイルのダウンロードなどで時間がかかる作業がある場合、事前に作業を行っておくことを指示する場合がある。また必須ではないが、もし所持しているよう出れば、ノートPCは専用GPUチップを搭載しているなど、比較的性能の良いものを使用することを推奨する。",
        "preparatoryStudy": "毎週時設定される次週までの作業内容をこなしてくること。また、Unityの操作や3Dモデリングについて演習内で細かく扱うことは無いので、自主的な学習が必要である（60分程度）。",
        "gradingGuidelines": "企画や作品については、企画発表、最終発表の際に論評によるフィードバックを行う。アイデアの内容と企画書の完成度（30%）、コンテンツの完成度（70％）の合計によって評価する。60点以上で単位認定とする。",
        "textbook": "特に指定するものは無い。適宜、資料などを共有する。",
        "referenceMaterials": "＊「バーチャルリアリティ学」舘暲（監修）＊「UnityによるVRアプリケーション開発」JonathanLinowes等",
        "courseSchedule": "第1回:ガイダンス、システム設定（盛川）第2回:HMDに対応したコンテンツの試作と動作確認（盛川）第3回:VRコンテンツ制作手法1HMDへの対応（盛川）第4回:VRコンテンツ制作手法2インタラクションの追加（盛川）第5回:VRコンテンツ事例調査（盛川）第6回:コンテンツ企画立案と試作（盛川）第7回:企画案発表（全教員）第8回:コンテンツの開発作業（盛川）第9回:コンテンツの開発作業：インタラクションの設計（盛川）第10回:コンテンツの開発作業：インタラクションの実装（盛川）第11回:コンテンツの開発作業：中間報告（盛川）第12回:コンテンツの開発作業：UIの設計と実装（盛川）第13回:コンテンツの開発作業：企画書の最終版とプレゼンテーションの用意（盛川）第14回:最終発表会（全教員）盛川が全回を担当、他の教員は企画や作品の発表会に参加する",
        "courseDataUpdatedAt": "2024\/01\/25"
    },
    "updateAt": "2024\/08\/07"
}