{
    "lectureCode": "P023427",
    "courseName": "プロジェクト演習VIII[インタラクティブ・ゲーム制作＜プロデューシング＞]",
    "lecturer": [
        "三上浩司(メディア学部メディア学科)",
        "栗原渉(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本演習は，全体を通じてコンピュータを使ったゲームを「作る」ために必要となる工程を理解し，そのスキルを実体験により身に付けることを目的としています．チームを形成し企画したゲームを3年後期までに展示会などに出展できるレベルまで完成させることを目的とします．その目的のために，他の演習で学んだ技術を終結させ，チーム一丸となって完成させます．ゲーム制作に必要な要素技術ごとに別れ，企画しているゲームの制作が中心となります．その中でもプロデューシングはゲームの分析や企画書の作成手法やプレゼンテーション，制作管理などの基礎技術を学び，「プログラミング」，「グラフィックス」，「サウンド」の履修者と一体となって完成まで導きます．3年次には大学のイベントに作品を出展し，ユーザーからのフィードバックを得ます．最終的に東京ゲームショウに作品を出展する予定です．この授業ではTGS出展のためのチーム結成し，プロトタイプを開発する．",
        "outcomesMeasuredBy": "東京ゲームショウに出展するためのゲームのα版の完成を目標とする．プロトタイプの開発を重ね，改善点について発展的なディスカッションを経て実装する能力の習得．新たな表現を採用する際の，技術情報の収集や検証の手法など，開発のための進め方やマネジメントの習得．コミュニケーション能力，論理的な思考力，分析・評価能力，問題解決力などの向上を目標とします．＜本授業のラーニングアウトカム重点項目＞「論理的な思考力」「問題解決力」",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "主にグループワークにより進めます．ゲーム制作以外にも、ディスカッションやプレゼンテーションを多く行います。ゲーム制作に必要な要素技術ごとに別れて企画しているゲームの制作が中心となります．その中でもプロデューシングはゲームの分析や企画書の作成手法やプレゼンテーション，制作管理などの基礎技術を学び，プログラミング，グラフィックス，サウンドの履修者と一体となって完成まで導きます．※ノートPC必携",
        "notices": "演習時間以外にも多くの準備が必要です．他の履修教科との時間配分に充分留意してください．自ら問題にとりくみ，仕組みを作り出し，工夫をする意欲のある学生を歓迎します．あらかじめ用意されている答えを知りたいタイプの学生には向きません．また基本的に継続して履修することを前提とします．1年次後期や2年次など途中から履修を希望する場合は履修前に相談すること．「インタラクティブ・ゲーム制作」の他のコースや「アニメーション」，「プログラミング」，「音楽」などの技術を他のプロジェクト演習で習得している場合は履修を許可することがあります．",
        "preparatoryStudy": "自分が制作したい思うゲームに関連するコンテンツはゲームに限らず，必ず分析すること．その際にユーザの視点ではなく，それを自分で作ることを意識して分析してください．授業で得たフィードバックをもとに改善すること（合わせて60分程度）",
        "gradingGuidelines": "演習ですので，出席し，同じ時間を共有することが最重要なのは言うまでもありません．その上で，ディスカッション・プレゼンテーションへの積極的な参加（30％），レポート（30％），作品（40％）をもとに評価します．100点満点中60点以上で単位認定とする毎回の発表に対して常に教員からのフィードバックがあります．",
        "textbook": "CGとゲームの技術（コロナ社）",
        "referenceMaterials": "適宜指示します．",
        "courseSchedule": "第1回:「オリエンテーション」（三上・栗原）第2回:「3年生TGS報告・ディスカッション」（三上・栗原）第3回:「2年生進捗報告・ディスカッション1」（三上・栗原）第4回:「2年生進捗報告・ディスカッション2」（三上・栗原）第5回:「2年生進捗報告・ディスカッション3」（三上・栗原）第6回:「2年生進捗報告・ディスカッション4」（三上・栗原）第7回:「2年生進捗報告・ディスカッション5」（三上・栗原）第8回:「2年生進捗報告・ディスカッション6」（三上・栗原）第9回:「3年生GGJ報告・ディスカッション1」（三上・栗原）第10回:「2年生進捗報告・ディスカッション7」（三上・栗原）第11回:「2年生進捗報告・ディスカッション8」（三上・栗原）第12回:「3年生GGJ報告・ディスカッション2」（三上・栗原）第13回:「2年生進捗報告・ディスカッション9」（三上・栗原）第14回:「最終発表会」1（三上・栗原）",
        "courseDataUpdatedAt": "2025/03/03"
    },
    "updateAt": "2025/03/21"
}