{
    "lectureCode": "GF1010",
    "courseName": "ソニックインタラクション",
    "lecturer": [
        "松村誠一郎(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "デザイン研究科修士課程デザイン専攻",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１４０４専門スキル演習室１"
    ],
    "courceDetails": {
        "courseOverview": "映像、ゲーム、インターネット、広告等のクリエイティブデザインの分野では、音楽や効果音等のサウンドデザインは必要不可欠な要素である。しかし近年、そこではデジタルテクノロジーを駆使するメディアデザインの発展が著しく、従来のメソッドによる音楽制作や効果音制作のみならず、プログラミングによってサウンドそのものを生み出し制御するサウンドプログラミングとインタラクションの手法によって「何を創るか」が重要視されている。音響系のエンジニアや電子音楽家のみならず、視覚系デザイナー、インタラクションデザイナーがテクノロジーを用いたサウンドデザインの知識や歴史について学び、基礎技術を学ぶことで、より俯瞰的な視野を得ることができる。本授業は、デジタルテクノロジーを用いた基礎的なサウンドデザインの知識、サウンドプログラミング、音にまつわるインタラクションについて論じ、サウンドコンテンツの実践的な制作を行う。ノードベースのプログラミング環境であるPureDataを用いる。本授業を通して、「実学に基づく専門能力」「論理的な思考力」「問題解決力」が養われることを目指す。本授業はゲーム制作企業におけるサウンド・デザインの実務経験を有した教員が行う実践的科目である。",
        "outcomesMeasuredBy": "・デジタルサウンドの基礎知識を理解する。・サウンドプログラミングを用いた電子音楽表現、インタラクションシステムの構築を行う。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "基本的には講義形式であるが、制作作業を行なうフェーズがある。ノートPC必携。授業資料の入手先は初回授業で提示する。",
        "notices": "・音楽制作経験の有無については問わない・Webアクセス、インターネット検索、タッチタイピング等、基本的なコンピュータの操作に慣れていることを前提とする。",
        "preparatoryStudy": "・予習前回の授業内容を自宅でも実践して確認する。（目途：30分程度）・復習授業内容に関連する小課題を自宅で実践する。（目途：30分程度）",
        "gradingGuidelines": "受講態度等の授業への取り組みに対する評価【50%】、授業の課題【50%】の割合で総合的に評価する。単位認定要件は60点以上とする。",
        "textbook": "松村誠一郎著,PdRecipeBookPureDataではじめるサウンドプログラミング,BNN新社,2012年.（電子書籍）初回授業にて購入方法を案内する予定。",
        "referenceMaterials": "授業内で適宜指示する。",
        "courseSchedule": "第1回：ガイダンス第2回：サウンドプログラミングの基礎1第3回：サウンドプログラミングの基礎2第4回：サウンドプログラミングの基礎3第5回：サウンドプログラミングの基礎4第6回：サウンドプログラミングの基礎5第7回：中間発表と講評第8回：サウンドプログラミングとインタラクション1第9回：サウンドプログラミングとインタラクション2第10回：サウンドプログラミングとインタラクション3第11回：サウンドプログラミングとインタラクション4第12回：サウンドプログラミングとインタラクション5第13回：製作作業第14回：最終発表と講評第15回：まとめ",
        "courseDataUpdatedAt": "2024\/03\/12"
    },
    "updateAt": "2024\/03\/19"
}