{
    "lectureCode": "GF1002",
    "courseName": "ビジュアルクリエイションI",
    "lecturer": [
        "伊藤丙雄(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月",
        "月2",
        "火",
        "火2"
    ],
    "targetDepartment": "デザイン研究科修士課程デザイン専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "4",
    "classroom": [
        "３１０１６教室"
    ],
    "courceDetails": {
        "courseOverview": "この授業では、入学時の研究計画書にある各自の研究テーマをベースに、関連する社会状況を調査、観察、内容により実地踏査を行うことを基本とした、修了研究に必要な「仮説」を導き出すための授業である。デザインは「温故知新」であり、携わる者は現状を捉え、未来を想い、過去の事例に対する知見を広げる努力が重要である。本科目では東京都内全域を調査対象の軸足に置き、様々な事例、文献、関連する資料、そしてフィールドワーク等、マクロからミクロまでの多角的な視点で対象となる実態を捉えその手法を学ぶ。授業は工業系デザイン、視覚系デザインと同じテーマで同時進行にて実施するが、結果としてどちらの系統においても取材力と高度な報告内容を求めており、加えてデザイン表現、スキルに裏打ちされた各自の報告内容に期待をしている。また本授業は、インダストリークリエイションⅠと合同で行い、後期まで継続的に研究を進める科目である。",
        "outcomesMeasuredBy": "前期では各自の研究テーマに関する徹底的な調査、観察、踏査など、リサーチをする基本的な仮説の組み立て、計画から報告までを目指す。並行して各自の研究活動に評価に活用させるなど、この授業での取り組みを通過点として認識することが大きな授業の到達目標である。また調査結果の分析や物事の構造評価などは、他者とのディスカッションを重ねた報告会、それまでの意見交換などのコミュニケーションにより成果が明確化され、密度のある調査内容と分析、評価は2年のデザイン研究Ⅱ、デザイン研究Ⅲ、修了制作への発展が期待される。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "当初リサーチは個人の研究テーマに則った形で行い、中間報告会以降は近い研究テーマで視覚、工業系に関係なく、ペアもしくはグループを結成し以降は活動、その対象研究を幅広く高いレベルへと昇華させる。また随時デザイン業界の著名人による講話や、ディスカッション、さらに担当教員による指導に加えた授業の仕組みにより、取り組む研究テーマを個々の仮説へと結び付ける。期末報告会には個々に戻り各自の研究テーマ報告を行い、教員の総評を経て後期のクリエイションにつなげる。",
        "notices": "各自研究のテーマにおける内容により、便宜上はビジュアル（視覚系）かインダストリー（工業系）のどちらかを履修選択する。また前期「ビジュアルクリエイションⅠ」を選択した場合は後期科目も「ビジュアルクリエイションⅡ」を継続して選択する仕組みが履修の条件である。幅広い社会を対象とした1年後期「コミュニティとデザイン」の履修を推奨する。",
        "preparatoryStudy": "各自の研究テーマをデザイン研究と反映して進める。この科目は１つの課題を提出する科目ではなく社会性のあるテーマをトリガーに俯瞰した視点を覚え、常に研究活動と連携している科目として捉えることが望ましい。",
        "gradingGuidelines": "研究テーマに対する取り組み、能動的な姿勢により評価、点数化し、60点以上を単位認定とする。なお評価は担当する全教員で行い、取り組み内容における評価項目は下記のとおり。リサーチ【50%】、分析や考察【30％】、報告【20％】",
        "textbook": "授業内容に合わせて必要な資料等をMoodleの授業ページトピックを通じて配付する。",
        "referenceMaterials": "参考となる資料を授業進行に合わせて紹介、全てMoodleを通じて配付する。",
        "courseSchedule": "第1回：授業ガイダンス／クリエイションテーマの課題説明（全学生集合）第2回：（講話1）研究テーマの設定と仮説（全学生集合）第3回：テーマリサーチプログラム⑴（個人）第4回：テーマリサーチプログラム⑵（個人）第5回：テーマリサーチプログラム⑶（個人）第6回：テーマリサーチ中間報告会1（１名10分程度／視覚・工業系）第7回：テーマリサーチ中間報告会2（１名10分程度予備日／総評）（講話2）社会の求めるデザインクリエイションの実際（仮称）第8回：テーマリサーチプログラム⑷（近似テーマでペア・グループ結成）第9回：テーマリサーチプログラム⑸（ペアもしくはグループ活動）第10回：テーマリサーチプログラム⑹（ペアもしくはグループ活動）第11回：テーマリサーチプログラム⑺（ペアもしくはグループ活動）第12回：テーマリサーチプログラム⑻（ペア、グループによる他者テーマ評価）第13回：テーマリサーチプログラム⑼（ペア、グループによる報告会準備）第14回：テーマリサーチ調査結果期末報告会1（１名10分程度／視覚系）第15回：テーマリサーチ調査結果期末報告会2（１名10分程度／工業系）総評とF.B.基本的に（全学生集合）以外は任意で調査研究を進める予定ではあるがデザイン・クリエイティブ業界の先駆者による講話を予定実施の詳細は事前にMoodleの授業トピックスへ掲載する",
        "courseDataUpdatedAt": "2024/02/12"
    },
    "updateAt": "2024/03/19"
}