{
    "lectureCode": "GF1001",
    "courseName": "デザイン特論",
    "lecturer": [
        "伊藤丙雄(デザイン学部デザイン学科)",
        "暮沢剛巳(デザイン学部デザイン学科)",
        "酒百宏一(デザイン学部デザイン学科)",
        "松村誠一郎(デザイン学部デザイン学科)",
        "宮元三恵(デザイン学部デザイン学科)",
        "中島健太(デザイン学部デザイン学科)",
        "田村吾郎(デザイン学部デザイン学科)",
        "深澤健作(デザイン学部デザイン学科)",
        "伊藤英高(デザイン学部デザイン学科)",
        "加藤一葉(デザイン学部デザイン学科)",
        "末房志野(デザイン学部デザイン学科)",
        "酒井正(デザイン学部デザイン学科)",
        "相野谷威雄(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "デザイン研究科修士課程デザイン専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１０１６教室"
    ],
    "courceDetails": {
        "courseOverview": "本授業は今年度デザイン研究科担当教員によるオムニバス形式で進行し、各教員それぞれのデザイン分野での代表的な活動と多様なデザイン研究の実践的な事例として、コンセプトメイクから制作、発表を経て結果の考察等をふまえた内容により構成される。受講生は本講義を通じて社会とデザインの関係性や様々なデザイン分野の動向など、広くデザイン分野の専門性を深める内容となる。またこれまでの専門分野とは異なる分野を複合的、横断的に関わることを認識し、この授業を通して知見を広げ、自らの研究テーマを進めるための科目として位置付ける。",
        "outcomesMeasuredBy": "デザイン分野の基礎的な知識、見識に加え、毎回の講義を通じて様々な課題解決に取り組む視点や姿勢を身につける。デジタルテクノロジーの成熟によるデザインの変化や、用いられるデザインスキルの変化もふまえながら、広くデザインの将来の姿を想起することも、この授業における学びの到達目標となる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "毎回の講義担当は各担当教員により行われ、講義を終了したのちに課せられる指定のフィードバックにより、授業の理解度と出席確認を行い授業評価とする。",
        "notices": "１年次生は必ず履修する科目である。並行して履修する「デザイン研究企画」での研究の進め方や「ビジュアルクリエイションⅠ」、「インダストリークリエイションⅠ」における課題内容、制作方法にも関連付けた受講を薦める。",
        "preparatoryStudy": "講義で取り上げるテーマの予習、ならびに講義でのキーワードや授業内の不明な点については教員への質問を基本とし、更に内容を深化させたい場合は、文献やインターネット等で追加して調査を薦める。その結果として、復習から自らの研究テーマへの展開などにプラスに働くこととなる。また自分のデザイン分野に関わらずデザイン全般に興味を持つ視点を常に持ち、自らの研究テーマとのつながりを意識して授業を受講すること。",
        "gradingGuidelines": "授業への取り組み内容に対する評価【60％】、最終レポート内容による評価【40％】の割合で評価点数化し、60点以上を単位認定要件とする。",
        "textbook": "授業進行に合わせて資料、または課題を適宜にMoodleにて配付する。",
        "referenceMaterials": "参考となる資料は授業内容に合わせて適宜にMoodleにて配付する。",
        "courseSchedule": "第1回（4月10日）：授業ガイダンス／イントロダクション（伊藤丙）第2回（4月17日）：仮説の証明となる修了制作について（伊藤丙）第3回（4月24日）：視覚デザインの役割と社会への貢献（伊藤丙）第4回（5月8日）：アニメーションにおけるマテリアルの意味変換効果（中島）第5回（5月15日）：平面表現とデザインによる展開について（深澤）第6回（5月22日）：UI,UX,GUIとインフォメーションデザイン（加藤）第7回（5月29日）：映像メディアにおける知覚と体験（伊藤英）第8回（6月5日）：インタラクションデザインとサウンドデザイン（松村）第9回（6月12日）：演出による空間、ディレクションについて（田村）第10回（6月19日）：空間づくりとプロジェクトについて（宮元）第11回（6月26日）：コミュニティとクリエイション（酒百）第12回（7月3日）：プロダクトデザインのものづくり（酒井／3限実施）第13回（7月10日）：サービスとロボットデザイン（相野谷）第14回（7月17日）：デザイン資源とキュレーション（暮沢）第回（7月24日）：最終レポート提出について（→オンデマンド配信：伊藤丙）第15回（7月30日）：イラストレーションの可能性（末房）",
        "courseDataUpdatedAt": "2024\/02\/12"
    },
    "updateAt": "2024\/03\/19"
}