{
    "lectureCode": "GF1007",
    "courseName": "コミュニティとデザイン",
    "lecturer": [
        "酒百宏一(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "デザイン研究科",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１０１６教室"
    ],
    "courceDetails": {
        "courseOverview": "人は常に自分と他者、社会との関係性の中で、何らかのコミュニティに属している。現代社会におけるコミュニティの問題は、人口減少や少子高齢化、大規模災害などの課題と密接に関連しており、これらはグローバルな問題であると同時に、地域固有の背景を伴う複雑な性質を持っている。そのため、画一的な解決方法では対応が難しく、多角的な視点からの取り組みが求められている。本授業では、SDGsの目標11「住み続けられるまちづくり」をテーマに、持続可能な社会や良好なまちづくりを実現するためのデザインアプローチを学ぶ。国内外の多様な事例を参考に、それぞれのコミュニティの特性に応じたデザインの提案方法を考察する。また、現場に根ざした視点を重視し、フィールドワークを交えた実践的な手法を学修することで、実社会で役立つスキルを身につけることを目指す。",
        "outcomesMeasuredBy": "今日におけるコミュニティの課題とデザインの必要性について理解し、主体的に取り組むことが望まれる。ネットや文献、現場でのリサーチを通して、その場所を読み取り、あくまで住民目線のその場所に応じた提案を念頭に、独自の発想と自らの表現を通して具体的に解決につながる提案を発表することを到達目標とする。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業計画の前半をコミュニティにおけるデザインの講義とし、後半はそれをふまえて個々によるリサーチを元とした実践的な演習とする。毎回の授業において授業内容に関するフィードバックを求め、その回答に教員のコメントを加えるなどアクティブラーニング形式を含める。課題におけるリサーチは必ずアウトプットを心がけ、それをワークシートとして提出する。",
        "notices": "本授業と関連する科目として社会における事象を読み解き新しい価値として捉える手法をテーマしている「クリエイティブキュレーション」（２年次前期）の履修を推奨する。",
        "preparatoryStudy": "Moodleを授業のプラットホームとするため、授業前に必ず確認すること。実地調査、国内外の実践事例調査も授業に含めるので最終的な提案のみならずプロセス等調査資料も提出することになる。授業後には授業内容に応じた記述形式のフィードバックを提出すること。",
        "gradingGuidelines": "授業への取り組みに対する評価：60%（講義内容に対するフィードバック内容［姿勢：30%／考察：30%］）、課題に対する提案の内容に対する評価：40%",
        "textbook": "指定しない。",
        "referenceMaterials": "本授業では特定の参考書を指定しない。各授業で取り上げられるデザインの事例や文献などの情報を基に、学生自身が興味を持った分野について主体的に調べ、知識を深めることを推奨する。必要に応じて教員が授業内で関連資料や情報源を提示する。",
        "courseSchedule": "第1回：オリエンテーション＜コミュニティにおけるデザインとは＞第2回：社会の構造について＜土地と人の営みの歴史について＞第3回：地域社会について＜まちづくりとデザイン＞第4回：コミュニティとデザイン⑴第5回：コミュニティとデザイン⑵第6回：フィールドワークの手法について第7回：フィールドワークの実践⑴＜問題を見つける＞第8回：フィールドワークの実践⑵＜現場の視点で考える＞第9回：フィールドワークの実践⑶＜提案をまとめる＞第10回：コミュニティとデザインの実践報告第11回：デザインの展開⑴第12回：デザインの展開⑵第13回：デザインの展開⑶第14回：コミュニティとデザインのプレゼンテーション第15回：まとめ",
        "courseDataUpdatedAt": "2025/01/23"
    },
    "updateAt": "2025/03/21"
}