{
    "lectureCode": "GF1009",
    "courseName": "クリエイティブキュレーション",
    "lecturer": [
        "暮沢剛巳(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "デザイン研究科修士課程デザイン専攻",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１０１６教室"
    ],
    "courceDetails": {
        "courseOverview": "キュレーションとは、様々な情報を収集・加工して新しい価値を生み出すことを意味するが、この授業では、クリティカルに事象や情報を捉え、創造的な解釈でのライティングに重きをおく。そのためにデザインに関わる様々な情報を収集・加工して提案するキュレーションに習熟することを目的とし、受講者には、教員の講義をベースに、課題に即したキュレーションを行い、その成果を文章及びプレゼンテーションを通じて提案してもらう。扱うテーマとしては、環境やエネルギーなどサステナビリティに関わるものが中心だが、ほかにも現代社会におけるテーマも取り上げる予定",
        "outcomesMeasuredBy": "デザインに関わる様々な情報を収集・加工して提案するキュレーションに習熟し、プレゼンテーションとライティングのスキルを向上させることを目標とする。これらはラーニング・アウトカムズにおける「実学に基づく専門能力」～「問題解決力」に相当する",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業は講義形式。最初の２回で概要の説明を行い、３回目からテーマ別の課題へと移行する。テーマ別課題は授業３回につき１セットで、初回と２回目に教員がテーマに即した事例紹介を行い、３回目に履修者による課題発表を行ってもらう。課題は、テーマに即したプレゼンテーションとライティングの双方を課し、前者は講評、後者は添削という形でフィードバックを行う。対面形式を基本とするが、状況によっては遠隔形式となる場合もある。",
        "notices": "情報検索が必須のため、PCを必ず携行すること。スマートフォンの代用は望ましくない。",
        "preparatoryStudy": "展覧会や商品の展示などに数多く接し、そこでどのようにキュレーションが行われているのかを絶えず意識すること。教科書、参考書以外の参考文献も随時紹介するので、時間を見つけて読んで欲しい。",
        "gradingGuidelines": "授業への取り組み（60％）とライティング（40％）の比率で評価する。プレゼンテーションへの評価は前者に含まれる。単位認定要件は60点以上。",
        "textbook": "暮沢剛巳『拡張するキュレーション』（集英社新書）",
        "referenceMaterials": "蟹江憲史『SDGｓ―持続的な開発目標』（中公新書）、南博＋稲葉雅紀『SDGs―危機の自裁の羅針盤』（岩波新書）、暮沢剛巳『核のプロパガンダ』（平凡社）、古舘恒介『エネルギーをめぐる旅―文明の歴史と私たちの未来』（英治出版）、その他、授業中に指示する。",
        "courseSchedule": "第1回：オリエンテーションキュレーションとは何か（情報の収集と加工）第2回：SDGｓとは何かーサステナビリティについて考える第3回：地域のキュレーション（上）（事例１）第4回：地域のキュレーション（下）（事例１）第5回：課題発表（１）第6回：事故のキュレーション（上）（事例２）第7回：事故のキュレーション（下）（事例２）第8回：課題発表（２）第9回：食のキュレーション（上）（事例３）第10回：食のキュレーション（下）（事例３）第11回：課題発表（３）第12回：サステナビリティと万国博覧会（上）（事例４）第13回：サステナビリティと万国博覧会（下）（事例４）第14回：課題発表（４）第15回：まとめ",
        "courseDataUpdatedAt": "2024/01/24"
    },
    "updateAt": "2024/03/19"
}