{
    "lectureCode": "GF1006",
    "courseName": "コミュニティとデザイン",
    "lecturer": [
        "酒百宏一(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "デザイン研究科修士課程デザイン専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１０１６教室"
    ],
    "courceDetails": {
        "courseOverview": "自分と他者、自分と社会との関係において、人は何らかのコミュニティに属している。現代社会におけるコミュニティの問題は、その時代での社会的な構造をもとにして生み出されている。とりわけ現代日本においては加速する人口減少、少子高齢化、大規模災害に伴う様々な課題は、グローバルな問題である一方、地域固有の性格や背景を伴うことでもあり、一定の解決方法で進められる課題でもないため、難しい問題でもある。このようにすでにあるコミュニティでの多種多様な問題に対してどうすれば持続可能な社会、あるいは良好なまちづくりにつなげられるのか。本授業ではSDGsの目標11「住み続けられるまちづくりを」をテーマとして展開する。そして現場に根ざした視点から、それぞれのコミュニティの性格に応じてどのようなデザインの提案ができるか、国内外の様々な実践例を参考に、フィールドワークを交えた実践的な手法を学修する。",
        "outcomesMeasuredBy": "今日におけるコミュニティの課題とデザインの必要性について理解し、主体的に取り組むことが望まれる。ネットや文献、現場でのリサーチを通して、その場所を読み取り、あくまで住民目線のその場所に応じた提案を念頭に、独自の発想と自らの表現を通して具体的に解決につながる提案を発表することを到達目標とする。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業計画の前半をコミュニティにおけるデザインの講義とし、後半はそれをふまえて個々によるリサーチを元とした実践的な演習とする。毎回の授業において授業内容に関するフィードバックを求め、その回答に教員のコメントを加えるなどアクティブラーニング形式を含める。課題におけるリサーチは必ずアウトプットを心がけ、それをワークシートとして提出する。",
        "notices": "本授業と関連する科目として社会における事象を読み解き新しい価値として捉える手法をテーマしている「クリエイティブキュレーション」（２年次前期）の履修を推奨する。",
        "preparatoryStudy": "Moodleを授業のプラットホームとするため、授業前に必ず確認すること。実地調査、国内外の実践事例調査も授業に含めるので最終的な提案のみならずプロセス等調査資料も提出することになる。授業後には授業内容に応じた記述形式のフィードバックを提出すること。",
        "gradingGuidelines": "授業への取り組みに対する評価：60%（講義内容に対するフィードバック内容［姿勢：30%／考察：30%］）、課題に対する提案の内容に対する評価：40%",
        "textbook": "授業内容に合わせて資料を配付する。",
        "referenceMaterials": "授業時に紹介する。",
        "courseSchedule": "第1回：オリエンテーション＜コミュニティにおけるデザインとは＞第2回：社会の構造について＜土地と人の営みの歴史について＞第3回：地域社会について＜まちづくりとデザイン＞第4回：コミュニティとデザイン⑴第5回：コミュニティとデザイン⑵第6回：フィールドワークの手法について第7回：フィールドワークの実践⑴＜問題を見つける＞第8回：フィールドワークの実践⑵＜現場の視点で考える＞第9回：フィールドワークの実践⑶＜提案をまとめる＞第10回：コミュニティとデザインの実践報告第11回：デザイン展開の実践⑴第12回：デザイン展開の実践⑵第13回：デザイン展開の実践⑶第14回：コミュニティとデザインのプレゼンテーション第15回：まとめ",
        "courseDataUpdatedAt": "2024/02/02"
    },
    "updateAt": "2024/03/19"
}