{
    "lectureCode": "GF1003",
    "courseName": "ビジュアルクリエイションII",
    "lecturer": [
        "伊藤丙雄(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月",
        "月2",
        "火",
        "火2"
    ],
    "targetDepartment": "デザイン研究科修士課程デザイン専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 4,
    "classroom": [
        "３１０１６教室"
    ],
    "courceDetails": {
        "courseOverview": "授業では、現代社会の複雑で多様な社会課題の状況をふまえ、各自の研究活動におけるデザイン提案につなげるための実践的なプロセスを身につけることを目的とする。そして前期に実践したリサーチによって理解したことを次の段階へとつなげていく。現代におけるデザインの役割が幅広くそして社会との接続が直接的であることをふまえると、考えたことをわかりやすく他者が目にするかたちにビジュアライズし、さらに社会に機能していくための創造的な思考が必要である。本授業では可能性のタネであるアイデアを具体的に手を動かして試作や実験を繰り返してくなかで「プロトタイプ」を制作、確かなデザイン提案につなげていくプロセスを体得する。未来社会において、ビジュアルデザイン、情報デザインなどの視覚系デザインが果たす役割は何か、また理想的な社会を実現するために必要なデザインは何かを考察する。そして、この思考のプロセスが、クリエイティブな発想と確かな造形力を生みだし、最終的には各自の研究につなげられるように、創造性を深めていく。また本授業は、インダストリークリエイションⅡとの合同で行い、前期と後期にまたがって段階的に進める科目である。",
        "outcomesMeasuredBy": "前期で最終発表したアイデアを具体的に展開させて魅力あるビジュアルやインタラクションによるコミュニケーションのデザインとして高いレベルでの実践と展開が求められる。創造的な思考では、具体的な実制作を進めながら客観的な評価と検証を行い、思考を深めていくことが重要である。社会性のある提案とオリジナリティのある表現を発見することを目標とする。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "主には調査に基づく研究作品の制作と発表、グループワークや担当教員による指導で授業は構成される。制作では、他のデザイン分野からの視点や表現手法等を取り入れながら進める。最終的には個人による成果物を求め、デザイン提案のプレゼンテーションを行う。",
        "notices": "関連授業として持続可能な社会等をテーマとした「コミュニティとデザイン」、「クリエイティブクリエーション」の履修を推奨する。",
        "preparatoryStudy": "各自のデザイン研究と並行して進めることになるため１つの科目としてというよりも社会性のある１つのテーマとして大きく俯瞰した視点で連携している科目として捉えること。つまり主体的に取り組むことによって自らの研究にもプラスに働くことになる。",
        "gradingGuidelines": "授業におけるプログラムに対する取り組み内容により評価、点数化し、60点以上を単位認定とする。なお評価は担当教員全員、取り組み内容における評価項目は下記のとおり。制作【40%】、提案【40％】、発表【20％】",
        "textbook": "授業内容に合わせて資料等を配付する。",
        "referenceMaterials": "参考となる資料を授業進行に合わせて紹介、配付する。",
        "courseSchedule": "第1回：授業ガイダンス／課題説明（全学生集合）第2回：講和／デザインにおけるビジュアライズとは（全学生集合）第3回：クリエイティブワーク（個人、ペアもしくはグループ活動）第4回：クリエイティブワーク（個人、ペアもしくはグループ活動）第5回：クリエイティブワーク（個人、ペアもしくはグループ活動）第6回：クリエイティブワーク（個人、ペアもしくはグループ活動）第7回：クリエイティブワーク（個人、ペアもしくはグループ活動）第8回：テーマリサーチ中間報告会（全学生集合）第9回：クリエイティブワーク（個人、ペアもしくはグループ活動）第10回：クリエイティブワーク（個人、ペアもしくはグループ活動）第11回：クリエイティブワーク（個人、ペアもしくはグループ活動）第12回：クリエイティブワーク（個人、ペアもしくはグループ活動）第13回：クリエイティブワーク（個人、ペアもしくはグループ活動）第14回：クリエイティブワーク（個人、ペアもしくはグループ活動）第15回：テーマリサーチ最終報告会（全学生集合）フィードバック",
        "courseDataUpdatedAt": "2024/02/12"
    },
    "updateAt": "2024/03/19"
}