{
    "lectureCode": "GF2004",
    "courseName": "デザイン研究III",
    "lecturer": [
        "各教員"
    ],
    "regularOrIntensive": "研究・プロジェクト科目",
    "courseType": "実験科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "デザイン研究科修士課程デザイン専攻",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": "4.0",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "デザイン研究科における2年間で、自身の研究を高いレベルで完遂させるために、これまでのデザイン研究により立てた「仮説」を証明するために、具体的な成果物として作品の制作・論文作成を進める。まとめの段階となる当科目では、それぞれの課題の解決につながるデザインを可能な範囲で一般化することを目指す。また現場でのユーザー評価や試験的な運用等を計画し、研究の成果を立証することが強く求められる。指導においては、主担当・副担当教員と論文、英文指導担当教員の連携のもと各自の研究テーマにおいて独自のデザイン提案をそのプロセスを含め、広く社会に還元できるものとして完成度の高い作品と論文に仕上げる。",
        "outcomesMeasuredBy": "課題の解決につながるデザインの可能性を探りながら、デザインにおける完成度を高め研究としてまとめること。また制作した作品（研究）は、広く社会へ還元されるものであり、社会的な課題をデザインにより解決に導き、その一助となる可能性のあるものが最終的な修了研究の到達レベルとなる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "指導は主担当教員による毎週の指導を目安とし、開催日時や場所等は担当教員による指示とする。主担当教員が論文の内容を含めた研究の内容について指導し、適宜研究の内容に応じて複数の副担当教員による指導を行う。論文指導については論文と英文の各担当教員の個別指導のもと文章指導を行う。また研究発表では、作品の展示と論文の提出、口頭による発表を行う。",
        "notices": "これまでの研究プロジェクト科目の課程と当科目の評価が、修了研究の審査となる。修了研究の審査においては、提出期限等のスケジュールに注意し、作品の展示、研究概要パネルの作成、論文作成ガイドライン等それぞれの指定様式に従うこと。",
        "preparatoryStudy": "最終的な研究の発表は研究概要をまとめたパネルと作品による展示と口頭による発表、そして論文の提出である。あらかじめスケジュールや内容を確認し準備を行うこと。また研究成果をまとめる段階で関連する学会での発表も視野に入れて活動を行うことも推奨する。それにより研究のブラッシュアップや評価にもつながり、交流などによりさらにその後の研究につながる可能性もある。",
        "gradingGuidelines": "修了作品【70%】修士論文【30%】で評価し、60点以上を単位認定要件とする。なお審査は授業担当教員全員が加わる。",
        "textbook": "指導担当教員の指示により適宜紹介する。",
        "referenceMaterials": "指導担当教員の指示により適宜紹介する。",
        "courseSchedule": "第1回：デザイン研究Ⅲについて／ガイダンス第2回：各研究テーマに基づいた作品の制作⑴第3回：各研究テーマに基づいた作品の制作⑵第4回：各研究テーマに基づいた作品の制作⑶第5回：各研究テーマに基づいた作品の制作⑷第6回：各研究テーマに基づいた作品の制作⑸第7回：デザイン研究Ⅲ中間報告会（指導担当教員の指示による）第8回：各研究テーマに基づいた作品の制作⑹第9回：各研究テーマに基づいた作品の制作⑺第10回：各研究テーマに基づいた作品の制作⑻第11回：各研究テーマに基づいた作品の制作⑼第12回：各研究テーマに基づいた作品の制作⑽第13回：各研究テーマに基づいた研究と論文指導⑴第14回：各研究テーマに基づいた研究と論文指導⑵第15回：修了研究最終報告会（作品展示、論文の提出はMoodleにて指示）",
        "courseDataUpdatedAt": "2024/03/12"
    },
    "updateAt": "2024/03/19"
}