{
    "lectureCode": "GF2001",
    "courseName": "デザイン研究企画",
    "lecturer": [
        "各教員"
    ],
    "regularOrIntensive": "研究・プロジェクト科目",
    "courseType": "実験科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "デザイン研究科修士課程デザイン専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "2.0",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "この科目は、本研究科での研究活動（デザイン修士作品制作と論文作成）のベースとなる研究の設計をしっかりと組み立てるために、入学前に提出した研究計画書を担当教員の指導により見直し、調査資料の収集や実践されたデザイン事例、先端技術などをふまえた現状によりまとめる科目（フェーズ1）となる。受講する学生は、デザイン領域を限定せず各自の研究テーマに基づいた調査、観察と分析、考察を行う。この科目を通じ、様々なデザインの事象を俯瞰してリサーチすることで、改めて修了研究全体の設計を組み立て再構築を進める計画を遂行するための効果的な授業とする。また計画書の作成において英文を含めた文章の指導を行う。",
        "outcomesMeasuredBy": "入学前の研究計画書を各デザイン領域にとらわれない先行事例等を探りながら、実際の社会における課題の発見、持続可能な解決方法による具体的な実践例をふまえて計画すること。そして最終的に質の高い研究計画書の作成を目標とする。研究方法と研究テーマの価値を社会に問うためには、皆が知っている情報を探すのではなく、国際的な事例を視野に入れ、自ら正しい情報を獲得していく必要がある。それを前提とした制作に加え、わかりやすい理論に落とし込んだ「一般化」された論文作成を目指したい。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "指導は主担当教員の指示による実施とし、毎週の指導を目安としたい。なお開催日時や場所等は担当教員による指示とする。進行により主担当教員が計画書、報告書の内容を含めた研究の内容について指導し、文章指導については論文担当と英文担当教員の個別指導をもとに行う。",
        "notices": "１年次前期は必修科目も複数あるため、研究指導のスケジュール管理を徹底すること。また講義科目「デザイン特論」、演習科目「ビジュアルクリエイションⅠ」、「インダストリークリエイションⅠ」、「デジタルデザインスキルⅠ」での学修は研究を具体的に進めるために必要な思考や表現方法につながる科目として位置づけているので科目ごとに捉えるのではなく多角的に取り組むこと。",
        "preparatoryStudy": "２年間の研究に対する目標をしっかりと立て、計画を遂行する。常に視野を広げ思考を深めるためにこの機会の位置付けを認識し事前に必要な準備をすること。",
        "gradingGuidelines": "主担当教員との指導により、研究の構想【70%】、文章【30%】で評価し、60点以上を単位認定要件とする。なお評価は担当する教員全員による。",
        "textbook": "指導担当教員の指示により適宜紹介する。",
        "referenceMaterials": "指導担当教員の指示により適宜紹介する。",
        "courseSchedule": "第1回：授業ガイダンス／大学院での研究について第2回：研究の進め方と論文の書き方について第3回：研究企画の構想⑴担当ミーティング第4回：研究企画の構想⑵第5回：研究企画の構想⑶第6回：研究企画の構想⑷第7回：研究企画の構想⑸第8回：研究企画中間発表（担当教員による）第9回：各自の研究テーマに基づいた調査・考察⑴第10回：各自の研究テーマに基づいた調査・考察⑵第11回：各自の研究テーマに基づいた調査・考察⑶第12回：各自の研究テーマに基づいた調査・考察⑷第13回：各自の構想に基づいた計画書の作成⑴第14回：各自の構想に基づいた計画書の作成⑵第15回：期末研究発表会（全員出席／研究計画書の提出）",
        "courseDataUpdatedAt": "2024/03/12"
    },
    "updateAt": "2024/03/19"
}