{
    "lectureCode": "GF2002",
    "courseName": "デザイン研究I",
    "lecturer": [
        "各教員"
    ],
    "regularOrIntensive": "研究・プロジェクト科目",
    "courseType": "実験科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "デザイン研究科修士課程デザイン専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 4,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "「デザイン研究Ⅰ」では、前期「デザイン研究企画」において構想した研究企画で次第に制作に着手する。仮説の立案と具体的なアイデアの検討を重ね、広い視野でのデザイン表現を模索し情報収集や実地調査等を進めながら研究を深めていく。また自分が取り組んできた研究の内容を整理し、意義ある研究として方向性を探り、また他者に説明するために制作と並行しながら研究報告書をまとめる。国内外問わず先端のデザインの事例等も参考にし、表現手法の検証を重ね、客観性のある独自性あるテーマとして修了研究に相応しいレベルまで高めていく。",
        "outcomesMeasuredBy": "課題の解決につながるデザインの可能性を探りながら、実地調査等により実社会に即した課題と原因の発見を目指す。また持続可能な解決方法を模索しながら、仮説による試作や実験を経て、これまでにない独自の提案につながるアイデアを目標とする。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "指導は主担当教員による毎週の指導を目安とし、開催日時や場所等は担当教員による指示とする。主担当教員が報告書の内容を含めた研究の内容について指導し、適宜研究の内容に応じて副担当教員による指導も行う。",
        "notices": "他の選択科目を履修し、研究における視野の拡大やデジタルスキルの向上に努める。授業計画のスケジュール等は変更となる場合がある。また報告書等の提出や発表についての詳細についてはMoodleを確認すること。",
        "preparatoryStudy": "「デザイン研究企画」により研究の設計を立てた内容から具体的な制作を実施し、アイデアから展開につなげるためにこの科目の位置づけを認識し、各自の情報収集や調査、分析、考察を深める。研究のプロセスを丁寧に記録し、主担当教員との指導のほか、論文作成の大事な研究記録として役立てる。",
        "gradingGuidelines": "主担当教員との指導により、作品制作【70%】、文章【30%】で評価し、60点以上を単位認定要件とする。なお評価は担当する教員全員による。",
        "textbook": "指導担当教員の指示により適宜紹介する。",
        "referenceMaterials": "指導担当教員の指示により適宜紹介する。",
        "courseSchedule": "第1回：デザイン研究Ⅰについて／ガイダンス第2回：各研究テーマに基づいた作品の制作⑴第3回：各研究テーマに基づいた作品の制作⑵第4回：各研究テーマに基づいた作品の制作⑶第5回：各研究テーマに基づいた作品の制作⑷第6回：各研究テーマに基づいた作品の制作⑸第7回：デザイン研究Ⅰ中間発表会（指導教員との調整による実施）第8回：各研究テーマに基づいた作品の制作⑹第9回：各研究テーマに基づいた作品の制作⑺第10回：各研究テーマに基づいた作品の制作⑻第11回：各研究テーマに基づいた作品の制作⑼第12回：各研究テーマに基づいた作品の制作⑽第13回：各研究テーマに基づいいた作品の制作と論文の作成⑴第14回：各研究テーマに基づいいた作品の制作と論文の作成⑵第15回：デザイン研究Ⅰ期末発表会（全員集合／各論文の草稿を提出）",
        "courseDataUpdatedAt": "2024\/03\/12"
    },
    "updateAt": "2024\/03\/19"
}