{
    "lectureCode": "GF2003",
    "courseName": "デザイン研究II",
    "lecturer": [
        "各教員"
    ],
    "regularOrIntensive": "研究・プロジェクト科目",
    "courseType": "実験科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "デザイン研究科修士課程デザイン専攻",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 4,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "１年次で進めてきた「デザイン研究企画」、「デザイン研究Ⅰ」をふまえて、幅広い視点と様々な表現手法を駆使し、自らの論文と制作作品を含めて検証する。次に様々なデザインの可能性を考え、試作をもとに様々な角度で検証を行い、意義ある研究成果に向けて具体的なデザイン手法を確立していく。積極的に先端技術を調査し、取り入れ、表現や技法の実証を重ねる。また客観性のある独自のデザインとして相応しい高いレベルまで進める。常に新しいデザインを言語化、体系的かつ論理的に積み上げ、計画的に修士論文と修了制作に取り掛かってほしい。",
        "outcomesMeasuredBy": "課題の解決につながるデザインの可能性を探りながら、常にアイデアを試作から展開し検証、評価を行う。また独自のデザイン性を高め、持続可能な解決方法を模索する。研究テーマに関連するデザインの方向性を絞り、研究成果（研究作品・修士論文）として完成をイメージできるレベルを後期の到達目標とする。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "指導は主担当教員による毎週の指導を目安とし、開催日時や場所等は担当教員による指示とする。主担当教員が論文の内容を含めた研究の内容について指導し、適宜研究の内容に応じて副担当教員による指導も行う。",
        "notices": "他の選択科目を履修し、研究における視野の拡大やデジタルスキルの向上に努める。授業計画のスケジュール等は変更となる場合がある。また論文等の提出や発表についての詳細はMoodleを確認すること。",
        "preparatoryStudy": "研究を前に進めることと同時に1年間の研究における着地点を見定めて、計画を随時調整しながら進めていくことが重要である。また論文に必要なデータや試作についても画像等の記録、整理も必要である。進行している研究論文については不足している部分の確認や、2年次の展開を想定しておくことも必要である。",
        "gradingGuidelines": "主担当教員との指導により、作品制作【70%】、論文【30%】で評価し、60点以上を単位認定要件とする。なお評価は担当する教員全員による。",
        "textbook": "指導担当教員の指示により適宜紹介する。",
        "referenceMaterials": "指導担当教員の指示により適宜紹介する。",
        "courseSchedule": "第1回：デザイン研究Ⅱについて／ガイダンス第2回：各研究テーマに基づいた作品の制作⑴第3回：各研究テーマに基づいた作品の制作⑵第4回：各研究テーマに基づいた作品の制作⑶第5回：各研究テーマに基づいた作品の制作⑷第6回：各研究テーマに基づいた作品の制作⑸第7回：デザイン研究Ⅱ中間発表会（指導教員との調整による実施）第8回：各研究テーマに基づいた作品の制作⑹第9回：各研究テーマに基づいた作品の制作⑺第10回：各研究テーマに基づいた作品の制作⑻第11回：各研究テーマに基づいた作品の制作⑼第12回：各研究テーマに基づいた作品の制作⑽第13回：各研究テーマに基づいいた作品の制作と論文の作成⑴第14回：各研究テーマに基づいいた作品の制作と論文の作成⑵第15回：デザイン研究Ⅱ期末発表会（全員集合／各論文の草稿を提出）",
        "courseDataUpdatedAt": "2024\/03\/12"
    },
    "updateAt": "2024\/03\/19"
}