{
    "lectureCode": "11041K61",
    "courseName": "情報リテラシー演習[電]",
    "lecturer": [
        "天野直紀(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3",
        "月4"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義実験棟４０１",
        "講義実験棟４０２"
    ],
    "courceDetails": {
        "courseOverview": "電気電子工学を学ぶ上でIT\/ICTなどと呼称される情報通信技術は必須である。現代社会における必要性と情報通信技術の多くは電気電子工学の応用事例であるからである。このためデジタルスキルを修得する必要がある。その内容はデジタルスキル標準として定義されているDXリテラシー標準、特にWhat\/Howとの対応付けを中心に学ぶ。次に電気電子工学が何を実現するの技術であるかを学ぶ。様々な具体例について実際に装置等を動作・検証を行うことで、その構成要素について体験的に理解する。このことは電気電子工学科での学びの展望を得ることにもつながる。",
        "outcomesMeasuredBy": "大学生として主体的に学び続け、更に社会人としても不可欠なデジタルスキルを身につける。更に電気電子工学の応用事例について、その構成要素や実現内容・程度を総合的に理解する。具体的には以下の通り。・DXリテラシー標準、特にWhat\/Howに該当するスキルを活用できる。これには情報の真贋、インターネットやSNSなどのサービスの構造・特性、文書作成・プレゼンテーション・データ処理が含まれる・電気電子工学の応用事例について、その構成・特性を説明できる",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力問題解決力",
        "teachingMethod": "全体として演習形式で行う。具体的には説明の後、実際に操作・検証を行う。またそのために必要な情報収集をデジタルスキルを活用して収集・分析する。またその過程や結果もデジタルスキルを活用して記録・まとめる。この授業ではノートPCを必要とする。",
        "notices": "デジタルスキルについては特に情報リテラシーとの間接的な関連があるので、相互に関連づけて理解・実践すること。",
        "preparatoryStudy": "毎回、次回の主題等を説明するので、事前に一般的な調査・理解をしておくこと。それにより授業参加（発言）が可能となるとともに上行全体に対する予習となる。情報リテラシーとの間接的な関連があるので、情報リテラシーで学んだ内容を演習で実践してスキル修得すること。そのための事前・復習学修を行うこと。",
        "gradingGuidelines": "「授業参加」と「課題」の合計で成績を評価する。その成績点数上の比率は50:50とする。ここで「授業参加」とは授業中の発言、報告などの活動のことを言う。「課題」はレポート等のことを言う。これらの具体的な定義は講義中に適宜、明示する。また基準量を超えた分についてはS評価に関わる加点要素とする。",
        "textbook": "なし。",
        "referenceMaterials": "なし。",
        "courseSchedule": "第1回：デジタルスキルと電気電子工学第2回：コミュニケーションツールおよびデータ管理第3回：オフィスツールの利用（文書作成、プレゼンテーション、データ処理）第4回：ホームIoT（1）構成第5回：ホームIoT（2）特性評価第6回：産業用IoT（1）構成第7回：産業用IoT（2）特性評価第8回：報告と講評第9回：通信特性比較（1）構成と計測第10回：通信特性比較（2）特性分析第11回：マイコン：ソフトウェアの構築と実行第12回：センサー：センサーの動作第13回：報告と講評第14回：総合的な報告と講評および追加演習※第4～13回の演習は小グループに分かれて行う。機材や実施環境の都合上、順序が入れ替わる。",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}