{
    "lectureCode": "11040K6",
    "courseName": "情報リテラシー[電]",
    "lecturer": [
        "天野直紀(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０２"
    ],
    "courceDetails": {
        "courseOverview": "現代社会においてディジタル技術を活用することは分野を問わずに必須である。これらは急速に進歩し、実用化され、また今も時々刻々と変化している。このため、即時的にこれらを活用できるようになるとともに、自ら変化に追従し、常に適切に活用できる素養が不可欠となる。この授業では現在必要とされるディジタル技術についてその知識と原理、歴史について学ぶ。また、これらを通じて変化に追従するための適応力を修得する。これらの学習にあたってデジタルスキル標準として定義されているDXリテラシー標準、特にWhat/Howとの対応付けを考慮する。社会においてはDX推進を提言・推進できるスキルを獲得する基礎とする。",
        "outcomesMeasuredBy": "PCとインターネットを用いた学習と将来の職業上の業務執行に必要となる情報リテラシーについて、その理解を目標とし、「問題解決力」「分析・評価能力」と「コミュニケーション能力」「電子工学の基礎力」を身につける。具体的には以下の通り。・インターネットとサービスの構造、特性を説明できる。・情報の真贋など情報検索を適切にできる。・ソーシャルネットワーキングサービスの特性を活かした安全な活用ができる。・文書作成、プレゼンテーション、データ処理の基本的な書式を利用できる。・コンピューターそのものの原理についても説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "全体としては講義形式で行うが、毎回、受講者からの授業参加（発言等）を求めるアクティブラーニングを行う。具体的には準備できるように事前に提示する参加項目と、授業中に提示する項目とがある。講義とこれらの授業参加を通じて、必要な知識の獲得とそれを活かす力の養成を行う。この授業では授業内の課題回答や調査のためにノートPCなどの情報端末を必要とする。",
        "notices": "情報リテラシー演習との間接的な関連があるので、相互に関連づけて理解・実践すること。",
        "preparatoryStudy": "毎回、次回の主題等を説明するので、事前に一般的な調査・理解をしておくこと。それにより授業参加（発言）が可能となるとともに上行全体に対する予習となる。情報リテラシー演習との間接的な関連があるので、ここで学んだ内容の演習での実践、演習で学んだ内容の理解という連携を常に把握することを通じた復習を行うこと。",
        "gradingGuidelines": "「授業参加」と「課題」の合計で成績を評価する。その成績点数上の比率は50:50とする。ここで「授業参加」とは授業中の発言、報告などの活動のことを言う。「課題」はレポート・理解度確認課題等のことを言う。これらの具体的な定義は講義中に適宜、明示する。また基準量を超えた分についてはS評価に関わる加点要素とする。",
        "textbook": "なし。",
        "referenceMaterials": "第6回関連「PowerPointプレゼンの極意」アスキー・メディアワークス牧田4048703625第9回関連「図解コンピュータ概論ハードウェア」オーム社橋本・松永・小林・天野4274208303その他、必要に応じて講義中に紹介する。",
        "courseSchedule": "第1回：学習方法：PC・インターネットを活用した学習第2回：ネットワーク：原理（～TCP/IP）、歴史、無線、インターネット、構造の理解と危険性第3回：コンプライアンス・モラル：知的財産法第4回：ツール1：メール、原理、作法第5回：ツール2：文書作法、ワードプロセッサーにおける構造、レポートの書き方第6回：ツール3：プレゼンテーション作法、プレゼンテーションソフトウェアにおける構造、見やすさ、発表の仕方第7回：データ1：情報検索：検索手法、情報の真贋第8回：データ2＆ツール4：ディジタルデータ、サンプリング、スプレッドシート、データ処理（理解・処理）第9回：データ3：データベース、DBMS、原理、構成、役割第10回：セキュリティ：情報管理、システム管理、暗号化などの原理第11回：ハードウェア：コンピューター：原理、構成（プロセッサー、メモリ－、.....）、歴史第12回：クラウド：オンプレミスとクラウド、SaaS、IaaS、PaaS級言語、ファイルシステム、IoT、サービスの展望と活用第13回：情報リテラシーと理解度確認課題第14回：今後の活用と展望",
        "courseDataUpdatedAt": "2025/01/05"
    },
    "updateAt": "2025/03/21"
}