{
    "lectureCode": "11040K5",
    "courseName": "情報リテラシー[機]",
    "lecturer": [
        "福島E文彦(工学部機械工学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "本授業では、国際的に使われているICT技術（情報通信技術）を支えるインターネットとコンピュータの基本知識と応用技術について講義する。本講義では、インターネットの仕組みや提供される諸サービス、情報の操作、情報モラル、これらの技術を支えるパソコンハードウェアの構成、特に急速に発展している機械の情報化についての知識が身につく。",
        "outcomesMeasuredBy": "本授業科目では以下を到達目標とする。1)インターネットの仕組みとIPアドレスを説明できる。2)情報モラルを守ってインターネットで提供されるサービスを使うことができる。3)2進数、16進数による演算ができる。4)コンピュータのハードウェア構成を説明できる。5)オペレーティングシステムの目的を説明できる。6)機械の情報化の仕組みを説明できる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "【授業形態：講義】プロジェクターを使った講義形式の説明が中心となるが、ノートPCを使った体験実習も随時行う【ノートPC必携】。",
        "notices": "ノートPCにソフトウェアの事前インストールや設定の必要がある場合がある。",
        "preparatoryStudy": "予習：各回の授業で、次回までに読んでくる資料範囲を指定する。（100分程度）復習：各回の授業内容を復習すること、また提出課題を期限内に提出すること。（100分程度）",
        "gradingGuidelines": "理解度チェック（レポートと小テスト）と期末試験の成績で総合評価する。比率は50:50とする。",
        "textbook": "特になし。必要に応じて電子化資料を配布する。",
        "referenceMaterials": "令和5年版情報通信白書（PDF版）特集「新時代に求められる強靱・健全なデータ流通社会の実現に向けて」総務省https:\/\/www.soumu.go.jp\/johotsusintokei\/whitepaper\/ja\/r05\/pdf\/index.html令和4年版「特集情報通信白書刊行から50年～ICTとデジタル経済の変遷～」令和3年版「特集デジタルで支える暮らしと経済」令和2年版「特集5Gが促すデジタル変革と新たな日常の構築」令和元年版「特集進化するデジタル経済とその先にあるSociety5.0」平成30年版「特集人口減少時代のICTによる持続的成長」平成29年版「特集データ主導経済と社会変革」平成28年版「特集IoT・ビッグデータ・AI～ネットワークとデータが創造する新たな価値～」",
        "courseSchedule": "第1回：ガイダンス、情報とは何か、インフラとして定着したインターネット第2回：知的財産法教育第3回：ディジタル化されたさまざまなデータ（数・文字・画像）とその操作第4回：インターネットで提供されるサービス（その１）第5回：インターネットで提供されるサービス（その２）第6回：情報検索、情報の再利用、情報モラル第7回：ネットビジネス：オンライントレード、オンラインショップ第8回：コンピュータ、マイコンの基本構成、動作概要第9回：オペレーティングシステムと実時間処理第10回：プログラミング言語とプログラムの基礎第11回：プログラミング言語とプログラム演習（πの計算）第12回：ネットワークプログラミングの基礎（socket通信）第13回：家電、自動車、ロボット、機械等の情報化第14回：IoT・ビッグデータ・AI、新しい技術、サービスの展望と活用",
        "courseDataUpdatedAt": "2024\/02\/06"
    },
    "updateAt": "2024\/09\/13"
}