{
    "lectureCode": "11042C1",
    "courseName": "数学概論[A]CS",
    "lecturer": [
        "山元進(コンピュータサイエンス学部コンピュータサイエンス学科)",
        "生野壮一郎(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ３０２"
    ],
    "courceDetails": {
        "courseOverview": "数学は学問の中でも最も古いものの一つであるが，今なお新たな分野を開拓しては，その裾野を広げ発展し続けている．これは，人間社会の進展とともに絶えず新たな問題が生じ，そこに数学的な問題解決の手法が要求されるからである．本講義では，オムニバス的にさまざまな数学利用の局面を学ぶことで，数学の実学としての側面を理解する．",
        "outcomesMeasuredBy": "トピックには高度に抽象化されて，現実の問題とは切り離れたように見えるものから，より密接に具体的な問題と関連したものまで種々用意されている．しかしながら，どの問題も現実の問題とつながりがあることを理解するのが第１点．その数理的アプローチの意義を理解し，類似の別の問題にも適用できるようになることが第２点である．言い換えれば，数学を現象や状態のモデル記述のためのツールとして捉え，行列や方程式，グラフ・ネットワーク，微分方程式などの抽象的な概念が現実の問題を解くツールとして開発されてきたという認識をもち，実際の問題に適用できるようになることである．本学が掲げるラーニングアウトカムの中では「論理的な思考力」「問題解決力」などが大きく関係する．また、定量性の概念がなければ、分析・評価・他人とのコミュニケーションに支障をきたすと言う意味で「分析・評価能力」，「コミュニケーション能力」とも関係がある．",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義を中心に進める．また，講義の合間に適宜，理解度確認の演習を行う．なお，資料はMoodle経由で配布するのでノートPC必携．",
        "notices": "多彩なトピックが盛り込まれているが，いずれも深く掘り下げることはせず，数学の応用の一端を素養として知ることに主眼をおく．それゆえ，最低限の簡易な計算はあるものの煩雑な計算は要求されない．その一方で，たえず思考する姿勢が求められる．",
        "preparatoryStudy": "高校数学（特に数学I，A，II，B）の知識をある程度前提として話を進める．したがって，忘れていると思われる内容については十分な復習をし，いつでも知識が引き出せるよう備えをしておくこと．講義後，必ず復習して，学修内容を整理すること．講義前に資料を配布するので、それに目を目を通して分からない単語があれば、未習のことか高校の教科書に載っているようなことか確認しておくこと．",
        "gradingGuidelines": "期末試験の成績70%，レポート・演習の成績30%の割合で素点を100点満点に換算し，成績評価を行う．60点以上が単位認定の要件となる．小テストはオンラインで行い，結果はその場でフィードバックされる．その他の演習については，Moodleにて正解率などを含めて講評を加える．",
        "textbook": "指定しない",
        "referenceMaterials": "指定しない",
        "courseSchedule": "第1回：講義概要，複素数(各クラスの担当者が担当)第2回：確率（確からしさ，条件付き確率の理解,山元が担当）第3回：確率（期待値の理解，確率の議論に現れる漸化式,山元が担当）第4回：確率（ギャンブラーの破産問題,山元が担当）第5回：グラフ（グラフとネットワークの関係の理解,山元が担当）第6回：最大流量問題（最大流量問題の理解,山元が担当）第7回：最大流量問題（簡単な最大流量問題を解いてみる,山元が担当）第8回：関数の極限と導関数(生野が担当)第9回：逆三角関数とその導関数(生野が担当)第10回：偏微分(生野が担当)第11回：スプライン補間(生野が担当)第12回：最小二乗法(生野が担当)第13回：現象とモデル，微分方程式(生野が担当)第14回:総合演習(各クラスの担当者が担当)ただし，Aクラスは第1回~第14回の順に，Bクラスは第1回，第8回~第13回，第2回~第7回，第14回の順に開講される．",
        "courseDataUpdatedAt": "2024\/01\/27"
    },
    "updateAt": "2024\/09\/13"
}