{
    "lectureCode": "1104101",
    "courseName": "情報リテラシー演習[機]",
    "lecturer": [
        "加藤太朗(工学部機械工学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月4",
        "月5"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０３"
    ],
    "courceDetails": {
        "courseOverview": "現在の情報化社会においてコンピュータを用いた作業は欠かせない。そのため、コンピュータの基本的な操作方法に加え、電子メールの利用方法やマナー、インターネットの安全かつ適切な活用方法、MicrosoftOfficeの操作方法などについて修得する必要がある。この授業では上記の必須事項に加えて、本学で学生生活を送るために必要なスキルを演習を中心に身に着ける。本講義の前半ではノートPCの操作方法やウェブブラウザ、電子メール、学内ウェブサービスの使用方法を習得する。講義後半では、MicrosoftOfficeのWord、Excel、PowerPointを使用し、実験レポートや論文の書き方、データ処理、グラフの作成、プレゼンテーション使用の作成などを習得する。さらに全14回の講義を通じて、PCのタイピングスキルの向上を図る。",
        "outcomesMeasuredBy": "本授業では、『国際的な教養』、『論理的な思考力』、『分析・評価能力』、『問題解決力』の習得と向上を目指す。なお具体的な達成目標を以下に示す。①ノートPCの操作方法の習得（ウェブブラウザの操作やファイルの管理、アプリケーションのインストール）②本学のウェブサービスの利用方法の習得（Moodle、履修登録システム、学生ポータル等）③電子メールの利用方法とマナー④MicrosoftOffice（Word、Excel、PowerPoint）の操作方法の修得⑤プレゼンテーション資料の作成と発表、コミュニケーションスキルの修得⑥タイピングスキルの向上",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本授業は講義と演習課題を組み合わせて行う。初回を除き次回の講義までに予習資料を基にした事前学習を前提とし、講義時間では前回の演習課題の解説や講義内容の補足説明、質疑応答を行う。なおタイピング練習は全講義で行う。演習の時間ではグループを作り、グループ内で相互に課題の進捗を確認し、分からないところや疑問をお互いに解決する能力の向上と講義の理解力向上を図る。またプレゼンテーションでは決められたテーマに沿って問題解決方法の提案や検討、資料作成、発表をグループワークとして行う。",
        "notices": "本授業ではノートPCを用いるため、ノートPCの購入及び持参が必須である。",
        "preparatoryStudy": "初回講義を除き、次回の講義までに予習資料を基に事前学習を行った上で講義に臨む。（予習課題あり）※60分程度また、講義に出題された演習課題について次回の講義で解説が行われるまでに復習する。※60分程度",
        "gradingGuidelines": "講義中の演習課題、到達度チェック、グループプレゼンテーション、授業参加度によって総合的に評価する。",
        "textbook": "指定なし。",
        "referenceMaterials": "Moodleに講義に関する資料を掲示する。",
        "courseSchedule": "第1回：ガイダンス、ネットワークへの接続、本学のウェブサービスの利用方法、MicrosoftOfficeのライセンス認証第2回：PowerPointでのポスター作成第3回：GoogleDriveでのデータ共有、プリントショップ第4回：PowerPointでのスライド作成第5回：Wordの使用方法第6回：Excelの使用方法第7回：中間到達度チェック第8回：Excelを用いたデータ処理①第9回：Excelを用いたデータ処理②、Wordによるレポート作成第10回：グループプレゼンテーション①、グラフ・数式作成演習第11回：グループプレゼンテーション②、グラフ・数式作成演習第12回：グループプレゼンテーション③、グラフ・数式作成演習第13回：VisualStudioのインストール、グラフ・数式作成演習第14回：最終到達度チェック※第2回から13回までタイピング練習を行う。",
        "courseDataUpdatedAt": "2025/02/05"
    },
    "updateAt": "2025/03/21"
}