{
    "lectureCode": "11043M2",
    "courseName": "数学基礎[M2]MS",
    "lecturer": [
        "小林克正(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義棟Ａ２０３"
    ],
    "courceDetails": {
        "courseOverview": "自然科学・工学・社会科学等あらゆる学問分野において，数学は基本的な言語としての役割を果たしている．そのため，大学入学後の講義を理解する上で高校レベルの数学を理解しておくことは必須の条件と言える．本講義では主に自然現象や社会現象を初等関数で記述するという視点から，数式の扱いや初等関数の基本的な性質，微積分学の初歩を解説する．具体的に扱う内容は実数および複素数の性質，多項式と有理式の扱い，初等関数の性質と現象のモデル化，微積分学の初歩的な定義と現象の解析である．",
        "outcomesMeasuredBy": "自然現象や社会現象のモデル化という作業に慣れること，数式の扱いや初等関数の基本的な性質，微積分学の初歩を理解し，基本的な計算ができるようになることを目指す．また，言葉としての数学に慣れることでコミュニケーション能力の基礎を築くこと，数学の思考形式の学修により，論理的な思考力，問題解決力，分析・評価能力を身につけることを重点的な目標とする．",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "基礎的な事項の解説の後，演習，小テストなどを行う．尚，本講義ではノートPCを出欠確認以外にも使用することがあるので，必携とする．",
        "notices": "履修前に高校数学IA，IIBの内容をよく復習しておくこと．学期中は復習・予習を積極的に行い，わからないことは質問すること．各回において，適宜小テスト，レポートを課すことがある．",
        "preparatoryStudy": "各回の講義前には高校の教科書や参考書として挙げられている書籍などを利用して予習をしておくこと．講義後は講義中に行った演習をもう一度解いてみること，宿題があればそれをやること，講義の内容について自分自身の力でまとめを作成してみること．講義の内容を他者に対して説明できるようになることが望ましい．",
        "gradingGuidelines": "期末試験の成績60%，演習・小テスト・レポートの成績40%の割合で100点満点に換算し，成績評価を行う．60点以上が単位認定の要件となる．提出物や小テスト，学修状況について，講義中に適宜コメントや講評などの形でフィードバックを行う予定である．",
        "textbook": "使用しない．",
        "referenceMaterials": "小寺平治著『リメディアル大学の基礎数学』（裳華房）",
        "courseSchedule": "第1回：数と式(1)：数の性質第2回：数と式(2)：多項式の扱い（和，差，積），数式を用いた事象の表現第3回：数と式(3)：有理式の扱い，剰余の定理，因数定理第4回：初等関数(1)：関数とグラフ，自然・社会現象の表現第5回：初等関数(2)：1次関数，2次関数の性質とその応用第6回：初等関数(3)：指数，対数計算とその応用第7回：初等関数(4)：指数関数，対数関数の性質第8回：初等関数(5)：指数的増加，減少モデル第9回：初等関数(6)：三角比，弧度法第10回：初等関数(7)：三角関数の性質第11回：初等関数(8)：周期的な変化をする現象第12回：微積分学の基礎(1)：微分法の定義と関数の増減第13回：微積分学の基礎(2)：積分法の定義と面積第14回：複素数とベクトル：複素平面と複素数の極形式表示",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}