{
    "lectureCode": "11051C13",
    "courseName": "フレッシャーズゼミII[13]CS",
    "lecturer": [
        "竹田昌弘(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "フレッシャーズゼミIIは、前期のフレッシャーズゼミIの活動を踏まえて、クラスメンバーと教員との信頼関係を発展させるために、また、社会人基礎力の養成のためにより主体的なグループ活動を中心に進める。具体的には、学生自身が能動的・自律的にグループで協力して活動し、その成果を発表するアクティブラーニングの実践を行う。数人の現場の技術者からその職種に就くために、大学卒業までに、卒業後にどのようなスキルや学問を修得しておく必要があるかを学んで、CS学部卒業後に就く職種の具体的な研究を行う。後期のはじめに、前期の成績結果及び夏休み計画の実施状況などについての振り返りとそれを踏まえた後期の成績目標設定の面談を行う。",
        "outcomesMeasuredBy": "アクティブラーニングの実践を通じ、学生自身が能動的・自律的にグループで協力して活動を行うことができるようになる（コミュニケーション能力）。また、CS学部卒業後に就く職種に必要なスキルを理解することができる（実学に基づく専門能力）。グループ内での発言やグループ発表を通じて、論理的な説明能力を向上することができる（論理的な思考力）。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力",
        "teachingMethod": "少人数クラスでの授業を中心とし、学生同士、学生と教員との自由な討論を通して大学生活4年間の人的ネットワークを形成できるようにする。また、学部の合同講義として、全体で共通の講義を受ける回も設ける。実施日程などの詳細はガイダンス時にアナウンスする。クラス分けは、学籍番号にしたがって決定する。3～4人程度でグループを組み活動（グループワーク）を行う。その成果を学生が発表することで、学生自らの主体的な学び(アクティブラーニング)を促す。",
        "notices": "4年間の大学生活の方向付けを行う科目であり、討論や発表を重視している。毎回必ず出席し、積極的に活動に参加すること。やむを得ない理由で欠席の場合、担当教員に理由書を提出すること。",
        "preparatoryStudy": "特にグループワークについて、授業時間外の調査、準備、打合せなどを行う必要がある。また、授業で紹介する企業調査の方法や現場の技術者からの講演内容を復習して、ワークシートを作成する。具体的には、クラスの担当教員の指示に従うこと。",
        "gradingGuidelines": "ワークシートやグループワーク発表の提出物に基づいて評価する。提出物に対して、授業内もしくはMoodleなどでフィードバックする。毎回の講義での発言やグループ発表の活動により加点することがある。",
        "textbook": "なし（講義スライドを使用）",
        "referenceMaterials": "必要に応じて、教員ごとに指示する。",
        "courseSchedule": "第1回:後期履修計画、アドバイザー面談第2回:SDGsへのITを用いた社会貢献、グループワークで検討第3回:SDGsへのITを用いた社会貢献、発表会第4回:キャリアパス形成の説明会第5回:キャリアパス形成、グループワークで準備学習①第6回:現場の技術者から①第7回:キャリアパス形成、グループワークで準備学習②第8回:現場の技術者から②第9回:キャリアパス形成、グループワークで準備学習③第10回:現場の技術者から③第11回:キャリアパス形成、発表会準備第12回:キャリアパス形成、発表会第13回:カリキュラム及び進路・キャリア関連の説明会第14回:総括",
        "courseDataUpdatedAt": "2024\/02\/29"
    },
    "updateAt": "2024\/09\/13"
}