{
    "lectureCode": "11050C05",
    "courseName": "フレッシャーズゼミI[5]CS",
    "lecturer": [
        "ライエルグリムベルゲン(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "フレッシャーズゼミIは、大学生活への適応、仲間や場づくり、各自の大学4年間の学業、サークル活動、自己啓発活動の具体的な目標とその計画立案を支援することを目的としている。大学の4年間は未成年から社会人になる重要な時期であり、将来、社会において進むべき道を見据えた勉学や社会で求められる能力（社会人基礎力）を理解し、これを伸ばすことが求められる。社会人基礎力の考えは、大学において能動的・自律的に学ぶ力そのものであるので大学で学びの目的を達成する上でも大事な能力となる。そこで、この授業では、履修計画、大学での学びの技法、学業目標・学習目標の設定など、大学生活の様々な側面において、より充実した実りのあるキャンパスライフを送るための基礎的なアドバイスをする。各自の可能性を最大限に引き出せるように、互いに啓発し合う授業を皆で作り上げていく。特に、大学での学びの基盤となる論理的な文章作成に重点を置く。夏休み前には、夏休みを活用した自主的活動の目的・目標などについて考え、有意義な休暇の過ごし方の準備を支援する。",
        "outcomesMeasuredBy": "大学での学びを円滑に開始するとともに、社会で必要とされる文章力や論理的で説得力のある文章を作成する能力（論理的な思考力）を身につける。さらに、少人数であるフレッシャーズゼミのグループにおいて、学生と教員との自由な討論を通してコミュニケーションを円滑に実施する能力（コミュニケーション能力）を身につける。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力",
        "teachingMethod": "少人数クラスでの授業を中心とし、学生同士、学生と教員との自由な討論を通して大学生活4年間の人的ネットワークを形成できるようにする。また、学部の合同講義として、全体で受講する共通の講義も設ける。実施日程などの詳細はガイダンス時にアナウンスする。クラス分けは、学籍番号にしたがって決定する。",
        "notices": "４年間の大学生活の方向付けを行う科目であり、討論や発表を重視している。毎回必ず出席し、積極的に活動に参加すること。やむを得ない理由で欠席の場合、担当教員に理由書を提出すること。事前に「シラバスと講義概要」、「教務関連ガイダンス資料」に目を通しておくこと。",
        "preparatoryStudy": "ロジカルライティングにおいて、授業で学んだことを用いて、復習として文章を作成する。具体的には、担当教員の指示に従うこと。",
        "gradingGuidelines": "ロジカルライティングの提出物に基づき評価する。提出物に対して、授業内もしくはMoodleなどでフィードバックする。毎回の授業での発表／発言で加点することがある。",
        "textbook": "別所栄吾，「で、結局なにが言いたいの」と言わせないロジカルな文章の書き方超入門(ディスカヴァー・トゥエンティワン)，2021．",
        "referenceMaterials": "必要に応じて、担当教員ごとに指示する。",
        "courseSchedule": "第1回:自己紹介、履修指導第2回:大学における履修の理解:フレッシャーズゼミの内容や履修の仕組みの理解第3回:学内オリエンテーリング第4回:学生生活におけるハラスメント、大学生活における安全、著作権の理解、GPS－Academicについて第5回:GPS－Academic(受験)第6回:大学における学びと就業力の理解第7回:GPS－Academic(結果の解説・振り返り)、大学の理念と歴史の理解第8回:ロジカルライティング実習1：ロジカルな文章を書くために気をつけること第9回:ロジカルライティング実習2：問題のある文章の修正、文章作成の練習1第10回:ロジカルライティング実習3：作成した文章の評価1第11回:ロジカルライティング実習4：パラグラフの構成、文章作成の練習2第12回:ロジカルライティング実習5：作成した文章の評価2、最終チェック第13回:大学生・社会人マナー実践講座第14回:まとめ、夏休みの行動計画",
        "courseDataUpdatedAt": "2024\/02\/29"
    },
    "updateAt": "2024\/09\/13"
}