{
    "lectureCode": "11120C01",
    "courseName": "キャリア設計I[CS]",
    "lecturer": [
        "大石邦夫(コンピュータサイエンス学部コンピュータサイエンス学科)",
        "榎内美穂(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "この授業の目的は、社会人基礎力の醸成と強化である。授業では、働くことの意義の考察や働くことへの動機づけに始まり、自己分析・自己理解、グループワークやペアワークを通じて、コミュニケーション能力と問題解決力を主として習得する。また、企業研究によって分析・評価能力と実学に基づく専門能力を獲得する。さらにエントリーシートの作成とそのフィードバックによって，自らが追加修正することで論理的な思考力を習得する。また、進路決定に大きな影響を与える卒業課題（創成課題）配属先研究室の選択を題材として、自分自身の希望や特性を生かしたキャリアディベロップメントを図っていくための基本的な考え方や自分がとるべき行動計画を作ることで、分析・評価能力と論理的な思考力を習得する。",
        "outcomesMeasuredBy": "・卒業課題研究室の調査や企業研究と併せて、将来のキャリア形成に向けた自己分析を行うことによって、自分に適した職種や企業の選択をする。（論理的な思考力、分析・評価能力）・グループワークやペアワークを通じて他者との相互理解に基づいたコミュニケーションについて学ぶことで、価値観や文化背景が異なるコミュニティーや人物に対して自身の意見や考え方を的確に伝えることができるようにする。（コミュニケーション能力、問題解決力）・夏季休暇中に開催されるインターンシップや研究室における挑戦的な学術プログラムに、自主的に参加する気概を持つことを目標としている。（実学に基づく専門能力、問題解決力）・授業で出されるエントリーシート作成、小テストや宿題を調べて解答できるようにする。（論理的な思考力、問題解決力）",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・出欠確認や課題の提出をMoodleにて行うため，学内ネットワークに接続可能なノートＰＣを必携とする。・履修者全員が参加する集合授業を行なう．・クラス別の講義（ワーク、ディスカッションを含む）を行なう．・研究室紹介を実施して、研究室の選択による創成課題と卒業課題を就職活動に生かせるようにする。・優良企業への就職内定、大学院進学および将来の顕著なキャリアップを目指すための選抜クラス（特進クラス及び大学院進学クラス）を設置する。・選抜クラスへの配属は、この講義の冒頭におこなう希望調査をもとに実施する。・選抜クラスでは一部、一般クラスとは異なる教材・内容による授業実施となる場合がある。",
        "notices": "・全14回の講義を無欠席及び無遅刻となることが、「授業への積極的な取り組み」になる。・欠席事由について事前連絡がない欠席（無断欠席）は、「授業への積極的な取り組み」にならないので、注意をすること。・やむを得ず欠席する場合、欠席申請（証明書のコピーを添付）を事前に提出すること。・授業回により全体での実施や個別クラスでの実施があることから、常に関連する掲示や案内に留意の上、出席すべき教室にて受講すること。",
        "preparatoryStudy": "・３年次後期に配属となる研究室についての情報を積極的に収集し、研究室説明会に参加して、自身の特性に合った研究室に対して自己推薦を行なうこと。・社会情勢、動向について、様々なメディアを通じて積極的に予習してくること。・自分自身の将来計画（キャリアビジョン）や将来就きたい仕事、職業について考えて来ること。・毎授業前には、次回授業のテーマを確認し、自分なりの考えをまとめてくること。・毎授業後には、当日の授業の振り返り（授業を通じて新たに得た知見、自分なりに考えたこと、今後の自身の活動や計画に生かしたいことなど）をまとめておくこと。",
        "gradingGuidelines": "・全14回の開始時間からの参加による授業への積極的な取り組みと、すべての提出物（課題、研究室ES、研究室模擬面接完了報告など提出すべきもの）とコミュニケーションシート及び小テストの期限内提出をすることが、成績判定の条件になる。・成績判定は、授業への積極的な取り組みの評価(50%）、提出物と小テストの評価(50%）によって行う。・授業への積極的な取り組み、提出物と小テストの評価が、60点以上を合格とする。・提出物や小テストの採点や講評のフィードバックを適宜実施する。・やむを得ない事情（例えば、電車遅延）によって、遅刻や欠席があった場合、それを証明する書類と欠席（遅刻）申請内容をもとに、承認する場合がある。",
        "textbook": "テキスト「MYCAREERNOTEⅢ」ベネッセi-キャリア",
        "referenceMaterials": "「働き方の哲学」ディスカバー・トェンティワン「折れない就活」リスナーズ「この１冊ですべてわかる新版SEの基本」日本実業出版社「就職四季報総合版2024」東洋経済新報社「会社四季報業界地図2024版」東洋経済新報社",
        "courseSchedule": "第1回：授業ガイダンス（大石邦夫、榎内美穂）第2回：自己理解を深める（大石邦夫、榎内美穂）第3回：社会に出るとは・キャリアビジョン（大石邦夫、榎内美穂）第4回：Web試験対策（大石邦夫、榎内美穂）第5回：IT企業・業界研究（大石邦夫、榎内美穂）第6回：インターシップ応募書類を作る、自己PR（大石邦夫、榎内美穂）第7回：就職四季報の活用（大石邦夫、榎内美穂）第8回：研究室紹介１（大石邦夫、榎内美穂）第9回：研究室紹介２（大石邦夫、榎内美穂）第10回：研究室紹介３（大石邦夫、榎内美穂）第11回：インターシップ応募書類を作る、学チカ（大石邦夫、榎内美穂）第12回：面接のフィードバック（大石邦夫、榎内美穂）第13回：面接のフィードバック（大石邦夫、榎内美穂）第14回：SPIとWebテスト対策（大石邦夫、榎内美穂）",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}