{
    "lectureCode": "B10403",
    "courseName": "生命科学I[3]",
    "lecturer": [
        "矢野和義(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ５０３"
    ],
    "courceDetails": {
        "courseOverview": "生命科学とよばれる分野は近年目覚ましい進展をしており、日々多くの新しい研究成果が発表されている。この講義では、生命の最小構成単位である細胞が、どのように複製され自己再生を行っているかを学ぶための第一歩として、以下の内容を習得することを目的として開講される。授業内容は、生物の進化、最小構成単位である細胞の構造及び機能、生体構成成分であるアミノ酸、タンパク質、核酸、糖、脂質についての基礎知識とする。",
        "outcomesMeasuredBy": "本講義では、学生が生命科学の実学に基づく専門能力を身に付けることを目指す。すなわち、生命の起源と進化のプロセスを理解し、生命の最小構成単位である細胞の構造及び機能を学ぶ。また、生体分子の基本的な知識を理解し、さらにそれらが互いに密接に相互作用し生命が維持されていることを理解することで、論理的な思考力を身に付ける。以上の内容によって、高度な生体反応を学習するための基礎を修得することを到達目標とする。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "授業は、パワーポイント資料と板書を併用して行う。授業内容は基本的には教科書に沿って進める。毎回の講義資料は紙媒体で配布される場合と、Moodleにアップロードされる場合がある。後者の場合は、ノートPCなどを利用してこの講義資料をあらかじめダウンロードして印刷する、あるいはノートPCなどで閲覧できるようにしておくこと。講義中には指名-回答-解説形式のアクティブラーニングを取り入れた講義を行う。また理解度チェックを講義時間中に行い、各学生はこの結果を授業の理解度の確認に利用する。また、Moodleはレポート・課題等の提出に使用することがある。レポートや講義中の理解度チェックに対しては、講義における解説、及びMoodleを通じてフィードバックを行う。",
        "notices": "高等学校の生物に自信のないものは、高等学校の生物の教科書を必要に応じて参照しておくことが望ましい。",
        "preparatoryStudy": "高等学校の生物の教科書から、生物の起源と進化、および細胞と分子に関係する箇所の内容を復習しておくこと。また講義前に必ずテキストを読んで予習し、授業があった日のうちに復習を行うこと。生物の基礎となる講義であることから、専門用語などは各自整理して理解すること。",
        "gradingGuidelines": "期末試験（70%）、講義に関連して行われる理解度チェック（課題や小テストを含む）の結果（30%）にて総合的に評価する。毎回行う小テストについては、小テストの後、または次回の講義冒頭で解説することでフィードバックを行う。",
        "textbook": "「はじめて学ぶ生命科学の基礎」畠山智充・小田達也編著化学同人本テキストは「生命科学Ⅰ、Ⅱ、Ⅲ」で共通して使用する。",
        "referenceMaterials": "特になし",
        "courseSchedule": "第1回：生命と進化生命の起源と複製、進化についての知識を習得する第2回：分類生物の分類についての知識を習得する第3回：細胞1細胞の基本構造についての知識を習得する第4回：細胞2細胞小器官についての知識を習得する第5回：タンパク質1アミノ酸の構造についての知識を習得する第6回：タンパク質2ペプチド結合、タンパク質の一次構造についての知識を習得する第7回：タンパク質3タンパク質の二次構造、三次構造についての知識を習得する第8回：タンパク質4・核酸1タンパク質の四次構造、DNAの構造についての知識を習得する第9回：核酸2DNAとRNAの構造についての知識を習得する第10回：糖質1単糖の化学構造、立体構造、単糖の誘導体についての知識を習得する第11回：糖質2グリコシド結合についての知識を習得する第12回：糖質3多糖と複合糖質についての知識を習得する第13回：脂質1脂肪酸と中性脂質についての知識を習得する第14回：脂質2グリセロリン脂質、複合脂質についての知識を習得する",
        "courseDataUpdatedAt": "2024\/01\/06"
    },
    "updateAt": "2024\/09\/13"
}