{
    "lectureCode": "B10501",
    "courseName": "生命科学II[1]",
    "lecturer": [
        "安川然太(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義棟Ａ３０３"
    ],
    "courceDetails": {
        "courseOverview": "生命科学は私たちの体や日常生活に深く関わっています。本講義では、生命を支える分子レベルのメカニズムについて学びます。一見複雑で神秘的に見える生命現象も、実は数多くの生体分子が精密に制御された仕組みによって成り立っています。この講義では特に、生命活動の主役となるタンパク質の構造と機能、そして細胞内でのエネルギー代謝に焦点を当てて解説していきます。この講義を通じて、生命科学の基礎を身につけ、私たちの体で日々起きている生命現象を科学的に理解する力を養います。日常生活における様々な生命現象を、分子レベルの視点から考察できるようになることを目指します。",
        "outcomesMeasuredBy": "本講義では、生命科学における実学に基づく専門能力と論理的な思考力の習得を目指し、以下の目標達成を目指します。【専門能力】1.タンパク質の多様な機能と生体内での役割について具体例を挙げて説明できる2.酵素の基本的性質と反応機構を理解し、その特徴を説明できる3.酵素活性の調節メカニズムとその生理的意義について説明できる4.細胞内におけるエネルギー代謝の主要経路（解糖系、TCAサイクル、電子伝達系など）について説明できる5.代謝経路間の相互関係とその制御機構について説明できる【論理的思考力】1.生体分子の構造変化と機能の関連性について論理的に考察できる2.細胞内の代謝経路の相互関係を体系的に理解し説明できる3.日常生活における生理現象を分子レベルで論理的に説明できるこれらの目標を達成することで、生命科学の基礎的な知識と思考力を身につけ、より専門的な学習への基盤を形成します。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "授業は教科書に基づいて進め、重要な概念や最新の研究知見も適宜補足説明します。各回の講義では以下の方法で学習を進めます：・前回の講義内容の簡単な振り返り・プリントを用いた講義内容の理解・教科書に沿った講義と解説学習管理システム（Moodle）を活用し、予習を行っていただきます不正解の問題については解説を行い、理解の定着を図ります※プリント実施時には、ノートPCまたはスマートフォンが必要となりますので、必ず持参してください。また基本は教科書から出題していますので、教科書も持参が必要です。",
        "notices": "生命科学Iを受講済みであることが望ましい。",
        "preparatoryStudy": "教科書を読んで予習に取り組むこと。",
        "gradingGuidelines": "毎回の授業における演習課題等（20%）と講義内容の理解度チェック（第7回）（40％）および期末試験（40%）で評価する。",
        "textbook": "はじめて学ぶ生命科学の基礎畠山智充・小田達也編著化学同人",
        "referenceMaterials": "",
        "courseSchedule": "第1回:タンパク質の機能と構造1酸素運搬タンパク質第2回:タンパク質の機能と構造2ヘム結合タンパク質の構造と機能第3回:タンパク質の機能と構造3酵素の特異性、分類と補因子第4回:タンパク質の機能と構造4酵素の反応機構と反応速度第5回:タンパク質の機能と構造5モータータンパク質第6回:タンパク質の機能と構造6細胞骨格第7回:タンパク質の機能と構造7中間理解度チェック第8回:細胞のエネルギー代謝1エネルギーの通貨と代謝の全体像第9回:細胞のエネルギー代謝2解糖系第10回:細胞のエネルギー代謝3クエン酸回路第11回:細胞のエネルギー代謝4電子伝達系第12回:細胞のエネルギー代謝5光合成の明反応第13回:細胞のエネルギー代謝6光合成の暗反応第14回:細胞のエネルギー代謝7脂肪酸のベータ酸化",
        "courseDataUpdatedAt": "2025/02/13"
    },
    "updateAt": "2025/03/21"
}