{
    "lectureCode": "B10901",
    "courseName": "一般化学[1]",
    "lecturer": [
        "横山憲二(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ３０２"
    ],
    "courceDetails": {
        "courseOverview": "物質を構成する粒子（原子、分子、イオン）の構造、粒子間の化学結合などの化学の基礎を発展的な内容を含め学ぶ。また、化学平衡と反応速度、酸・塩基と酸化・還元など、2年生以降の化学系科目を理解し、実践的に利用するための化学の基礎、発展的内容を学ぶ。これらを学ぶことは、応用生物学部で取り扱う様々な物質の性質を理解し、実践応用する上でも重要である。",
        "outcomesMeasuredBy": "物質を構成する粒子の構造、性質や化学結合について理解するため、電子軌道の基礎的概念を学び、原子等の電子配置を自身で確実に記述できるようにする。また、化学平衡と反応速度、酸・塩基と酸化・還元など、生命科学を理解するための化学に関する実学に基づく専門能力を育成することを目標としている。また、応用生物学部で学ぶ上で重要な化学計算問題を解く訓練をし、論理的な思考力を有する学生を育成する。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "対面形式で講義を行う。パワーポイントを使いながら、教科書に従って行う講義であるが、発展的な内容は他の書籍、論文等の文献の内容を使用しながら説明する。毎回の講義後半に、講義内容に関連する問題を出し、講義時間内に模範解答の紹介、解説を行う。高校化学の習熟度が高い学生を対象とした、高いレベルの講義と演習を行う授業である。Moodleに講義で使用するパワーポイントファイル（PDF）をアップロードしておくので、この資料を見ながら受講することを強く勧める。",
        "notices": "図書館の本などを利用して受講前に高校化学（化学基礎、化学）を自習しておく。また、前期に履修した化学演習、化学基礎演習を十分に復習しておくこと。",
        "preparatoryStudy": "学生ポータルMoodleに講義で使用するパワーポイントファイル（PDF）をアップロードしておくので、各自、事前にダウンロードし、予習することが望ましい。また解説動画も、併せてアップロードしておくので、予習、復習に利用することが望ましい。",
        "gradingGuidelines": "学期中期に行う到達度確認テスト30%、期末テストを70％として評価する。全14回全てに出席することを前提とする。毎回の授業で行う演習を通して理解度をフィードバックを行うことができる。毎回の講義終了後、moodle上に模範解答、解説動画などをアップロードするので、それらを用いたフィードバックを行うことができる。",
        "textbook": "Catchup大学の化学講義（改訂版）、杉森彰・富田功著、裳華房、ISBN978-4-7853-3507-6定価1,900円＋税",
        "referenceMaterials": "フレンドリー物理化学、田中潔・荒井貞夫著、三共出版、ISBN978-4-7827-0482-0、定価2,800円+税",
        "courseSchedule": "第1回ガイダンス、原子・元素・単体、原子軌道・原子の中の電子の軌道第2回元素の周期律と性質第3回無機化学と無機化合物、化学結合序論第4回共有結合基礎、混成軌道（炭素）第5回混成軌道発展、シグマ結合パイ結合第6回共有結合・分極第7回化学式と異性体、前半の復習第8回前半の総括、到達度確認テスト第9回反応エンタルピー第10回エントロピー、自由エネルギー、化学平衡第11回反応速度、酸塩基序論第12回酸塩基とpH第13回塩の加水分解と緩衝溶液第14回酸化還元、標準電極電位、電気分解",
        "courseDataUpdatedAt": "2024\/02\/21"
    },
    "updateAt": "2024\/09\/13"
}