{
    "lectureCode": "B21002",
    "courseName": "無機化学（2024年度入学者用）",
    "lecturer": [
        "柴田雅史(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "生命科学、創薬、環境、食品、化粧品などの応用生物学分野に関連する無機化学の基礎理論と無機物質の性質を学ぶことで、これら分野を体系的に理解し、かつ実験・研究へと応用できる能力を身につけるための授業である。1）応用生物学分野に関連する元素（H〜Krといくつかの遷移元素）とその化合物の化学的性質2）化学結合および錯体に関する基礎的な化学理論の2点を中心に講義をする。",
        "outcomesMeasuredBy": "本授業を履修することにより、ライフサイエンスに関連する無機化学分野の、実学に基づく専門能力を得ることができる。具体的にはバイオテクノロジー、医薬品、食品、化粧品などライフサイエンスを理解する上で必要な無機化学の知識の体系的な習得である。また、物質の性質と化学結合・錯体に関する化学理論との関連を考え、理解することによって論理的な思考力が身につく。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力",
        "teachingMethod": "授業では穴埋め部分に書き込みをしながら予習段階での推察との適合を確認し、詳細を理解する。また穴埋め部分の推察については、授業中に適宜指名して回答を求めることでコミュニケーション能力の向上をはかる。授業時間終了後、セクションの区切り毎に講義内容に関する小テストを実施する（オンライン提出）。授業にはノートPCまたはタブレットを持参する。",
        "notices": "授業では、資料（ワークブック）の説明および書き込み指示をおこなう。その場で理解し、必要事項は暗記するように心がける。ワークブックに書き込みができるよう、印刷をするか、もしくはpdfファイルに書き込みができるデジタル端末を持参して授業に参加する。終了前の5分間を質問時間にあてるので、理解できなかった点はその際に積極的に問い合わせること。",
        "preparatoryStudy": "まず前回のワークブックの穴埋め事項を確認する復習をおこなう。次にワークブックを事前に授業サイトからダウンロードし、穴埋め部分を推察しながら読み込んだ上で、授業に持参すること。",
        "gradingGuidelines": "授業への出席を前提として、期末試験を70%、授業時間終了後におこなう小テストの成績を30%として評価する。小テストは次回の授業の始めにフィードバックをおこなう。",
        "textbook": "授業サイトで資料（ワークブック）が配布される。",
        "referenceMaterials": "ライフサイエンス系の無機化学（三共出版）工学のための無機化学（サイエンス社）",
        "courseSchedule": "第1回:本講義の進め方、周期表と電子配置第2回:八隅説、電気陰性度第3回:18族の元素・水素の性質第4回:1族元素、2族元素の性質第5回:13族元素の性質第6回:14族元素の性質第7回:計算化学での結合の考え方（分子軌道法、混成軌道）第8回:15族元素の性質第9回:16族元素の性質第10回:17族元素の性質第11回:遷移元素と典型元素との比較第12回:錯体の形成と性質1:配位子の機能第13回:錯体の形成と性質2：配位座と結晶場理論第14回:代表的な遷移元素の性質",
        "courseDataUpdatedAt": "2024\/02\/13"
    },
    "updateAt": "2024\/09\/13"
}