{
    "lectureCode": "B22601",
    "courseName": "生命工学",
    "lecturer": [
        "秋元卓央(応用生物学部応用生物学科)",
        "松井徹(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "人類は昔から生物の力を利用し生活を豊かにしてきた。酵母を利用したパン作りや、カビを利用した味噌や酒作りはその一部である。また、抗生物質の発見による医療の進歩もまた、生物の力を利用した好例である。近年では、DNAを操作する遺伝子工学が発展し、生命現象の基本である遺伝、代謝、増殖などに人為的に手を加え、生物の力を効率よく利用したり、まったく新しい物質を生み出すことに利用されている。生命工学とは、遺伝子工学やタンパク質工学、生物を利用する産業技術全般を示す言葉であり、生命工学を学ぶことは将来の産業を支えるためにために大変に重要である。そこで本講義では、遺伝子工学やタンパク質工学などの専門的な生命工学の知識を身に着け、さらには、生命工学を利用した新しい実験手法などを自ら組み立てることのできる論理的な思考力や分析・評価能力を習得すること、実学に基づく専門能力の習得を目的とする。",
        "outcomesMeasuredBy": "分子生物学の知識を土台にして、基本的な遺伝子工学やタンパク質工学の知識を身に着ける。また、これらの知識を将来の研究に応用できる応用力を育成する。さらに、これらの知識を医療や環境へ応用した事例についても理解することを目的とする。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "パワーポイントの資料を用いた講義をを中心に、板書による補足を加えながら授業を進める。理解を深めるためアクティブラーニングとして授業中に練習問題や演習問題を出す。次回講義で、演習問題等のフィードバックを行う。",
        "notices": "授業中は授業資料を参照しながら、講義内容をノートに補足することで内容を理解する。テキストや参考書による予習、配布資料と講義ノートの併用による復習が重要である。",
        "preparatoryStudy": "分子生物学Ⅰ、Ⅱを復習しておくこと。履修していない場合は、独学し基本的にな分子生物学の知識を身につけておくこと。",
        "gradingGuidelines": "期末試験80％，授業中に課す小テスト20%で評価する",
        "textbook": "しくみからわかる生命工学田村隆明裳華房",
        "referenceMaterials": "基礎講義遺伝子工学Ⅰ、Ⅱ山岸明彦東京化学同人",
        "courseSchedule": "第1回：遺伝子と遺伝情報1染色体、ゲノム、遺伝子（秋元）第2回：遺伝子と遺伝情報2遺伝子の発現：RNA合成「転写」（秋元）第3回：核酸の性質と基本操作１DNAの合成（秋元）第4回：核酸の性質と基本操作２PCRとそのの応用（秋元）第5回：組み込んだDNAをつくり、細胞に入れる1制限酵素（秋元）第6回：組み込んだDNAをつくり、細胞に入れる2目的クローンをマークする（秋元）第7回：RNAとRNA工学（秋元）第8回：タンパク質に関する生命工学と前半のまとめ（秋元）第9回：動物細胞（松井）第10回：医薬品分野と生命工学（松井）第11回：一次産業と生命工学（松井）第12回：バイオリアクター、バイオセンサー（松井）第13回：環境・エネルギーと生命工学（松井）第14回：まとめと発展課題（松井）",
        "courseDataUpdatedAt": "2024\/02\/08"
    },
    "updateAt": "2024\/09\/13"
}