{
    "lectureCode": "B30701",
    "courseName": "化粧品実験Ｉ",
    "lecturer": [
        "柴田雅史(応用生物学部応用生物学科)",
        "吉田雅紀(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木3",
        "木4",
        "木5",
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "片柳研究所Ｅ５０１"
    ],
    "courceDetails": {
        "courseOverview": "1)化粧品設計実験コロイド界面化学の基礎知識と化粧品設計と製剤化に必要な技術を習得することを目的とする。前半は乳化、洗浄、ゲル化を題材に基礎実験をおこなう。後半は応用として化粧品の設計製造の実践（処方設計）をおこなう。2)化粧品評価実験スキンケア素材を開発するために使われる細胞での評価方法を習得し、皮膚の構造や皮膚内のメラニンの分布などの化粧品の標的となる対象の症状について知識を高める。無菌操作に加えてメラニン合成系への評価や美白剤評価法を実習する。皮膚色の違いとメラニン顆粒の分布を組織切片と角層で観察することで実際の皮膚での変化を学習する。",
        "outcomesMeasuredBy": "本実験では、実験作業を通して、化粧品分野についての実学に基づく専門能力をつけることを目指す。またグループ内で結果・考察の議論とレポート作成を通してコミュニケーション能力を、実験結果の解析と処方設計の試行を通して論理的思考能力と分析・評価能力そして化粧品分野の実態に沿った問題解決能力を身につけることを目指す。本実験を履修することで、化粧品の設計・製造および美白剤などの有効性物質評価に関わる皮膚の生理的反応や理論、および評価技術を実験を通して理解し、身につけることができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "【授業形態：実験】数人のグループで実習でおこない、結果および考察をおこなう。（グループワーク）。実験レポートは各自で作成し、提出する。",
        "notices": "実験と講義には必ず出席し、実験のレポートを期限内に提出すること。やむを得ず欠席する場合は、理由を証明する書類を提出すること。グループ単位で実験をおこなうので、協力しあって積極的に作業に取り組むこと。実験ノート、筆記用具、および電卓を各自で準備すること。実験の際は必ず白衣、保護メガネを着用すること。PCを各自持参する。",
        "preparatoryStudy": "テキストに記載されている実験手順などをフローチャートにして、ノートに記述する。化粧品設計実験のテキストには講義項目があるので、その内容を理解してから参加すること。化粧品評価実験では、特にメラニン合成に関わる生理反応や美白剤について周辺の情報を調べておく。（予習復習あわせて210分程度）",
        "gradingGuidelines": "講義や実験中の取り組み方（予習準備、共同での実験操作や議論への積極的参加、安全への配慮、を確実におこなう）ならびに実験時間中におこなう発表に対する評価を30％、実験結果とそのレポートに対する評価を70％の比率で成績評価をする。実験結果に対するフィードバックは、実験終了後にグループ単位でおこなう。",
        "textbook": "実験テキスト「化粧品実験I」を配布する。",
        "referenceMaterials": "",
        "courseSchedule": "第1回:ガイダンス(柴田、吉田雅)第2回:1)界面活性剤の種類と洗浄性能(柴田)第3回:1)O/W乳化とW/O乳化、所要HLB(柴田)第4回:1)乳化法と乳液の性質(柴田)第5回:1)サンスクリーン乳液の設計(柴田)第6回:1)オイルの基本物性(柴田)第7回:1)オイルのゲル化とゲル物性(柴田)第8回:1)口紅スティックの設計：スタート処方とトライアル処方1の調製(柴田)第9回:1)口紅スティックの設計：トライアル処方2と3の調製と処方検討のまとめ(柴田)第10回:2)皮膚組織切片による構造/皮膚内メラニン観察、チロシナーゼの抗体染色(吉田雅)第11回:2)無菌操作の練習と細胞への添加実験および試料回収とタンパク質量評価(吉田雅)第12回:2)電気泳動とウエスタンブロッティングI(吉田雅)第13回:2)ウエスタンブロッティングIIと細胞でのメラニン合成評価(吉田雅)第14回:優秀者発表会(学部長賞選考)（柴田・吉田雅）",
        "courseDataUpdatedAt": "2025/02/04"
    },
    "updateAt": "2025/03/21"
}