{
    "lectureCode": "B31901",
    "courseName": "食品製造学",
    "lecturer": [
        "安川然太(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "月4"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "我々の豊かな食生活は、多種多様な食品が安定して供給されることによって支えられている。大量に流通するこれらの食品が「どのような過程を経て製造されているのだろう？」と考えたことがあるだろうか？食品の製造過程とは、原料の選定・品質管理から、加工工程における成分変化の制御、最終製品の保存・品質保証までを含む。食品製造学はこれらの過程を科学的に理解し、実践するための学問領域である。本講義では、日常生活で親しみのある代表的な食品を取り上げ、その製造における重要管理項目と科学的根拠について、食品化学、微生物学、生化学の基礎知識と関連付けながら体系的に解説する。本講義は、企業での食品開発研究・製造経験を持つ教員の実務経験に基づき、実際の製造現場での具体例を交えながら、理論と実践の両面から解説する実践的科目である。",
        "outcomesMeasuredBy": "食品製造学を受講することによって、以下の3つの能力が身につくことを期待する：①分析・評価能力：・食品の物理的・化学的・生物的特性を理解し、製品の品質を客観的に分析・評価することができる・製造工程における品質管理項目の意義を理解し、適切な評価方法を選択できる・製造工程で発生する成分変化を科学的に説明することができる②問題解決力：・食品の製造過程で生じる具体的な問題に対して、科学的な根拠に基づいた解決策を提案することができる・品質劣化や製造トラブルの原因を、これまでに学んだ専門知識を活用して論理的に推察することができる・食品製造に関する疑問に対して、科学的な根拠を示して適切に回答を述べることができる③実学に基づく専門能力：・実際の製造現場で活用されている品質管理手法や製造技術の原理を理解し、説明することができる・製造現場特有の課題や新技術について、科学的な観点から考察することができる・習得した専門知識と実践的な製造技術の知見を、卒業研究や将来の実務において活用することができる",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力問題解決力",
        "teachingMethod": "講義形式で行う。説明にはパワーポイントを使用する。本講義ではノートPCは必携ではないがMoodleを利用することが出来るようにスマートフォン等を持ってくること。",
        "notices": "本講義の受講によって食品製造に関する知識を十分に得ることができるが、生物化学Ⅰや生物化学Ⅱ、食品関連の科目も受講しておくと理解がより深まると考えられる。授業中はスライド・説明内容の要点をノートにメモし、帰宅後に授業内容を完全に再現できるようにすること。",
        "preparatoryStudy": "講義前までにその日の講義に関する内容を参考書やインターネットで調べておく。講義直後は「学習した内容をよく理解できた」と錯覚してしまう傾向があるため、復習によって知識の定着を図ることが重要である。そのため、講義内で行う演習課題やノートを見直して復習することで、知識の定着を図る。",
        "gradingGuidelines": "毎回の講義で行う演習課題（20%）、定期試験（80％）により、総合的に評価する。100点満点中60点以上で単位認定とする。なお、演習課題の解説は講義内ででフィードバックする。",
        "textbook": "使用しない。",
        "referenceMaterials": "食品加工・保蔵学栄養科学シリーズNEXT講談社食品加工貯蔵学新スタンダード栄養・食品シリーズ東京化学同人栄養科学イラストレイテッド食品学Ⅰ羊土社栄養科学イラストレイテッド食品学Ⅱ羊土社",
        "courseSchedule": "第1回：イントロダクション(ガイダンス)（食品製造学とは）第2回：乳の加工①（生乳の成分、製造、乳製品の分類）第3回：乳の加工②（粉乳、クリーム、バター、発酵乳）第4回：肉の加工①（食肉の成分、分類、牛肉）第5回：肉の加工②（豚肉、鶏肉、食肉加工品）第6回：豆類・大豆の加工第7回：小麦、米、とうもろこしと粉の加工第8回：卵の加工と乳化第9回：野菜の加工第10回：果物の加工第11回：魚、海藻の加工第12回：油脂、調味料、嗜好飲料第13回：食品の加工、保存、流通、包装第14回：食品の表示と規格、HACCP等",
        "courseDataUpdatedAt": "2025/01/06"
    },
    "updateAt": "2025/03/21"
}