{
    "lectureCode": "B32702",
    "courseName": "地球環境科学",
    "lecturer": [
        "浦瀬太郎(応用生物学部応用生物学科)",
        "秋元卓央(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "応用生物学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ２０２"
    ],
    "courceDetails": {
        "courseOverview": "環境関連の業界(たとえば，環境分析コンサルタント業，水処理業，農業法人，種苗業など)，あるいは，企業の環境管理部門への就職を目指す学生に必須となる地球環境およびそれを構成する大気圏，水圏での様々な現象について，講義する。また，他産業へ就職する学生にとっても，持続的な社会における判断や戦略に役立つ基礎的素養を本講義によって身につけることができる。具体的には，大気の運動，地球の熱収支，水質現象，人類に影響を与える化学物質や微生物に関する地球規模での問題についての基本的知識を講義する。",
        "outcomesMeasuredBy": "本講義では，地球環境に関する授業を通して，地球環境科学についての実学に基づく専門力を授業を通して身に付ける。さらに，授業中に地球環境に関連した小課題に回答することを通して問題解決力を身につける。さらに，ばらつきのある環境モニタリングのデータを統計的に理解することを通して，どの分野の学生にも有用な分析評価能力を育成する。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力問題解決力",
        "teachingMethod": "授業では要点を解説するとともに，質問と応答を重視したアクティブラーニングの形式でおこなう。LMS(Moodle)上に講義資料をあらかじめ掲載しておくので，授業前に目を通しておくことが望ましい。これらの講義資料に目を通すことによって，実学に基づく専門能力が養成されるとともに，地球環境に関するデータを読み解くことによって，分析・評価能力が育成されるように工夫されている。毎回の授業では、出席の確認をかねた小課題を課すことによって，自律的な学びを定着させ，また，さまざまな問題に対する幅広い意見を拾い上げることにより，問題解決力を育成する。LMS(Moodle)上で回答する課題も用意しているので，その回答が可能なデバイス(たとえばノートPC)が必要である。",
        "notices": "この科目の受講のために前もって履修が必要な科目は設定していないが，基本的な化学についての講義，および，基本的な化学実験を経験していることが望ましい。",
        "preparatoryStudy": "予習のための講義資料をMoodleに掲載しているので，事前に目を通しておくこと(予習60分)。また，授業のキーワードを復習するとともに，各回の授業内容の理解についての確認問題をMoodleから提出してください(復習180分)。",
        "gradingGuidelines": "60点を期末試験，40点を14回の講義中に回収する課題の評価とし，その合計で評価する。期末試験には合格最低点がある。また，小課題にも合格するための最低提出回数が設定されている(原則として毎回提出)。毎回の課題については，解答例や考え方を授業中に解説し，フィードバックをおこなう。",
        "textbook": "指定しない",
        "referenceMaterials": "松本淳著「はじめての大気環境化学」コロナ社(2015)D.J.ジェイコブ著「大気化学入門」東京大学出版会(2002)小倉義光著「一般気象学」東京大学出版会(2016)浦瀬太郎著「公害防止管理者[水質関係]完全合格教本(改訂3版)」新星出版社（2018）山﨑友紀著「地球環境学入門」講談社(2020)",
        "courseSchedule": "第1回:地球大気の組成と大気の垂直分布(秋元)第2回:大気の安定度と雲の形成(秋元)第3回:気圧と気象(秋元)第4回:地球規模での大気の循環と世界の気候(秋元)第5回:二酸化炭素の存在量と循環(秋元)第6回:太陽活動と地球の温度(秋元)第7回:温室効果と地球の放射(秋元)第8回:有機物の地球上での循環と反応，測定(浦瀬)第9回:栄養塩の地球上での循環と反応，測定(浦瀬)第10回:水の成層と水質現象(浦瀬)第11回:病原微生物と地球環境問題(浦瀬)第12回:難分解性化学物質の毒性評価，地球規模での挙動(浦瀬)第13回:水処理技術の基礎(物理処理，化学処理，生物処理)(浦瀬)第14回:上下水道などの環境管理施設(浦瀬)",
        "courseDataUpdatedAt": "2025/02/13"
    },
    "updateAt": "2025/03/21"
}