{
    "lectureCode": "B33701",
    "courseName": "公衆衛生学",
    "lecturer": [
        "浦瀬太郎(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "公衆衛生学は，保健，医療，福祉，食品などにかかわる様々な職業資格の学修要件とされている分野であり，ヒトの健康を(「個人の」健康ではなく)「集団の」健康の観点から学ぶ社会医学系の学問である。したがって，化学や生物だけではなく，環境や社会の分野を含み，さらに統計学を活用して包括的，学際的な学びが要求される。公衆衛生学においては，多要因から成る健康の成り立ちを理解し、健康的な生活の保持増進と疾病予防のために，広範な知識と技術および方法論を修得する。具体的には，（1）公衆衛生の成り立ち（2）健康・疾病・障害に関連した統計学(疫学)（3）感染症，食品，環境，生活習慣と健康の関連（4）社会の様々な場面(医療，学校，保健，産業)における健康への取り組みとそれを支援するさまざまな制度(医療保険，福祉サービス，国際協調)，などを学ぶ。",
        "outcomesMeasuredBy": "本講義では，さまざま人の健康にかかわる分野（食品製造，医療サービスの提供，健康の増進，環境保全など）で就業するための実学に基づく専門能力を身に付けることを目指す。さまざまな健康に関連する因子，社会医学，疫学について具体的事例を挙げて自分の意見を述べることができるための論理的な思考力を養成する。また，健康データにかかわる統計学を活用できる分析・評価能力を身に着けることを目標とする。母子保健・学校保健・高齢者保健・高齢者福祉・精神保健・地域保健・国際保健等の各論についての知識を用いて，さまざまな社会における問題に関する問題解決力を養う。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義形式で授業を行う。講義ではパワーポイントを用いる。ほぼ完全に教科書に準拠した授業なので，教科書の購入は必須である。授業では，ほとんどの回で授業中に1～3名で相談して答える課題を課す。この学生同士の考察課題の回答は紙で回収し，公衆衛生の幅広い問題について理解を深め，授業に参加し，公衆衛生の理解を深めることを狙う。それに加えて，毎回，授業内容の理解確認のための小テストを実施する。小テストはMoodleで出題するので，PCなどのデバイスを毎回持参することが必要である。14回の授業は浦瀬が原則すべて担当するが，14回のうち2回は食品の安全についての見識の深い今井客員教授，14回のうち1回は公衆衛生学を必須としている管理栄養士の有資格者である後藤助教，もそれぞれ授業に参画する。",
        "notices": "あらかじめ講義資料をダウンロードして講義に臨むことを推奨るする。印刷しておくかは個人の判断だが，電子的にでもいいので講義での気づきを書き込めることが望ましい。",
        "preparatoryStudy": "予習として，教科書の当該の章を熟読しておく(120分程度)。復習として，理解確認のための小テストにMoodleから回答し，復習欄に記載したキーワードが説明できるようにしておく(120分程度)。",
        "gradingGuidelines": "期末試験50％，1～3名で相談して答える考察課題および理解確認のための小テスト20％，授業中盤の回に実施する演習問題30％により評価する。毎回の1～3名で相談して答える考察課題および理解確認のための小テストの解説を翌週Moodleに掲載し，学生の回答例や回答分布，正答の考え方を翌週の授業でフィードバックする。授業中盤の回に実施する演習問題では次回または次々回に答案を返却し，返却時にフィードバックを実施する。",
        "textbook": "安達修一編，落合裕隆ら著，公衆衛生学―社会・環境と健康―(2023)，三共出版",
        "referenceMaterials": "用いない。",
        "courseSchedule": "第1回公衆衛生の概念・歴史(浦瀬)第2回環境と健康，さまざまな環境問題(浦瀬)第3回健康や疾病に関する統計と保健指標(浦瀬)第4回疫学研究の方法(その1,コホート研究,症例対照研究)(浦瀬)第5回疫学研究の方法(その2,スクリーニング検査,統計分布)(浦瀬)第6回感染症(浦瀬，今井客員教授)第7回食中毒(浦瀬，今井客員教授)第8回社会と健康，疫学，感染症，食中毒についての問題演習(浦瀬)第9回生活習慣と疾病(浦瀬，後藤)第10回主要疾患の疫学と予防(浦瀬)第11回精神保健(浦瀬)第12回母子保健，児童虐待(浦瀬)第13回学校保健，産業保健(浦瀬)第14回保健・医療・福祉の制度と国際協力(浦瀬)",
        "courseDataUpdatedAt": "2025/02/03"
    },
    "updateAt": "2025/03/21"
}