{
    "lectureCode": "C10203",
    "courseName": "微分積分I[AS3]CS",
    "lecturer": [
        "加用一者(教養学環)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "金3"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義棟Ａ２０３"
    ],
    "courceDetails": {
        "courseOverview": "微分積分学は関数を用いて我々の身のまわりに起こる諸現象を記述し，その様相を理解するための基礎的かつ重要な方法論であると言える．そのため，自然・社会科学，工学を含めた様々な領域で幅広く応用されている．本講義では微分積分学への初歩的な導入として，主に一変数関数の微分積分について解説を行う．具体的には，関数と極限，微分の定義，微分法の応用（関数の極大・極小，関数の近似など），積分の定義，置換積分や部分積分による積分の計算などについて扱う予定である．本講義を通して，論理的な思考力と問題解決力を身につけることを主な目標とする．加えて，工学への応用例に触れることで，実学に基づく専門能力や分析・評価の能力の基礎も養うこととする．また，数学の理工系分野における基礎的な言語としての役割について認識を深めることにより，コミュニケーション能力の習得も目指すこととする．",
        "outcomesMeasuredBy": "微分，積分の定義を理解し基本的な計算に習熟すること，それらの応用として近似計算や関数の値の変化等，関数の性質の解析手法について理解することを目標とする．講義全体を通して基礎事項の解説を理解し，問題演習を行うこと，その際，単なるパターンの当てはめによる答案作成では終わらず，言葉の定義をよく理解し，演繹するという作業に意識を向けることで，論理的な思考力，問題解決力，コミュニケーション能力の習得を目指す．また，講義中に提示される応用例を通して実学に基づく専門能力，分析・評価能力の基礎を養う．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "習熟度別のクラスに分けて講義を行う．尚，本講義ではクラスによってノートPCを出欠確認以外にも使用することがある．講義開始時のアナウンスに注意すること．",
        "notices": "履修するにあたって高校数学の内容を良く復習しておくこと．また，学期中は復習・予習を十分に行うこと．演習問題を解き，自ら力をつけること．",
        "preparatoryStudy": "各回の講義前には予定されているトピックについて，指定参考書や図書館の書籍などを読んで予習しておくこと．講義後は講義中に出された演習問題を解き，さらには講義内容について自力でまとめてみること．講義の内容を他者に説明できるようになることが望ましい．",
        "gradingGuidelines": "期末試験（約70％）のほか，レポート・小テスト・演習（約30％）を考慮して評価する．提出物や小テスト，学修状況について，講義中に適宜コメントや講評などの形でフィードバックを行う予定である．",
        "textbook": "石原繁，浅野重初「理工系入門微分積分」（裳華房）",
        "referenceMaterials": "神谷淳，生野壮一郎，仲田晋，宮崎佳典「理工系のための微分積分学」（近代科学社）",
        "courseSchedule": "第1回:関数の極限と連続性第2回:指数関数，対数関数の定義と基本的な性質第3回:三角関数，逆三角関数，双曲線関数の定義と基本的な性質第4回:導関数の定義と計算第5回:初等関数の微分法第6回:合成関数の微分法第7回:高階導関数の定義と計算第8回:不定形の極限値の計算第9回:テイラー展開，マクローリン展開第10回:関数の値の変化第11回:定積分の定義，区分求積法第12回:積分の性質，不定積分・原始関数，微分積分学の基本定理第13回:初等関数の不定積分第14回:置換積分法，部分積分法，定積分の計算と応用",
        "courseDataUpdatedAt": "2025/02/20"
    },
    "updateAt": "2025/03/21"
}