{
    "lectureCode": "C11502",
    "courseName": "先進情報専門演習・知能I[AI・2]",
    "lecturer": [
        "菊池眞之(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "人間同様の知的な情報処理を人工的に実現し，人間の生活を支える人工知能について考えるうえで，情報処理の規範となり，かつサポートする対象でもある人間の認知の仕組みや性質を知ることは重要である．本授業では人間の認知について実験的に調べる各種手法を，様々な演習を通して習得する．具体的には，物理的刺激に対する主観的な知覚を定量的に調べる心理物理実験における基本的な方法や，実験結果の解釈の為の統計処理の方法を，錯視パターンを見た際に生じる錯視量の測定などの具体的な実験を通して理解する．また，視線計測により得られたデータの分析などの方法や，感性評価を行うためのSD法，脳活動計測により得られた時系列データの分析などについても，グループワークでの取り組みを通して学ぶ．本授業を通し，実学に基づく専門能力，論理的な思考力，分析・評価能力，問題解決力などを養う．",
        "outcomesMeasuredBy": "ヒトの認知特性について調べる各種の実験方法を学び，将来実社会の中で実験の必要が生じた際に自ら実験計画立案・実施・解析ができるようになることを目指す(実学に基づく専門能力，論理的な思考力，分析・評価能力)．併せて，課題の遂行中に直面する問題に対する克服方法の模索を通し，問題解決力を養うことも目指す．",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業はグループワーク形式で実施する．ノートPCを使用するので持参すること．",
        "notices": "実験プログラムの構築・実行やデータ解析を各自のノートPCを使って行うため，PC内ストレージに余裕を持たせることが望ましい．",
        "preparatoryStudy": "毎回の授業の理解には，それまでの授業内容が予備知識として必要になる．毎回の授業で不明確な点があれば復習し理解に努めること．予習の必要がある場合は授業内で指示するが，スムーズな受講のために自主的に心理物理学，時系列解析，感性情報処理などについて学んでおくことが望まれる．",
        "gradingGuidelines": "課題への取り組みで得られた結果はMoodleを通して提出する．提出物に対してはMoodle上や後の授業時に口頭でコメントする．成績は提出物に基づいて評価する．実験のカテゴリーごとの点数の配分は，心理33.3%，視線・感性・モデル33.3%，脳活動33.3%とする予定である．",
        "textbook": "特に定めない．",
        "referenceMaterials": "入戸野宏，心理学のための事象関連電位ガイドブック，北大路書房(2005)東広志,中西正樹,田中聡久，脳波処理とブレイン・コンピュータ・インタフェース:計測・処理・実装・評価の基礎，コロナ社(2022)小野弓絵，MATLABで学ぶ生体信号処理，コロナ社(2018)大山正(監修)，村上郁也(編・著)，心理学研究法1感覚・知覚，誠信書房(2011)大山正ら，新編感覚・知覚心理学ハンドブックPart2，誠信書房(2007)",
        "courseSchedule": "第1回：心理①実験準備・サンプル実行・実験内容策定第2回：心理②実験実施第3回：心理③分析・発表準備第4回：心理④発表会第5回：脳活動①実験準備・サンプル実行・実験内容策定第6回：脳活動②実験実施第7回：脳活動③分析第8回：脳活動④発表準備第9回：脳活動⑤発表会第10回：視線・感性・モデル①実験準備・サンプル実行・実験内容策定第11回：視線・感性・モデル②実験実施第12回：視線・感性・モデル③分析第13回：視線・感性・モデル④発表準備第14回：視線・感性・モデル⑤発表会",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}