{
    "lectureCode": "C11602",
    "courseName": "社会情報専門演習I[SI・2]",
    "lecturer": [
        "瀬之口潤輔(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "研究棟Ａ４０２"
    ],
    "courceDetails": {
        "courseOverview": "本授業は、機械学習により予想・分類を行う際の代表的な手法について、基礎と理論を理解することが目的である。人工知能と機械学習の基礎的な知識を理解し、数学的な背景をよく理解し、論理的な思考力を養ったうえでコンピュータを使わずに手計算で人工知能・機械学習の中身の計算を行えるようにすることを目指す。また実際にコンピュータを使用してデータ解析を行う専門能力も身に付ける。伝統的な統計的手法から派生したもの、ベイズ統計から派生したもの、人工知能の仕組みを利用するものに分けて説明を行う。また実際のデータを用いてpythonにより機械学習モデルを作成し、データの解析や将来予想を行う分析・評価能力や問題解決力も身に付ける。",
        "outcomesMeasuredBy": "本授業の到達目標は以下のようになっている。・予想や分類に用いられる機械学習の様々な手法について、数式レベルで深く理解する（論理的な思考力）・pythonで人工知能と機械学習の使い方を理解する（実学に基づく専門能力）・伝統的な統計的手法によるデータ解析手法を習得する（実学に基づく専門能力）人工知能の仕組みを利用したデータ解析手法を習得する（分析・評価能力、問題解決力）",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "各回の授業はいずれも、講義と演習がセットになって構成されている。質問は随時行うので、積極的に教員と交流を図ること。授業は配布資料を中心に進める。演習は数式を解くことを中心に、教科書から離れた内容を扱うことがある。ノートPCは必携。単に知識を知るだけではなく、積極的に手を動かすことと。",
        "notices": "予習・復習を適宜行い、わからない箇所を残さないように心がけること。質問等も積極的に行うこと。特に復習に関しては、一つの授業でわからないと次の授業につながらないため、しっかりとわかるまで学習すること。",
        "preparatoryStudy": "知識等自分に足りない点が発覚した場合は、自主的・主体的に予習及び復習をすること。",
        "gradingGuidelines": "授業中に実施する課題・小テスト（30%）、期末試験の結果(50%)、授業態度(20%)を総合的に判断し成績評価を行う。試験の採点後にMoodleに成績と解答例を記載する。",
        "textbook": "向後千春、冨永敦子「統計学がわかる【回帰分析・因子分析編】（アイスクリームで味わう‟関係”の統計学）技術評論社、1,680円",
        "referenceMaterials": "第1回：分布とパラメータ第2回：分散・共分散と重相関第3回：線形回帰（最小2乗法）第4回：線形回帰（重回帰・偏回帰）第5回：線形回帰（決定係数、t値、p値）第6回：モデルの学習法（最尤法）第7回：モデルの学習法（最急降下法）第8回：過学習と変数選択（ステップワイズ法）第9回：過学習と変数選択（主成分分析）第10回：ロジスティック回帰分析第11回：ニューラルネットワーク第12回：ディープラーニングとその応用第13回：決定木とブースティング第14回：まとめ",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/29"
    },
    "updateAt": "2024\/09\/13"
}