{
    "lectureCode": "C20301",
    "courseName": "離散数学",
    "lecturer": [
        "亀井聡(教養学環)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義棟Ｄ３０１"
    ],
    "courceDetails": {
        "courseOverview": "離散数学という言葉は文字通り離散的な対象を扱う数学分野を意味する．世の中にあるシステムの多くは離散的なモデルを用いて表現することができる．社会の基盤となるシステムのほとんどにコンピュータが用いられている現在，離散数学で展開される内容は情報系の研究者・技術者にとって必要不可欠なものと言える．情報系分野において離散数学が用いられる事例を具体的に挙げてみると，論理回路設計，データ構造とアルゴリズムの解析，データの暗号化と符号化，グラフィックスや音声などのデータ処理，ネットワークの設計と構築，物流システム等の解析と最適化，自然・社会現象のシミュレーションなど枚挙に暇がない．そして，それら全てにおいて離散数学は中心的な役割を果たしていると言っても過言ではない．以上のことから分かるように離散数学自体は極めて幅広い内容を含んでおり，その全てを一学期間で見通すことは不可能である．そこで本講義では，集合，命題と論理，関係，グラフ等の基本的な概念の定義と性質に内容を絞って解説を行う．本講義を通して，論理的な思考力と問題解決力を身につけることを主な目標とする．加えて，工学への応用例に触れることにより，実学に基づく専門能力や分析・評価の能力の基礎も養うこととする．また，数学の理工系分野における基礎的な言語としての役割について認識を深めることにより，コミュニケーション能力の習得も目指すこととする．",
        "outcomesMeasuredBy": "基本的な概念の定義，性質を理解すること，それらを工学の具体的な問題に応用する能力を身に付けることが目標である．講義全体を通して基礎事項の解説を理解し，問題演習を行うこと，その際，単なるパターンの当てはめによる答案作成では終わらず，言葉の定義をよく理解し，演繹する作業に意識を向けることで，論理的な思考力，問題解決力，コミュニケーション能力の習得を目指す．また，講義中に提示される応用例を通して実学に基づく専門能力，分析・評価能力の基礎を養う．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "基本事項の解説の後に適宜演習を行うが，自らも問題の演習を積極的に行って補うことが望ましい．尚，本講義では出欠確認，アンケート提出以外ではノートPCは使用しない．",
        "notices": "講義を履修するにあたって，集合と場合の数，確率，命題と論理，数列について，高校数学で学んだ内容をよく復習しておくこと．また，アルゴリズムとデータ構造，論理回路などの情報系科目における抽象的なモデルの記述に慣れておくこと．学期期間中は復習・予習を十分に行うこと．また講義では抽象的な定義と具体例との対応についてよく考えることが大事である．",
        "preparatoryStudy": "各回の講義前には予定されているトピックについて，指定参考書や図書館の書籍などを読んで予習しておくこと．講義後は講義中に出された演習問題を解き，さらには講義内容について自力でまとめてみること．講義の内容を他者に説明できるようになることが望ましい．",
        "gradingGuidelines": "期末試験を中心（約70％）に小テスト・レポート・演習など（約30％）を考慮して評価する．提出物や小テスト，学修状況について，講義中に適宜コメントや講評などの形でフィードバックを行う予定である．",
        "textbook": "特に指定しない．",
        "referenceMaterials": "安藤清・土屋守正・松井泰子著「例題で学ぶグラフ理論」（森北出版）守屋悦朗著「離散数学入門」（サイエンス社）SeymourLipschutz著「マグロウヒル大学演習離散数学」（オーム社）",
        "courseSchedule": "第1回:集合と演算第2回:命題と論理第3回:関係と写像1:二項関係，同値関係，順序関係第4回:関係と写像2:関係の図を用いた表現、写像の定義と例第5回:グラフ1:グラフの定義と例第6回:グラフ2:離散モデルのグラフによる表現，隣接行列，接続行列第7回:グラフ3:歩道，小道，道の定義第8回:グラフ4:歩道，小道，道に関する問題とそれらの応用第9回:グラフ5:グラフの性質と様々な問題の計算量第10回:グラフ6:木と森の性質と応用第11回:グラフ7:グラフの平面および曲面への埋め込み第12回:グラフ8:グラフの彩色とその応用第13回:グラフ9:彩色多項式第14回:グラフ10:確率行列とランダムウォーク（酔歩）",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}