{
    "lectureCode": "C20601",
    "courseName": "ベンチャービジネス",
    "lecturer": [
        "赤津慎二(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義棟Ｄ３０１"
    ],
    "courceDetails": {
        "courseOverview": "社会課題の解決など新たな価値創造を狙う組織では、不確実性が高いビジネス環境での従来の枠を超えた取組みが求められ、オープンイノベーションにより企業がダイナミックに連携することによって、今まで存在しなかった新しいビジネスモデルが創出されている。このような状況下で求められるのは、新しいビジネスを作り出し、それを仮説検証によって育てていく起業家的なリーダーである。この科目は、教員が総合電機メーカーの研究所および日米の事業部門において新規ビジネス立ち上げに従事した実務経験に基づき、大学で学ぶ基礎的な技術や知識が実際の事業創造にどのように利用されているかについて解説する実践的科目である。講義では、新規ビジネス事業創出のメソドロジー（手法とプロセス）を取得し、具体的なビジネスの機会を見つけ出し、具現化するためのビジネスモデルを作る。この授業では前半で理論や事例分析を通して「実学に基づく専門能力」として企業における新規ビジネス創出プロセスを身につけ、後半では企業間の取引や企業としてのビジネス創出に関する意見交換を通して「コミュニケーション能力」を高めることを目的とする。",
        "outcomesMeasuredBy": "1)事業創出プロセスおよびビジネスモデルの分析を通して、事業創出のメソドロジーを応用できるようになる（実学に基づく専門能力）2)議論によるビジネスモデルの検討を通して、事業創出プロセスを具体的に理解する（コミュニケーション能力）",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力",
        "teachingMethod": "教材を基にした講義と、設定したテーマに沿ったアサインメントを元にした議論を行う（アクティブラーニング）。授業では前回理解度確認のミニテストを行う。また、個人でのレポート作成を行う。なお、ノートPC或いはタブレットPCを準備し、毎回の授業へ持参のこと。（PCは、Moodleでのミニテスト回答、およびアサインメントやレポートの作成に用いる。）",
        "notices": "1年次の価値創造演習で学んだ内容を前提とする。",
        "preparatoryStudy": "教材を予習・復習に活用する。アサインメント作成のため、毎回の資料調査などが必要。",
        "gradingGuidelines": "ミニテストとアサインメントによる理解度評価（40％）、レポートによる理解度評価（2回、合計50％）、発表によるメソドロジーの体得評価（10％）。各項目の評価内容はルーブリックに提示する。ルーブリックはMoodleに掲載する。なお、評価に関わるフィードバックはMoodleを経由して提供する。",
        "textbook": "指定教科書無し。教材はMoodleで配布する。",
        "referenceMaterials": "「ビジネス・クリエーション！」、ビル・オーレット（ダイヤモンド社）2014年「図解カール教授と学ぶ成功企業３１社のビジネスモデル超入門！」（Discover）2012年「ゼロからつくるビジネスモデル:新しい価値を生み出す技術」、井上達彦、（東洋経済新報社）2019年「VentureDeals:BeSmarterThanYourLawyerandVentureCapitalist」、BradFeld,JasonMendelson、（Wiley）、2019年",
        "courseSchedule": "第1回：イノベーションとは何か第2回：イノベーションのプロセスと起業第3回：イノベーションのパターン第4回：企業の競争力への影響第5回：研究・技術開発のマネジメント第6回：製品アーキテクチャのマネジメント第7回：新製品開発のマネジメント第8回：市場の戦略的ポジションと市場分析第9回：エレベータピッチとバリュープロポジション第10回：ビジネスモデルのマネジメント第11回：企業間関係のマネジメント第12回：組織マネジメントとリーダシップ第13回：企業事例分析第14回：まとめ",
        "courseDataUpdatedAt": "2024\/02\/07"
    },
    "updateAt": "2024\/09\/13"
}