{
    "lectureCode": "C20601",
    "courseName": "情報理論",
    "lecturer": [
        "大石邦夫(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ４０３"
    ],
    "courceDetails": {
        "courseOverview": "情報源、情報源符号化、通信路、誤り訂正符号などの符号理論について学ぶ。具体的には、情報源をモデル化すると、情報を圧縮できることを学ぶ。次いで、通信路をモデル化して、情報の伝送誤りを検出・訂正できることについて学習する。この授業では主に論理的な思考能力、問題解決力と分析・評価能力を身につけることを目的としている。さらに、実学に基づく専門能力を増やすことを目指している。",
        "outcomesMeasuredBy": "本授業の到達目標1)情報源符号化と通信路符号化およびエントロピーの概念が説明できる。（論理的な思考能力）2)ハフマン符号が構成でき、データ圧縮技術の基礎に活用できる。（実学に基づく専門能力）3)パリティ検査符号、巡回ハミング符号を理解し、誤り検出・誤り訂正が行える。（分析・評価能力、問題解決力）",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "原則として配布資料に沿って授業を進める。複雑な図面、難解な内容については、学生ポータルから補足資料を配布する。毎回、講義中にMoodle上で小テストを実施するので、ノートPCは必携とする。尚、論理的思考力の育成のため、授業及び課題取り組みにおいてサンプルコードの参照やAIによるコードの生成を一切認めないことがある。",
        "notices": "データと統計を履修していると、理解が容易になる。",
        "preparatoryStudy": "予習として、次回講義資料と教科書を熟読して、指示に従い例題を解法してみること（各授業回ごとに150～200分）。復習として、講義の小テストをもう一度自ら解答した後、正解を用いて答え合わせを行い、間違いがあれば訂正すること。また、講義時に示した理論や知見を用いて教科書章末問題を解答し、理解を深めること（各授業回ごとに150～200分）。",
        "gradingGuidelines": "小テスト(20%)、期末試験(80%)によって総合的に成績を評価する。小テスト、期末試験、課題等の実施後にMoodleに正解、受験結果、解答例を掲載するとともに、小テストについては次回の講義冒頭で解説する。",
        "textbook": "久保田一，大石邦夫，福本昌弘「C言語による情報理論入門」（コロナ社）",
        "referenceMaterials": "必要に応じて、教科書の参考文献を参照することが望ましい。",
        "courseSchedule": "第1回:情報源モデル：情報の価値と定量化、確率、自己情報量第2回:情報源モデル：ベイズの定理、確率、条件付き確率、結合確率第3回:情報源モデル：無記憶情報源、マルコフ情報源、エルゴード性マルコフ情報源第4回:情報源モデル：状態遷移図、遷移確率行列、定常確率第5回:情報源モデル：結合エントロピー、条件付きエントロピー、相互エントロピー第6回:情報源符号化：平均符号長、一意復号可能性、瞬時符号第7回:情報源符号化：符号の木、拡大情報源とシャノンの第１基本定理、符号の効率第8回:情報源符号化：ハフマン符号と性能評価、算術符号、ランレングス符号化第9回:通信路と通信路容量：通信路の確率モデル、通信路行列、2元対称通信路、2元消失通信路第10回:通信路と通信路容量：伝送情報量と通信路容量、シャノンの第2基本定理第11回:誤り訂正符号：シャノンの通信路モデル、組織符号、ハミング距離、加法性2元通信路モデルと誤り空間第12回:誤り訂正符号：誤り訂正符号、誤り検出符号、誤り訂正・検出符号第13回:誤り訂正符号：ハミング符号、シンドロームと誤り検出・訂正方法、共通鍵暗号（秘密鍵暗号）と公開鍵暗号、第14回:暗号：シャノンの暗号系モデル、原始多項式、M系列、RSA暗号（秘密鍵暗号）とディジタル署名",
        "courseDataUpdatedAt": "2025/01/31"
    },
    "updateAt": "2025/03/21"
}