{
    "lectureCode": "C21602",
    "courseName": "情報セキュリティ[後期]",
    "lecturer": [
        "宇田隆哉(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ３０３"
    ],
    "courceDetails": {
        "courseOverview": "本講義は情報セキュリティについての理解を深めることを目的とする。ネットワークを介した不正攻撃、コンピュータウイルスの仕組みや対策、ファイアウォールの原理などのネットワークセキュリティ、共通鍵暗号、公開鍵暗号、ハッシュなどの暗号技術、暗号理論を応用した認証技術、電子透かし技術、匿名化通信、IoTセキュリティについての解説を行う。この授業では主に論理的な思考力を身につけることを目的としている。さらに、実学に基づく専門能力を鍛えることを目指している。",
        "outcomesMeasuredBy": "公開鍵暗号の仕組みについて理解する。（実学に基づく専門能力、論理的な思考力）共通鍵暗号の仕組みについて理解する。（実学に基づく専門能力、論理的な思考力）ネットワークのフィルタリングについて理解する。（実学に基づく専門能力、論理的な思考力）情報セキュリティに関する知識を深める。（実学に基づく専門能力）これらの仕組みや専門知識は、論理的な構造を伴うものであり、目標に到達する過程で、実学に基づく専門能力、論理的な思考力を養う。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "ノートPCの使用と学内ネットワークへの接続を前提に、講義形式で授業を行う。全受講者はノートPC必携とする。",
        "notices": "全受講者はノートPC必携とする。受講者は全員、本講義の開始日までに学内ネットワークに接続可能な環境を整えておくこと。コンピュータ概論I、コンピュータ概論IIを修得していることが履修の前提となる。予習・復習を十分に行うこと。提出方法を守らないレポート、および、やむを得ない事情無く期日に遅れて提出されたレポートは受理しない。",
        "preparatoryStudy": "コンピュータ概論I、コンピュータ概論II、情報リテラシーの内容を理解していることを前提に講義を行うので、これらの科目の単位取得有無にかかわらず、本講義の開始日までにその内容を理解していること。予習として、次の回の授業に必要な前提知識を、コンピュータ概論I、コンピュータ概論II、情報リテラシーの教科書を使って再確認する。復習として、その回の授業におけるMoodleの小テストで不正解となった項目について、講義資料と照らし合わせて確認する。",
        "gradingGuidelines": "数回の課題レポートおよび期末試験により成績評価を行う。期末試験結果とレポートは、100対27の比率で総合成績に反映する。Moodle小テストの得点はこれに期末試験の最大15%の割合で加算される。レポートおよび小テストのフィードバックはMoodleにて行う。",
        "textbook": "宮地充子、菊池浩明編著、「ITText情報セキュリティ改訂2版」、オーム社（2022年）",
        "referenceMaterials": "情報セキュリティ標準テキスト編集委員会編、「情報セキュリティ標準テキスト」、オーム社（2006年）佐々木良一、吉浦裕、手塚悟、三島久典共著、「インターネット時代の情報セキュリティ・暗号と電子透かし」、共立出版（2000年）岡田仁志著、「決定版ビットコイン＆ブロックチェーン」、東洋経済新報社（2018年）松井俊浩著、「IoTセキュリティ技術入門」、日刊工業新聞社（2020年）",
        "courseSchedule": "第1回：情報セキュリティの目的、技術的対策方法について概要を学ぶ第2回：不正攻撃に対するコンピュータの脆弱性、攻撃手法と対策について学ぶ第3回：代表的コンピュータウイルスの種類と機能、対策について学ぶ第4回：ファイアウォールの仕組み、NAT、DMZについて学ぶ第5回：共通鍵暗号、ハッシュの技術について学ぶ第6回：公開鍵暗号の技術について学ぶ第7回：電子署名、タイムスタンプなどの認証技術について学ぶ第8回：認証技術を応用したSSL、S\/MIME、PGP、VPN、WEPの仕組みについて学ぶ第9回：PKIの基礎について学ぶ第10回：電子透かしについて学ぶ第11回：ブロックチェーン技術について学ぶ第12回：バイオメトリクスについて学ぶ第13回：IoTセキュリティについて学ぶ第14回：総復習を行う",
        "courseDataUpdatedAt": "2024\/02\/29"
    },
    "updateAt": "2024\/09\/13"
}