{
    "lectureCode": "C22102",
    "courseName": "オペレーティングシステム[後期]",
    "lecturer": [
        "塩野康徳(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ４０３"
    ],
    "courceDetails": {
        "courseOverview": "本講義では、オペレーティングシステムの基本的概念と機構、それらの関係が理解できるようにすることを目的とする。オペレーティングシステムの本質は、容易にプログラムを開発できるようにするため、ソフトウェアの下地を整え、開発されたプログラムを動かせるようにハードウェアの状態を維持し、入出力データも含め、複数のプログラムが効率よく動作できるように全体の調整と管理を行うことである。また、インターネットの普及に伴い、ネットワーク管理も重要な要素となっており、セキュリティや仮想化技術も重要視されるようになってきた。オペレーティングシステムでは、資源の仮想化とスケジューリング機能が実現されており、コンピュータシステムの中核であるということができる。また、オペレーティングシステムの機能を実現するために用いられている技術は、他のプログラムにも適用可能な、重要な基本概念から構築されており、コンピュータサイエンスを学ぶ上で不可欠の知識である。講義では、どのオペレーティングシステムでも共通するコアとなる部分についての理解を深めていく。オペレーティングシステムが管理する資源をユーザプログラムから利用するには、オペレーティングシステムが提供するシステムコールと呼ばれるインタフェースを用いる。実際にオペレーティングシステムがおこなっていることを理解するためには、システムコールをはじめとした具体的な機能や機構を把握することも有用であるので、必要に応じて事例を用いた説明も行う。オペレーティングシステムは複雑なソフトウェアであり、実用的なシステムである。複雑さを克服するために抽象化、構造化、仮想化が行われており、厳密解を求めるのではなく、現実的な効果が得られるようにトレードオフが考慮されている。このような考え方がオペレーティングシステムにどのように繰り返し適用されているかを学ぶことは、アプリケーションの利用やプログラミングをはじめとした情報技術の活用や研究の基礎的な知識と能力を養うことになり、実学に基づく専門能力と論理的な思考力を磨くことができる。",
        "outcomesMeasuredBy": "・オペレーティングシステムの基本的な概念と機構およびそれらの関係を説明でき、議論することができる。（実学に基づく専門能力）・オペレーティングシステムの機能を実現するために用いられている技術の考え方を理解し、応用する力を身に付け、現実的な効果について議論することができる。（論理的な思考力）",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "教科書に従い、講義を中心に授業を行う。理解度を確認し、深めるため、レポートや演習問題などを必要に応じて行う。資料の閲覧や演習のためノートPCを必携とする。",
        "notices": "コンピュータの構成やプログラミングに関する基礎的な知識があることが望ましい。",
        "preparatoryStudy": "授業の進行状況及びシラバスに従い、問題関心や着目点を中心に予習を行うことが望ましく、授業前に教科書の単語をチェックし、わからない単語はどれか把握して、授業の中での理解と整理がしやすくなるように備えること。復習として、授業で学んだ内容を自分なりに理解し、次回の授業や試験などに備え、課題がある場合は必ず取り組むこと。",
        "gradingGuidelines": "期末試験（70%）及びレポート、演習問題（30%）に基づき評価を行う。学修内容の定着のため、レポートや演習問題について、授業時間内またはMoodleでフィードバックを行う。",
        "textbook": "大澤範高著、\"オペレーティングシステム\"、コロナ社",
        "referenceMaterials": "指定しない",
        "courseSchedule": "第1回:オペレーティングシステムとは第2回:オペレーティングシステムの基礎第3回:実行管理とスケジューリング第4回:同期と通信第5回:デバイス管理第6回:記憶領域管理第7回:仮想記憶第8回:ファイルシステム第9回:ネットワークの管理第10回:並列分散処理第11回:ユーザインタフェース、保護とセキュリティ第12回:構成法と事例第13回:歴史と展望第14回:まとめ",
        "courseDataUpdatedAt": "2024\/02\/29"
    },
    "updateAt": "2024\/09\/13"
}