{
    "lectureCode": "C22704",
    "courseName": "プロジェクト演習II[テーマD・C]CS",
    "lecturer": [
        "伏見卓恭(コンピュータサイエンス学部コンピュータサイエンス学科)",
        "竹田昌弘(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "＜テーマD＞・Pythonによるゲーム開発プログラミングを通じて，1年次に学習したPythonの基礎知識をさらに深めるとともに，実際に動くプログラムの実装を体験してもらうことを目的とする（実学に基づく専門能力）．・読みやすい，かつ，効率的なコードを書くにはどうすれば良いかという論理的な思考も養う（論理的な思考力，分析・評価能力，問題解決力）．・プログラムの設計と実装，成果物の発表やコードレビューをグループで実施する．これにより，技術的知識だけでなく，コミュニケーションの重要さを体験することも重視する（コミュニケーション能力）．＜テーマC＞主に「ビジネスデータ」の活用を学修する。私たちをとりまく生活環境やビジネスにおける多様な問題を改善してゆくには、正確なデータに基づいた正しい判断が必要であり、本授業ではそのための基礎技術を習得することを目的とする。主観的な情報が、データ処理を施すことにより客観的に整理され、説得力・訴求力を高めて表現されることを学修する。金融・流通などビジネスに関する実験を中心とし、ICTの知識および技能とビジネス知識を合わせ持つ即戦力型の学生を養成することを主眼に、ビジネス・データ分析とWebサイトとインターネットを活用した金融・流通業務の効率化に関する実験を行う。「ビジネスゲーム」や「ビジネスモデル」の構築を通じて、企業活動におけるビジネスデータの分析および意思決定やマネジメントについて、重点的に学ぶ。実務経験のある教員が担当することで、実際のビジネス現場に即したデータの扱い方を学修する。したがって、本授業では「実学に基づく専門能力」「コミュニケーション能力」「論理的な思考力」「分析・評価能力」「問題解決力」を総合的に学修する。",
        "outcomesMeasuredBy": "＜テーマD＞・コードをわかりやすく書くことができる（論理的な思考力，実学に基づく専門能力）・他者のコードと自分のコードを比較し，より良いコードに修正することができる（分析・評価能力）・うまく動作した時と動作しなかった時のコードの差分を分析し，原因を突き止めることができる（問題解決力）・自らが作成したプログラムの動作を説明することができる（コミュニケーション能力）・他者へ意見をしたり，他者からの意見を受け入れることができる（コミュニケーション能力）＜テーマC＞本授業では以下を身につけることを目標とする。(1)ビジネスシーンにおける多様な問題を改善するための統計的基礎知識を身につける（実学に基づく専門能力）(2)データに基づいたロジカルなプレゼンテーションができるようになる（論理的な思考力）(3)ビジネスゲームやビジネスモデルの構築を通じ、企業活動における意思決定の基礎を身につける（分析・評価能力、問題解決力）(4)グループワークを通して、コミュニケーション能力を養う（コミュニケーション能力）",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "＜テーマD＞・1コマ目：配布される資料を基にゲームの基本機能を実装する・2コマ目：各自で追加機能を実装する・3コマ目：グループワークで各人のコードをレビューする・各回授業終了時に，その日に実装したレビュー前のプログラム，レビュー後のプログラム，レビュー内容をまとめたレポートを提出する．＜テーマC＞第1回目のガイダンスに全体説明および、ロジカル・プレゼンテーションに関する基本的な演習を行う。第2回目以降は「ビジネスゲーム」と「ビジネスモデル」の2つのグループに分かれて、3回ごとに完結するテーマにグループワークで取り組む。安全面と教育上の観点から、学生実験は特に時間に正確で順を追った進行を意識する。各自のノートPCを基本ツールとする。各週の初めに実験概要と進め方の説明を行い、個人もしくはグループで課題に取り組んでいく。実験講師が一人一人の達成度および理解度を適宜確認していく。各授業の終了前に、決められた課題やレポートを提出し、講師が内容を確認した上でそれらを受領する。",
        "notices": "＜テーマC、D共通＞ノートPCを必ず持参すること。グループワーク形式で実験を進める際に、同じグループ内の人に迷惑をかけないようにすること。特に、遅刻は厳禁である。また、時間内にメニューをこなせるよう、集中して学習すること。安全面やマナーに関しても注意をはらい、効率的な学習を意識してほしい。評価には、課題やレポートが大きく関わるため、しっかり内容を復習して、提出物を作成すること。",
        "preparatoryStudy": "＜テーマD＞・1年次に学習したPythonの基礎（制御構文，関数，クラス，例外処理など）を復習しておくこと．・テーマDの各回の内容は，それまでに学習した内容を理解していることを前提としている．したがって，次回の講義までに前週の内容を復習することが必須である．・不明な点の質問は担当教員のオフィスアワーで対応する．・Moodleには講義資料を事前に公開するので，資料内容をもとに予習してから講義に臨むこと．＜テーマC＞配布される各実験のテキストやMoodleにあがっている資料をよく予習すること。予習により、技術や知識の習得を効率的に行える。また、本実験に関連するアンケート調査、ビジネスなどの諸分野に関するニュースにも注意をはらい、本実験と照らし合わせて実験の意義を確認してほしい。",
        "gradingGuidelines": "テーマC（50%）とテーマD（50%）を合計して成績を決定する。各テーマにおける内訳は以下の通りである。＜テーマD＞・第1回～第5回の提出物（15×5=75%），第6回の共同開発成果物（15%），第7回の成果発表（10%）・提出物のフィードバックはMoodleを経由して提供する．＜テーマC＞「ビジネスゲーム」「ビジネスモデル」のテーマごとに課せられたレポートをベースに評価を行い、配点は均等とする。また、プレゼンが課せられるテーマについては、プレゼン（20%）とレポート（80%）で総合的に評価を行う。１つのテーマだけでも、レポートが未提出の場合は、単位を取得できないので注意する。評価に関わるレポートのフィードバックはMoodleを経由して提供する。",
        "textbook": "＜テーマC、D共通＞それぞれの実験で使用する専用のテキストやpdfが配布される。",
        "referenceMaterials": "＜テーマD＞廣瀬豪「Pythonでつくるゲーム開発入門講座」ソーテック社廣瀬豪「Pythonでつくるゲーム開発入門講座実践編」ソーテック社＜テーマC＞井上勝雄「エクセルによる調査分析入門」海文堂高田直芳「新・ほんとうにわかる経営分析」ダイヤモンド社井上達彦「ゼロからつくるビジネスモデル:新しい価値を生み出す技術」東洋経済新報社",
        "courseSchedule": "＜テーマD＞第1回:実験環境の構築／Pygameの基礎／Gitの基礎第2回:Pygameによるゲーム開発の基礎／コード規約とコードレビュー第3回:オブジェクト指向によるゲーム開発／GitHubの応用第4回:Pygameによるゲーム開発の応用／共同開発の基礎第5回:共同開発演習（個別実装）第6回:共同開発演習（共同実装）第7回:共同開発演習（成果発表）＜テーマC＞第8回:全体説明（ガイダンス）／ロジカル・プレゼンテーションの基礎演習／ビジネス数値の基礎第9回:ビジネスゲームの基礎、企業における意思決定／ビジネスモデルの基本理解第10回:流通業におけるビジネスゲームの習得／BtoB(B2B)取引におけるデータ収集・分析第11回:流通業におけるビジネスゲームの応用／取引サイト構築による流通の効率化実験第12回:ビジネスゲームのデータ分析と改善評価／BtoC(B2C)取引におけるデータ収集・分析第13回:ビジネスゲームの条件変更による影響分析／収益モデル分析と損益分岐点データ評価第14回:プレゼン発表",
        "courseDataUpdatedAt": "2024\/02\/07"
    },
    "updateAt": "2024\/09\/13"
}