{
    "lectureCode": "C22803",
    "courseName": "先進情報専門演習I[IT・3]",
    "lecturer": [
        "大石邦夫(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "研究棟Ａ３０２"
    ],
    "courceDetails": {
        "courseOverview": "アナログ信号をディジタル技術によって処理するディジタル信号処理について学ぶ。具体的には、標本化定理と量子化操作によってアナログ信号をディジタル的に表現できることを学ぶ。次いで、ディジタル信号の解析方法としてz変換とラプラス変換の関係、離散フーリエ変換、高速フーリエ変換を学び、これを用いてディジタルフィルタのインパルス応答と伝達関数の関係、周波数特性について理解することを目標とする。この授業では主に論理的な思考力，問題解決力と分析・評価能力を身につけることを目的としている。さらに，実学に基づく専門能力を増やすことを目指している。",
        "outcomesMeasuredBy": "1)アナログ信号をディジタル信号に変換について理解する。2)z変換によってシステムの安定性、周波数特性を評価できるようになる。（論理的な思考力、問題解決力）3)ディジタル信号を周波数解析ができるようになる。（問題解決力）",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "原則として配布資料に沿って授業を進める。複雑な図面、難解な内容については、学生ポータルから補足資料を配布する。毎回、講義中にMoodle上で小テストを実施するので、ノートPCは必携とする。",
        "notices": "信号処理に関するプログラミングを授業では扱わないが、毎回、自宅で授業内容に基づきプログラミングを学習すると、信号処理の仕組みが深く理解できる。",
        "preparatoryStudy": "フーリエ解析を理解していると、理解が容易になる。予習として、次回講義資料と教科書を熟読して、指示に従い例題を解法してみること。復習として、講義の小テストをもう一度自ら解答した後、正解を用いて答え合わせを行い、間違いがあれば訂正すること。また、講義時に示した理論や知見を用いて教科書章末問題を解答し、理解を深めること。",
        "gradingGuidelines": "小テスト(20%)、期末試験(80%)によって総合的に成績を評価する。小テスト、期末試験、課題等の実施後にMoodleに正解、受験結果、解答例を掲載するとともに、小テストについては次回の講義冒頭で解説する。",
        "textbook": "大石邦夫、”C言語によるはじめて学ぶ信号処理”、コロナ社",
        "referenceMaterials": "必要に応じて、教科書の参考文献を参照することが望ましい。",
        "courseSchedule": "第1回:AD変換の概要、標本化周波数、ナイキスト周波数、標本化とエイリアシング第2回:アンチエイリアシングフィルタ、標本化定理、固定小数点表示、浮動小数点表示第3回:量子化と逆量子化、量子化誤差、平均符号長、一意復号可能性、瞬時符号第4回:符号の木、拡大情報源とシャノンの第１基本定理、符号の効率第5回:ハフマン符号と性能評価、算術符号、ランレングス符号化、単位インパルス関数と単位ステップ関数、差分方程式第6回:IIRフィルタとインパルス応答、ステップ応答第7回:単位インパルス関数と単位ステップ関数、差分方程式、IIRフィルタとインパルス応答、ステップ応答第8回:IIRフィルタの安定性、畳み込み演算、FIRフィルタとインパルス応答、ステップ応答第9回:z変換と諸性質、逆z変換、フィルタの伝達関数とインパルス応答の関係第10回:極とIIRフィルタの安定判別第11回:離散フーリエ変換(DFT)と高速フーリエ変換(FFT)第12回:共通鍵暗号（秘密鍵暗号）と公開鍵暗号、シャノンの暗号系モデル、原始多項式、M系列第13回:RSA暗号（秘密鍵暗号）とディジタル署名、第10回:誤り訂正符号：シャノンの通信路モデル、組織符号、ハミング距離第14回:全体まとめ",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}