{
    "lectureCode": "C30101",
    "courseName": "先進情報プロジェクト実習I[IT・1]",
    "lecturer": [
        "宇田隆哉(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "本実習は、Webセキュリティについて実践を通して体験し、理解を深めることを目的とする。主として、システムの設定における問題点と攻撃、ブルート・フォース・アタック、インジェクション攻撃、クロス・サイト・スクリプティング攻撃を扱う。受講者はLinuxOS上にWebサーバを自力で構築し、Webシステムを稼働させる。その上で、Webシステムに存在する具体的な問題について学び、問題を再現することで攻撃方法と対処方法を体得する。本実習では、実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力、問題解決力の鍛錬を目指している。なお、授業内容が倫理的な事項も含むため、技術の利用における倫理についても学ぶ。",
        "outcomesMeasuredBy": "グループメンバーと協力し、Webサーバを自力で構築する。（実学に基づく専門能力、コミュニケーション能力、論理的な思考力、問題解決力）グループメンバーと協力し、Webシステムを稼働させる。（実学に基づく専門能力、コミュニケーション能力、論理的な思考力、問題解決力）Webシステムにおけるセキュリティ上の問題点について、システムを動かして理解する。（実学に基づく専門能力、論理的な思考力、分析・評価能力、問題解決力）ブルート・フォース・アタックについて理解し実践する。（実学に基づく専門能力、論理的な思考力、分析・評価能力、問題解決力）グループメンバーと協力し、ブルート・フォース・アタックを応用する。（実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力、問題解決力）インジェクション攻撃について理解し実践する。（実学に基づく専門能力、論理的な思考力、分析・評価能力、問題解決力）グループメンバーと協力し、インジェクション攻撃を応用する。（実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力、問題解決力）クロス・サイト・スクリプティング攻撃について理解し実践する。（実学に基づく専門能力、論理的な思考力、分析・評価能力、問題解決力）グループメンバーと協力し、クロス・サイト・スクリプティング攻撃を応用する。（実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力、問題解決力）これらの仕組みや専門知識は、論理的な構造を伴うものであり、目標に到達する過程で、実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力、問題解決力を養う。さらに、社会的な倫理についても理解する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ノートPCの使用と、教室から学内および学外ネットワークへの接続を前提に、グループワークの実習形式で授業を行う。受講者はノートPC必携であり、仮想的にLinuxを実行できる環境を構築できるだけの空き容量を、SSDまたはHDDに確保している必要がある。実習においては、教員の説明に従って実践を行う回と、それまでに得た知識を用いてアクティブラーニングとして自由に実装を行う回がある。自由に実装を行う回においては正解はなく、攻撃が成功しない方法を選択している可能性もある。",
        "notices": "ノートPCはWindows環境で動作すること。Windows環境以外は自己責任とし、教員およびTAはこれをサポートしない。Windows環境の上で、仮想的にLinuxを実行可能な性能を持つノートPCを持参する必要がある。例えば、WindowsOSが仮想的に実行されている場合には、Windowsの上で仮想的にLinuxが実行可能であること。提出方法を守らないレポート、および、やむを得ない事情無く期日に遅れて提出されたレポートは受理しない。各回の実習では、それまでの回の知識や設定を利用するため、やむを得ず欠席した場合には、欠席した回の復習を次の回の実習までに行わないと、次の回の実習が行えない。",
        "preparatoryStudy": "コンピュータ概論I、コンピュータ概論IIの内容を理解していることを前提に実習を行うので、これらの科目の単位取得有無にかかわらず、本実習の開始日までにその内容を理解していること。プログラミング基礎I、プログラミング基礎IIを修得していることを前提に実習を行うので、本実習の開始日までに当該科目で問われた内容にすべて答えられるように復習しておくこと。情報リテラシー演習のLinux操作を修得していることを前提に実習を行うので、本実習の開始日までに当該科目で問われた内容にすべて答えられるように復習しておくこと。予習として、次の回の授業に必要な内容を事前に公開するので、資料を確認して知識を身につけておくこと。例えば、HTMLやJavaScriptなどがこれに該当する。復習として、その回の授業内容で、グループメンバーやTAの助けが必要だった項目において、何ができなかったのかを再確認し、解決方法を理解する。",
        "gradingGuidelines": "各回のレポートの合計点を成績評価の基礎得点とする。レポートのフィードバックはMoodleにて行う。最終回の発表にて、学生間の投票で上位のグループに加点を行う。なお、自分のグループには投票できず、投票を棄権すると減点される。グループに加点された得点は、同じグループ内の学生間による投票により、票数に応じて得点が配分される。これにより、グループワークに貢献するほどよい成績になり、個人で提出するレポートがよいほどよい成績となる。各回のレポートは3点満点であり、投票項目は3種類ある。それぞれの投票項目につき、1位5点、2位4点、3位3点、4位2点、5位1点がグループに加算される。",
        "textbook": "なし",
        "referenceMaterials": "なし",
        "courseSchedule": "第1回：仮想環境とWebサーバの構築第2回：Webシステムの実装第3回：Webプログラミング第4回：Webシステムと問題点-予約システム、メール送信、tcpdump第5回：Webシステムと問題点-タグ、詐欺メール、DOM第6回：ブルート・フォース・アタック-辞書攻撃、パスワード第7回：ブルート・フォース・アタック-Webサイト第8回：インジェクション攻撃-データベース、SQL第9回：インジェクション攻撃-PythonのCGI、セッションID第10回：クロス・サイト・スクリプティング攻撃-キー取得基礎、フラッド基礎、他第11回：クロス・サイト・スクリプティング攻撃-キー取得応用、フラッド応用、他第12回：プロジェクト-内容決定第13回：プロジェクト-発表準備第14回：プロジェクト発表",
        "courseDataUpdatedAt": "2023\/12\/26"
    },
    "updateAt": "2024\/09\/13"
}