{
    "lectureCode": "C30202",
    "courseName": "先進情報プロジェクト実習II[IT・2]",
    "lecturer": [
        "金光永煥(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "研究棟Ａ３０２"
    ],
    "courceDetails": {
        "courseOverview": "この授業では，ネットワークに関する幅広いトピックを，主に研究の視点で扱う．具体的にはネットワークに関する論文を読み，そしてその内容を発表してもらうことと，最新のネットワーク技術であるWeb3に触れ，そして機能拡張や性能評価を行うことを想定している．授業の前半部では，ネットワークの基礎や仕組みを理解してもらうために，論文をグループ単位で読んでもらい，その内容について発表してもらう．論文内に含まれている基礎事項を確認することで，ネットワーク全般に関する基礎事項を理解してもらう．授業の後半部では，Web3技術について扱う．近年では，個人同士が自律的かつ安全にネットワーク上で取引を行うための情報基盤，すなわちWeb3が普及しつつある．ブロックチェーンによるコンテンツ一貫性の担保や取引自動化の仕組みなどは，自律分散型ネットワーク上でなされることを想定している．IPFS(InterPlanetaryFileSystem)は，この自律分散型ネットワークを構成するための主要なPeer-to-peer(P2P)技術である．また，教員が開発したFlexible-IPFSでは，IPFS上で複数属性や範囲指定検索，コンテンツのバージョニングを実現したものであり，自律分散型でより柔軟に取引を可能にするためのミドルウェアである．そこで授業の後半部ではFlexible-IPFSを用いて，個人間で安全に情報のやり取りを実現するための機能拡張，ユーザビリティ改善，セキュアな取引を実現するための取り組みや性能評価をグループワークで行う．その結果，最新のネットワーク技術の仕組みだけでなく，その上でWeb3の今後のあり方についての深い理解が得られるものと考えている．この授業では主に実学に基づく専門能力，論理的な思考力を身につけることを目的としている．さらに，コミュニケーション能力，問題解決力と分析・評価能力を修得することを目指している．",
        "outcomesMeasuredBy": "・通信時間の算出手法の理解（実学に基づく専門能力，分析・評価能力）・自律分散型ネットワークでのコンテンツ検索手法の理解（問題解決力）・チームワークを通じて目的の具現化手法を学ぶ（論理的な思考力，コミュニケーション能力）・IPFS上でのチーム開発を通じて，処理負荷やネットワーク負荷についての理解を深める（実学に基づく専門能力，論理的な思考力）・ネットワーク性能の評価手法を学ぶ（実学に基づく専門能力，問題解決力）",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "基本事項をスライドで説明した後，グループワークにより，IPFS上での新たな機能の設計・実装を議論等を通じて行う．ノートPC必携．",
        "notices": "・毎回，チームとしての進捗報告を提出してもらい，次の授業にてフィードバックを行う．進捗報告では，誰が，どの部分を担当して何を行ったのかを報告してもらう．・開発言語は問わないが，まずは何をどのように作ればよいかをグループ内でしっかりと議論してください．",
        "preparatoryStudy": "・進捗報告を通じて各チームの課題を明確にし，授業後において，グループワークでの課題の明確化と技術的な復習に180分，そして次回授業前には改善するための施策の検討・技術的な内容の予習に180分費やすことが望ましい．・前提知識としては，TCP/IPの基本（特にIPアドレス，TCPの基本）を知っていることが望ましい．",
        "gradingGuidelines": "進捗報告（40%）と成果発表（60%）による．また，各回で，前回の進捗報告に対するフィードバックを行う．",
        "textbook": "使用しない．",
        "referenceMaterials": "チーム毎に実装内容が異なるため，授業内で適宜指示する．",
        "courseSchedule": "第1回：スレッドプログラミングやネットワークの基礎の紹介第2回：ネットワーク技術に関する代表的な論文調査（論文の検索方法）第3回：ネットワーク技術に関する代表的な論文調査（論文の査読方法）第4回：ネットワーク技術に関する代表的な論文調査（査読から今後の研究への生かし方）第5回：ネットワーク技術に関する代表的な論文調査（論文査読の発表会）第6回：Web3についての紹介（ブロックチェーン，IPFS）第7回：Flexible-IPFSの動作確認と仕組みの理解第8回：グループワーク（IPFS上での機能実装の企画）第9回：グループワーク（IPFS上での機能実装の設計）第10回：グループワーク（IPFS上での機能実装の開発）第11回：グループワーク（IPFS上での機能実装の検証・試験）第12回：グループワーク（IPFS上での機能実装の実験）第13回：グループワーク（IPFS上での機能実装の評価）第14回：最終発表会",
        "courseDataUpdatedAt": "2025/01/29"
    },
    "updateAt": "2025/03/21"
}