{
    "lectureCode": "C30601",
    "courseName": "人工知能専門演習II[AI・4]",
    "lecturer": [
        "井上亮文(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "講義実験棟３０１"
    ],
    "courceDetails": {
        "courseOverview": "インタラクティブなソフトウェアでは、人からの入力と、それに対するソフトウェア側の反応とが繰り返される。本講義では代表的なゲームエンジンの1つとして知られるUnityを用いて2D及び3Dのインタラクティブなソフトウェアの開発を目的とする。その題材として2Dではジャンプゲーム、3Dではパズルゲームを開発する。インタラクティブなソフトウェアの構造や動作原理の違いを理解することで「実学に基づく専門能力」を身につける。また、自由課題の開発の過程で「論理的な思考力」「分析・評価能力」「問題解決力」を身につける。",
        "outcomesMeasuredBy": "[最低到達目標]・コンソールアプリケーションの動作・構造と、インタラクティブソフトウェアの動作・構造の違いを理解する（実学に基づく専門能力）・インタラクティブソフトウェアを設計・開発・動作させることができる（実学に基づく専門能力、論理的な思考力）・設計及び開発の過程で発生した問題の原因を究明し、それを解決、もしくは代替の手段を考案できる（分析・評価能力、問題解決力）[上位到達目標]-人の利用を意識したソフトウェアを設計・開発することができる（実学に基づく専門能力、論理的な思考力）-設計・開発・動作確認・分析・改善を繰り返すことができる（分析・評価能力、問題解決力）",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ノートPC必携。本講義の全14回は大きく3つに分けられる。まず、Unityで用いるプログラミング言語C#の基礎を身につける。次に、2Dのインタラクティブな環境を構築する。最後に3Dのインタラクティブな環境を構築する。VRの開発は高性能PC・外部機器・スマートフォンの準備などが必要なため予定していない。各回の前半ではその日に扱う内容を解説する。後半ではその日の内容に基づいた演習を実施する。",
        "notices": "授業で用いるPCのローカルストレージを空けておくこと（20GB〜）。本講義の開発環境はかなりのローカルストレージ容量を消費する。他講義のレポートなどはクラウドストレージや外付けのメディアに保存しておくことが望ましい。本講義で用いるC#の前提知識は必要ないが、Pythonで学習したプログラミングの基本的な概念（変数・代入・関数・オブジェクト・クラス・メソッドなど）があることを前提に講義を進める。授業開始前に復習をしておくこと。",
        "preparatoryStudy": "[予習]各回の講義の最後に提示された内容を予習してくること。次回講義の冒頭でその知識を確認することがある。[復習]その回の演習課題が短時間で完成できる程度に、講義内容を復習すること。授業時間内に演習課題が終わらなかった学生は、次回講義まで提出機会を設けるので、それまでに終わらせてくること。",
        "gradingGuidelines": "「製作物とそのレポート」（2回）と各回の演習課題で評価する。比率は「製作物とそのレポート」が60%、演習課題が40%である。毎週の課題は、演習時間中の提出であれば教員やTAから直接フィードバックを行う。それ以外の時間であればMoodleでフィードバックを行う。これ以外の加点要素は(1)製作物の着眼点、(2)技術的工夫、(3)広報の仕方、(4)授業への積極的な参加、である。可能であれば、互いの製作物を学生どうしで見せ合う機会を設けたい。多くの学生から高評価が得られた製作物を提出した学生や、多くの学生の製作物に対してフィードバックをした学生の評価を加点する。",
        "textbook": "指定しない",
        "referenceMaterials": "指定しない",
        "courseSchedule": "第1回：環境構築第2回：C#基礎(1)変数・制御構文・配列第3回：C#基礎(2)メソッド・クラス第4回：2D開発(1)オブジェクトの操作第5回：2D開発(2)ゲーム状態の管理第6回：2D開発(3)オブジェクトの自動生成第7回：2D開発(4)物理演算とアニメーションの基礎第8回：2D開発(5)物理演算とアニメーションの応用第9回：理解度確認第10回：3D開発(1)ゲーム空間の構築と装飾第11回：3D開発(2)ゲーム内オブジェクトの判定と操作第12回：その他の開発技法第13回：開発実習(1)最終課題の開発＋外部プロセスの連携手法第14回：開発実習(2)最終課題の開発＋PVの作り方",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}