{
    "lectureCode": "C31401",
    "courseName": "プログラミングC1[2023以前]",
    "lecturer": [
        "福西広晃(コンピュータサイエンス学部コンピュータサイエンス学科)",
        "未定(所属なし)",
        "武博(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月4",
        "月5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "大規模なシステム開発で用いられるJava言語を修得することを目的とする。前半回では、変数の定義と演算、条件文、繰り返し文、配列、メソッドに関する基本的なJavaの文法を身に着ける。後半回では、オブジェクト指向のプログラミングに必要な、クラスの定義（オブジェクトの設計図）とインスタンスの生成の基本を身に付ける。具体的には、アクセス修飾子、コンストラクタ、クラス変数・クラスメソッド、オブジェクト配列、クラスライブラリ、継承、抽象クラス、インターフェース、パッケージ、例外処理に関する文法を段階的に学習し、応用範囲を広げていく。本講義では、（１）プログラムを作成することを通して論理的な思考力を育成する、（２）演習課題に取り組むことで問題解決力を育成する、（３）ITエンジニアに必要なオブジェクト指向プログラミングを実践することで実学に基づく専門能力を育成する、（４）プログラム作成時に直面するエラーの原因特定と解決の経験を通して分析・評価能力を育成する。",
        "outcomesMeasuredBy": "・Java言語による制御構文（順次処理、分岐処理、反復処理）を実装できるようになる（論理的な思考力、分析・評価能力、問題解決力）・オブジェクト指向プログラミングの概念を理解し、クラスを実装できるようになる（実学に基づく専門能力、論理的な思考力、分析・評価能力、問題解決力）",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・講義と演習をセットで実施する。講義では主に文法解説を中心に進め、適宜サンプルプログラムの作成も行う。演習では個々の学生が講義内容に対応したプログラムの作成を行う。その際、教員及びティーチングアシスタント（TA）が質問に対応し、サポートする。・本講義は、各自のノートPCでプログラミングを行うため、ノートPCおよびACアダプタを必ず持参すること。・論理的思考力の育成のため、授業及び課題取り組みにおいて、生成AIの使用を禁じる。",
        "notices": "・プログラミング環境には、VisualStudioCode（VScode）を使用する。第1回の授業前にMoodle上でJavaの環境構築の資料を公開するので各自で実施すること。第１回授業は環境構築ができている前提で行うことに注意すること。・１年次のプログラミング基礎I,IIにおいて、プログラミングの基本的な文法（分岐処理、反復処理など）は理解しているものとして進めるため、理解が不十分である場合は復習しておくこと。",
        "preparatoryStudy": "毎回の授業は、それまでの講義・演習の内容が理解されていることを前提に進める。そのため、前回の授業で作成した演習課題のプログラムを、講義資料を参照することなく作成できるように繰り返し取り組むこと。授業前にMoodle上で公開された講義資料は確認しておくこと。",
        "gradingGuidelines": "・２回の理解度確認チェック（70%）と平常授業の演習課題の成績(30%)によって総合的に評価する。・フィードバックとして理解度確認チェック後に解説を行う。",
        "textbook": "教科書の指定はなし。毎回、Moodle上に講義資料と演習資料を掲載する。",
        "referenceMaterials": "アクティブラーニングで学ぶJavaプログラミングの基礎1,コロナ社アクティブラーニングで学ぶJavaプログラミングの基礎2,コロナ社",
        "courseSchedule": "第01回：変数の定義と演算第02回：条件文第03回：繰り返し文第04回：配列第05回：メソッド第06回：第1回理解度チェック第07回：クラスとインスタンス第08回：アクセス修飾子・コンストラクタ第09回：クラス変数・クラスメソッド第10回：オブジェクト配列・クラスライブラリ第11回：継承第12回：抽象クラス・インターフェース第13回：パッケージ・例外処理第14回：第２回理解度チェック",
        "courseDataUpdatedAt": "2025/02/06"
    },
    "updateAt": "2025/03/21"
}