{
    "lectureCode": "C40273",
    "courseName": "卒業課題II[前期]CS",
    "lecturer": [
        "山元進(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": 4,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "卒業課題は大学での学びを総括するものであり、担当教員の指導のもとに、自主的活動の訓練とともに創意工夫の実践を行う。卒業課題IIでは卒業課題Iで作成した企画に基づいた実行に重点を置く。実験やシミュレーション、理論的検証などにより目標（何を行う）や手法（問題点の解決方法）の確認を行う。成果を論文としてまとめるとともに、研究室などの発表会、卒論発表会において評価を得る（コミュニケーション能力）。卒業課題IIの推進にあたっては卒業課題Iから継続した研究ノートを作り、考えた解析方法やアイディア、問題点、成果などを随時、記録する習慣を身につける。担当教員の指導に従って、主に実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力と問題解決力を身につけることを目的としている。",
        "outcomesMeasuredBy": "卒業課題の最終成果物として卒論発表会で合格する内容の論文を完成させることが一般的な目標であるが、具体的には指導教員の指示による。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "卒業課題Iと同一の研究室で、卒業課題IIに取り組む。原則として毎日、卒研室で卒業課題に取組むこと。定期的な研究室の集まりで進捗状況・成果を報告し、指導を受ける。卒業課題では包括的な取組みが必要である。例えば、ソフトウェアの開発を行うのであれば、プログラムの設計・作成・評価と共に、プログラム保守者、ユーザに対するマニュアル等、卒業論文本文以外の必要なドキュメントを完成させなければならない。具体的な進め方は、研究室毎の方針に従うものとするが、例年概ね以下の［授業計画］に示す内容となっている。",
        "notices": "研究室内での集まりの他、各自の日常の勉学・研究、学生間の交流・討議が重要である。研究室の集まりに無断欠席は絶対に許されないので、必ず指導教員に連絡を取ること。卒業研究は多くの時間をかけて計画的に行う必要があるので、必要となる時間を確保し卒業課題に専念すること。卒業課題Iで、課題の目的、目標、課題、手法、スケジュールなどを明らかにしておく。",
        "preparatoryStudy": "研究室内での集まり、発表会などのほかに、その準備などに十分な時間（予習・復習）をかけなければならない。予習として研究の準備（方式検討、プログラミングなど）を実施し、指導を受けた内容に応じて復習すること。",
        "gradingGuidelines": "卒業論文に加え、最終発表(卒論発表会)、日常の研究状況の観点から総合的に評価する。論文内容が貧弱な場合、研究室活動が不十分な場合等には、指導教員の判断により、論文が提出されても不合格となることがある。また、最終発表で論文内容や質疑から、課題の取組み・理解が不備と判断された場合、再発表を行うことがある。発表の結果によっては、不合格と判定されることがある。なお、指定日時までに提出されない卒業論文は受理されないので注意すること。研究室内の集まりや発表会などで、指導の形で研究進捗に対してフィードバックする。",
        "textbook": "各指導教員の指示による。",
        "referenceMaterials": "各指導教員の指示による。",
        "courseSchedule": "第1回：卒業課題Iと同じ研究室で指導を受ける第2回～第9回：研究の展開（解析・実験など）第10回～第12回：卒業論文執筆第13回:卒業論文提出第14回:最終発表会",
        "courseDataUpdatedAt": "2024\/02\/29"
    },
    "updateAt": "2024\/09\/13"
}