{
    "lectureCode": "GE000301",
    "courseName": "サステイナブルパワーエレクトロニクス特論",
    "lecturer": [
        "高木茂行(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "総合科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "工学研究科博士前期課程サステイナブル工学専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ３０２"
    ],
    "courceDetails": {
        "courseOverview": "サステイナブル社会で持続的なエネルギー環境を実現するのに中心的役割を果たすのが、パワーエレクトロニクス（以下パワエレ）である。直流から交流、交流から直流へとパワー（電力）をエレクトロニクス（電子回路）でコントロールすることで、電力の利用効率を高めている。本講義では、パワエレの応用機器として、サステイナブル社会への貢献が期待される太陽光発電、廃熱発電、植物工場、プラズマ殺菌、電気自動車の取り上げる。講義で取り上げる内容はES専攻との関連だけでなく、植物工場、プラズマ殺菌はBS専攻の専門分野との関連を、太陽光発電、廃熱発電、電気自動車はCS専攻の専門分野との関連を想定している。それぞれの応用機器で現状について理解するとともに、パワーエレクトロクスが果た役割を学ぶ。",
        "outcomesMeasuredBy": "以下の内容を通して、サステイナブル社会へのパワーエレクトロニクスの貢献を理解する。①パワーエレクトロニクスの概要②それぞれの電力機器の原理・構造・特徴・現状③パワーエレクトロニクスの使われ方なお、本講義の「ラーニングアウトカム」としては、教科書に記述されている理論や技術が、具体的にどのように活用されるかを通して、「実学にもとづく専門能力」を身につけることを目標とする。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "・授業の基本的な進め方は、35分の講義後に15分の演習問題を行うとうアクティブラーニング形式で実施し、100分間に2回の講義と演習を行う。・予習資料を事前にMoodleにアップし、講義終了後には講義資料をMoodleにアップする。・2～3回に１度の割合で、講義内容に関する演習あるいはミニレポートの作成を行って提出する。・講義中に行う演習、ミニレポートの作成にはPCを活用する。",
        "notices": "・講義中に行う演習、ミニレポートの作成ではPCを使うので、毎回持参すること。・Moodleに予習用資料をアップするので、アップされた予習資料をPCで閲覧しながら、講義を受けると理解が深まる。・終了後に、講義資料をアップするので、学習内容を復習すること。",
        "preparatoryStudy": "・予習：授業に先出ち、概要をまとめた予習資料をMoodleにアップするので、事前に関連する内容について調べておくこと。・復習：授業終了後に、講義と演習問題・回答の資料をMoodleにアップするので、授業の復習をしておくこと。",
        "gradingGuidelines": "・講義中に行う演習あるいはレポート提出（50％）と、最後に提出するレポート（50％）の合計で成績を評価する。・講義中に行う演習については、演習終了後に解答と解説をフィードバックする。",
        "textbook": "教科書は使わず、講義ではパワーポイントに資料を使う。毎回の予習資料と講義資料は、Moodleにアップする。",
        "referenceMaterials": "高木茂行、長浜竜：「これですっきりパワーエレクトロニクス」，コロナ社（2017）高木茂行、長浜竜、服部文哉、今岡淳、佐藤大介、平沢浩一、向山大索：「エンジニアの悩みを解決パワーエレクトロニクス」，コロナ社(2020)",
        "courseSchedule": "第1回：サステイナブル社会とパワーエレクトロニクス第2回：太陽光発電を実現するスマートグリッドシステム第3回：パワーデバイス第4回：廃熱発電の概要・原理と現状第5回：LEDのパワーコントロールと植物工場第6回：プラズマの生成と生体への応用（プラズマ殺菌、成長促進）第7回：電機自動車を実現するパワーエレクトロニクス",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}