{
    "lectureCode": "GE000401",
    "courseName": "サステイナブル応用化学特論",
    "lecturer": [
        "西尾和之(工学部応用化学科)",
        "須磨岡淳(工学部応用化学科)",
        "原賢二(工学部応用化学科)"
    ],
    "regularOrIntensive": "総合科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "工学研究科博士前期課程サステイナブル工学専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ３０４"
    ],
    "courceDetails": {
        "courseOverview": "ロボット，宇宙・航空機，自動車などに必須の構造材料，電気・電子デバイスや医療・介護デバイスに必須の機能性材料など，無機物から生物を含む有機物に至る多様な物質・材料の創造がサステイナブル社会を構築する基盤となっている．本講義では，様々な物質・材料について，サステイナブル工学の下に生産・活用するための指針を，さらに化学の果たす役割を学ぶ．対象とする物質・材料について，電気的性質，磁気的性質，光学的性質，機械的性質や表面物性の解明方法を理解し，物理学，工学，技術の領域で重要になる化学の基盤を身につける．",
        "outcomesMeasuredBy": "本科目を修得することで，材料の分析・評価，数物的考察に基づいた解釈を進める力が身につく【実学に基づく専門能力，論理的な思考力，分析・評価能力】．具体的には，1）グリーンサステイナブルケミストリーに基づく物質・材料の製造・消費2）応用化学の見地からみた省エネルギー・創エネルギーによる資源・環境・エネルギー問題の解決3）種々の材料を用いたサステイナブル応用化学に基づく技術開発が行えるようになる．",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "初回は対面で実施するが，2回目以降はオンデマンド形式で3名の教員で実施する予定である．原則として，各回の終わりには理解度チェックのための課題を出す．講義資料をmoodleに掲示するため，ノートPCを使用する．",
        "notices": "対象の物質について，見出されている具体的な現象に加えて歴史的な背景も説明する．自分にとって理解しやすい書籍を選び，補助教材として活用することが望ましい．また，分からないことをそのままにせず，積極的に質問をすることが，理解を深めるために重要である．何が分からないのかを，自分なりに考えるようにして欲しい．",
        "preparatoryStudy": "moodleに掲示した資料に沿って参考書籍を利用して予習し，少なくとも各回の授業の概要を理解して授業に臨むこと．また，演習問題の内容を中心に十分な復習を行い，疑問点はオフィスアワーや次回の授業時に積極的に質問して，疑問を後に残さないように心掛けること．",
        "gradingGuidelines": "各講義で実施する演習課題およびレポート課題の達成度で評価する．",
        "textbook": "指定しない．各回で準備する講義資料に沿って授業を進める．",
        "referenceMaterials": "必要に応じてmoodleあるいは初回の授業で紹介する．",
        "courseSchedule": "第1回(西尾)：概論（サステイナブル応用化学とは）第2回(須磨岡)：バイオプラスチック（バイオマスプラスチック、生分解性プラスチック）第3回(須磨岡)：バイオマテリアル（金属・セラミック・高分子）第4回(原)：物質変換を可能にする物質・材料第5回(原)：エネルギー変換を可能にする物質・材料第6回(西尾)：陽極酸化処理の技術と歴史，サステイナブル社会への貢献第7回(西尾)：陽極酸化処理の先端研究",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/09/13"
}