{
    "lectureCode": "GE101801",
    "courseName": "表面科学概論",
    "lecturer": [
        "西尾和之(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "工学研究科博士前期課程サステイナブル工学専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ２０１"
    ],
    "courceDetails": {
        "courseOverview": "表面科学は，物質の表面あるいは異なる物質間の界面で生じる化学的･物理的な現象に関する学問である．固体と液体，固体と気体の界面は反応が進行する場としてきわめて重要であり，サステイナブル社会の実現にも重要な役割を果たす．また，固体表面の微細構造は，その材料の特性を大幅に変化させるほか，ナノスケールでの高度な構造制御は新たな機能材料としての展開を可能とする．表面の現象の理解と表面状態・表面構造の制御は，材料を扱う上で重要な知識となる．授業期間の前半では，固体表面のナノスケールの微細構造を詳細に観察・分析する装置について，観察の原理と具体的な観察方法を中心に学ぶ．後半では，固体表面の微細構造の制御について，人工的なプロセス(トップダウンプロセス)，固体の表面処理に基づく自発的なプロセス(ボトムアッププロセス)を学ぶ．これらの学習を通して，表面・界面に関する論理的な思考力，分析・評価能力が身につく．具体的には，自身が取り扱う材料の表面の物性を測定し，解析によってその特性を正確に理解する能力が身につく．",
        "outcomesMeasuredBy": "表面の観察・分析を通して実際の表面・界面の現象を推測することができる【論理的な思考力，分析・評価能力】．具体的には，以下のことができる様になる．(1)固体表面の観察・分析により，表面の状態を論理的に理解することができる．(2)ナノスケールで表面の構造を制御する目的と具体的な制御方法を理解することができる．(3)求める物性に応じて固体表面を制御する能力を身につけることができる．",
        "learningOutcomes": "論理的な思考力分析・評価能力",
        "teachingMethod": "前回の授業の復習の後，講義内容を数項目に分けて進める．微細構造を詳細に観察・分析する装置については，理解度を高めるため，学内保有装置の操作方法を含めて学習していく．界面科学の基礎となる日常で見られる現象(吸着，接着，剥離)を含めて、演習を取り入れながら学習していく．第1回のみ対面とし，第2回以降はオンデマンドで実施する予定である．各講義の演習や課題の説明は，その都度moodleを通して行う．",
        "notices": "分析化学，機器分析，界面化学，電気化学に関する学習をしておく事が好ましい．",
        "preparatoryStudy": "事前にmoodleに講義内容を掲示するので，予習しておくこと(目途：60分程度)．講義後は講義資料を用いて復習するほか，図書館などで関連資料を入手してより深く理解することが望ましい(目途：60分程度)．",
        "gradingGuidelines": "毎回設定する課題の提出内容で評価する.",
        "textbook": "指定しない．moodleに掲示する資料に従って講義を進める．",
        "referenceMaterials": "機器分析（講談社，大谷肇編）界面化学（丸善，近澤正敏，田嶋和夫著）接着の基礎と理論，(三刀基郷，日刊工業新聞）電気化学（丸善出版，渡辺正，金村聖志，益田秀樹，渡辺正義著）",
        "courseSchedule": "第1回：ガイダンス，表面・界面の制御の実例第2回：表面の物性第3回：界面の物性第4回：電子顕微鏡・原子間力顕微鏡第5回：ナノマテリアルとトップダウンプロセス第6回：ボトムアッププロセスと陽極酸化第7回：陽極酸化技術に基づくエネルギーデバイス",
        "courseDataUpdatedAt": "2024/02/27"
    },
    "updateAt": "2024/09/13"
}