{
    "lectureCode": "GF1002",
    "courseName": "デザインクリエイションI",
    "lecturer": [
        "伊藤丙雄(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月",
        "月2",
        "火",
        "火2"
    ],
    "targetDepartment": "デザイン研究科",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 4,
    "classroom": [
        "３１０１６教室"
    ],
    "courceDetails": {
        "courseOverview": "この授業では入学時の研究計画書にある各自の「研究テーマ」をベースに、実際の地域（大田区）における社会状況を丁寧に調査、観察、実地踏査まで行うことを基本に、各自の修了研究に必要な「仮説」を導き出すための授業である。今年度は大田区内全域を対象として設定し、独自のデザイン発想による課題解決を図るものとする。デザイン分野に携わる場合、人を想いと未来を想い、過去の事例に対する知見を広げる努力が重要である。本科目では調査対象地域に軸足に置き、様々な事例、文献、関連する資料、具体的なフィールドワーク等、マクロ～ミクロまで多角的な視点で対象となる実態を捉え、地域関係者からの知見も得た上で課題の抽出方法を学ぶ科目である。授業は所属するデザイン系統に関係なく実施をするが、結果としてどちらのデザイン系統においても取材力と高度な調査報告を求めており、加えてデザイン表現、スキルに裏打ちされた各自の調査報告に基づく「仮説」と、その証明とするための作品に期待をしたい。",
        "outcomesMeasuredBy": "前期では各自の研究テーマに関する徹底的な調査、観察、踏査など、リサーチをする基本的な仮説の組み立て、計画から報告までを目指す。並行して各自の研究活動に評価に活用させるなど、この授業での取り組みを通過点として認識することが大きな授業の到達目標である。また調査結果の分析や物事の構造評価などは、他者とのディスカッションを重ねた報告会、それまでの意見交換などのコミュニケーションにより成果が明確化され、密度のある調査内容と分析、評価は2年のデザイン研究Ⅱ、デザイン研究Ⅲ、修了制作への発展が期待される。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "当初リサーチは個人の研究テーマに則った形で行い、中間報告会以降は近似する研究テーマで視覚、工業系に関係なく、ペアもしくはグループを形成し活動、その対象研究を幅広く高いレベルへと昇華させる。また随時業界の著名人による講話やディスカッション、担当教員による指導に加えた包括的な授業の仕組みで、取り組んだ研究テーマを個々の仮説へと結び付ける。期末報告会には個々に戻り各自の研究テーマ報告を行い、教員の総評を経て後期のクリエイションにつなげる。",
        "notices": "各自研究のテーマに関係なく、またビジュアル（視覚系）かインダストリー（工業系）に関係なく共通で開講される授業である。なお前期「デザインクリエイションⅠ」を選択した場合は後期科目も「デザインクリエイションⅡ」を継続して選択するのが履修の条件である。また幅広い社会を対象とした1年後期「コミュニティとデザイン」の履修を推奨する。",
        "preparatoryStudy": "各自の研究テーマをデザイン研究と反映して進める。この科目は１つの課題を提出する科目ではなく社会性のあるテーマをトリガーに俯瞰した視点を覚え、常に研究活動と連携している科目として捉えることが望ましい。",
        "gradingGuidelines": "研究テーマに対する取り組み、能動的な姿勢により評価、点数化し、60点以上を単位認定とする。なお評価は担当する全教員で行い、取り組み内容における評価項目は下記のとおり。リサーチ【50%】、分析や考察【30％】、報告【20％】",
        "textbook": "授業内容に合わせて必要な資料等をMoodleの授業ページトピックにて配付する。また講話等の講師から提供される資料、関連の書類も同様に配付する",
        "referenceMaterials": "授業内容に合わせて必要な資料等をMoodleの授業ページトピックにアップロード",
        "courseSchedule": "第1回：授業ガイダンス／デザインクリエイションテーマ「仮説とは」課題説明第2回：関連講話A「研究と課題制作」実例に関するレクチャー（伊藤丙雄）第3回：課題制作・指導（主に学内でのテーマ検討、資料収集）第4回：課題制作・指導（主に学内でのテーマ検討、資料収集）第5回：課題制作・指導（主に学内でのテーマ検討、資料収集）第6回：課題制作・指導（主に学内でのテーマ検討、資料収集）第7回：中間報告会／地域関係者、客員教授評価・デザイン検証大田区地域の関係業者とのマッチング開始第8回：関連講話B「デザインによる社会課題の取り組み（仮題）」第9回：課題制作・指導（主に学外への取材）第10回：課題制作・指導（主に学外への取材）第11回：課題制作・指導（主に学外への取材）第12回：関連講話C「大田区の歴史と区制〇〇の変遷（仮題）」第13回：課題制作・指導（主に学外への取材）第14回：最終報告会／第三者評価・検証／クリエイションⅡへの展開第15回：個人制作面談／フィードバック／実施企業とのマッチング会",
        "courseDataUpdatedAt": "2025/02/03"
    },
    "updateAt": "2025/03/21"
}