{
    "lectureCode": "GGB13701",
    "courseName": "食品分析化学特論",
    "lecturer": [
        "永井利治(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "バイオ・情報メディア研究科博士前期課程バイオニクス専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "食品は、水分の他、炭水化物、たんぱく質、脂質、ビタミン、ミネラルといった様々な成分で構成されているが、食品の品質や機能を評価するには、食品の分析は必要不可欠である。食品の分析は、分析項目が極めて多い。また、食品成分を分析するにも多種多様の分析方法があり、その中から測定する成分に適した分析法を選択しなければならない。本講義では、食品から分析する成分を抽出する等の前処理方法から、食品成分を分析するための原理や特徴について紹介する。特に多くの分析で多用されるクロマトグラフィーに重点を置く。また、食品の品質管理のため実際の現場で使用されている分析法についてもあわせて紹介する。",
        "outcomesMeasuredBy": "本講義では、食品成分を分析する際の基礎知識を習得することを目標とする。また、食品分析の原理や手法についての実学に基づく専門能力を身に付けることを目指す。本講義では、食品分析に関する科学英語論文を読解することで、同分野における国際的な教養を身につける。さらにスライドを使用したプレゼンテーションを実施することで、コミュニケーション能力を身に付ける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "前半は講義形式、後半は食品分析に関する科学英語論文を読み、その内容をプレゼンテーションするゼミ形式（ノートPCを使用する）を伴うアクテイブラーニングを実施する。なお、授業は英語で進めることがある。",
        "notices": "学部授業で「有機化学」、「生化学」、「分析化学」、「食品化学」、「栄養化学」、「食品安全論」、「食品製造学」のすべてを履修していることが受講の必須条件とする。プレゼンテーションでは、食品分析に関する科学英語論文を読むが、それに関する基礎知識を参考書等を使ってあらかじめ理解しておくことが必要である。授業は英語で進めることがあるので、基礎的な英語の専門用語を理解していることが必要である。",
        "preparatoryStudy": "学部授業の「有機化学」、「生化学」、「分析化学」、「食品化学」を復習しておくこと。プレゼンテーションでは、事前にスライド（10枚以内）を、題名、諸言、方法、結果の順で作成した後、スライドを収めた配布資料を人数分用意すること（または事前にPDFファイルを教員に提出すること）。プレゼンテーションの資料は英語で作成することが必要となる場合がある。",
        "gradingGuidelines": "プレゼンテーション50％、レポート50％で評価する。プレゼンテーションで出されたコメント等やレポートの模範解答については、Moodle上でフィードバックする。",
        "textbook": "随時、講義資料をMoodle上に配布。",
        "referenceMaterials": "「食品分析」中澤・堀江・井部著、共立出版「新・食品分析法」日本食品科学工学会編、光琳「ハリス分析化学下原著9版」、化学同人",
        "courseSchedule": "第1回:食品分析の種類と特徴（成分分析）第2回:食品分析の種類と特徴（微量成分分析）第3回:機器分析（主にクロマトグラフィーを扱う）第4回:食品成分の定性・定量第5回:プレゼンテーション１：アミノ酸・たんぱく質の分析第6回:プレゼンテーション２：脂質の分析第7回:プレゼンテーション３：微量成分（ビタミン・ミネラル・色素）・有害物質の分析",
        "courseDataUpdatedAt": "2024/01/07"
    },
    "updateAt": "2024/09/13"
}