{
    "lectureCode": "GGB13001",
    "courseName": "皮膚科学特論",
    "lecturer": [
        "松井毅(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "バイオ・情報メディア研究科博士前期課程バイオニクス専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ３０２"
    ],
    "courceDetails": {
        "courseOverview": "皮膚科学研究やその皮膚疾患に対する創薬・化粧品関連業務に携わる上で、必須の美容の基礎知識と最新の科学的知見を習得することを目的とした実践的科目として開講する。皮膚の基本的な構造と役割・機能、皮膚の発生と進化的起源、皮膚の恒常性異常から発生する様々な疾患や変化について解説する。特に、化粧品開発に必要とされる皮膚の保湿や老化による形態の変化、疾病に関係する皮膚内部で起きる現象を分子機構も含めて詳細に解説し、皮膚表面に現れてくる変化や症状との因果関係について解説する。授業の後半では、皮膚科学関連の最新論文を演習の形で読解し、研究背景やデータの解釈、今後の研究の方向性や発展性、産業への応用性に関して、考察を行う。",
        "outcomesMeasuredBy": "本講義では、皮膚科学の基礎知識を高度なレベルで習得しつつ、最新の皮膚科学研究の知見も積極的にとりこみ、創薬や化粧品開発などの実学に基づく専門能力を身に付けることを目指す。皮膚の基本的な構造、機能および年齢による変化、外的因子により誘導される変化とその変化を誘導する作用機序について深く理解する。加えて世界で行われている最新の皮膚科学分野の研究テーマを理解できる論理的な思考力、そこから、何が未解明となっている皮膚科学研究テーマであるかを把握する。さらには、それらの知見から、創薬や化粧品開発などの産業応用可能なコンセプトの立案ができるような問題解決力を習得することを達成目標とする。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "パワーポイント資料、配布プリント、板書を併用して授業を行う。ノートPCまたはスマートフォンは、出席管理や授業中の双方向コミュニケーションに用いるため、必携です。また講義資料は授業開始前にMoodleに掲載しますので、事前の予習、講義中の資料の補助、講義後の復習に活用してください。",
        "notices": "細胞生物学の基礎知識を履修にあたり復習しておくこと。",
        "preparatoryStudy": "毎回の授業前において全体の内容を含むプリントをMoodleで公開するので、教科書と参考教科書（資料）と共に予習をしておくこと。復習は、講義資料やMoodleに紹介した参考資料を勉強することが望ましい。",
        "gradingGuidelines": "最終回の講義終了後に提示されるレポート課題で評価する。",
        "textbook": "配布する講義資料",
        "referenceMaterials": "・あたらしい皮膚科学（清水宏著：中山書店）・あたらしい美容皮膚科学（南山堂）・化粧品の効能を考える時に読む皮膚科学（正木仁著：技術教育出版社）・エビデンスに基づくアトピー性皮膚炎治療新しい潮流（編集椛島健治\/宮地良樹：中山書店）・MatsuiTandAmagaiM:Dissectingtheformation,structureandbarrierfunctionofthestratumcorneum.Int.Immunol.27:269-80,2015.・CandiE,SchmidtR,MelinoG,Thecornifiedenvelope:Amodelofcelldeathintheskin.Nat.Rev.Mol.CellBiol.6:328–340,2005.",
        "courseSchedule": "第1回：皮膚科学の総論-皮膚の構造、付属器官-第2回：表皮の分化第3回：角層形成プロセス-その1-特殊な細胞死、コルネオトーシス第4回：角層形成プロセス-その2-角層バリア形成第5回：フィラグリンと角層バリア第6回：タイトジャンクションと表皮ターンオーバー第7回：外部講師による皮膚科学の最新知見についての講演",
        "courseDataUpdatedAt": "2024\/01\/08"
    },
    "updateAt": "2024\/09\/13"
}