{
    "lectureCode": "GGB12401",
    "courseName": "毛髪科学特論",
    "lecturer": [
        "岩渕徳郎(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "バイオ・情報メディア研究科博士前期課程バイオニクス専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ３０２"
    ],
    "courceDetails": {
        "courseOverview": "本講義では毛髪科学、特に毛髪生物学についての実学に基づく高い専門力を身につけることを目指す。生物学をベースとした最新の毛髪科学のみならず、関連する幹細胞生物学、発生生物学、細胞生物学、皮膚科学および遺伝学の知識の習得も目的とする。併せて、白髪形成の観点から色素細胞生物学の知識を習得する。さらに、最新の再生医療の知見も取り入れながら、毛髪に関わる最先端の科学知識、医療知識を含めて、総合的に理解習得していく。授業の中では、アクティブラーニングとして、学生にレポート課題の調査結果について発表してもらう機会を設ける。",
        "outcomesMeasuredBy": "大学院修士課程修了者としてふさわしい、実学に基づいた毛髪科学に関する高い専門能力を習得する。本授業の資料は全て英語で表記され、科学言語である英語力の養成、および国際的な教養の習得も目指している。授業中に多くの質疑応答を経験することにより、コミュニケーション能力、論理的な思考力、分析・評価能力を育成することも本授業の到達目標の一つである。さらに、毛髪科学領域に関連する幹細胞生物学、発生生物学、細胞生物学、再生医療学などの最先端の知識、実験法を習得し、現代毛髪科学分野における科学的な問題解決力の養成も主要な目標の一つとしている。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "スライドを中心に板書を使いながら説明する。大学院修士課程修了者としてふさわしいレベルの英語力を身に付けるため、資料は全て英語で表記される。個別質疑応答といったアクティブラーニング形式の機会も多用する。必要に応じてノートPCも使用する。",
        "notices": "復習を行うこと。本講義は学部の「毛髪科学」および「皮膚科学」を履修していることを前提に行う。さらに、「再生細胞医薬概論」、「医薬品開発概論」、「遺伝子工学」、「薬理学」、「生命科学ⅠⅡ」、「分子生物学ⅠⅡ」を受講していることが好ましい。",
        "preparatoryStudy": "シラバスや参考書を用いて該当分野を予習すること。また、講義中に行う提出課題について復習を十分に行うこと。",
        "gradingGuidelines": "出席を前提として、レポート課題70%、毎回の講義中に行う提出課題30%で評価する。なお、レポート課題の回答例を示しながら、解説するフィードバックも適宜行う。",
        "textbook": "特になし。英文の講義資料を中心に解説する。",
        "referenceMaterials": "「Chemicalandphysicalbehaviorofhumanhair5thedition」ClarenceR.Robbins著（Springer）「Hairgrowthanddisorders」UlrikeBlume-Peytavi,AntonellaTosti,DavidA.Whiting,RalphM.Trueb編（Springer）「最新の毛髪科学」松崎、新井、上甲、細川、中村著（フレグランスジャーナル社）",
        "courseSchedule": "第1回：毛の発生、毛周期、毛包の構造、毛髪の人種差第2回：男性の薄毛と女性の薄毛第3回：毛髪生物学における実験技術と遺伝子改変動物第4回：毛髪形成および毛髪再生と幹細胞、細胞の分化第5回：毛乳頭細胞の毛包誘導能第6回：毛周期制御に関与する生体因子第7回：色素幹細胞と白髪",
        "courseDataUpdatedAt": "2024\/01\/08"
    },
    "updateAt": "2024\/09\/13"
}