{
    "lectureCode": "GGC12101",
    "courseName": "データサイエンス特論",
    "lecturer": [
        "福西広晃(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "バイオ・情報メディア研究科博士前期課程コンピュータサイエンス専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ３０４"
    ],
    "courceDetails": {
        "courseOverview": "近年、データとデジタル技術でビジネスモデルや働き方に変革を起こすことを目的とした「DX（デジタルトランスフォーメーション）」が推進されている。DX時代において、企業の競争力を高めるためには、蓄積されたデータを分析し、データ駆動型の意思決定を行うことが不可欠である。そして、DX時代を牽引する人材とって、データサイエンスは重要なスキルである。本講義では、構造化データ（テーブルデータ）の予測分析に関する実践的な授業を行う。講義形式の回では、データサイエンスの役割やデータ分析の事例を理解することから始め、データの前処理方法、機械学習手法、データ分析ツールなど解説する。機械学習手法に関しては、テーブルデータに強い勾配ブースティング系の手法に焦点を当てる。ゼミ形式の回では、各自で設定したテーマで予測分析を行うか、各自の研究領域におけるデータサインエス関連論文の調査を行うかを選択し、発表及びディスカッションを行う。以上を通して、予測分析の一連の分析プロセスを身に付ける。",
        "outcomesMeasuredBy": "本講義の到達目標は、（１）データサイエンスの役割を理解すること、（２）予測分析に関する原理や手法を理解すること、（３）予測分析の一連の分析プロセスを理解すること、である。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・講義形式とゼミ形式の構成で行う。講義形式の回では分析手法の解説に加えて、Pythonを使用してサンプルプログラムを実行することや、分析課題に取り組む。・ゼミ形式の回では、各自で設定したテーマで予測分析を行うか、各自の研究領域におけるデータサインエス関連論文の調査を行うかを選択し、発表及びディスカッションを行う。これにより、学生自らの主体的な学び(アクティブラーニング)を促す。・毎回の授業でノートPCおよびACアダプタを持参すること。",
        "notices": "Pythonによるプログラミング経験があることを前提に授業を行う。経験がない場合には事前にAnaconda等のプログラミング環境を導入し、基本文法等を習得しておくことを推奨する。",
        "preparatoryStudy": "毎回の授業は、それまでの講義内容が身に付いていることを前提に行うため、授業前に前回の講義資料および作成したプログラムを復習し、知識を定着させておくこと。ゼミ形式の回では、事前に発表資料を準備すること。",
        "gradingGuidelines": "ゼミ形式の回で行う発表（30％）、最終レポート（70％）により総合的に評価を行う。",
        "textbook": "教科書の指定はなし。毎回、Moodle上に講義資料を掲載する。",
        "referenceMaterials": "参考書の指定はなし。参考資料が必要な場合は、Moodle上に掲載する。",
        "courseSchedule": "第1回:講義形式：データサイエンスの世界第2回:講義形式：テーブルデータの前処理第3回:講義形式：機械学習を用いた予測分析(1)：DecisionTree第4回:講義形式：機械学習を用いた予測分析(2)：GradientBoostingDecisionTree第5回:講義形式：機械学習を用いた予測分析(3)：XGBoost,LightGBM第6回:ゼミ形式：予測分析または文献調査の発表、ディスカッション（1）第7回:ゼミ形式：予測分析または文献調査の発表、ディスカッション（2）",
        "courseDataUpdatedAt": "2024\/01\/08"
    },
    "updateAt": "2024\/09\/13"
}