{
    "lectureCode": "GGC11901",
    "courseName": "セキュリティシステム",
    "lecturer": [
        "宇田隆哉(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "バイオ・情報メディア研究科博士前期課程コンピュータサイエンス専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ３０４"
    ],
    "courceDetails": {
        "courseOverview": "コンピュータにおけるセキュリティにまつわる最新の研究発表から本学の学生と関わりがあると判断される分野の研究を抜粋し、講義で紹介、解説する。また、講義中に解説した最新技術に関して、学生を交えた討論を行い、新規性、実用性の点や社会に与えるインパクトについてレポートにまとめるものとする。開講年度における最新の研究を取り上げるため、内容は年度ごとに異なる。可能であれば、セキュリティの研究に取り組んでいる技術者と直接対話できる場を設けたいと考えている。本講義により、学生の研究に対する興味の喚起と研究意欲の向上が期待される。この授業では主に論理的な思考力と問題解決力を身につけることを目的としている。さらに、実学に基づく専門能力を鍛えることを目指している。",
        "outcomesMeasuredBy": "セキュリティシステムに関する和文論文や英文論文を読めるようになり、その論文に書かれた技術的内容を説明できるようになる。授業中のディスカッション、課題を通して実学に基づく専門能力、論理的な思考力と問題解決力を養う。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "講義形式で行う。ただし、授業時間中に学生との対話、討論も行う。資料をオンラインで配布するためノートPCを必携とする。",
        "notices": "授業中に行われる討論に参加しない者には単位を与えない。コロナウイルス感染拡大の影響を鑑み、最前線で研究を行う技術者による特別講演を行わない場合がある。また、本講演は講演者の都合により日にちが変更となる場合がある。",
        "preparatoryStudy": "共通鍵暗号、公開鍵暗号、ハッシュ関数、デジタル署名の概要を理解する。プログラミング言語の種類は問わないが、条件文、繰り返し文、配列を扱うプログラミングスキルを授業開始までに必須とする。二進数の計算方法について授業開始までに修得している必要がある。予習として、次の回の授業で使用する論文の基礎的知識について、Web等を使用して確認する。復習として、論文中でディスカッションの対象となった箇所について、論文の内容と照合して再確認する。",
        "gradingGuidelines": "レポートと、毎回の講義時間中における討論と確認プリントを用いて成績評価を行う。まず、レポートを基準とし成績を付ける。討論は加点対象とせず、参加拒否1回につき1段階成績を下げる。確認プリントに関しては、著しく優れた内容のもの3回で1段階成績を上げ、著しく劣った内容のもの3回で1段階成績を下げる。討論のフィードバックはその場で行う。確認プリントおよびレポートは、採点後に物理的な方法または電子メールにてフィードバックを行う。",
        "textbook": "なし",
        "referenceMaterials": "論文を配布する。",
        "courseSchedule": "第1回：暗号化されたデータベースを扱う技術の解説および討論(ブルームフィルタ)第2回：コンテンツ保護に関するセキュリティ技術の解説および討論(映画スクリーンの裏から赤外線)第3回：バイオメトリクスに関するセキュリティ技術の解説および討論(グミの指と試験管の指)第4回：機械学習を用いたセキュリティ技術の解説および討論(機械学習)第5回：標的型攻撃に関するセキュリティ技術の解説および討論(標的型攻撃)第6回：演奏情報に対して情報を埋め込む電子透かし技術の解説および討論(MIDI透かし)第7回：最前線で研究を行う技術者による特別講演",
        "courseDataUpdatedAt": "2023\/12\/26"
    },
    "updateAt": "2024\/09\/13"
}