{
    "lectureCode": "GGM12601",
    "courseName": "Webアプリケーション技術特論",
    "lecturer": [
        "戀津魁(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金4"
    ],
    "targetDepartment": "バイオ・情報メディア研究科博士前期課程メディアサイエンス専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "講義実験棟２０２"
    ],
    "courceDetails": {
        "courseOverview": "Webアプリケーション技術特論では、Webアプリケーションの利用及び実装にあたって必要な各種技術について、ハードウェアやネットワーク通信、OS、ソフトウェアと広い範囲にわたって基礎的な内容を解説する。特にデータベース技術とそれに応じたデータ形式について、主流のものだけでなく幅広く触れデータ永続化についての汎用的な知見を伝える。また、HTML5及びCSS3、javascriptとそれらを利用したライブラリを用いて簡易なWebアプリケーションの実装を行い、それを通じてWebアプリケーション技術全般についての幅広い知識の習得を目指す。",
        "outcomesMeasuredBy": "パソコンへのLinuxのインストール及びネットワーク等の各種設定を行い、コンテンツの作成と配置をしてWebアプリケーションの公開を行えるようになることを目的とする。公開するWebアプリケーションについてはデータ形式及びデータ入出力経路についての簡易な設計も含め行えるようにする。ラーニングアウトカム重点項目：国際的な教養、実学に基づく専門能力",
        "learningOutcomes": "国際的な教養実学に基づく専門能力",
        "teachingMethod": "座学と演習を交え行う。技術概要について述べ、都度それを実践する形式をとる。学内に教員の用意したLinuxサーバへのログイン及び操作を行うため、ノートPCを必携とする。最終課題として班単位で簡易なWebアプリケーションの構築をするグループワークを行い、登壇しての相互発表会を通じて学生自らの主体的な学び（アクティブラーニング）を促す。",
        "notices": "最終課題では簡易なWebアプリケーション構築を行うが、班単位での作業を想定するため履修上必須の技術は指定しない。プログラム、デザイン、データ設計など必要技術は多岐に渡るが、未経験からでも調査と並行して達成できる難易度を想定する。",
        "preparatoryStudy": "予習として各回のテーマの技術について基本的な知識を調べておくこと（40分程度）授業の性質上多くの技術情報を紹介するが、主眼ではない場合単語の紹介に留め詳細な解説を行わないことも想定される。これらについて授業後の復習時間で各自調査し、授業資料の理解を補完しておくこと。（80分程度）",
        "gradingGuidelines": "授業内の演習時間において都度理解度の確認を行う。また、最終課題のグループワークで構築するWebアプリケーションを成果として成績判定する。そのため、試験形式など技術の完全な習得は目的とせず、授業資料並びにインターネット等で調査を行いながらの構築ができるようになることを確認する。理解度確認を20%、最終課題を80%で評価する。最終課題は発表会を行い、そこでフィードバックを行う。",
        "textbook": "指定なし",
        "referenceMaterials": "",
        "courseSchedule": "第1回Webアプリケーションに関わる技術の概要・俯瞰第2回ハードウェアとOSのインストール・設定第3回ネットワーク設定とコンテンツ公開第4回データベース技術とデータ形式の設計第5回HTML5・CSS3・javascript等のフロントエンド技術前編第6回前半：フロントエンド技術後編後半：最終課題グループワーク第7回最終課題相互発表会",
        "courseDataUpdatedAt": "2024/03/02"
    },
    "updateAt": "2024/09/13"
}