{
    "lectureCode": "GGM12001",
    "courseName": "メディアネットワーク特論",
    "lecturer": [
        "寺澤卓也(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "バイオ・情報メディア研究科博士前期課程メディアサイエンス専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "この科目ではIoT（InternetofThings）、センサーネットワーク、位置情報の利用など、ユビキタス環境の実現に利用可能な技術を学び、人間の活動を支援するネットワークについて理解を深める。",
        "outcomesMeasuredBy": "この科目で習得を目指すのは以下の項目である。・関連する論文の探し方と読み方・ネットワーク技術の体系的な理解・研究の評価手法の習得",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "基本的に、関連する研究論文（日本語/英語）を配布し、担当者を決めて輪講形式で授業を行う。輪講担当者は発表スライドとレジュメを用意する。受講者数によっては1つの論文を複数人で分担する可能性がある。毎回の授業の終わりには、教員がまとめと補足、関連トピックの紹介を行う。随時、Web検索等を行うため、ノートPCを使用するので持参すること。また、全員、最終レポートを作成する。オプションとして、数名のグループを結成して実際にシステム構築を行うミニプロジェクトを並行して遂行することを推奨する。対象システム、実現手法については担当教員とあらかじめ相談すること。適宜、進捗状況の報告を求める。最終回に成果発表を行うこと。遂行したメンバーには加点する。",
        "notices": "学部の授業科目のうち、ネットワークに関連する次の科目（または相当する科目）の理解を前提とする。・メディア学部1年次「インターネットシステム入門」・メディア学部1年次「システム基盤技術の基礎」・メディア学部3年次「ソーシャルコンピューティング論」",
        "preparatoryStudy": "論文は全員に配布する。輪講で発表する担当者以外も、あらかじめ論文に目を通し、概略を理解しておくこと（予習120分程度）。また、その論文の理解に必要と思われる項目についても調べて学習しておくこと。担当外の回は復習として論文を読み直し理解を深めること（120分程度）発表回については、発表者は指摘された点について再度確認し、資料の修正を行うこと（復習120分程度）。",
        "gradingGuidelines": "担当論文に関する理解、発表の質、資料の質（修正前/後のスライドとレジュメを提出）が50%、最終レポートが50%の比率で合計し、100点満点のうち60点に達した者に単位を与える。発表当日のスライドとレジュメを回収し、改善点を指示して再提出を求める。オプションのミニプロジェクトを遂行したグループのメンバーには、達成度に応じた加点を行う。",
        "textbook": "論文による輪講主体のため、特に用いない。",
        "referenceMaterials": "「M2M/IoT教科書」インプレスほか、適宜紹介する。",
        "courseSchedule": "第1回：イントロダクション、論文の配布と担当者の決定第2回：ユビキタス技術の歴史的経緯と現在の技術との関係第3回：輪講（1）担当者による発表（位置情報の利用など）第4回：輪講（2）担当者による発表（産業への応用など）第5回：輪講（3）担当者による発表（行政での利用など）第6回：輪講（4）担当者による発表（介護・福祉での利用など）第7回：まとめと最終レポート課題の提示",
        "courseDataUpdatedAt": "2024/03/01"
    },
    "updateAt": "2024/09/13"
}