{
    "lectureCode": "GH1002",
    "courseName": "臨床検査学研究方法論",
    "lecturer": [
        "佐々木聰(医療保健学部臨床検査学科)",
        "三上あかね(医療保健学部臨床検査学科)",
        "栗原由利子(医療保健学部臨床検査学科)",
        "岡崎充宏(医療保健学部臨床検査学科)",
        "奥橋佑基(医療保健学部臨床検査学科)",
        "榎本みのり(医療保健学部臨床検査学科)",
        "十島純子(医療保健学部リハビリテーション学科理学療法学専攻)",
        "澤田辰徳(医療保健学部リハビリテーション学科作業療法学専攻)",
        "友利幸之介(医療保健学部リハビリテーション学科作業療法学専攻)",
        "水野元貴(医療保健学部臨床検査学科)",
        "川又紀彦(医療保健学部臨床検査学科)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "医療技術学研究科修士課程臨床検査学専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "Ｍ６１１多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "臨床検査学領域に関する幅広い視野を有する高度な専門職業人として研究遂行に必要な質の高い国内外の論文抄読を行い、仮説の立案から科学的な検証に至るまでの研究過程における研究方法について学修する。本講義では、臨床研究の現状と課題、研究倫理、レギュラトリーサイエンス、統計、データ解析、データベース検索、データ分析を学び、研究遂行能力を修得する。また自ら新しい研究テーマを探求・遂行できるよう将来の展望も含め解説する。",
        "outcomesMeasuredBy": "研究論文作成や研究発表の概要を学び、論文投稿の基礎知識を修得する。実学の基づく専門能力、分析・評価能力に加え、論理的な思考力、問題解決力、コミュニケーション能力をつける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義を中心とする。統計等に関しては演習も行う。オムニバス方式（全15回）。",
        "notices": "研究遂行に必要な知識を教授するので、疑問があれば積極的に質問等を行うこと。",
        "preparatoryStudy": "配布される資料をもとに事前学習すること。",
        "gradingGuidelines": "受講中の討議への参加態度（40％）、レポート（60％）などにより総合的に評価する。",
        "textbook": "特に指定しない。資料は教員側が授業前に準備し配信する。",
        "referenceMaterials": "特に指定しない。",
        "courseSchedule": "第1回：（栗原）実験データのまとめ方について解説する。第2回：（岡崎）発表論文等を通して生物学・医学の研究の現状を紹介し、研究課題の流れを中心に解説する。第3回：（澤田）発表論文等を通して生物学・医学の研究の現状を紹介し、研究手法の新旧の比較を含めて解説する。第4回：（友利）生物学・医学の研究の現状を紹介し、実験データの評価の仕方をデータベース検索も含め解説する。第5回：（川又）生物学・医学の研究を開始する前に行っておくべき事・準備手順・注意点を解説する。巻き込まれやすいトラブルを避けるための法令に関する知識とその注意点も併せて解説する。第6回：（三上）生物学・医学の研究の現状の検討から、新しい方法論の開発も含め解説する。第7回：（栗原）実験データのまとめ方、結果の妥当性の検討について解説する。第8回：（十島）研究対象について、その研究背景を調べ、学術的問いを明らかにする過程を、実例を交えて解説する。第9回：（十島）学術的問いを決定した研究対象について、具体的な研究テーマを決定していく過程を、実例を交えて解説する。第10回：（佐々木）論文作成における背景・目的について、論理的に記述する手法の基礎について例を交えて解説する。第11回：（佐々木）得られたデータをまとめて報告するうえで、実験から結果まで論理的に記述する手法の基礎について例を交えて解説する。第12回：（榎本）論文作成時の考察について、論理的に記述する手法の基礎について例を交えて解説する。第13回：（水野）実臨床における検査データの利用方法と解析手法について、例を交えて解説する。第14回：（奥橋）直近の臨床及び臨床検査の研究論文記載を解析することにより、研究根拠と研究構成の重要性を習得する。第15回：（佐々木）全体を総括する。",
        "courseDataUpdatedAt": "2025/01/17"
    },
    "updateAt": "2025/03/21"
}