{
    "lectureCode": "GH1001",
    "courseName": "医療技術学概論",
    "lecturer": [
        "岡崎充宏(医療保健学部臨床検査学科)",
        "篠原一彦(医療保健学部臨床工学科)",
        "佐々木聰(医療保健学部臨床検査学科)",
        "苗村潔(医療保健学部臨床工学科)",
        "日向奈惠(医療保健学部臨床工学科)",
        "栗原由利子(医療保健学部臨床検査学科)",
        "廣田雅子(医療保健学部臨床検査学科)",
        "中川和美(医療保健学部リハビリテーション学科作業療法学専攻)",
        "田仲浩平(医療保健学部臨床工学科)",
        "榎本みのり(医療保健学部臨床検査学科)",
        "十島純子(医療保健学部リハビリテーション学科理学療法学専攻)",
        "笠井亮佑(医療保健学部臨床工学科)",
        "清水潤(医療保健学部リハビリテーション学科理学療法学専攻)",
        "水野元貴(医療保健学部臨床検査学科)",
        "川又紀彦(医療保健学部臨床検査学科)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "Ｍ６１１多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "医療技術の進歩は高度医療の進展に欠かせないものであり、最新の医療技術や理論に対応し自らの研究能力を高めるため、専門分野に偏ることなく広い視野を持って課題に対応することが必要不可欠である。研究能力を養う目的で、医療技術だけでなく広く医療に関連する最新の研究事例を紹介し、関連分野の知識を学ぶ。本講義では、臨床検査分野だけでなく医療分野や医療技術に関連する分野での最新研究、具体的には新しい検査法・診断技術の紹介や医療技術へ応用可能な最先端の基礎的研究等を紹介する。",
        "outcomesMeasuredBy": "医療技術分野の最新研究について俯瞰する。実学の基づく専門能力、分析・評価能力に加え、論理的な思考力、問題解決力、コミュニケーション能力をつける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義形式。オムニバス方式（全15回）。",
        "notices": "日頃から医療分野のニュースやトピックスに関心を持つこと。",
        "preparatoryStudy": "事前に配布される資料を精読すること。",
        "gradingGuidelines": "授業への参加度（40％）、レポート（60％）により総合的に評価する。",
        "textbook": "特になし",
        "referenceMaterials": "必要なら講義内で紹介する。",
        "courseSchedule": "4月8日第1回：（栗原）生化学検査学に関する最新のトピックスを紹介し、解説する。4月15日第2回：（清水）人の様々な骨格筋病態に関して説明し、治療法開発や病態解明の展望を解説する。4月22日第3回：（水野）検体検査（化学検査、血液検査等）に関する最新のトピックスを紹介し、その展望と課題について考察する。5月6日第4回：（岡崎）微生物学及び臨床微生物学に関する最新のトピックス（遺伝子検査や質量分析等）を紹介し、解説する。5月13日第5回：（川又）最新の治療学（分子標的療法・抗体療法・免疫チェックポイント阻害剤・二重特異抗体薬・CAR-T細胞療法・遺伝子治療など）と、その効果を事前に推測するための臨床検査技術の動向について概括する。5月20日第6回：（榎本）生理検査学の視点から捉えた医療技術学の展望と課題について最新の知見を提示し教授する。5月27日第7回：（佐々木）臨床検査分野に応用が期待される各種分析機器の原理と応用例を紹介する。6月3日第8回：（篠原）内視鏡外科手術やInterventionalRadiolotyに代表される低侵襲治療の概要と進歩について解説する。6月10日第9回：（田仲）臨床検査分野の生体計測・治療機器に関する最新トピックスを紹介、解説する。6月17日第10回：（十島）臨床検査分野にも関連する生命科学研究について、分子レベルでの研究を中心に、最近の知見を解説する。6月24日第11回：（苗村）臨床検査及び治療で行なわれる針の穿刺技術に関する最新のトピックスを紹介し、解説する。7月1日第12回：（中川）電気生理学を中心とした精神生理学的な手法による神経・精神機能の評価やその応用に関する最新の話題について解説する。7月8日第13回：（廣田）血液検査のクオリティマネジメントシステムに関する国際的動向について解説する。7月22日第14回：（笠井）臨床検査分野に関連した生命維持管理装置の概要と最新のトピックスを解説する。7月29日第15回：（日向）統括及び討論を行う。",
        "courseDataUpdatedAt": "2024\/04\/17"
    },
    "updateAt": "2024\/05\/29"
}