{
    "lectureCode": "K000231",
    "courseName": "サステイナブル工学基礎[AB][電]",
    "lecturer": [
        "江頭靖幸(工学部応用化学科)",
        "高橋秀智(工学部機械工学科)",
        "木村康男(工学部電気電子工学科)",
        "野田龍介(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "メディアホール",
        "片柳研究所Ｅ２０２"
    ],
    "courceDetails": {
        "courseOverview": "サステイナブル工学とは、持続可能な社会（サステイナブル社会）の実現に貢献するために、研究や技術開発において、ライフサイクル思考に基づいてplanet（地球環境との調和）、people（生活の質の向上）、prosperity（経済の活性化）という3つの視点を同時に考慮し、それぞれを望ましい水準に保つとともに、将来に渡って維持・向上する方向での科学的なアプローチを実践する工学である。本授業では、サステイナブル工学を実践する研究者や技術者の必須要件として、工学技術の新たな基盤となるライフサイクル思考をはじめ、環境やエネルギーの問題とその解決に向けた機械工学、電気電子工学、応用化学の各分野における技術的な課題や対策事例、ならびに製品等のサステイナビリティの測定に有効な指標や分析・評価を可能とするライフサイクルアセスメント等の手法について包括的に学ぶ。",
        "outcomesMeasuredBy": "本授業科目では以下を到達目標とする。１）サステイナブル工学のはたすべき役割について理解し、説明できる。２）環境やエネルギー問題の全体像を把握し、今後の方向性等について考察できる。３）機械工学、電気電子工学、応用化学分野における環境・エネルギー関連の技術的な課題や対策事例を説明できる。４）ライフサイクルアセスメント、環境効率等の指標や分析・評価手法について理解し、技術や製品のサステイナビリティ評価への応用について考察できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "講義は教科書に沿って進め、適宜補助資料を参照する。基本は三学科合同での授業だが、途中各学科に分かれてより専門的な講義と学内設備の見学等を行う。受講者は聴講に加え、与えられた演習課題やワークシートに取り組みサステイナブル工学に関する知識と評価手法を習得していく。また、講義の中間および最終段階では提示された課題についてグループワークによる討議等を行い、問題の理解度を受講者が相互に確かめつつ解決策を検討する。さらに、自身の考察内容を個別のレポートにまとめ、知識の整理と高度化を図る。授業中の演習課題等では学習支援システムmoodleを利用するので授業に際してノートPCは必須である。",
        "notices": "本講義で多くのデータを紹介する「環境白書」および「エネルギー白書」の最新版をダウンロードし、講義期間中に一度は必ず目を通すこと。",
        "preparatoryStudy": "授業前に必ず下記教科書の当該部分を一読し、概要を把握しておく。(30分程度)授業後は教科書に掲載された演習問題に取り組むとともに、講義や討議の内容を次回までに整理する。また、ワークシート等の課題が与えられた場合は、期限を厳守し必ず提出すること。（90分程度）",
        "gradingGuidelines": "各授業で行う小テスト･演習課題等による理解度チェック（50％）、レポートの内容（20％）、期末試験の成績（30％）により総合的に評価する。なお、各％は目安である。",
        "textbook": "・芝池成人編著「サステイナブル工学基礎」（コロナ社、2018）",
        "referenceMaterials": "・第1回：サステイナブル工学入門（概要、ライフサイクル思考、役割）（江頭教員･野田教員）・第2回：環境問題の現状（全体像、地球温暖化問題、その他の環境問題）（江頭教員･野田教員）・第3回：エネルギー問題の動向（エネルギー情勢、対策、省エネ技術）（江頭教員･野田教員）・第4回：サステイナブル材料（応用化学分野の技術課題や対策事例）（全教員）・第5回：サステイナブル設計・製造（機械工学分野の技術課題や対策事例）（全教員）・第6回：サステイナブル電気電子工学（電気電子工学分野の技術課題や対策事例）（全教員）・第7回：省エネルギー･リサイクル施設の実際（原動設備、ゴミ収集場、再生可能エネルギー実験施設）（全教員）＊第4回～第7回は学科別の授業とし、開講順序は学科により異なる。・第8回：中間まとめ（前半の復習、ワークシート作成）（江頭教員･野田教員）・第9回：グループ討議1（環境問題等について討論、レポート作成）（江頭教員･野田教員）・第10回：ライフサイクルアセスメント（概要、国際標準規格の内容）（江頭教員･野田教員）・第11回：製品の環境効率評価（概要、ファクターX、等）（江頭教員･野田教員）・第12回：サステイナビリティの評価（各種評価指標、全体評価）（江頭教員･野田教員）・第13回：グループ討議2（製品評価等について討論、レポート作成）（江頭教員･野田教員）・第14回：サステイナブル工学の展望（最終まとめ）（江頭教員･野田教員）",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/02\/06"
    },
    "updateAt": "2024\/09\/13"
}