{
    "lectureCode": "K500201",
    "courseName": "微分積分I(1Q)",
    "lecturer": [
        "大久保友雅(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3",
        "金"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義実験棟４０３"
    ],
    "courceDetails": {
        "courseOverview": "工学では，時間，長さ，重さ，物の量などいくつもの変量の関係を式で表すことは不可欠である．特に，変数の変化量の割合を表す微分という演算と，その逆演算もしくは累積値を表す積分という演算はそれらを操るのに必須である．本講義では，簡単な物理現象を取り上げながら，実学としての工学に必要な数学的基礎知識として，微分・積分の基本的な概念，理論，解析手法を身につける．具体的には，身近な物理現象を紹介しながら微分積分学の導入を行い，微分と導関数，積分と原始関数また，微分の幾何学的意義，べき関数の微分積分，合成関数の微分，極大値・極小値などについて学修する．理工学における基本的な英語の語彙や語法を身につけるため，定評ある洋書テキストを教科書として用い，国際的な理工系の文書を読む．",
        "outcomesMeasuredBy": "本講義科目においては，本学の「６つのラーニングアウトカムズ」のうち・論理的な思考力・実学に基づく専門能力の育成・向上を目指す．具体的には以下を到達目標とする．・位置，速度，加速度と微分・積分の関係を理解し，説明できるようになる．・微分・積分の幾何学的意味を理解し，説明できるようになる．・時間発展だけではなく，空間内における変化量が取り扱えるようになる．・チェインルール等微分積分に必要な計算手法が使えるようになる．・英語の教科書を読み解き，国際的な理工系の文書が読めるようになる．",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "基本的には英語のテキストに沿って，プロジェクター，黒板等を用いて日本語で講義形式で授業を行う．また，出席確認やmoodleを用いた理解度チェックではPCを使うことがあるため，ノートPC必携とする．",
        "notices": "高校数学の内容を良く復習しておくこと．また，テキストが英語である事から，高校英語の内容も良く復習しておくこと．また，自筆のノートを取る事を必須とする．",
        "preparatoryStudy": "復習・予習を十分に行うこと．演習問題を解き，自ら力をつけること．具体的には，テキストが英語である事から，予習に際してはその内容を全て理解出来なくても構わないが，不明な単語は調べてくること（60分程度）．また，各回に課されている課題を提出すること（60分程度）",
        "gradingGuidelines": "最終回の総まとめの理解度チェックの配分を6割とし，残りの4割については各回の理解度チェック，授業態度などを考慮して評価する．なお，総点で6割を下回った場合は単位は認めない．なお，本講義は第一クォーターに実施されるため，期末試験は実施しない．",
        "textbook": "MorrisKline,“CALCULUS–AnIntuitiveAndPhysicalApproach”,Dover(1998)",
        "referenceMaterials": "授業の各回での内容は以下の通りとする．なお，括弧内の数字はテキストの章に対応する．第1回:導入：何故微分積分を学ぶのか．物の動きについて時間と位置の関係から関数とは何かを学ぶ(1,2)第2回:移動距離と速度との関係等から微分を学ぶ(2)第3回:速度と移動距離との関係等から積分を学ぶ(3)第4回:微分の幾何学的な意味を理解する(4)第5回:微分積分の基本的な公式を学ぶ(5,6)第6回:チェインルールを学ぶ(7)第7回:極大と極小について学ぶ(8)第8回:定積分について学ぶ(9)第9回:三角関数について学ぶ(10)第10回:逆三角関数について学ぶ(11)第11回:対数関数，指数関数について学ぶ(12)第12回:平均値の定理，様々な積分の手法について学ぶ(13,14)第13回:定積分の応用例：幾何学的な意味を考える(15)第14回:総まとめ",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/02\/03"
    },
    "updateAt": "2024\/09\/13"
}