{
    "lectureCode": "K500301",
    "courseName": "微分積分II",
    "lecturer": [
        "松永栄一(兼任講師)",
        "野田龍介(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火5"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義棟Ｄ３０１"
    ],
    "courceDetails": {
        "courseOverview": "微分積分Iで学んだ内容を前提として、簡単な物理現象も取り上げながら、工学に必要な微分・積分の理論や解析手法を学ぶ。まず、多項式関数・有理関数の微分と積分の関係について確認した後、三角関数・逆三角関数、対数・指数関数、平均値の定理について学び、これらの微分・積分法を身に付ける。さらに、多変数関数やテーラー展開について学び、機械工学の学修に必要な微分・積分法を身に付ける。授業では、ノートPCによる数式処理システムを用いた微分・積分の数式処理やグラフ描画を通して、論理的な思考力と実践的な微分・積分の適用法を身に付ける。なお、理工学における基本的な英語の語彙や語法を身につけるため、定評ある洋書テキストを教科書として用いる。",
        "outcomesMeasuredBy": "本講義科目においては、工学部機械工学科の「８つのラーニングアウトカムズ」のうち・実学に基づく専門能力・論理的な思考力・分析・評価能力・機械や機械システムの基本原理に関わる理論や技術の育成・向上を目指す。具体的な到達目標は以下の通りである。１．初等関数の微分・積分計算の修得２．多変数関数の微分・積分計算の修得３．具体的な物理系や機械システムへの微分積分の適用方法の修得４．数式処理システム(Maxima)による微分・積分の計算およびその計算結果の視覚化の方法の修得",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "指定した教科書に沿って作成した講義資料を基に、黒板とプロジェクターを用いて日本語で解説を行う。また各回の内容に関連した問題についての演習を行う。教科書以外の資料(講義資料、提出課題およびその解答、その他の補足資料)は本講義のホームページに掲載する。また、ノートＰＣによる数式処理システムを用いて計算結果やグラフを確認しながら講義を進めるので、授業時にはノートPCを必携とする。",
        "notices": "理工学における基本的な英語の語彙や語法を身につけるため、定評ある洋書テキストを教科書として用いるので、必ず用意すること。また、講義ページに提示した資料は内容を確認したうえで講義に参加すること(講義資料中の練習問題にも取り組むこと)。期末試験では、講義資料、板書した内容および演習内容の理解度を確認するので、必ずノートを取ること。また、ノートＰＣ（Windowsベース）による演習も行うので、ノートＰＣを必携すること。高校での数学、および、数学基礎あるいは数学概論、微分積分I、基礎力学、機構学の内容を理解していることを前提に授業を進めるので、これらの内容をよく復習をしておくこと。",
        "preparatoryStudy": "予習では、講義ページに掲載する講義資料の内容を確認し、講義資料中の練習問題にも取り組むこと(120分程度)。また講義資料のみだけでなく、教科書の該当箇所にも目を通し理解を深めておくこと。必要であれば教科書にある関連問題にも取り組むこと(60分程度)。授業後は毎回の提出課題の解答を、指定した期限までに必ず提出すること(100分程度)。復習では、各回の提出課題で解けなかった問題について、解答例をみて解法を理解すること。この際に、単に解答例の資料を眺めるのではなく、ノートに計算を実行すること(出来なかった問題×15分程度)。",
        "gradingGuidelines": "各回の提出課題の解答内容と期末試験の成績によって評価する（提出課題４０％、期末試験６０％の比率で評価する）。",
        "textbook": "MorrisKline,“CALCULUS–AnIntuitiveandPhysicalApproach”,Dover(1998)",
        "referenceMaterials": "\"松坂和夫、他訳「S.ラング解析入門」（岩波書店）村上仙端「直感でつかむ大学生の微積分」（東京図書）佐々木隆宏「数学の基本ノート［微分積分編］」（KADOKAWA）吉田武「オイラーの贈物」（東海大学出版会）赤間世紀「Maximaで学ぶ微分積分」（工学社）",
        "courseSchedule": "第1回.微分積分Iの復習（全教員）第2回.MAXIMA入門（全教員）第3回.定積分の幾何学的応用について学ぶ(Ch.15)（全教員）第4回.定積分の物理的応用について学ぶ(Ch.16)（全教員）第5回.極座標について学ぶ(Ch.17)（全教員）第6回.パラメータ方程式と曲線運動について学ぶ1(Ch.18)（全教員）第7回.パラメータ方程式と曲線運動について学ぶ2(Ch.19)（全教員）第8回.これまでのまとめとしての演習（全教員）第9回.テーラー展開と級数展開について学ぶ1(Ch.20)（全教員）第10回.テーラー展開と級数展開について学ぶ2(Ch.20)（全教員）第11回.多変数関数について学ぶ(Ch.21)（全教員）第12回.偏微分について学ぶ(Ch.22)（全教員）第13回.多重積分について学ぶ(Ch.23)（全教員）第14回.講義のまとめ(総合演習)（全教員）",
        "courseDataUpdatedAt": "2024\/02\/03"
    },
    "updateAt": "2024\/09\/13"
}