{
    "lectureCode": "K501901",
    "courseName": "計測工学",
    "lecturer": [
        "高橋秀智(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０３"
    ],
    "courceDetails": {
        "courseOverview": "自然科学や工学においてものの諸元や現象に関する知見を共有するためには、単位を決め、観察・実験などを通して数値化する「計測」が必要であり、科学的にものごとを進める基本となる。そして、単に数値化するだけでなく、その手法、統計処理などを総合したものが計測工学であり、工学・工業において欠くことのできない基盤技術である。本科目では、計測における精度と誤差の取り扱い、計測データの解析方法など、計測の基礎について学ぶ。さらに、各種物理量の計測方法と原理について学び、機械工学の分野で必要となる計測技術の基礎を身につける。",
        "outcomesMeasuredBy": "本授業科目では，本学の「６つのラーニングアウトカム」のうち・実学に基づく専門能力・分析・評価能力・問題解決力の３つを目指し，より具体的には以下を到達目標とする。本科目の修得により、計測工学の全般的な知識と機械工学において基本的な計測原理に関する系統的な知識に加え、目標とする計測データを取得する最適な方法を選択できる論理的な思考力を身につけること、さらに得られた計測データを適切に処理し、必要な情報を取り出す手法を身につけることを目指す。具体的には、以下の項目ができるようになる。１）計測における概念と用語を理解し、説明できる。２）国際単位系を理解し、説明できる。３）長さ、角度、力、温度、振動、流量などの機械工学における基本的な測定について、測定原理と手法を理解し、説明できる。４）要求するデータを取得するために適した計測手法を選択することができる。５）測定データを正しく取り扱うことができ，必要な情報を取り出すことができる。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力問題解決力",
        "teachingMethod": "講義は市販のテキストを用い、適宜MicrosoftPowerpointにまとめた資料を適宜参照し、講義中の演習課題や、その他の演習課題により、理解度を確認しながら授業を進める。",
        "notices": "講義ノートを必ず作成し，授業の要点等をまとめながら受講すること．また，授業開始時に配布される演習課題は，当日の講義の理解度チェックに役立つので必ず解答し提出すること．提出した演習課題は，次週までに採点し返却されるので，見直しを行い，正しい解答をノートに記載すること．手書きのノートのみ期末試験の持ち込みを可能とするので，ノートには資料等を貼り付けないこと．",
        "preparatoryStudy": "予習：前日19時までに資料が公開されるので，テキストの該当範囲を読み，講義資料に目を通し、重要語句とその概要をノートにまとめて置くこと。復習：行った演習が電子的に返却されるので、解答を確認して、ノートに正しい解答をまとめる。予習・復習合わせて120分程度行うこと。",
        "gradingGuidelines": "授業への取組み姿勢（40%）、演習課題等による理解度チェック（30%）、期末試験の成績（30%）により、総合的に評価する。なお、各％は目安である。",
        "textbook": "中村邦夫編著、計測工学入門（第３版・補訂版）、森北出版",
        "referenceMaterials": "",
        "courseSchedule": "第1回：計測の基礎(1)第2回：計測の基礎(2)，長さ・角度・形状の測定(1)第3回：長さ・角度・形状の測定(2)第4回：長さ・角度・形状の測定(3)第5回：力・圧力等の測定第6回：温度・湿度等の測定(1)第7回：温度・湿度等の測定(2)第8回：ここまでのまとめ・到達度チェック、ノートチェック第9回：真空度の測定，時間等の測定(1)第10回：時間の測定(2)，流量等の測定第11回：光と放射線の測定第12回：電気計測第13回：PCによるデータ処理演習第14回：最新の計測技術・本講義のまとめ",
        "courseDataUpdatedAt": "2025/01/07"
    },
    "updateAt": "2025/03/21"
}