{
    "lectureCode": "K501301",
    "courseName": "電気電子回路II",
    "lecturer": [
        "上野祐樹(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "機械システムが有効に機能するためには，要素や機器同士の間でさまざまな情報を授受したり，信号波形の整形や成分の抽出，除去などの処理を施す必要がある．このために，情報を電圧や電流として取得，あるいはこれらに変換して，電子回路によって信号処理を実現する場合が少なくない．一方，モータなど電気エネルギーで作動する要素に望みの動作をさせるためには，電力を信号で制御する電子回路が必要になる．この授業では，１年次後期の「電気電子回路I」で学んだ内容を基礎に，主に信号処理や電力制御に使われる電子回路の原理と解析・設計手法を学ぶ．まず，電気回路の基礎を復習したあと，受動素子による電気回路について周波数特性の概念を学ぶ．次に，電子回路の基本としてトランジスタなどの能動素子による増幅回路を取り上げる．さらに，実際の機器でよく用いられる演算増幅器（オペアンプ）を用いた信号処理について扱う．実験を行う代わりに，標準的な回路シミュレータを用いて，各素子の働きや回路の性質の実践的な理解を目指す．本科目で得られる知識や技術は，メカトロニクス，制御，ロボットに関する講義や実験，卒業研究のための重要な基盤となる．",
        "outcomesMeasuredBy": "本授業科目では，本学の「６つのラーニングアウトカムズ」のうち・国際的な教養・実学に基づく専門能力・論理的な思考力・分析・評価能力・問題解決力の５つを目指し，より具体的には以下を到達目標とする．1）トランジスタなどの能動素子や演算増幅器（オペアンプ）を用いた増幅回路の原理を理解し，簡単な設計ができるようになること2）電気電子回路の周波数特性について基礎を習得し，その概念を説明できるようになること3）1），2）の基本法則や定理を用いて数式による特性計算ができること4）標準的な回路シミュレータを使ったアナログ電子回路の解析・設計法について交流解析などの応用手法を体得し，これらのシミュレーションや解析を実行して結果を説明できるようになること5）電気電子回路に関する基本的な英語の技術用語や語法を理解し，説明できること",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "「電気電子回路I」の内容を受け，ダイオードやトランジスタ，FETなどの能動素子を用いた増幅回路，オペアンプを用いた増幅回路やフィルタ回路を対象とする．毎回の講義，演習，予習課題，レポート課題の内容は，授業専用のウェブサイトにスライドとして掲載する．授業では，基本概念の講義，必要最小限の数式計算に加えて，原則として毎回，回路シミュレータを活用して具体的な例題や演習問題を受講生自身が自分でシミュレーションし結果を観察・考察するアクティブラーニングによって，より直感的な理解とその定着を図る．回路シミュレータには，「電気電子回路I」と同じくMATLAB\/Simulink，Simscapeを利用する．回路シミュレータや専用ウェブサイトを活用するためWindowsを搭載したノートPC必携．必要なソフトウェアのインストールについては初回に説明する．さらに，電気電子回路や理工学における基本的な英語の語彙や語法を身につけるため，これも「電気電子回路I」と同じ実用志向の英語の教科書を用いる．ただし，講義は日本語で行う．",
        "notices": "「電気電子回路I」を履修済みであること．",
        "preparatoryStudy": "・予習：次回取り扱う内容やシミュレーション方法について説明している動画を視聴し，スライドにまとめる（60分程度）・復習：授業時間中にまとめられなかった演習をスライドにまとめる（60分程度）",
        "gradingGuidelines": "予習方向（10%）と演習報告（30%），中間レポート２回（40%），最終レポート（20%）の結果によって評価する．課題やレポートの解説，フォローアップは授業時間中に行う．",
        "textbook": "・Scherz,Monk:PracticalElectronicsforInventors,McGraw-Hill(2016)",
        "referenceMaterials": "・高木，編著：アナログ電子回路，オーム社（2011）・藤井：なっとくする電子回路，講談社（1994）",
        "courseSchedule": "第1回：授業概要，ダイオードの特性第2回：ダイオードの基本特性第3回：整流回路第4回：トランジスタの基本特性第5回：中間演習１第6回：エミッタ接地型回路第7回：エミッタ接地型増幅回路第8回：エミッタ接地型増幅回路の周波数特性第9回：中間演習２第10回：MOSFETと基本回路第11回：MOSFETのスイッチング動作第12回：オペアンプとオペアンプIC第10回：非反転増幅回路第14回：パッシブフィルタとアクティブフィルタ",
        "courseDataUpdatedAt": "2024\/02\/06"
    },
    "updateAt": "2024\/09\/13"
}