{
    "lectureCode": "K501401",
    "courseName": "プログラミング応用(M)",
    "lecturer": [
        "加藤太朗(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金",
        "金2"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ３０３"
    ],
    "courceDetails": {
        "courseOverview": "機械工学分野の研究開発のツールとして，プログラミング環境を利用したソフトウェア開発が欠かせない．特に，ある程度規模の大きなソフトウェアや高機能のアプリケーションを効率的に開発するには，オープンソースソフトウェアなど外部で開発された既成のライブラリを，IDE（統合開発環境）上で活用することが有効である．これらはそれぞれの専門的な知識はもちろん，PC等によるデータ処理方法の基本的な概念を身に付けていなければ実現できない．本講義では，プログラミング基礎（M）で学んだプログラミングの基礎知識とC言語の手法をふまえて，機械工学分野における計測・制御やデータ解析に必要なプログラムの概念や基本技術，数値計算の基礎に加え，マイクロコントローラを用いたデータの処理方法やGUI(GraphicalUserInterface)による情報提示方法について理解することを目指す．なお，この科目は企業での実務経験をもつ講師により，学生自らが能動的にプログラミングを学習する実践的講義科目である．",
        "outcomesMeasuredBy": "本授業科目では，本学の「６つのラーニングアウトカム」のうち・実学に基づく専門能力・論理的な思考力・分析・評価能力・問題解決力の4つを目指し，より具体的には以下を到達目標とする．1)差分や積分，平均など数値計算の基礎が理解でき，プログラムで実装できること2)計測制御系のプログラム構造が理解できること3)マイクロコントローラを用いた信号取得方法が理解できること4)時系列データの取り扱いが理解できること5)GUIの構造について理解でき，構築できること",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業は講義と演習課題を組み合わせて行う．初回を除き次回講義時間までに予習資料の閲覧と予習課題へ取り組むことを前提とし，講義時間では前回の課題の解説や講義内容の補足説明，質疑応答を行ったのち，演習課題を公開し，残りの時間で課題に取り組む．ノートPCを用いてプログラミングを行うため，ノートPC必携である．",
        "notices": "1年次後期のプログラミング基礎の内容を修得済みであることを前提とする．",
        "preparatoryStudy": "本講義では次回の講義開始までに講義動画を閲覧し，内容を理解しておく（40分程度），お予習資料の演習問題および課題があり，講義開始までに提出する（100分程度）．",
        "gradingGuidelines": "講義中の演習課題（50%），任意提出の演習課題（10%），総合演習（40%）によって評価する．2回目以降は授業の冒頭で，前回の課題の解説や，質問対応することで理解を深められるようにする．",
        "textbook": "指定しない",
        "referenceMaterials": "やさしいC第4版(「やさしい」シリーズ)：高橋麻奈，ソフトバンククリエイティブCによる数値計算法入門：堀之内總一ほか，森北出版株式会社アプリを作ろう!VisualC++入門：WINGSプロジェクト，日経BP社",
        "courseSchedule": "第1回：ガイダンス，プログラミングの復習(関数，構造体)第2回：プログラミングの復習(数値計算)第3回：クラスの利用第4回：GUIの作成1（GUIの基本構造と簡単なアプリケーションの作成）第5回：GUIの作成2（データや状態の表示）第6回：GUIの作成3（グラフの表示）第7回：静止画の画像処理第8回：動画の画像処理第9回：入力装置としてのArduinoの利用1第10回：入力装置としてのArduinoの利用2第11回：エンコーダデータの処理第12回：センサデータとノイズ第13回：フィルタリング処理の基礎第14回：総合演習",
        "courseDataUpdatedAt": "2024\/02\/05"
    },
    "updateAt": "2024\/09\/13"
}