{
    "lectureCode": "K502401",
    "courseName": "システム制御基礎",
    "lecturer": [
        "禹珍碩(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "工学部機械工学科,工学部電気電子工学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "ものを操る技術の基本は、部屋の温度を一定に保ったりロボットの関節を目標角度に動かしたりするシステム制御技術である。本講義では、フィードバック制御系の解析法と設計法について学習する。まず、制御工学の発展の歴史を振り返りながら、「制御とは何か」や「フィードバック制御の設計法とは何か」について考察し、制御の考え方を学ぶ。次に、制御対象のモデリング方法、システムの伝達関数表現方法、応答の計算方法、制御系の設計法およびコンピュータによる制御系の実装法について学習し、ロボットなどのメカトロシステムに応用できる実践的な制御技術を身に付ける。また、MATLABを用いた演習により、具体的な対象に対する安定性や応答波形の論理的な考察力と、制御系を分析・評価する力を身に付ける。講義では専門用語の英語表現も学ぶ。",
        "outcomesMeasuredBy": "本授業科目では以下を到達目標とする。１．フィードバック制御の考え方を説明できる２．ブロック線図、伝達関数、システムの応答と安定性の導出ができる３．制御系のシミュレーションを行うことができる",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本授業は、主にパワーポイントスライドと黒板を用いて解説するが、演習やノートＰＣ（Windowsベース）によるシミュレーションにより理論を確認しながら学習を進める。また、教科書を補足する資料等は講義のホームページに掲載されるため、講義中もノートＰＣを利用する。また、専門用語の英語表現を説明しながら、講義・演習を行う。",
        "notices": "微分積分、線形代数、微分方程式、基礎力学、電気電子回路、機械力学、プログラミング基礎などで学んだ内容を基礎とするので復習しておくこと。実例の解析の順にしたがって解説を行うので、講義内容は必ずしも教科書の記載に添ったものではない。板書した内容を必ずノートにとって確認すること。板書した内容に基づいた演習課題、試験問題が出題される。講義、演習中にノートＰＣを利用したシミュレーションも行うため、ノートＰＣを準備すること。欠席の場合は速やかに教員へ連絡し、教員の指示を受けること。",
        "preparatoryStudy": "講義の授業、演習の授業とも、授業内容の解説資料が講義サイトに順次掲載される。予習では、予定された内容について対応するテキストの部分と掲載資料を読み、予習課題を講義サイトに期限までに提出すること。（60分程度）また、復習では、掲載された講義日の演習問題について解答例をみて自身の解答を確認し、ノートPCによるシミュレーションを十分に行うこと。（100分程度）",
        "gradingGuidelines": "授業中の演習課題（予習課題、宿題課題も含む）と中間理解度確認テスト、そして総合理解度確認テストの成績によって評価する(演習課題６０％、中間理解度確認テスト２０％、総合理解度確認テスト２０％の比率で評価する)。",
        "textbook": "余錦華、禹珍碩、大山恭弘「英語で学ぶ制御システム設計（Introductiontolinearcontrolsystemdesign）」（コロナ社）",
        "referenceMaterials": "以下の資料を参考に作成した授業資料を配布予定斉藤制海、徐粒「制御工学」（森北出版）GeneF.Franklin,etal.,FeedbackControlofDynamicSystems,GlobalEdition.PEARSON示村悦二郎「自動制御とは何か」）（コロナ社）橋本洋志、他「Scilabで学ぶシステム制御の基礎」（オーム社）川田昌克、他「MATLAB\/Simulinkによるわかりやすい制御工学」（森北出版）川原篤生「ラダー図によるH8マイコン活用入門」（CQ出版）",
        "courseSchedule": "第1回システムの表現１：システムのモデリングとは何か第2回システムの表現２：ラプラス変換と動的システムのモデリング第3回制御系の解析１：ラプラス変換とブロック線図第4回制御系の解析２：ブロック線図と等価変換、MATLABによる計算（１）第5回制御系の解析３：伝達関数の一次系と二次系の時間応答と安定性第6回制御系の解析４：ラウスの安定判別法第7回周波数応答、前半のまとめ第8回制御系の解析５：制御系の設計と安定性第9回制御系の解析６：フィードバック系の安定性第10回制御系の解析７：ボード線図の求め方、MATLABによる計算（２）第11回制御系の設計と実装１：時間領域における制御系設計第12回制御系の設計と実装２：周波数領域における制御系設計第13回制御系の設計と実装３：アームロボットのPI制御問題検討第14回後半のまとめ",
        "courseDataUpdatedAt": "2024\/02\/05"
    },
    "updateAt": "2024\/09\/13"
}