{
    "lectureCode": "K503501",
    "courseName": "機械創造応用[挑戦]",
    "lecturer": [
        "上野祐樹(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金4",
        "金5"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟１０１",
        "講義実験棟１０２",
        "講義実験棟１０３",
        "講義実験棟１０４"
    ],
    "courceDetails": {
        "courseOverview": "一般に広く認知されたロボットコンテストに挑戦する過程を通して，機械システム開発に必要な基礎技術を修得・研鑽するとともに，チームで協力して創造性を発揮し工学プロジェクトを完遂する能力を実践的に身につける．具体的には，プロジェクトの企画を立ててコンテストにエントリーし，３年次前期までの機械工学科の専門科目の履修を通じて修得した機械工学やメカトロニクスの基本技術を活用して，チームプロジェクトとしてオリジナルのロボットを設計・製作する．外部の技術イベントへの参加によって広い視野から自らの学修課題を認識し，他校のパフォーマンスにも学び，達成できたことから自信を得て，技術者としての全人格的な成長を図る．",
        "outcomesMeasuredBy": "本授業科目では本学の「６つのラーニングアウトカムズ」のうち，・実学に基づく専門能力・コミュニケーション能力・論理的な思考力・分析・評価能力・問題解決力の5つを目指し，具体的には以下を到達目標とする．1）専門科目で学んだ基礎技術を実践的に磨き，ロボット製作プロジェクトの実践に活用できるようになること2）チームで協力して創造性を発揮する工学プロジェクトにおいて，自身も積極的に貢献し，かつチームメンバーの力も十分に引き出せること3）工学システム開発の過程で遭遇するバグや動作不良，性能不足などの技術的問題を分析し解決できること4）ウェブを介して技術情報を収集・評価し，ロボット設計などに活用できること",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "クラス全体で１つのチームとして実際のロボットコンテストに挑戦するプロジェクトを，受講生地震が自発的に遂行すること自体を本授業の課題とする．すなわち，授業全体がアクティブラーニングであり，グループワークとして行われる．本年度は大学ロボコンを対象とする予定だが，周辺状況や受講生のレベルによっては他の公的なロボット競技イベントなどに代える場合もある．授業の具体的な課題は，プロジェクトの企画と大会への応募書類の作成とエントリー，プロジェクトの自主的運営，競技用ロボットシステムの企画・設計・製作，大会参加のための審査用ビデオおよび技術報告書の作成などである．授業科目としては後期実施だが，前期にガイダンスを行なって参加希望者を募集し，前期および夏期休業期間中に準備講習を行なって基礎技術やプロジェクトに臨む姿勢を養う．この準備講習への参加状況によって各自の履修を制限する場合がある．参加を希望して履修が認められなかった場合には，「機械創造応用」一般テーマのクラスを履修できる．",
        "notices": "プロジェクトを最後まで遂行する意欲と根気に加えて，チームメンバーと協力してお互いの能力を引き出すように努力する真摯な姿勢をもって当たること．課題が与えられるのを待つのではなく，各自が積極的に，自分から課題を考え発見して取り組むこと．メンバー全員が常にプロジェクトの全体像を共有できるように，お互いによく報告・連絡・相談しあって意思疎通に努めながら進めること．自分の担当部分だけに集中するのではなく他のメンバーの担当内容にも積極的に情報を求めて意見を出し，自身の担当部分については積極的に他のメンバーに発信して意見を聴取すること．ロボット製作作業に際しては，安全に留意し万全の準備と細心の注意をもって当たること．",
        "preparatoryStudy": "予習・復習：授業時間外で分担するプロジェクトの作業課題を毎回スケジューリングし，期日までに仕上げる．作業について新たな問題が生じた場合は，さらにグループまたは個人で対処すること．",
        "gradingGuidelines": "プロジェクトの達成度（50%）と各自のプロジェクトへの貢献度（50%）を，プロジェクトの過程（企画・運営と製作作業）と結果（製作物と個人の最終報告書）に基づいて評価する．",
        "textbook": "授業用ウェブサイトを用意し，随時必要な情報を掲載する．",
        "referenceMaterials": "・森：機械部品の幕の内弁当，オーム社（2003）・清水：ロボコン・ベーシック・スタディ，オーム社（2002）・米田，ほか：はじめてのロボット創造設計，講談社（2001）",
        "courseSchedule": "第1回：コンテストルール検討／アイデア企画第2回：アイデア検討／プロジェクト計画第3回：アイデア構築／基礎技術調査／テストフィールド設計第4回：アイデア構築／基礎技術調査／テストフィールド設計第5回：概念設計／機構・機能の試作検討／テストフィールド製作第6回：概念設計／機構・機能の試作検討／テストフィールド製作／エントリー書類完成第7回：基本設計／部品・材料発注／テストフィールド製作第8回：基本設計／部品・材料発注／本製作第9回：詳細設計／部品・材料発注／本製作第10回：詳細設計／部品・材料発注／本製作第11回：本製作第12回：実験・改良第13回：実験・改良第14回：競技デモ発表会／大会審査用ビデオ制作・技術報告書作成",
        "courseDataUpdatedAt": "2024\/01\/04"
    },
    "updateAt": "2024\/09\/13"
}