{
    "lectureCode": "K504501",
    "courseName": "3D機械設計製図[A]",
    "lecturer": [
        "加藤太朗(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "研究棟Ａ５０３"
    ],
    "courceDetails": {
        "courseOverview": "機械や機械要素部品の設計製造において、機械製図図面は機械技術者に必須の情報伝達手段である。機械製図図面は、日本工業規格(JIS)で定められた規則、規格等により、機械部品の寸法、構造、精度、材質、等が明確に指示されており、それを元に加工などを行うことができる。一方で近年の効率的な製品設計では、3D-CADシステムの利用は欠くことができない。3D-CADシステムを用いた製品開発では、コンピュータ上で製品の3Dモデルを作成・解析評価し、設計案を修正することで、高い品質の製品を効率的に開発することができる。作成された製品の３Dモデルは、図面化や各種システムを用いて、部品加工や生産設計に利用される。そのため、図面を正しく「読み」、「描く」こと、さらに3D-CADを用いて部品設計を行うことは、機械技術者にとってのリテラシー（読み書き能力のような重要な基本能力）である。本授業では、日本工業規格（JIS）に基づいた機械製図法の基礎を学び、設計図面を「読む」、「描く」ための基本的な能力を習得する。図面を「読む」技能では、投影法、第三角法、寸法、幾何交差、はめあい、材料記号、等の製図法の基礎となる概念や規則・規格の意味と使い方を習得する。図面を「描く」技能では、3D-CADパッケージを用いて、主な機械要素部品のモデリングし、さらにそれを元に製図作成を行うことで、描く技能を習得するとともに、機械要素の規格、利用方法についても学ぶ。さらに減速機構の設計製図を行うことにより、機械設計の基本技能を習得する。なお、この科目は企業で実務経験をもつ講師による講義と学生が能動的に考え、学習する実践的講義科目である。",
        "outcomesMeasuredBy": "本授業科目では，本学の「６つのラーニングアウトカム」のうち・実学に基づく専門能力・問題解決力の２つを目指し，より具体的には以下を到達目標とする。本科目の修得により、機械製図に関する全般的な知識と機械要素についての知識を身につけ、機械製図から形状、寸法、精度、加工法等、必要な情報を読み解くことができ、またJISの規約に沿った機械図面を自ら描く技能を身につけることをめざす。さらに、歯車減速機の設計方法を理解し、設計したパラメータを用いて歯車減速機の機械製図を描く技能を身につけることを目指す。具体的には、以下の項目ができるようになる。１）機械図面より表現された製品の形状、精度、加工法等の情報を読み解くことができる。２）与えられた仕様に対して適切な機械図面を描くことができる。３）必要な機能を考慮して適切な機械要素を選定することができる。４）3D-CADシステムを用いて機械部品のモデリングを行うことができる。５）3D-CADシステムを用いて機械図面を作成することができる。６）歯車減速機構の構造、原理を理解し、説明することができる。７）歯車減速機を設計し、それを機械図面として描くことができる。",
        "learningOutcomes": "実学に基づく専門能力問題解決力",
        "teachingMethod": "本講義は、講義動画閲覧による学習、補足説明、ミニテスト、演習課題によって構成される。講義動画閲覧による学習は、その回の演習課題が終わってから次回授業が始まるまでに閲覧することとする。教科書と併せて閲覧することで関連する知識、規格等を身に付ける。また授業冒頭で適宜補足説明や質問対応を行うことで理解を深められるようにする。その後，第8回までは毎回ミニテストによる理解度チェックを行う。また同じく第8回までは毎回製図課題があり、3D-CADソフトウェアを用いて３Dモデルの作成や２Dの機械図面作成を行う。第9回以降の設計演習はグループワークとなる。グループごとに異なる仕様の2段階減速機を設計し、3Dモデルの作成や、２D機械図面の作成を行う。3D-CADソフトウェアを用いた演習を行なうため、ノートPC必携である。",
        "notices": "なし",
        "preparatoryStudy": "本講義では次回の講義開始までに講義動画を閲覧し、内容を理解しておくこと。（40分程度）。なお予習資料の演習問題および課題があり、講義開始までに提出する（100分程度）。",
        "gradingGuidelines": "授業への取組み姿勢（40%）、製図課題（60%）により評価する。なお、各％は目安である。提出された課題や演習中の様子を見ながら、必要に応じて課題の解説やよくある間違いなどの説明を行い、理解を深められるようにする。",
        "textbook": "新編JIS機械製図第5版，編著吉澤武男，森北出版(2015)",
        "referenceMaterials": "新・演習機械製図，塚田忠夫，金田徹，数理工学社(2015)",
        "courseSchedule": "第1回：機械製図の基本1：講義概要、第三角法、投影法第2回：機械製図の基本2：断面図、省略、特殊な図示方法、寸法記入方法第3回：機械要素、締結要素（ねじ）、寸法公差、はめ合い第4回：動力伝達要素（歯車）、表面あらさ第5回：動力伝達要素（Vプーリー、歯付ベルト）幾何公差第6回：動力伝達要素（フランジ型たわみ軸継手）、軸受第7回：到達度チェック、これまでのまとめ第8回：プランマブロック製図の説明第9回：2段歯車減速機設計演習:設計手順説明第10回：2段歯車減速機設計演習:設計1第11回：2段歯車減速機設計演習:設計2第12回：2段歯車減速機設計演習:製図1第13回：2段歯車減速機設計演習:製図2第14回：2段歯車減速機設計演習:製図3",
        "courseDataUpdatedAt": "2024\/02\/05"
    },
    "updateAt": "2024\/09\/13"
}