{
    "lectureCode": "K600301",
    "courseName": "線形代数(E)",
    "lecturer": [
        "松永栄一(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金4"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義実験棟４０３"
    ],
    "courceDetails": {
        "courseOverview": "線形代数は、自然科学、工学、情報科学、社会科学などに幅広く応用される基礎科目である。線形代数(E)では、ベクトル、行列についての基礎事項とそれらの具体的な計算方法、および応用例について学ぶ。ベクトルと行列の定義からはじめ、それらの計算方法の基礎を具体例を通して学ぶ。次に、線形代数の重要な応用分野の1つである連立1次方程式の解法について解説する。この解法を学ぶ際に、行列の変形、逆行列、行列式など行列に関する重要な概念とその計算方法を学ぶ。もう１つの線形代数の応用分野として、図形への応用がある。そこで、ベクトルが張る空間(線形空間)という概念を説明した後に、ベクトルの変換(線形変換)を行う行列の機能についての解説を行い、その具体的な計算方法と計算結果の図形的意味について学ぶ。具体的には以下の項目について学ぶ．線形独立、線形従属、線形変換、基底、正規直交基底、直交変換・直交行列、固有値・固有ベクトル、行列の対角化これらを通じて、論理的な思考力と問題解決力を身につけることを主な目標とし、その他の分野において線形代数を応用できるようになることを目指す。",
        "outcomesMeasuredBy": "本講義では以下のことを到達目標とする．・ベクトルおよびその演算の定義を理解し，基本的な計算ができるようになること・行列の基本的な定義を理解し,基本的な計算ができるようになること・連立方程式を基本変形により解くことができるようになること・2次および3次正方行列の行列式を理解し，計算できるようになること・逆行列を用いた連立1次方程式の解法を理解し，簡単な計算ができるようになること・線形独立および線形従属の定義を理解しその判定ができるようになること・線形変換と行列との関係を理解し、線形変換の基本的な問題が解けるようになること・基底・次元・階数といった概念を理解すること・図形のベクトルによる表示を理解し，図形の問題をベクトルの問題として解くことができるようになること・固有値・固有ベクトルといった概念を理解し，対称行列の対角化程度ができるようになること講義全体を通して、線形代数に関する基礎事項の解説を理解し、各回の問題演習を必ず行うこと。その際に単に解法パターンの当てはめによる答案作成では終わらず、基礎事項である言葉の定義をよく理解し、演繹するという作業に意識を向けることで論理的な思考力を養い、電気工学および電子工学に限らずその他の科学技術や社会における線形代数の有用性について理解し新たなテーマに対する問題解決力の習得を目指す。",
        "learningOutcomes": "論理的な思考力問題解決力",
        "teachingMethod": "各回、テキストに沿って作成した講義資料を講義ページに掲載する。授業では、プロジェクターを用いて講義資料の解説を行い、講義資料やテキストに掲載された演習問題を解く。そのため、テキストとノートPCは必携とする。各回、提出課題を課すので、指定した期限までに必ず提出すること。",
        "notices": "本講義の参考図書（参考書欄に記載）について、(1)は比較的読みやすい。さらに学びたい人には同(2)をすすめる。",
        "preparatoryStudy": "予習では、講義ページに掲載する資料を授業日までに確認すること。その際には単に式を眺めるだけでなく、実際にノートに計算を行うこと。またテキストの該当箇所を読んでいくつかの問題を解いてみること。授業後は、提出課題の解答を期限までに必ず提出すること。提出する解答は単に答のみを記述するのではなく、その答に至った途中の数式やその説明文も記述すること。復習では、講義ページに掲載した前回の提出課題について解答例を確認し、出来なかった問題についてはもう一度問題を解きなおすこと。さらには講義内容について自力でまとめてみることをすすめる。講義の内容を他者に対して説明できるようになることが望ましい。各回の復習および予習には少なくとも合計で約120分の時間が必要である。なお、高等学校（または同レベル）のベクトルと行列について復習しておくこと。ベクトル・行列を大学で初めて学ぶ人は、高校の教科書や参考書を参照できるようにしておくことをすすめる。",
        "gradingGuidelines": "各回の提出課題の内容（30％）、および期末試験の結果（70％）により評価する。各回の提出課題の内容や提出状況については、講義中に適宜コメントや講評などの形でフィードバックを行う予定である。",
        "textbook": "「理工数学シリーズ線形代数理工数学の基礎」村上雅人・鈴木絢子・小林忍著飛翔舎",
        "referenceMaterials": "(1)「線形代数」、江見圭司、中西祥司共著、東京図書．(2)「線形代数入門」、齋藤正彦著、東京大学出版会．",
        "courseSchedule": "第1回ベクトルと行列(1)：ベクトルの定義、ベクトルの計算第2回ベクトルと行列(2)：ベクトルと行列、行列の計算第3回連立1次方程式と行列(1)：連立方程式の行列表示、行基本変形第4回連立1次方程式と行列(2)：逆行列の定義、逆行列による連立1次方程式の解法第5回連立1次方程式と行列(3)：行列式の定義、2元正方行列の行列式第6回連立1次方程式と行列(4)：3元正方行列の行列式第7回連立1次方程式と行列(5)：行列式の性質第8回連立1次方程式と行列(6)：クラメルの公式による連立1次方程式の解法第9回正方行列：正方行列の計算、行列の階数第10回線形空間と線形変換第11回固有値と固有ベクトル(1)：2元正方行列の固有方程式第12回固有値と固有ベクトル(2)：3元正方行列の固有方程式第13回固有値と固有ベクトル(3)：行列の対角化と2次曲線の標準化第14回全体のまとめ",
        "courseDataUpdatedAt": "2024\/02\/24"
    },
    "updateAt": "2024\/09\/13"
}