{
    "lectureCode": "K601501",
    "courseName": "工学基礎実験II(E)[A]",
    "lecturer": [
        "黒川弘章(工学部電気電子工学科)",
        "小原翔馬(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火4",
        "火5"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "私たちをとりまく生活や環境において、電気電子工学に関する知識と技術は重要な役割を担っている。とくに、電気に関連した部品、装置、システムは様々な所で使用されており、本授業ではこれらに関わる基礎技術の習得を大きな目的とする。そのため、半期ごとに物理・電気電子基礎系の実験とマイコン基礎系の実験とに大別して実施する。マイコン基礎系実験（本実験）では、PIC(PeripheralInterfaceController)と呼ばれるマイクロコントローラを用いて、LEDやモータの制御を行うためのアセンブラプログラムを組み、実際の動作とプログラムの関係を習得することを目的とする。また、アセンブラプログラムでのマイコン制御を理解することで、今後、C言語やJava言語といった高級言語でのマイコン制御の流れを自ら考えられる基礎力を身につける。",
        "outcomesMeasuredBy": "実際の回路をプログラムにより制御することで、【実学に基づく専門能力】を身につける。また、回路配線ミスやプログラムバグ等の問題点を見つけ解決することで【問題解決力】を養う。実験の内容は電気電子工学における初歩的な内容であり、この実験を通して【電気工学の基礎力】【電子工学の基礎力】を身につける。1)電子部品の基礎特性を理解し、これらを組み合わせて基本的機能をもつ回路を動作させることができる。2)PICを利用したマイコン制御の流れを説明できるようになる。3)PICアセンブラプログラムを見て、処理手順を理解し、プログラム作成、デバッグができるようになる。",
        "learningOutcomes": "実学に基づく専門能力問題解決力",
        "teachingMethod": "安全面と教育上の観点から、学生実験は特に時間に正確で順を追った進行を意識する。始めに、担当教員または実験講師が概説と実験手順の説明を行い、各自が一つひとつ課題を達成していく。担当教員、実験講師および補助員が各自の達成度および理解度を一人ひとり確認する。レポートはすべて期限までに提出すること。提出の期限と場所については、担当教員または実験講師が指示する。内容上不十分なレポートについては修正・再提出などの指示があり、これを満たしたレポートのみ正式に受理する。",
        "notices": "安全面と教育上の観点から、学生実験は時間通り特に正確に開始し、予定の段階を一つ一つ理解し達成していく必要がある。そこで欠席および遅刻の記録を正確に行い、安全および教育上問題が想定される際は、当日の実験実施ができない場合がある。電源回路や電子部品の取り扱いを誤ると、切り傷や刺し傷、感電、火傷のおそれがあるため、指導教員の指示に十分注意を払うこと。各自必ず、ノートPCを持参すること。その他、授業の詳しい進め方や注意事項については、各実験テーマの始めに行われるガイダンスにて説明する。",
        "preparatoryStudy": "Webまたは配布される実験テキストをよく予習すること。実験実施前日までの予習により、実験技術の習得および知識・技術の理解と記憶の面で大きな効果が期待できる。また、実験テキストを復習することにより、それぞれの実験やプログラムの流れがよく理解・説明できるようになる。",
        "gradingGuidelines": "実験で課される小問や課題に対する学習および完成の度合い、課題レポートの提出とその内容により総合的に評価する。実験各回の参加態度および小問・課題取り組み（60%）、実験レポートの提出・内容（40%）を基準に評価する。",
        "textbook": "実験テキストはWebまたは紙資料等により配布する。",
        "referenceMaterials": "図解PICマイコン実習、堀桂太郎、森北出版",
        "courseSchedule": "第1回：回路作成基礎、安全教育：実験回路作成上の注意、ブレッドボード、テスタ使用方法理解第2回：PIC利用手順(1)：PICマイコンの基礎、PIC開発環境構築準備、アセンブラプログラミング基礎第3回：PIC利用手順(2)：LED点灯回路作成、プログラム作成、PIC書き込み手順と実行第4回：PIC基礎理解(1)：PIC入出力設定とデバック方法第5回：PIC基礎理解(2)：条件分岐命令の理解第6回：課題レポート第7回：課題レポート解説、まとめ第8回：PICによるLED制御(1)：タイマ原理と利用方法第9回：PICによるLED制御(2)：LED点滅制御第10回：PICによるLED制御(3)：PWM原理と制御第11回：PIC応用回路(1)：DCモータ制御第12回：PIC応用回路(2)：A\/D変換利用設定と応用回路第13回：課題レポート、まとめ第14回：課題レポート解説、まとめ",
        "courseDataUpdatedAt": "2024\/01\/11"
    },
    "updateAt": "2024\/09\/13"
}