{
    "lectureCode": "K602501",
    "courseName": "電子デバイス",
    "lecturer": [
        "中払周(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "金3"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ４０３"
    ],
    "courceDetails": {
        "courseOverview": "企業研究所において半導体デバイスの研究開発に従事した実務経験に基づき、主に半導体を中心に構築される各種電子デバイス技術についての知見を与える実践的科目である。私たちの生活においては、パソコン、携帯電話、テレビ、ゲーム機など様々な製品を使っている。それらの機能の実現のためには様々な電子デバイスが用いられている。また、技術系の仕事であれば、設計、計測、製造、研究開発など職種を問わず、電子デバイスを使うことが多い。皆さんが、電子デバイスの概要について理解し、出来れば今後、電子デバイスを仕事で使いこなせるレベルに到達するための、もっとも基礎的な知識を習得することをこの授業の目標とする。電子デバイスの多くは半導体を利用したものなので、半導体と半導体デバイスの基礎に先ず焦点をしぼり説明する。次に、上記製品や業務用の様々な装置の中でキーデバイスとして使用されている磁性体、磁気デバイスや磁気センサについて説明する。最後に、その他の電子技術を用いている各種センサの興味深い応用について説明する。全体を通して各種電子デバイスの構造、動作原理、現在の応用、そして、省エネルギーの可能性や持続可能社会との関連性について理解を深めるように解説する。また、実学に基づく専門能力を養うことを目的として、企業における研究開発のエピソードや企業技術者のコメントを支障のない範囲で紹介し、実際の製品例をあげて説明する。",
        "outcomesMeasuredBy": "この講義を通じて、電子工学における電子デバイス全般に関する専門的基礎力および論理的な思考力を身につけることを目標とする。具体的には、電子デバイスの概要について理解し、将来、電子デバイスを仕事で使いこなせることを想定して、基礎的な知識を習得すること。応用を想定して、半導体と半導体デバイスの基礎を理解する。磁性体、磁気デバイスや磁気センサについて理解する。電子技術を用いている各種センサの応用について理解する。各種電子デバイスの構造、動作原理、現在の応用、そして、省エネルギーの可能性や持続可能社会との関連性について理解しつつ問題解決力を養い、実学に基づく専門能力を身につける。以上が本講義の到達目標である。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "授業は基本的に講義形式にて行うが、毎回の授業で演習問題や調査課題等をとり入れる。技術動向調査等に用いるため、毎回ノートPCを必携とする。",
        "notices": "講義資料はオンライン上で事前に公開するので、予習をしてくること。",
        "preparatoryStudy": "高校レベルおよび大学・共通技術科目の物理と数学を復習し、いつでも内容を参照できるようにしておくと理解しやすくなる。また、電子物性を履修していることが望ましい。",
        "gradingGuidelines": "授業中の演習や提出課題から評価する。",
        "textbook": "指定しない",
        "referenceMaterials": "「基礎半導体工学」小林敏志等著(コロナ社)，「電子材料」澤岡昭著(森北出版)，「磁気センサ理工学」毛利佳年雄著(コロナ社)，「センサデバイス」浜川圭弘著(コロナ社)，「半導体デバイス基礎理論とプロセス技術第2版」S.M.ジィー著(産業図書)．",
        "courseSchedule": "第1回:概要半導体の基礎的性質,エネルギー準位第2回:エネルギーバンド理論,ｎ型ｐ型の形成,電子と正孔,伝導性第3回:pn接合とショットキー接合の電圧・電流特性第4回:接合型トランジスタ第5回:電界効果トランジスタ第6回:集積回路の要素デバイスとメモリーデバイス第7回:半導体電子デバイスの中間まとめ第8回:受光デバイス第9回:発光デバイス第10回:磁性体と磁気特性第11回:磁気効果と磁気デバイス第12回:各種センサデバイスと応用変位,トルク,歪み,圧力,熱,超音波第13回:理解度チェック第14回:全体のまとめ",
        "courseDataUpdatedAt": "2025/01/24"
    },
    "updateAt": "2025/03/21"
}