{
    "lectureCode": "K602401",
    "courseName": "信号処理",
    "lecturer": [
        "坪川宏(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ５０２"
    ],
    "courceDetails": {
        "courseOverview": "音声信号、画像信号、各種センサーの出力信号などの信号をデジタルデータとして処理するシステムを理解し、設計を行う上で重要となるたたみ込み演算、フーリエ解析、ラプラス変換、連続時間システムの伝達関数、A\/D変換、標本化定理、離散時間システム、インパルス応答と差分方程式、ｚ変換について学び、それらを元に有限インパルス応答フィルタや無限インパルス応答フィルタなどのデジタルフィルタの構成法および特性について理解する。",
        "outcomesMeasuredBy": "実際の通信機器や画像処理装置で扱われる信号処理技術について実学に基づく専門能力を習得し、信号処理システムによる分析・評価能力を養う。また、電気工学・電子工学の基礎力となる知識も身につける。1)A\/D変換や標本化定理を利用して、適切なデジタル信号への変換ができるようになる。2)離散時間システムの表現方法を理解して、伝達関数や周波数特性を計算できるようになる。3)所望する特性を有するデジタルフィルタの構成方法を理解し、簡単な設計ができるようになる。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力",
        "teachingMethod": "原則として、配布資料に沿って授業を進めるが、Octaveを用いたシミュレーションを行うので、各自ノートPCを必ず持参すること。また、授業前半で復習、授業後半で練習問題を行う。",
        "notices": "必須ではないが、電気回路、電子回路、電気数学を修得していると、理解が容易になる。Octaveのインストールには、1.5GByte程度の空き容量を必要とするので事前に確保しておくこと。",
        "preparatoryStudy": "授業前に、講義資料をよく読み、Moodleの予習問題に解答すること。また、授業後半に行う練習問題をよく復習し、次回の授業前半の復習に備えておくこと。",
        "gradingGuidelines": "中間演習課題と期末演習課題を３割、定期試験を７割で成績評価を行う。授業中の練習問題について、授業後に解答例を示し、適宜誤りやすい箇所について説明を行う。",
        "textbook": "Web等により資料を配布する。",
        "referenceMaterials": "よくわかるディジタル信号処理、相良岩男、日刊工業新聞社基本からわかる信号処理講義ノート、渡辺栄二、オーム社MATLAB対応ディジタル信号処理、樋口龍雄、森北出版",
        "courseSchedule": "第1回：信号処理の役割、応用分野、アナログ信号とデジタル信号、標本化と量子化、Octave環境導入、Octaveの基本操作第2回：離散時間信号と線形時不変システム第3回：線形時不変システムのインパルス応答、たたみ込みによるシステム出力第4回：離散時間信号のフーリエ解析第5回：連続時間信号と離散時間信号の関係、標本化定理とエイリアシング第6回：Z変換と離散時間システムの差分方程式、伝達関数第7回：離散時間システムの周波数特性第8回：中間演習課題第9回：高速フーリエ変換と時間周波数解析第10回：デジタルフィルタの基礎第11回：デジタルフィルタ設計第12回：フィルタによる画像処理第13回：信号処理の応用事例（学習機能と手書き文字認識）第14回：期末演習課題",
        "courseDataUpdatedAt": "2023\/12\/25"
    },
    "updateAt": "2024\/09\/13"
}