{
    "lectureCode": "K603901",
    "courseName": "集積回路",
    "lecturer": [
        "中払周(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義実験棟４０２"
    ],
    "courceDetails": {
        "courseOverview": "企業研究所において半導体デバイスの研究開発に従事した実務経験に基づき、現在の情報技術を支える半導体の大規模集積回路の基礎と、これまでの発展の歴史の概観と将来の展望について解説する実践的科目である。本講義では、このような大規模集積回路技術の全体像を把握し、その基盤技術である種々の半導体デバイスの動作原理や製造方法、レイアウト設計、ＣＭＯＳ回路の動作の仕組みとスイッチング特性、論理ゲートや順序回路、メモリ回路について学ぶ。そして、現代の集積回路技術の重要課題である低消費電力化と、そこで求められる微細化・比例縮小における課題について理解する。これにより、集積回路に関する専門知識を身につけ、集積回路の設計・開発ができるようになる。",
        "outcomesMeasuredBy": "本講義では、電子回路やデジタル回路の基礎的な知識を基礎として、集積回路で用いられるＣＭＯＳ技術による論理回路の実現方法、及び集積回路を製造する半導体微細加工技術についての知識を習得する。また、スケーリング則の限界とその回避技術を中心として集積化の課題について理解を深める。これにより、集積回路関する専門能力が身につき、集積化回路を用いたデジタル回路やアナログ回路の設計などにおける問題解決力が身につく。具体的には、以下のことができるようになる。１）MOSトランジスタの動作原理を説明できる。２）基本論理ゲートをCMOS回路で設計することができる。３）メモリをはじめとする各種集積回路の特徴を理解し、その使い分けができる。４）集積化回路のスケーリング則とその限界を理解し、今後の課題について説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "全体として講義形式で行うが、適宜練習問題等を採り入れる。理解度チェックにおいてはそれまでに学んだ中で理解が不足している部分を見つけ出し、重点的に復習する。",
        "notices": "電気回路I,II、電子回路I,II、論理回路、電子デバイス、電子物性、ディジタル回路を習得していることが望ましい。なお、プロセス工学やマイクロプロセッサとも互いに関係するため、これらも履修することが望ましい。",
        "preparatoryStudy": "毎回、次回の主題等を説明するので、事前に一般的な調査・理解をしておくこと。",
        "gradingGuidelines": "各講義内での演習や提出物、及び期末試験の合計で評価する。その割合は40:60とする。",
        "textbook": "指定しない",
        "referenceMaterials": "吉本雅彦(編著)：\"集積回路工学\",オーム社(2013\/9)ISBN:978-4-274-21427-1.",
        "courseSchedule": "第1回：MOSトランジスタの動作原理第2回：CMOSスタティック基本ゲート第3回：プロセスフローとCMOSレイアウト設計第4回：CMOS組み合わせ論理回路第5回：ラッチとフリップフロップ、演算回路第6回：これまでの復習と理解度チェック第7回：理解度チェックの復習第8回：同期設計第9回：メモリ回路第10回：消費電力第11回：寄生素子と2次効果第12回：比例縮小則(スケーリング則)と微細化の課題第13回：これまでの復習と理解度チェック第14回：理解度チェックの復習とまとめ",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}