{
    "lectureCode": "K604401",
    "courseName": "電気法規と電気施設管理",
    "lecturer": [
        "田代洋一郎(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金4"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義棟Ａ２０４"
    ],
    "courceDetails": {
        "courseOverview": "2016年4月から電力小売全面自由化が始まり、一般家庭で自由に電気の購入先を選ぶことが出来るようになった。一方で、ウクライナ戦争の影響により石油や天然ガス等のエネルギー価格が高騰したため、新規に参入した電力小売り業者の多くは撤退を余儀なくされ、消費者も値上げに苦しんでいる。電気は日常生活や産業・経済に不可欠なエネルギーであり、安定的かつ公平に供給にされなければならない社会基盤のため制度や規制の在り方には十分な議論が必要である。このような電気を供給する電力設備・施設を安定的にかつ効率的に維持・管理するためには、その設備を取り扱う人が電気の持つ特性および設備構成を理解し、電気設備に関わるルールを守ることが重要である。ここでは、電力流通設備の設計・工事・保守および運転を実践していた実務経験に基づき、電気を供給するための送電・変電・配電など電気設備の実構造および運用方法を学ぶ。また、設備管理の基本ルールとなる電気事業法ならびに電気設備の技術基準など関連法規について、法規制の背景や規制の考え方に言及しながら学ぶ。さらに電力設備・施設の管理、トラブル事例について学ぶことにより、電気関係法規についての理解を深めると共に、電気技術者として不可欠な安全（自己、公衆および設備）についての知識取得を目指す実践的科目である。",
        "outcomesMeasuredBy": "電気設備の実構造、電気事業法ならびに電気設備の技術基準など関連法規について学ぶことで、実学に基づく専門能力を身に付ける。具体的には以下を到達目標とする。1.電気の特質と電力供給・施設について説明でき規制に関し議論できる2.電気関係法規とその意図するところを理解し説明できる3.電力設備の保安管理における基礎知識と安全に関する考え方を伝えることができる",
        "learningOutcomes": "実学に基づく専門能力",
        "teachingMethod": "・パワーポイントを用いて要点講義を行う。（パワーポイント資料は抜粋しWEB配布する。）・電力設備および電気活用技術の事前調査・発表を実施し、学生自らの主体的な学び(アクティブラーニング)を促す。発表に際してはノートPCを利用する。・演習として電気主任技術者資格に関連する設問と解説を行う。＊可能であれば電力施設見学により電力設備の理解を深める。",
        "notices": "対面授業を基本とするが、緊急事態宣言等の事情によりＷＥＢ講義に切り替えることがある。",
        "preparatoryStudy": "電力設備や電気・電力利用技術に関わるニュース・トピックスを調べてくること。これをベースに発表・ディスカッションを授業内で実施する。発表するニュースはパワーポイント1枚に纏めてくること。（30分程度）また、講義終了後は１週間以内に講義の要約レポート（200字以内）を作成・提出して復習を行うこと。(10分程度）",
        "gradingGuidelines": "・期末試験（50％）・・・講義内容から出題・毎回の授業要約レポート（25％）・・・提出後の質問等にはMoodleでフィードバックを実施・トピックス（時事調査）の発表（25％）・・・発表内容、質疑応答に応じて加点",
        "textbook": "電気設備技術基準とその解釈（2024年版）出版社電気書院",
        "referenceMaterials": "第1回:電気法規･施設管理講義の目的第2回:電力ネットワークを構成する電力設備第3回:電気事業と法令第4回:電気法令の種類(必要に応じて構内施設見学）第5回:法令用語と電気事業法第6回:電気設備技術基準第7回:電気設備技術基準並びにその解釈第8回:電気設備技術基準（絶縁管理）第9回:電気設備技術基準（接地抵抗管理）第10回:電気設備技術基準(機器、電路保護）第11回:産業標準化(国際標準）第12回:電気設備電技基準（小出力発電設備・分散電源）第13回:問題演習(電験）第14回:ふりかえり（まとめ）",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/10"
    },
    "updateAt": "2024\/09\/13"
}