{
    "lectureCode": "K604101",
    "courseName": "マイクロプロセッサ",
    "lecturer": [
        "木村康男(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "IT化は現代社会の基盤であるといえる。これを実現しているコンピューターの処理装置であるマイクロプロセッサはその重要な構成要素である。一方、マイクロプロセッサ自体はプロセス工学でその製造過程を学ぶ集積回路でもある。本講義ではマイクロプロセッサについて網羅的に学ぶ。具体的には、マイクロプロセッサは実現されてからまだ半世紀であるが、その歴史を学ぶことで大局的な理解を得る。また、マイクロプロセッサの構成要素やコードセットを理解することでマイクロプロセッサの動作原理を理解する。さらに、アセンブリ言語を学ぶことにより、マイクロプロセッサとプログラムとの関係を理解する。これにより、マイクロプロセッサの動作原理を理解した上でアセンブリ言語のプログラミング技術を習得でき、高速かつ低消費電力動作を可能とするプログラミング技術を身につけることができる。",
        "outcomesMeasuredBy": "マイクロプロセッサでは、電子回路やディジタル回路の知識を基礎としてマイクロプロセッサの構成要素やその実現方法及び動作原理について理解する。また、マイクロプロセッサの構成要素及び動作原理と機械語とやアセンブリ言語との関係を理解する。これらを通じてアセンブリ言語及び機械語を用いたプログラミングの基礎を習得し、様々なマイクロプロセッサを活用する上での実学的な専門能力が身につく。１）マイクロプロセッサの基本的な構成要素及びその原理を説明できる。２）機械語またはアセンブリ言語の各命令でのマイクロプロセッサの動作が理解できる。３）アセンブリ言語により基本的なプログラムを作成できる。",
        "learningOutcomes": "実学に基づく専門能力",
        "teachingMethod": "全体としては講義形式で行うが、必ずノートをとるように心掛ける。適宜演習を行い理解を深める。",
        "notices": "電気回路I,II,III、電子回路I,II、論理回路、電子物性、電子デバイス、ディジタル回路、計算機工学を習得していることが望ましい。なお、集積回路工学とも互いに関係するため、これも履修することが望ましい。",
        "preparatoryStudy": "毎回、次回の主題等を説明するので、事前に予習し一般的な調査・理解をしておくこと。復習しわからない点を次週に残さぬよう心掛ける。",
        "gradingGuidelines": "提出物及び期末試験の合計で成績を評価する。ただし、その割合は、順に30:70とする。",
        "textbook": "「新編マイクロコンピュータ技術入門」、コロナ社、松田忠重、佐藤徹哉共著、ISBN:987-4-339-02490-6",
        "referenceMaterials": "「マイクロコンピュータ制御プログラミング入門」、コロナ社、柚賀正光、千代谷慶共著、ISBN:987-4-339-011976-7「作って学ぶCPU設計入門」、森北出版、葉山清輝著、ISBN:987-4-627-78431-4",
        "courseSchedule": "第1回：ディジタルコード第2回：基本論理回路第3回：加算記憶その他の代表的回路第4回：コンピュータの構成と働きの概説①第5回：コンピュータの構成と働きの概説②第6回：これまでの復習と理解度チェック第7回：理解度チェックの復習第8回：マイクロプロセッサのハードウェア第9回：命令セットとプログラム①第10回：命令セットとプログラム②第11回：機械語またはアセンブリ言語によるプログラミング①第12回：機械語またはアセンブリ言語によるプログラミング②第13回：これまでの復習と理解度チェック第14回：理解度チェックの復習とまとめ",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}