{
    "lectureCode": "K605001",
    "courseName": "電気電子工学実験I",
    "lecturer": [
        "荒川貴博(工学部電気電子工学科)",
        "黒川弘章(工学部電気電子工学科)",
        "小原翔馬(工学部電気電子工学科)",
        "李寧(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3",
        "月4",
        "月5"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "半導体デバイスはいうまでもなく現代社会を支える高度な情報処理を実現する基幹技術である。電子制御は様々な機械・機器を動作させるための中核技術である。この実験を通じて、半導体デバイスと電子制御の基礎を習得することを狙いとする。半導体デバイスはどのようにして作製され、どのような性質を有するのか。電子制御がどのような仕組みでどのように機会・機器を制御できるかを体得する。これによりサステイナブル工学を実践する上で基礎的な半導体デバイスと電子制御についての知識・分析・評価能力が身につく。",
        "outcomesMeasuredBy": "この実験を通じて半導体デバイスと電子制御に関わる「実学に基づく専門能力」「分析・評価能力」「電気工学の基礎力」「電子工学の基礎力」を身につけることを目標とする。具体的には以下の通り。・ショットキーダイオードの原理と特性を物性論に基づいて説明できる。・半導体の真空プロセスの原理と操作法を説明できる。・半導体動作の基礎である固体の電気伝導と光電効果を説明できる。・シーケンサを用いた電子制御について、その原理や特性を説明できる。・マイコンを用いた電子制御について、ラピッドプロトタイピングに必要な基礎的な構成や特性を説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "テーマおよび毎回の説明に基づいて、実験を実施する。実施した結果（データ等）に基づいて、レポートを作成し発表する。この授業では電子資料を閲覧するだけでなく、各自のノートPCにArduinoマイコンのプログラム開発環境をインストールして実験を行うので、ノートPCが必須である。",
        "notices": "実験はグループで行うため、欠席は自身だけでなく同グループの他のメンバーにも影響が出る。やむを得ない欠席時には事前にメンバーおよび教員に連絡をとること。再実験の有無、条件等についてはガイダンス等で説明する。いかなる理由でも再実験に対するさらなる追加措置はないものとする。",
        "preparatoryStudy": "1年次の実験、演習を前提条件とする。それぞれの実験テーマについて、授業資料ページ等を通じて資料の配布があるので、予習として実験実施前にその前提となっている知識を確認し、実施に必要な準備を整えること。また、実験実施後にはレポートに記載するためのデータ整理等を通じて復習すること。",
        "gradingGuidelines": "実験1および実験2における成果（発表やレポート）によって成績評価を行う。その割合は50:50とする。なお、やむえない理由で欠席した場合には速やかに追実験願いを提出することとする。どちらかのテーマで不可となったり、実験を行わなかった項目がある場合にはその他の条件によらずに不合格となる。これらの詳細については第1回に説明する。",
        "textbook": "なし",
        "referenceMaterials": "実験中に適宜紹介する。",
        "courseSchedule": "第1～7回：グループにより実験1or実験2第8～14回：グループにより実験2or実験1グループ分けについてはガイダンスもしくは第1回に説明する。実験1（半導体：固体の電子物性と素子の電気的特性）1.金属における電気抵抗の温度特性（正の依存性）2.半導体における電気抵抗の温度特性（負の依存性）3.光電効果（光子＆電子の量子性）4.ショットキーダイオードの作製（半導体素子を自分で作る）5.ショットキーダイオードの評価（自分の素子のI-V特性）6.ショットキーダイオードの解析（I-V特性と電子物性）7.成果報告実験2(電子制御)1.電子制御とは？開発ツールの設定と基本操作(シーケンサ\/Arduinoマイコン)2.ステージの位置制御(シーケンサ\/Arduinoマイコン)3.制御特性の評価と改善(シーケンサ\/Arduinoマイコン)4.開発ツールの設定と基本操作(Arduinoマイコン\/シーケンサ)5.ステージの位置制御(Arduinoマイコン\/シーケンサ)6.制御特性の評価と改善(Arduinoマイコン\/シーケンサ)7.成果報告",
        "courseDataUpdatedAt": "2024\/01\/10"
    },
    "updateAt": "2024\/09\/13"
}