{
    "lectureCode": "K605202",
    "courseName": "電気電子工学実験III[2Q]",
    "lecturer": [
        "前田就彦(工学部電気電子工学科)",
        "木村康男(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3",
        "木4",
        "木5",
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "工学基礎実験I、II、電気電子工学実験I、IIの集大成として、サステイナブル電気電子工学において重要な技術項目について、グループで実験から結果の解析、関連する技術調査、課題抽出、今後の技術開発や将来展望に関する議論までを行うアクティブラーニング型の授業を行う。題材としては、省エネで地球環境に優しい高度な情報通信社会を実現するために重要な、グリーンエネルギーやその利用、近年注目されつつあるエネルギーハーベスティング技術、通信技術に関するテーマやアイテムを扱う。これらの題材の選択は、サステイナブル社会の実現には、再生可能エネルギーの基幹エネルギーとしての効率的活用と同時に、省電力のセンサーや通信機器の開発・実現により、エネルギーハーベスティング技術などによる低電力の独立電源を活用可能にすることが重要であるという、サステイナブル電気電子工学の考え方に基づいている。また、本実験で扱う題材は、大企業からベンチャー企業までが将来的なビジネス展開を狙っている技術でもあり、企業における技術調査から研究企画までの模擬体験も意図している。",
        "outcomesMeasuredBy": "電気電子工学実験IIIでは、工学基礎実験I,II、電気電子工学実験I,IIの集大成として、サステイナブル工学に関連する再生可能エネルギー、電力連係、通信技術に関する実験を行う。また、後半に実験に関する発表会を行う。実験を成功させるためには、多くの困難を解決しなければならない。それらの原因をグループで分析、議論し問題を解決することより、コミュニケーション能力、論理的思考力、分析評価能力、問題解決力が身につく。また、後半に実験に関して発表を行うことにより、実学的な立場から工学に関する原理や技術を説明できるようになる。具体的には、以下のことができるようになる。１）各実験の原理を理解する。２）実験データを分析・評価することができる。３）実験データを論理的に議論し、それを結果としてまとめることができる。４）結果を論理的に発表することができる。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "グループで実験を行い、テーマ毎にレポートを提出する。１つのテーマの授業は２日間計６コマの授業から構成され、およその目安として、第１日目に実験、第２日目に主に結果のまとめ、討論などを行う。後半に発表会を開催する。",
        "notices": "実験装置は危険なものであり、また、高価で壊れやすい。わからない装置は勝手に触ってはならない。安全に実験を行うため、指導者の指示の下実験を行うこと。",
        "preparatoryStudy": "サステイナブル工学基礎の学習内容の理解を深めておくこと。また、次回の実験テーマについて予習し、その内容をよく調査し、原理について理解しておくこと。",
        "gradingGuidelines": "実験や発表資料の作成への取り組み、及びレポートなどの提出物により評価を行う。実験テーマ毎に提出されるレポート(70％)および発表内容(30％)により総合的に評価する。",
        "textbook": "指定しない",
        "referenceMaterials": "指定しない",
        "courseSchedule": "第1回：太陽電池の特性（１）第2回：太陽電池の特性（２）第3回：太陽光発電の電力系統連係（１）第4回：太陽光発電の電力系統連係（２）第5回：熱電発電（１）第6回：熱電発電（２）第7回：圧電発電／微小電力独立電源による無線信号伝送（１）第8回：圧電発電／微小電力独立電源による無線信号伝送（２）第9回：発表会準備第10回：発表会第11回：レクテナ技術（１）第12回：レクテナ技術（２）第13回：光ファイバー（１）第14回：光ファイバー（２）",
        "courseDataUpdatedAt": "2024\/01\/08"
    },
    "updateAt": "2024\/09\/13"
}