{
    "lectureCode": "K606301",
    "courseName": "電磁気学I",
    "lecturer": [
        "小原翔馬(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義棟Ｄ３０１"
    ],
    "courceDetails": {
        "courseOverview": "電磁気学は、電気・電子工学、通信工学、電子物性、ナノテクノロジーからグリーンエネルギーおよびそれら関連分野の基礎となる重要な科目である。電磁気学Ⅰでは、電場（電界）および磁場（磁界）がどのようなものかについて学び、それらの法則や理論が実際のデバイスや機器においてどのように応用されているかについても学習する。さらに、電磁誘導の諸現象を理解した後、オプトエレクトロニクスや光通信において重要な知識となる電磁波の基礎を学ぶ。なお、電磁誘導および電磁波に関する理論や応用についてさらに深く学ぶには、電磁気学Ⅱも履修することをすすめる。",
        "outcomesMeasuredBy": "この講義を通じて、電磁気学に関する専門知識および論理的な思考力を身につけることを目標とする。具体的には、電気および磁気について理解し、電気・電子工学の基礎力、ひいては、電子物性、電子デバイス、通信工学、グリーンエネルギー、パワーエレクトロニクスおよびそれら関連分野を学ぶための基礎学力を身につける。電場および磁場がどのようなものかについて学び、それらの概念や特性が実際のデバイスや機器においてどのように応用されているかについて理解する。電磁誘導の諸現象を学び、オプトエレクトロニクスや光通信の基礎となる電磁波について理解する。電気および磁気を身近な現象および技術として捉え、家庭や業務上の製品や電子部品との関連性を理解し、ひいては電気エネルギーと省エネルギーに対する関心を深めて問題解決力および実学に基づく専門能力を養う。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "全体としては講義形式で行う。基礎的な問題を例題として講義中に取り上げる。",
        "notices": "講義内容をよく理解するためには、毎回の予習・復習、および基礎数学の予備知識が大切である。電気や磁気に関する興味を広く持ち、積極的に学ぶこと。",
        "preparatoryStudy": "高校レベルの物理の内容はもとより、微分・積分およびベクトルの知識が必要である。なお、毎回の講義内容は前回までの内容を理解している前提で進行するため、しっかりと復習を行うこと。",
        "gradingGuidelines": "中間試験（40%)および期末試験の結果（60%）の合計で成績を評価する。",
        "textbook": "「電磁気学」，多田泰芳，柴田尚志共著，コロナ社授業にて配布する資料",
        "referenceMaterials": "「第5版物理学基礎」，原康夫著，学術図書出版「電磁気学ノート(改訂版)」，藤田広一著，コロナ社「マグロウヒル大学演習電磁気学」，JosephA.Edminister著，オーム社",
        "courseSchedule": "第1回：スカラーとベクトル第2回：電界と電位(1)電界の線積分，保存場第3回：電界と電位(2)電位の和第4回：電界と電位(3)電位の勾配第5回：電荷と電位(1)電界の発散第6回：電荷と電位(2)ガウスの法則第7回：中間確認テスト第8回：電流と磁界(1)ベクトル積第9回：電流と磁界(2)ストークスの定理第10回：電流と磁界(3)アンペールの法則第11回：電磁誘導第12回：電荷保存則と変位電流第13回：マクスウェル方程式第14回：期末確認テスト",
        "courseDataUpdatedAt": "2024\/02\/06"
    },
    "updateAt": "2024\/09\/13"
}