{
    "lectureCode": "K701601",
    "courseName": "物理化学II[2023年以前入学者]",
    "lecturer": [
        "原賢二(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "金4"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "物理化学は、物質の状態、構造、性質や変化を物理法則に基づいて記述する分野であり、有機化学、無機化学と並ぶ応用化学の基幹科目である。高分子化学、材料科学、環境科学、化学工学から生物学におよぶ様々な分野の化学現象を理解するためには、原子・分子レベルでの挙動と巨視的な現象を定量的に考察する物理化学的視点が基盤となる。本講義では、１年後期「物理化学I」に引き続き、巨視的現象を記述する熱力学の基礎について習得することをねらいとする。化学ポテンシャル、相平衡、混合物・溶液、平衡、反応速度について理解をし、状態の変化および化学反応を熱力学を用いて記述する方法論を体得することにより、サステイナブル工学を実践する上で基礎的かつ重要になる、化学現象を論理的に解釈する知識・能力が身につく。",
        "outcomesMeasuredBy": "１）純物質の相の安定性と相転移の関係を説明できる。２）混合物や溶液の状態を熱力学的な物理量で記述・説明できる。３）2成分系の相図が表す意味を説明できる。４）平衡状態およびその挙動について予測できる。５）種々の反応について適切な速度式に基づいて解析することができる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "黒板とプロジェクターを用いた講義形式で行う。ノートPC持参。原則として、講義の開始時にその回の予習やその理解度を確認する調査をMoodle上で実施する。また、授業中あるいは終了前に理解度チェックのための小テストをMoodle上で行う。これらMoodle上の回答を教員がその場で集計・評価・公開することにより、各学生が自身の理解度や学習の取り組みについて客観的に判断し、主体的に学ぶこと（アクティブラーニング）を促す。必要に応じて、復習のための宿題を課する。授業を受けながら記入するワークシートを配布する回もある。",
        "notices": "数式に惑わされることなく、数式が表す物理的な意味を理解することに努力をして欲しい。また、分からないことをそのままにせず、積極的に質問をすることが、理解を深めるために重要である。何が分からないのかを、自分なりに考えるようにして欲しい。",
        "preparatoryStudy": "「化学基礎」、「化学基礎演習」および「物理化学I」で学んだ内容をしっかり理解していることが必要である。また、「微分積分」で学んだ内容を十分に復習しておくこと。教科書の該当部分をあらかじめしっかり読んで授業に参加する。各回の理解度チェックの内容を中心に復習を行い、疑問点を後に残さないように心がけること。",
        "gradingGuidelines": "到達度チェック・期末試験ならびに各回に行う理解度チェックや宿題の成績により評価する。（到達度チェック・期末試験50%、理解度チェック・宿題50%として、総合的に判断する。）",
        "textbook": "P.Atkins・J.dePaula著、中野元裕・上田貴洋・奥村光隆・北河康隆訳、「アトキンス物理化学（上）」第10版、東京化学同人P.Atkins・J.dePaula著、中野元裕・上田貴洋・奥村光隆・北河康隆訳、「アトキンス物理化学（下）」第10版、東京化学同人",
        "referenceMaterials": "P.Atkins・J.dePaula著、「Atkins'PhysicalChemistry,10thedition」,OxfordUniversityPress.ボール「物理化学（第2版）〔上〕、化学同人寺島正秀他「現代物理化学」、化学同人",
        "courseSchedule": "第1回：純物質の相図第2回：相転移の熱力学的側面第3回：混合物の熱力学的な記述第4回：溶液の性質第5回：2成分系の相図第6回：活量第7回：到達度チェックと復習第8回：平衡定数第9回：反応条件と化学平衡第10回：電気化学セル、電極電位第11回：反応速度(1)化学反応速度論第12回：反応速度(2)速度式の解釈第13回：反応速度(3)反応機構第14回：到達度チェックと復習",
        "courseDataUpdatedAt": "2025/01/07"
    },
    "updateAt": "2025/03/21"
}