{
    "lectureCode": "K702801",
    "courseName": "放射線化学",
    "lecturer": [
        "須磨岡淳(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ２０１"
    ],
    "courceDetails": {
        "courseOverview": "放射線の生体分子への影響について理解する。そのためには、生命活動を化学の視点から捉え、分子レベルで理解することが重要である。本科目では、まず、生命基本となる、糖質、アミノ酸、タンパク質、脂質、核酸の化学的な構造、性質、反応性について学ぶ。さらに、核酸に保存された遺伝情報からどのようにタンパク質が合成されていくのか、どのようにしてエネルギー生産が行われているのかを分子レベルで理解する。また、核酸やペプチドの化学合成や、遺伝子操作などのバイオテクノロジー技術や放射線の生体分子への影響について学ぶ。",
        "outcomesMeasuredBy": "本科目を修得することで、化学的な視点で生体分子や生体反応を理解することができるようになる。具体的には以下の通りである。・生体を構成する分子の構造と性質が説明できる。・遺伝情報からタンパク質がどのように合成されるかを説明できる。・生体物質の代謝の概要について説明できる。・タンパク質や核酸関する、分析と化学合成について説明できる。・生体分子に対する放射線の影響を説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "授業は，プロジェクターを使用するとともに板書を併用する。また，講義内で複数回の理解度チェックを行う。ノートPC必携。",
        "notices": "学修する範囲は広いので、闇雲に暗記せず本質を理解すること。有機化学I、無機化学、物理化学I、有機化学II、物理化学II、生物化学を履修しておくと理解が深まる。",
        "preparatoryStudy": "教科書の該当部分をよく読み、分らない用語について調べておくこと（100分程度）。また、復習として、課題問題を解き、講義内容の理解を深めること（100分程度）。",
        "gradingGuidelines": "毎回の講義内で実施する理解度チェック・到達度チェック（40％）、復習課題や講義内のクイズ（20％）、期末試験（40％）から総合的に評価する。理解度チェックや期末試験のフィードバックは各講義時間中またはMoodle上で行う。",
        "textbook": "「イラスト基礎からわかる生化学」坂本順司（裳華房）「マクマリー有機化学第9版（下）」JohnMcMurry（東京化学同人）また、必要に応じて資料をMoodleにアップロードする。",
        "referenceMaterials": "「マクマリー生物有機化学[生化学編](原書8版)」（丸善）「ヴォート基礎生化学(第5版)」DonaldVoet,CharlottePratt,JudithVoet（東京化学同人）「ストライヤー生化学(第8版）」J.M.Berg,J.L.Tymoczko,L.Stryer(東京化学同人）",
        "courseSchedule": "第1回：糖質第2回：分子間力と水第3回：脂質第4回：タンパク質とアミノ酸第5回：核酸とヌクレオチド第6回：生体物質の構造に関するまとめ第7回：到達度チェック第8回：酵素の特徴第9回：酵素反応のしくみ（具体的な反応機構を示しながら）第10回：酵素の速度論第11回：生体エネルギー学，代謝の概要第12回：エネルギー共役、調節、鋳型に基づく合成反応第13回：オリゴペプチドの化学合成と分析第14回：オリゴヌクレオチドの化学合成とバイオテクノロジー（遺伝子操作と周辺技術）、放射線の生体分子への影響",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}