{
    "lectureCode": "K703703",
    "courseName": "有機化学演習[1Q]",
    "lecturer": [
        "上野聡(工学部応用化学科)",
        "須磨岡淳(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火3",
        "木3"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ２０２"
    ],
    "courceDetails": {
        "courseOverview": "有機化学Ⅰ、有機化学Ⅱ、生物化学で学んだ内容について演習を行うことで、基礎的な有機化学の知識を確実に習得する。特に、化学構造やその反応性、合成法について、指定された教科書に沿って化合物別に学ぶ。この授業では、化合物名あるいは化学構造式からその性質や反応性、合成法に関する知識が身につく。",
        "outcomesMeasuredBy": "有機化合物の化学構造式を見て、その化合物名が分かる。化学構造式あるいはその化合物名からその化合物の物性を推測できる（論理的な思考力）。化学構造式からその合成法や変換方法を考えることができる（実学に基づく専門能力、問題解決力）。分光学的な手法で得られたデータを基に、その化合物を推測できる（分析・評価能力）。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業では主にプロジェクターを用いて説明するが、授業中の受講生の理解度や質問などによっては、要点を板書することがある。授業では毎回理解度チェックを行う。",
        "notices": "事前に有機化学Iと有機化学II、生物化学を履修しておくことが望ましい。",
        "preparatoryStudy": "毎回事前に配布する練習問題とその解答を参考にして、それらの解き方を勉強しておく。授業では、それらの問題の解説を行った後に質問を受け付け、最後に類似した問題について理解度チェックを行なう。また、理解度チェックの解答を参考に理解度を各自で確認し、教科書の類題を解いて復習すること。",
        "gradingGuidelines": "予習課題（20%）理解度チェック(80%)Moodleを通じてあるいは答案用紙の返却や講義内での解説によって理解度チェックのフィードバックを行う",
        "textbook": "マクマリー有機化学（上）（中）（下）第9版（東京化学同人、JOHNMcMURRY著）",
        "referenceMaterials": "困ったときの有機化学（化学同人、D.R.クライン著、竹内敬人・山口和夫訳）有機化学演習III大学院入試問題を中心に（東京化学同人、豊田真司著）",
        "courseSchedule": "第1回：ガイダンス、構造と結合、極性共有結合；酸と塩基（上野）第2回：有機化合物：アルカンとその立体化学、シクロアルカンとその立体化学（上野）第3回：四面体中心における立体化学、有機反応の概観（上野）第4回：アルケン：構造と反応性、反応と合成（上野）第5回：アルキン：有機合成序論（上野）第6回：有機ハロゲン化物、ハロゲン化アルキルの反応：求核置換と脱離（上野）第7回：ベンゼンと芳香族性、ベンゼンの化学：芳香族求電子置換（上野）第8回：アルコールとフェノール（須磨岡）第9回：エーテルとエポキシド；チオールとスルフィド（須磨岡）第10回：アルデヒドとケトン：求核付加反応（須磨岡）第11回：カルボン酸とニトリル、カルボン酸誘導体：求核アシル置換反応（須磨岡）第12回：カルボニルα置換反応（須磨岡）第13回：カルボニル縮合反応（須磨岡）第14回：アミンと複素環（須磨岡）",
        "courseDataUpdatedAt": "2024\/03\/27"
    },
    "updateAt": "2024\/09\/13"
}