{
    "lectureCode": "K704301",
    "courseName": "卒業課題I",
    "lecturer": [
        "山下俊(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": "4",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "卒業課題はこれまでの講義や演習を通じて学んだ知識をもとに大学での学びを総括するものであり、担当教員の指導のもとに特定の課題についての探求を行う。新規性、創造性や客観的有用性を含んだ研究課題を設定し、独自の視点で課題を設定し研究を遂行することが求められる。卒業課題Iでは、創成課題に引き続き、配属された研究室において指導教員の指導を受けながら、研究課題の目的（何のために）、目標（何をめざすか）、課題（問題点の抽出）、手法（問題点の解決手法）、スケジュールなどを具体的に立案する。これらについては研究室内のミーティングおよび学科全体で行う中間発表会で議論し、卒業課題の目標達成に反映させる。",
        "outcomesMeasuredBy": "卒業課題Iでは、研究室において特定の課題に関する研究に取り組むことにより、それぞれの分野における専門能力を育成する。自ら課題を設定し解決するプロセスを実践することにより、問題解決力が養われる。また、研究で得られた結果を解析し、次の課題を設定するプロセスの繰り返しにより、分析評価能力が身につく。さらに、研究レポートや発表原稿をまとめることによって、論理的思考力が身につく。研究室ではさまざまなことを仲間と協力して調整し、実施することが必要である。この過程を通してコミュニケーション力も身につけることができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "創成課題で配属された研究室で、教員の指導の下でおこなう演習形式の授業である。特定の課題について、調査、実験、解析を行い、研究室内での週1回以上の定期ミーティングにおいて、進捗状況・成果を指導教員および研究室の他の学生に報告・説明し、それに基づき議論を行う。ミーティングなどの具体的な日時は学期の初めに研究室で相談して決定する。",
        "notices": "上記の研究室の集まりの他に、各自の日常の勉学・研究、研究室内、研究室間の学生間の交流・討議が重要である。就職試験における面接の質問や作文のテーマには、卒業課題に関するものがとりあげられることが多いので，そのためにも日頃から卒業課題に打ち込んでいる必要がある。",
        "preparatoryStudy": "研究の進め方によって予習・復習の内容は異なるので、指導教員との十分な打合せが必要である。また、研究室内での集まり、発表会などのためには、その準備などに十分な時間をかけなければならない。",
        "gradingGuidelines": "報告の提出、中間審査会の概要提出と発表を行うことが、単位取得の必要条件である。その成績については、期間内の卒業課題に対する取り組みの状況、日常の研究室内での発表会の内容、中間審査会での発表内容や質疑の内容を総合して評価する。",
        "textbook": "授業の中で指示する。",
        "referenceMaterials": "授業の中で指示する。",
        "courseSchedule": "授業や学部学科の行事がない時間は、研究活動（研究・研究会・発表会など）に従事する。創成課題において指導教員と相談し決めた研究テーマに沿って実験を行う。研究（毎日）：研究室で定められている研究会・発表会などの行事の時間帯以外は、指導教員と相談して決めた研究テーマに沿って実験を行う。研究会（毎週）：自分の研究の進捗状況を発表し、行ってきた実験内容を教員や他の研究室メンバーと議論する。また、他の研究室メンバーの発表を聞くことで、自分の研究に役立つ情報を収集する。発表会（毎週）：研究に関連する文献を調査・精読し発表する。また、他の研究室メンバーによる発表から、自分の研究の背景や展望を深く理解する。期末時に中間審査会を実施する。",
        "courseDataUpdatedAt": "2024\/01\/17"
    },
    "updateAt": "2024\/09\/13"
}