{
    "lectureCode": "K70531",
    "courseName": "化学基礎演習1",
    "lecturer": [
        "入谷康平(工学部応用化学科)",
        "山下俊(工学部応用化学科)",
        "原賢二(工学部応用化学科)",
        "藤田隆史(工学部応用化学科)",
        "橋本徹(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火",
        "火2"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ１０２",
        "片柳研究所Ｅ１０３",
        "片柳研究所Ｅ１０４"
    ],
    "courceDetails": {
        "courseOverview": "化学基礎演習では、大学でこれから学ぶ化学を理解する上で必要となる基礎知識を身につけることを目的に、化学基礎の講義で学んだ内容を確認する演習を行う。１時間目は反転授業を取り入れながら化学基礎で講義した箇所の課題の解説を行う。２時間目はまとめの演習問題およびその解説を行う。さらに学びを定着するための問題にも取り組む。本演習により、化学系の専門科目を理解するための化学的な記述法、化学的な解析法、化学的な思考法などの基礎知識が身につく。",
        "outcomesMeasuredBy": "大学で学ぶ有機化学・物理化学などの専門科目を理解する上で必須となる化学的記述法、解析法、思考法などの基礎力に加え、実験的に観察された現象から化学法則にしたがって結論を導き出す化学的思考力を身につけることが本講義の到達目標である。",
        "learningOutcomes": "論理的な思考力分析・評価能力",
        "teachingMethod": "本講義は、習熟度別に編成したクラスで受講する。化学基礎の講義の際に演習問題（宿題）を配布する。演習１時間目には、宿題のチェックおよび解説を行う。次に、演習問題（クイズ）を行い、解答用紙を回収した後に、それについての解説を行う。演習２時間目には、演習内容に関連する問題を解く。講義内でソフトウェア教材のOdysseyを用いて、有機分子の構造に関して視覚的な理解を深める。Moodle講義ページを利用するためノートPC必携。",
        "notices": "宿題は必ず解いてくること。疑問点は講義時間内に積極的に質問すること。各自ノートパソコンと関数電卓を持参すること。また、各回の演習問題の成績不振者には学修支援センターの利用を義務付ける。",
        "preparatoryStudy": "化学基礎の講義の際に指定された宿題を解いてきて演習に臨むこと。指示された演習問題を事前に解答して授業に臨み、授業後は演習問題を解き直し、授業内容が定着するように復習を行うこと。",
        "gradingGuidelines": "授業中の演習問題（80%）および授業への取り組み（20%）で評価する。",
        "textbook": "ティンバーレイク「教養の化学」（渡辺正,尾中篤訳）東京化学同人マクマリー有機化学（上）第9版（伊東他訳）東京化学同人",
        "referenceMaterials": "アトキンス物理化学（上）第10版（中野他訳）東京化学同人なお、上記参考書は専門科目（物理化学I、物理化学II、電気化学、界面化学、量子化学、工業物理化学）において教科書として使用されるので、早めに入手しておくことを勧める。",
        "courseSchedule": "第1回【山下】：測定および物質とエネルギー；測定値と有効数字、換算係数第2回【原】【入谷】【藤田】：測定および物質とエネルギーおよび元素と原子；測定値と有効数字、換算係数、元素の周期表、原子番号、原子量第3回【原】【入谷】【藤田】：電子配置と周期性;原子スペクトルとエネルギー順位、軌道図と電子配置第4回【原】【入谷】【藤田】：構造と結合；化学結合論、混成軌道第5回【入谷】【藤田】、【橋本】：物質の量および反応の表記と分類；原子量とモル質量、実験式と分子式、化学反応式、結合反応、分解反応、置換反応、有機化合物の官能基第6回【入谷】【藤田】【橋本】：量でみる化学反応および分子やイオンの形と引き合い；モルの関係、質量の関係第7回【入谷】【藤田】【橋本】：極性共有結合および分子やイオンの形と引き合い；結合の極性、共鳴構造、ルイス構造、多重結合と共鳴構造、分子やイオンの形、分子の引き合い、非共有結合性相互作用、状態変化",
        "courseDataUpdatedAt": "2024\/05\/14"
    },
    "updateAt": "2024\/09\/13"
}