{
    "lectureCode": "K70641",
    "courseName": "物理化学2",
    "lecturer": [
        "入谷康平(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "物理化学は、物質の状態、構造、性質や変化を物理法則に基づいて記述する分野であり、有機化学、無機化学と並ぶ応用化学の基幹科目である。高分子化学、材料化学、環境化学、化学工学から生物学におよぶ様々な分野の化学現象を理解するためには、原子・分子レベルでの挙動と巨視的な現象を定量的に考察する物理化学的視点が基盤となる。本講義では、巨視的現象を記述する熱力学の基礎を習得することをねらいとする。熱と仕事、エネルギーについて理解をし、化学反応および状態の変化を熱力学を用いて記述する方法論を体得することにより、サステイナブル工学、中でもサステイナブル化学を実践する上で最も基礎的で重要な、化学現象を論理的に解釈し、さらに分析・評価する知識・能力が身につく。",
        "outcomesMeasuredBy": "本科目を修得することで、物理化学を基盤にした物質・材料の分析・評価、数物的考察に基づいた解釈を進める力が身につく。具体的には、以下のことができるようになる。１．エントロピー、ギブズエネルギー、ヘルムホルツエネルギーなどの熱力学関数を用いて化学反応や状態変化の解析ができる。２．冷凍機などの実デバイスのエネルギー効率の見積もりや動作原理の説明ができる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義は板書とプロジェクターを併用してすすめる。また、毎回講義内もしくは宿題として課題を課し、その回の講義内容の確認と復習を行う。MoodleへのアクセスのためにノートPCを使用する。",
        "notices": "数式に惑わされることなく、数式が表す物理的な意味を理解することに努力をして欲しい。教科書以外に参考書を提示するので、自分にとって理解しやすい物理化学の書籍を選び、補助教材として活用すること。また、分からないことをそのままにせず、積極的に質問をすることが、理解を深めるために重要である。何が分からないのかを、自分なりに考えるようにして欲しい。",
        "preparatoryStudy": "予習として、教科書をよく読み、講義において自分の学ぶべきことを明確にしておくこと。復習として、演習問題を配布するので、これを解くこと。これにより自分の理解できていない部分を明らかにし、補うこと。必要ならオフィスアワーに教員を尋ねること。あるいは学習支援センターを利用すること。",
        "gradingGuidelines": "毎講義で実施する理解度チェック（６０％）と期末試験（４０％）により総合的に評価する。理解度チェックや定期試験のフィードバックは各講義時間中またはMoodle上で行う。また、授業最終回で全体に対するフィードバックを行う。",
        "textbook": "P.Atkins・J.dePaula著、中野他訳、「アトキンス物理化学（上）第10版」、東京化学同人",
        "referenceMaterials": "P.Atkins・J.dePaula著、「Atkins'PhysicalChemistry,10thedition」,OxfordUniversityPress.ボール「物理化学（第2版）〔上〕、化学同人",
        "courseSchedule": "第1回：熱力学第二法則(1)エントロピー、分子の持つエネルギー第2回：熱力学第二法則(2)エントロピーの定義と分子論的解釈、エントロピーの統計的な定義、カルノーサイクル第3回：熱力学第二法則(3)カルノーサイクルの拡張、熱力学温度、クラウジウスの不等式第4回：熱力学第二法則(4)エントロピーの計算、トルートンの規則第5回：熱力学第三法則(1)Nernstの熱定理、標準エントロピー，残余エントロピー第6回：熱力学第三法則(2)ヘルムホルツエネルギー，ギブズエネルギー第7回：熱力学第三法則(3)第一法則と第二法則の結合；まとめと演習",
        "courseDataUpdatedAt": "2024\/02\/06"
    },
    "updateAt": "2024\/09\/13"
}