{
    "lectureCode": "L10102",
    "courseName": "リベラルアーツ特論[日本と世界の政治的論点を議論する]",
    "lecturer": [
        "落合浩太郎(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "月4"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟３０１"
    ],
    "courceDetails": {
        "courseOverview": "リベラル・アーツ科目として正解のないことを考えて議論します。２０２４年兵庫知事選挙では、オールド・メディア（テレビ・新聞）対ソーシャル・メディア、中高年対若者の対立や二極化が指摘されました。また、川口市のクルド人をめぐっても、正反対の情報が流されています。真実（ファクト）はどちらなのか。そもそも真実は存在するのか。ファクト・チェックはどこまで可能なのか。相反する情報の中で、どう考えて生きていけばいいのかを探究します。正解はないかもしれませんが、世界・日本・社会・人間についての理解は深まるはずです。その他のテーマは学生と相談して決めますが、他に死刑、安楽死、ヘイト・スピーチ規制等が候補です。",
        "outcomesMeasuredBy": "情報の真偽を見極める能力（メディア・リテラシー）を身につけ、世界や日本や人間についての理解を深めます。議論での他人の意見を聞き、異なる立場や意見の他者との「対話」ができるようになります。数回のレポート作成、学修支援センターでのチェックを受けて、きちんとしたレポートを正しい日本語で書けるようになります。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "各課題についてのレクチャー、自らの情報収集、資料の読みこみ、議論、レポート作成、学修支援センターでのレポート・チェック、教員によるレポート講評というサイクルです。講義科目ですが、演習に近いスタイルになります。ノートＰＣを使用します。",
        "notices": "政治学・国際関係論の基本的理解がないと十分な学習ができません。この２科目の最低１科目の単位を修得してからの履修を勧めます。また、自分で調べて、資料を読み、自分で考え、議論で積極的に発言し、数回レポートを書き、学修支援センターでのチェックを受けるという、負荷の多い科目であり、強い意欲が求められることを覚悟して履修して下さい。定員は１０名です。",
        "preparatoryStudy": "新聞、テレビ、ネットで日本や世界のニュースをチェックしてください。",
        "gradingGuidelines": "議論での発言の回数と内容（５０％）、レポート（５０％）で評価します。レポートの評価は次回講義で行います。",
        "textbook": "指定しません。",
        "referenceMaterials": "村上靖彦『客観性の落とし穴』筑摩書房嶋崎史崇『ウクライナ・コロナワクチン報道にみるメディア危機』本の泉社石井孝明『埼玉クルド人問題』ハート出版角南圭佑『ヘイトスピーチと対抗報道』集英社立石陽一郎『ファクトチェックとは何か』岩波書店立石洋一郎『ファクトチェック最前線』あけび書房",
        "courseSchedule": "第1回：ガイダンス第2回：課題１「兵庫知事選をどう見るか」レクチャー、資料読み込み第3回：課題１議論第4回：課題１まとめ、レポート講評第5回：課題２「川口クルド人問題をどう見るか」レクチャー、資料読み込み第6回：課題２議論第7回：課題２まとめ、レポート講評第8回：課題３レクチャー、資料読み込み第9回：課題３議論第10回：課題３まとめ、レポート講評第11回：課題４レクチャー、資料読み込み第12回：課題４議論第13回：課題４まとめ、レポート講評第14回：全体まとめ",
        "courseDataUpdatedAt": "2025/01/27"
    },
    "updateAt": "2025/03/21"
}