{
    "lectureCode": "L20601",
    "courseName": "宗教学[木1]CSES",
    "lecturer": [
        "髙瀬航平(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科,工学部機械工学科,工学部電気電子工学科,工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ５０２"
    ],
    "courceDetails": {
        "courseOverview": "ニュースなどからも分かる通り、宗教は今日もなお、日本を含む世界各地で政治や社会を動かす原動力のひとつになっています。また日本に暮らしていても、労働や観光などを目的に海外から多くの人々が訪れるようになったため、様々な宗教的背景を持つ人々と交流する機会が格段に増えました。宗教学は、このようにグローバル化が進む国際社会で生きるために欠かせない教養のひとつです。宗教学とは、特定の宗教への信仰を前提とする神学とは異なり、宗教を人間の営みとして捉え、その歴史や機能、政治や社会との関係などを多様な視点から明らかにする学問です。「（本当の）宗教とは何であるべきか」ではなく、「宗教とは過去何であったのか、いま何であるのか」を問う学問ともいえます。ゆえに宗教学を学ぶことで、自分とは異なる宗教的背景を持つ人々と円滑な関係を結ぶための様々な示唆を得ることができます。しかし、日本の多くの学校では宗教学の授業がないため、宗教学という名前自体大学に入って初めて知ったという方も多いでしょう。なかには漠然と「宗教（学）は自分とは縁遠いもの、関係ないもの」と考えている方もいるかもしれません。そこで本授業では、身近な（はずの）日本の宗教を題材に、宗教学の基礎を学びます。具体的な目標は、宗教学の基本的な考え方を習得し、日本の様々な宗教の歴史や現状について海外の事例とも比較しつつ説明できるようになることです。それにより、自分のなかにある「宗教」の固定的なイメージやそれに基づく偏見を改め、現代社会で宗教的背景の多様な他者とともに生きるために必要な寛容さを養うことを目指します。",
        "outcomesMeasuredBy": "・宗教学の基本的な考え方を説明できる。・日本の様々な宗教について概要や現在までの歴史を説明し、海外の事例と比較できる。・宗教学の概念や宗教史の知識を用いて、現代日本の宗教に関するテーマについて自分の意見を表現できる。・宗教的背景の異なる他者に関して寛容な行動を取ることについて具体的なアイディアを提案できる。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "・授業は講義形式で行います。・授業プリントや関係論文は各回の授業の前日までにMoodleにアップロードします。どちらも読み予習を行ってください。・ノートPC必携です。・質問があれば口頭、リアクションペーパー、メールなどで随時行ってください。・授業で使用したスライドは、授業終了後にMoodleにアップロードします。スライドを読むことで復習を行ってください。・リアクションペーパーや理解度確認小テストが課された場合、かならず期限までに回答してください。",
        "notices": "・履修条件としての予備知識は求めません。・授業全体の構成や評価方法は第1回の授業で説明します。・授業中、プリントやスライドを見ながら説明を聞くだけでは知識はなかなか定着しません。かならずノートを取ることを心がけてください。・Web出席システムを使います。毎回の授業時に出席の入力を行ってください。・やむをえず授業を欠席した回については、授業プリント、関係論文、スライドをMoodleから入手し、補完的に自習を進めてください。",
        "preparatoryStudy": "【予習】・Moodleに事前にアップロードする授業プリントと関係論文を読んでください。・予習時間60分×14回【復習】・授業プリント、関係論文、授業中に各受講者が取るノート、授業後にMoodleにアップロードする授業スライドを読んでください。・授業後にリアクションペーパーや理解度確認小テストが課された場合、それに取り組み期限までに回答してください。・復習時間120分×14回【さらなる学習について】・本シラバスに掲載した参考書や、授業中に紹介する書籍・ウェブサイトを積極的に読み、理解を深めましょう。",
        "gradingGuidelines": "【成績評価について】次の2項目により評価します。・リアクションペーパーおよび理解度確認小テスト：40%・定期試験：60％【フィードバックについて】・リアクションペーパーについては、実施した次の授業でいくつかの回答を紹介し、コメントを述べます。・理解度確認小テストについては、実施した次の授業で正解を示し解説します。・最終授業で全体に対するフィードバックを行います。",
        "textbook": "とくに指定しません。",
        "referenceMaterials": "【宗教学に関する入門書】・脇本平也『宗教学入門』講談社学術文庫、1997年。・伊原木大祐、竹内綱史、古荘匡義編『3STEPシリーズ4宗教学』昭和堂、2023年。【日本の宗教に関する入門書】・岩田文昭、碧海寿広編著『知っておきたい日本の宗教』ミネルヴァ書房、2020年。【より詳しく学びたい方へ】・池澤優、藤原聖子、堀江宗正、西村明編『いま宗教に向きあう』全4巻、岩波書店、2018年。・島薗進、末木文美士、大谷栄一、西村明編『近代日本宗教史』全6巻、春秋社、2020–2021年。",
        "courseSchedule": "第1回：宗教とはなにか：宗教学の基本的な考え方と教養として学ぶ意義第2回：「日本人」は「無宗教」なのか：データから見る日本や世界の宗教状況第3回：なぜ正月に初詣でに行くのか：日本や海外の暦・巡礼・年中行事第4回：なぜお盆に墓参りに行くのか：墓や葬送の歴史と現代の終活第5回：仏教はどのように日本に広まったのか：6世紀の仏教公伝から現代の「寺院消滅」へ第6回：神道は「宗教」なのか：日本神話・神社・皇室祭祀・教派神道第7回：なぜキリスト教は禁止されたのか：16世紀の弾圧・潜伏から19世紀の解禁・宣教へ第8回：新宗教とはなにか：19世紀の組織化から20世紀の「神々のラッシュアワー」へ第9回：海外ルーツの宗教にとって日本社会は寛容か：現代日本におけるイスラム教徒の生活第10回：政治と宗教はどのような関係にあるのか：信教の自由と政教分離第11回：学校で宗教はどのように教えられているのか：日本と海外の教科書の比較第12回：なぜ女性を聖地に入れないのか：ジェンダーから見る日本宗教史第13回：「カルト」問題とはなにか：「カルト」イメージの危うさと問題の具体相第14回：まとめと振り返り：宗教学を通じて養う他者への寛容さ",
        "courseDataUpdatedAt": "2025/03/18"
    },
    "updateAt": "2025/03/21"
}