{
    "lectureCode": "L21103",
    "courseName": "メディアコミュニケーション論[木2]BSMSES",
    "lecturer": [
        "鈴木万希枝(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "応用生物学部応用生物学科,工学部機械工学科,工学部電気電子工学科,工学部応用化学科,メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ４０３"
    ],
    "courceDetails": {
        "courseOverview": "メディア環境の劇的な変化は、私たちの日常生活におけるコミュニケーションへ大きな影響を及ぼしています。本講義では、新聞やテレビなどのマス・メディアを通じてなされるマス・コミュニケーション、PCやスマートフォンなど電子メディアを利用したオンライン・コミュニケーションが及ぼす社会心理学的な影響のメカニズムについて検討し、それらを理解するために必要な基礎的概念や理論について修得することを目的とします。まず、エンタテインメント、ゲーム、ニュースなどのメディア・コンテンツの利用を導く欲求やその利用の影響について、そして青少年、消費者、有権者といった異なる発達段階や社会領域におけるオーディエンスとメディアの関わりについて学びます。その上で、メディア表象によるテレオタイプの維持、誤情報・偽情報の拡散など、具体的なメディアコミュニケーションの社会課題について理解を深め、国際的な教養を身につけます。",
        "outcomesMeasuredBy": "学習したメディアコミュニケーションにかかわる概念や理論を理解し、自身のコミュニケーション行動の理解や改善につなげられることを目指します。また、ステレオタイプや偏見、ネット炎上やフェイクニュース、ゲーム依存など、今日のメディア環境において生じているさまざまな社会課題について考察し、解決策を導き出す力を養うことを目標とします。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "各テーマについて講義を中心におこないます。いくつかのテーマについては、講義に先立って体験を尋ねたり、小調査を実施しながら進めます。すべての課題提出はMoodleを利用します。ノートPC等、Moodleを利用できる環境を準備してくること。",
        "notices": "・前期開講の「社会心理」のアドバンス科目です。「社会心理」の単位取得を履修条件にはしませんが、社会心理学の主要概念や理論の習得を前提とした内容になっていますので注意して下さい。「社会心理」未履修者は、各回の内容に関連する社会心理学の概念や理論について自習が必要な場合があります。・第２回からは教科書を使用します。・授業冒頭に小テストを実施する予定です。遅刻すると小テストが受けられませんので注意して下さい。",
        "preparatoryStudy": "予習：教科書の該当部分を読んでくる。また、各回のテーマに関連するメディアコンテンツや社会的出来事について事例を収集するなど、最近の動向についてある程度の知識をもって受講すること。（100分程度）復習：授業スライドの空所部分を埋める。教科書と授業スライドによって講義内容を振り返り、次回の小テストに備えること。小テストで正解できなかった問題は、重点的に復習すること（100分程度）",
        "gradingGuidelines": "小テストやミニレポートなどの提出課題（40%）および期末試験(60%)によって評価します。100点満点中60点以上が単位認定条件です。提出課題に対するフィードバックは講義内、またはMoodleを通じて行います。",
        "textbook": "李・渋谷編著，メディアオーディエンスの社会心理学【改訂版】，新曜社，2021",
        "referenceMaterials": "辻・是永・関谷著，コミュニケーション論をつかむ，有斐閣，2014橋元良明編著,メディア・コミュニケーション学，大修館書店，2008",
        "courseSchedule": "第1回：イントロダクション第2回：メディア・コンテンツ（１）エンタテインメント・スポーツ第3回：メディア・コンテンツ（２）広告第4回：メディア・コンテンツ（３）ゲーム第5回：メディア・コンテンツ（４）ニュース①第6回：メディア・コンテンツ（４）ニュース②第7回：メディア・オーディエンス（１）青少年第8回：メディア・オーディエンス（２）消費者第9回：メディア・オーディエンス（３）有権者第10回：メディアコミュニケーションの社会的課題（１）メディア表象とステレオタイプ第11回：メディアコミュニケーションの社会的課題（２）情報共有・検索第12回：メディアコミュニケーションの社会的課題（３）ゲーム依存第13回：メディアコミュニケーションの社会的課題（４）情報の信頼性第14回：まとめ",
        "courseDataUpdatedAt": "2024\/02\/23"
    },
    "updateAt": "2024\/09\/13"
}