{
    "lectureCode": "L21301",
    "courseName": "芸術論[月1]",
    "lecturer": [
        "東晴美(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ２０２"
    ],
    "courceDetails": {
        "courseOverview": "この授業では、芸術について、演劇・舞台芸術を例にとって学びます。まず、現代の日本の芸術の基礎となった、西洋芸術の特色について学びます。次に、西洋芸術とは異なる独自の発展をとげた日本の伝統芸術を概観します。また、難解だと思われがちな古典芸能の鑑賞のポイントも紹介します。最後に、漫画、アニメ、ゲーム、ミュージカルなどの現代の表象文化を、演劇の視点から考察します。",
        "outcomesMeasuredBy": "・演劇・舞台芸術を通して芸術の基本を学びます。・西洋と東洋の芸術の違いに触れながら国際的な教養を養います。・日本の芸術の特色を学ぶ。また、伝統芸能は、江戸時代以前の文化でありながら、近代以降も同時代の文化の影響も受けていることを理解します。・現代のメディアに、伝統的なコンテンツがどのように取り入れられているかを学びます。・授業では、テーマに関して別の視点から各自で考察を行うことによって、論理的な思考力、分析・評価能力、問題解決力を養います。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "Moodleの初回授業に関する指示をよくよむこと。教員が各テーマについて解説を行います。（画像、映像を多用する）学生は、授業中に課されるアンケートや小レポートで知識を整理します。Moodle上の設問に学生が回答し、教員がユニークな回答を紹介するアクティブラーニング形式で授業を実施します。ノートPC必携です。",
        "notices": "各テーマと、自分が現在関心をもっていることと関連づけながら学ぶことを求めます。",
        "preparatoryStudy": "新聞、雑誌、テレビなどで紹介される芸術や芸能に関する情報に関心を持つことがのぞまいしいです。予習：次回扱うテーマについてこれまでどのように学んできたか予備知識を確認すること。授業中のアンケートで質問します。復習：扱ったテーマに関して、どのような発見があったか授業後のリアクションペーパーを記入します。",
        "gradingGuidelines": "授業中の小テスト（2回）各20％、期末理解度確認20％、リアクションペーパー40％小テストやリアクションペーパーのフィードバックは授業内で行う。100点満点中60点以上で単位認定とする。最終試験のフィードバックはMoodle上で行う。",
        "textbook": "moodleで資料をダウンロード",
        "referenceMaterials": "各テーマにあわせて授業で紹介します。",
        "courseSchedule": "第1回：ガイダンス：総合芸術としての演劇と、他の芸術ジャンルとの交流第2回：ドラマ（物語）：創作された物語から、証言まで第3回：劇場：社会と劇場、劇場と演劇の関係第4回：観客：もう一人の作り手として第5回：身体：身体の文化とことばの関係第6回：ジェンダー：演じる性と演じられる性（小テスト）第7回：能：物語のビジュアルイメージ化第8回：狂言：笑いの表現第9回：歌舞伎：現代に生きる古典芸能第10回：文楽：人形の表現と語る表現（小テスト）第11回：物語の継承とゲームの可能性：日本の物語の再生第12回：アニメ・マンガ：文字と絵画、舞台メディアの交流史第13回：ミュージカル：「ライオンキング」と文楽第14回：2.5次元ミュージカル：まとめ（期末理解度確認）",
        "courseDataUpdatedAt": "2024\/01\/23"
    },
    "updateAt": "2024\/09\/13"
}