{
    "lectureCode": "L30501",
    "courseName": "国際関係論[木3]",
    "lecturer": [
        "落合浩太郎(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "世界は様々な政治体制・民族・宗教の２００の国からなります。１９９０年頃東西冷戦が終わり、多様な世界がグローバリゼーションによって「アメリカ化」するかと思われました。しかし、２１世紀に入って、反グローバリゼーションの動きが強まっています。グローバリゼーション（統合）と反グローバリゼーション（分裂）をキーワードにして、世界の現状を政治・経済・文化・宗教等の多様な視点で学びます。常に、世界の中の日本を意識して国際情勢の解説や他国との比較を行います。以上によって、国際的な教養だけでなく、異文化や異なる政治的立場の間での「対話」ができる論理的な思考力、コミュニケーション能力を身に付け、政治や日本を論じられる社会人となることを目指します。自然科学と異なり、正解のないのが社会科学ですが、学習によって以上の成果が期待できます。",
        "outcomesMeasuredBy": "国際的な教養の基礎として、世界の現状を知るために、リベラルと保守、先進国と途上国、自由・民主主義と権威主義といった基礎概念を理解して下さい。さらに、基礎的な指標、世界の国の数や人口（今後の予測を含む）、主要国・地域の人口やＧＤＰも同様です。グローバリゼーションとは何か、なぜ反発する動きが強まっているのかを理解して下さい。民主主義の危機、格差、ポピュリズム、気候変動、ＳＤＧｓ、対テロ戦争、デモクラティック・ピース等のキーワードを説明できることを目指します。そして、異なる立場（文化）の間での「対話」を可能する論理的な思考力とコミュニケーション能力を高めます。また、世界の中の日本を意識して国際情勢の解説や他国との比較を行うことで国際的な教養を身に付けます。以上によって、国際的な視点から政治や日本を論じられる社会人となることを目指します。",
        "learningOutcomes": "国際的な教養コミュニケーション能力論理的な思考力",
        "teachingMethod": "教科書はなく、プリントを使用します。ノートを取るよりもその場で理解し、批判的に考えて、質問や疑問を提示して下さい。ノートＰＣは使用しません。",
        "notices": "私語等の講義の妨げになる行為を禁止します。電車の遅延等の正当な理由のない遅刻も認めません。以上を前提に履修して下さい。",
        "preparatoryStudy": "日常的に新聞を読み、テレビのニュース見て、世界と日本で起きていることを知った上で出席して下さい。復習としては、図書館所蔵の『ニューズウィ―ク』、『ＡＥＲＡ』、『文藝春秋』、『中央公論』、『世界』等の雑誌、講義で紹介する本を読んで、理解を深めることを求めます。",
        "gradingGuidelines": "５回の小テスト（予告なし）で評価します。採点後次回の講義で返却します。合計１０点満点で５点以上が合格の目安です。毎回（小テスト実施回を除く）の受講投稿の優れたものは加点します。投稿（質問）へのフィードバック（回答）は次回の講義で行います。",
        "textbook": "指定しません。",
        "referenceMaterials": "中西寛『国際政治とは何か』中央公論新社ジョセフ・ナイ『国際紛争』有斐閣ロスリング『FACTFULNESS』日経BP",
        "courseSchedule": "第1回：世界の多様性（１）第2回：世界の多様性（２）第3回：グローバリゼーション（１）経済第4回：グローバリゼーション（２）文化第5回：グローバリゼーション（３）環境第6回：反グローバリゼーション（１）民族・人種第7回：反グローバリゼーション（２）宗教第8回：反グローバリゼーション（３）経済・文化第9回：アメリカ一極支配は終わるか第10回：民主主義の危機第11回：食で見る世界第12回：スポーツで見る世界第13回：戦争と平和第14回：数字で見る世界",
        "courseDataUpdatedAt": "2025/01/26"
    },
    "updateAt": "2025/03/21"
}