{
    "lectureCode": "L50401",
    "courseName": "集中実技I[スキー]",
    "lecturer": [
        "佐久間裕司(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "厳冬の大自然の中，冬季スポーツの代表とされるスキーを通して積極的なチャレンジ精神を養い，それを克服し，さらには生涯スポーツの礎を築くことをねらいとする。スキースポーツの特性を活かし，全身の筋肉をしなやかに，弾力的に使いながら，巧緻性や集中力を高める。一方で，授業で習得したそれぞれの滑走技術を駆使しながら，あらゆる雪質・斜面を安全に克服し，スキーの楽しさ，奥深さを実感し，自然・人・体験など多くの出会いを通して，心の豊かさ，生きるための創造力を涵養する。",
        "outcomesMeasuredBy": "１．全体共通●事前授業を通してスキーの専門用語，冬山の気象と安全について理解し，厳冬･雪上環境の下，健康と安全を考慮した行動と判断力を身に付ける。●自身の滑走技術を駆使し，あらゆる雪質や斜面を安全に滑走することができると同時に，遭遇した壁や困難に対しても自らの知識とスキルを活用し，対応力や問題解決力を向上させる。●滑走の姿勢や運動の構造，運動エネルギーの活用，ターンの効率などを科学的･論理的に理解する習慣を身につけ，実習以外の機会にも自身の運動を分析，フィードバックできる論理的思考力を磨く。●集団生活により必要なマナーやエチケットを学びつつ，学部・学年を超えた人間関係を構築し，コミュニケーション能力の質と幅を向上・拡大する。２．能力別●初心者…両スキーが平行に回転する感じを身につけ，最終的には初歩的なパラレルターンができる。●初級者…今後の上達に弊害を及ぼすクセを修正し，中斜面でもパラレルターンができる。●中･上級者…一定のスピードで自分の回転弧を自由に調節し，あらゆる斜面でパラレルターンの大回りと小回りができる。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "現時点では，志賀高原・一の瀬ファミリースキー場（長野県）を実習の拠点として実施する予定である。期間は４泊５日，初日に履修者の滑走能力に応じた班編成の後は，班ごとにそれぞれの課題やプログラムを進めていく。滑走技術を習得する過程においては，各班の指導教員が学生個々に見合った解決策やコツを逐一フィードバックしながら反復練習し，技術の向上を目指す。また，宿舎ではミーティングを通じてスキー運動のイメージづくりをはじめ，学部・学科・学年を超えた他学生との交流を図る。",
        "notices": "集中実技に要する諸費用（宿泊費・昼食代・交通費・リフト代・保険料・レンタル料等）は，履修者の負担とする。各学部の後期最初に行われる履修ガイダンスに出席し，「集中実技I（スキー）」の履修希望手続きを済ませること。全学部共通の実技授業となるため，履修可能な人数の上限を設け，希望者が多い場合には抽選で決定する。また，希望者が極端に少ない場合には，集中実技Iを「当該年度のみ中止する」などの対応をする場合もある。また，この科目は後期の履修上限には含めないものとする。履修者は，事前授業（後期補講期間または後期授業終了後の計4コマ分）に出席し，スキーを体験する上での大切な知識や安全管理について聴講することを義務づける。なお，事前授業を無断で2回以上欠席した者は，履修不可とする。",
        "preparatoryStudy": "［予習］●専門用語をはじめ，正しい運動技術やマナー，安全対策をしっかりと理解しておくこと。●行動の先取りができるよう事前の準備・対策を練ること。［復習］●各回の授業で良くできたところ，修正・改善すべきところを把握し，とくに修正・改善すべきクセや動作については，感覚づくり・体力づくりを意識し，宿舎で対策，実践すること。",
        "gradingGuidelines": "事前授業への出席，現地での授業への取り組み，各人の課題達成度などを総合的に評価し，合否を判定する。具体的には，①事前授業への参加と知識の習得度（20％），②実技への取り組み姿勢，実技課題の達成度（40％），③マナー・協調性，安全配慮など（20％），④感想文（20％），計100％（100点満点）とし，60点以上を合格とする。",
        "textbook": "特に指定はないが，スキーの滑走技術については関連する書籍等に記載の理論と同様であり，事前の自主学修に大いに活用するとよい。",
        "referenceMaterials": "市販されている関係書籍やインターネットで掲載された技術解説などの閲覧を大いに奨励する。事前授業においては，適宜，プリントなどを配布する。",
        "courseSchedule": "第1回:履修に関するガイダンス：実技概要の説明，履修希望調書の記入と提出第2回:事前授業(1)：集中実技に向けて，スキー用語，滑走技術，諸連絡第3回:事前授業(2)：スキー用具の知識，冬山の知識，諸連絡第4回:事前授業(3)：スキーの安全知識，実習地の特徴，各ゲレンデの説明，諸連絡第5回:事前授業(4)：現地での具体的学修内容と生活の仕方，準備物，諸連絡（最終確認）第6回:現地授業(1)：集合，現地移動，第1日目／午後講習（足慣らし，班分け），ミーティング(1)第7回:現地授業(2)：第2日目／午前講習，仮練習班にて基礎練習，班調整第8回:現地授業(3)：第2日目／午後講習，練習班固定，基礎練習，ミーティング(2)第9回:現地授業(4)：第3日目／午前講習，各班にて基礎練習第10回:現地授業(5)：第3日目／午後講習，各班にて基礎・応用練習，ミーティング（3）第11回:現地授業(6)：第4日目／午前講習，各班にて応用・発展練習第12回:現地授業(7)：第4日目／午後講習，試験，フリー時間，ミーティング（4），授業評価アンケート第13回:現地授業(8)：第5日目／講習まとめ，閉講式，後片付け，現地撤収・移動，解散第14回:自宅学修：感想文の作成と提出",
        "courseDataUpdatedAt": "2024\/01\/19"
    },
    "updateAt": "2024\/09\/13"
}