{
    "lectureCode": "L50401",
    "courseName": "集中実技I[スキー]",
    "lecturer": [
        "藤平杏子(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "実習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本授業では、雪山でのスキー活動を通じて、自然環境の厳しさと美しさを体感し、学生間の協働を通じて社会性を育成することを目的とする。事前授業（2日程度）では、スキー技術の基礎や装備の使い方、雪山での安全管理について学び、問題解決型のグループワークや計画発表を行いながら、実践的な思考力を養う。現地実習では、実技レベルごとにグループ分けを行い、基礎技術の復習から応用技術の習得までを行い、自然環境下でのリスク管理を実践する。さらに、フォーム分析やチーム活動を通じて技術力と協働力を高める。",
        "outcomesMeasuredBy": "・事前授業や宿泊型の現地実習を通して、学生間のコミュニケーション力や問題解決力を向上させる。意見交換や役割分担を経験し、自然環境下でのチームワークを学ぶ（コミュニケーション能力）・指導者からのフィードバックを基に自身の滑走フォームを分析し、改善点を考えることで、論理的思考力を高める。また、技術向上に必要な要素を自己評価する力を養う（論理的な思考力）・雪山の地形や気象条件を理解し、自然環境で適切に行動する力を養う。また、緊急時に必要なリスク管理スキルを実践的に習得する。初心者から上級者まで、それぞれのレベルに応じたターン技術を習得し、様々な雪質や斜面に対応できる技術を身につける（問題解決能力）",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "現時点では、大学での事前授業（2日程度）を実施したのち、春季休業中（2月を予定）に現地実習（3泊もしくは4泊）を実施予定である。事前授業では、スキー技術の基礎や装備の使い方、雪山でのリスク管理に関する知識を講義形式で学ぶ。さらに、チームビルディングの活動や現地実習の計画立てに関するグループワークを通じて、コミュニケーション能力の育成に取り組む。現地実習では、初日は基礎技術の確認を行い、2日目以降は応用技術や特殊な斜面での滑走技術を習得する実技講習を行う。また、フォーム分析やチームでの課題活動を実施し、技術向上とコミュニケーション能力を高める。全体を通じて、自然環境での実践的学びを重視する構成となっている。",
        "notices": "・集中実技に要する諸費用（宿泊費・昼食代・リフト代・レンタル代・交通費等）は、履修者の負担とする・全学部共通の実技授業となるため、履修可能な人数の上限を設け、希望者が多い場合には抽選で決定する。希望者が極端に少ない場合には、集中実技を「当該年度のみ中止する」などの対応をする場合もある・募集の掲示を10月頃に学内掲示板・学生ポータルにて行う。受講希望者は実習説明会（ガイダンス）に必ず出席し、実施概要・履修方法等の具体的な情報を入手すること・受講者は学内で行われる事前授業（2日程度）に必ず出席し、雪山のリスク管理やスキーの基礎知識について学習すること・事前授業を無断で欠席した者は履修不可とする",
        "preparatoryStudy": "授業に参加する前に、雪山での生活やスキーに関する基礎知識を学んでおくこと。具体的には、活動で必要な装備や安全管理の方法を調べ、理解すること。さらに、活動予定地の自然環境やリスクを予習し、体調を整えるとともに、チームで円滑に活動するためのコミュニケーションスキルを学ぶ。これらを通じて、実習に備えた万全な準備を整える。",
        "gradingGuidelines": "事前授業の受講状況、現地実習での取り組み、課題達成度等を総合的に評価する。具体的には、①事前授業への参加と知識の習得度（30％）、②現地実習への取り組み姿勢、マナー・協調性、安全配慮等（50％）、③レポート（20％）、計100％（100点満点）とし、60点以上を合格とする。",
        "textbook": "授業時間中に必要に応じて資料を配布する。",
        "referenceMaterials": "なし。授業時間中に必要に応じて資料を配布する。",
        "courseSchedule": "第1回：ガイダンス：授業のテーマや到達目標及び授業方法の説明第2回：事前授業１：スキー用語・技術に関する講義、諸連絡第3回：事前授業２：雪山での生活に関する講義、諸連絡第4回：事前授業３：スキーの安全知識、実習地の特徴、各ゲレンデの説明、諸連絡第5回：事前授業４：現地での具体的学修内容と生活の仕方、準備物、諸連絡（最終確認）第6回：野外実習：移動、集合、開講式、アイスブレイク（初日）第7回：野外実習：足慣らし、グループ分け第8回：野外実習：練習グループごとに基礎講習・練習、ミーティング第9回：野外実習：練習グループごとに基礎講習・練習、ミーティング第10回：野外実習：練習グループごとに応用講習・練習、ミーティング第11回：野外実習：練習グループごとに応用講習・練習、ミーティング第12回：野外実習：練習グループごとに応用講習・練習、ミーティング第13回：野外実習：閉校式、現地撤収・移動、解散（最終日）第14回：野外実習：レポートの作成、提出",
        "courseDataUpdatedAt": "2025/01/27"
    },
    "updateAt": "2025/03/21"
}