{
    "lectureCode": "L50613",
    "courseName": "スポーツ実技I[金1キンボール・フライングディスク・ノルディックウォーキング]",
    "lecturer": [
        "志村広子"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "実技科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "金1"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "運動経験、体力を問わず、誰もが取り組みやすい運動の例として、キンボール、フライングディスク、ノルディックウォーキングを行います。チームスポーツ、一人でもできる運動の両方を扱います。いずれも高度な技術は必要としません。運動の実践を通して、主にからだの調子を整える方法を習得します。",
        "outcomesMeasuredBy": "【キンボール・フライングディスク】目標や状況に合わせた練習ができること。自分達だけでルールの調整、試合の計画・進行ができること。安全に配慮し、場の環境を整えて運動できること。【ノルディックウォーキング】運動としてのウォーキングの基本的な歩き方、ノルディックウォーキングのポールの基本的な使い方を習得すること。安全に配慮し、周囲の環境や当日の体調に合わせて歩けること。【その他】からだのどこを主に使っているのか、意識しながらストレッチできること。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "・第2回目以降、体育館（キンボール・フライングディスク）またはキャンパス内（ノルディックウォーキング）にて実技を行う。・フライングディスクはドッヂビーを中心に行う予定である。・できるだけたくさん体を動かすよう、授業を進めていく。・用具や場の使い方に慣れた後は、学生主動でゲーム・運動を行うことを目指す。教員は適宜サポートを行う。・ウォームアップ、クールダウンの際、主な筋の位置や働きを教員が解説しながらストレッチを行う。・運動やストレッチのポイントについて、安全面・技術面から随時フィードバックする。※当日の天候により、授業内容を変更する場合がある（例：雨天時はノルディックウォーキングの代わりに室内種目を実施）。※授業計画は、進捗状況や参加者の技術レベルなどに応じて変更する場合がある。",
        "notices": "①第1回目はアリーナにてガイダンスを実施する。ガイダンス時に種目選択を行うので必ず参加すること。②希望者多数の場合は抽選とする。③更衣室での盗難防止のため、荷物は必ず教場に持参すること。④届け出により考慮されうる欠席・遅刻（感染症、電車遅延など）に関しては、証明となる書類を担当教員へ提出すること。【服装・持ち物に関する注意】・伸縮性のある、動きやすい服装で参加すること。ジーンズ、チノパン、シャツなど運動に適さない服での参加は、運動の妨げになるため認めない。・運動に適した靴で参加すること。キンボールとフライングディスクは屋内（体育館）で、ノルディックウォーキングは屋外で行う。革靴などの動きづらい靴、裸足、靴下のみ（シューズ無し）での参加は、安全上の理由により認めない。・着替えは更衣室を利用し、貴重品は携帯して各自が管理をすること。・水、タオルを持参することを推奨する。・ノルディックウォーキングの際は、帽子、日焼け止め、サングラス、手袋（軍手など、ストラップとの擦れ防止のため）、ヒップバッグ（水などを持ち歩く場合）など、必要に応じて準備すること。",
        "preparatoryStudy": "・睡眠、休養、食事を適切にとり、日頃から体調管理に留意すること。・自分なりの「今日の目標」を一つ決めて、毎回の授業に臨むこと。",
        "gradingGuidelines": "次の観点別により評価する。満点は100点とし、その内訳は【参加・研究…30％、努力（関心・態度）…20％、技能…20％、応用・思考・判断…20％、協力性（関わり合い）…10％】、合計60％以上を合格とする。評価のポイントは以下の通り：【参加・研究】体調を整え、積極的に授業に参加できたか。自分自身の現状を分析し、この授業を通してやるべきことを明らかにすることができたか。【努力（関心・態度）】それぞれの種目を通して自分ができるようになりたいことを運動技能の面、他者との関わりの面からそれぞれ1つずつ見つけ、それらを達成できるよう積極的に実技に取り組んだか。【技能】ゲームや運動を楽しめる最低限の技能を身につけることができたか。【応用・思考・判断】実技を通して自分の課題を見つけ、より良くするための方法を考え、行動に移すことができたか。安全に配慮し、自ら進んで環境を整えることができたか。【協力性（関わり合い）】自由に意見を述べ、互いの考えを尊重しながらより良い方法を選択し、快適に、楽しく、できるだけ長い時間ゲームや運動ができるよう、協力的な態度で授業に参加することができたか",
        "textbook": "指定しない",
        "referenceMaterials": "宮下充正,ウォーキングブック─科学に基づいたウォーキング指導と実践,ブックハウス・エイチディ,2006年.",
        "courseSchedule": "第1回：ガイダンス、種目選択（更衣不要）第2回：【アイスブレーカー・ゲーム】キンボールやディスクを使ったレクリエーション第3回：【キンボール1】試しのゲーム第4回：【キンボール2】ゲームの実践（教員による試合進行）第5回：【キンボール3】ゲームの実践（ルールの調整、学生による試合進行）第6回：【キンボール4】ゲームの実践、まとめ第7回：【ノルディックウォーキング1】ポールの使い方、かかとから着地して歩く第8回：【ノルディックウォーキング2】前を見て歩く第9回：【ノルディックウォーキング3】スピードに乗って心拍数を上げて歩く第10回：【ノルディックウォーキング4】連続して長い距離を歩く、まとめ第11回：【フライングディスク1】基礎練習、試しのゲーム第12回：【フライングディスク2】ゲームの実践（教員による試合進行）第13回：【フライングディスク3】ゲームの実践（ルールの調整、学生による試合進行）第14回：【フライングディスク4】ゲームの実践、まとめ",
        "courseDataUpdatedAt": "2025/03/13"
    },
    "updateAt": "2025/03/21"
}