{
    "lectureCode": "L50732",
    "courseName": "スポーツ実技II[金3バスケットボール]",
    "lecturer": [
        "植松雄太(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金3"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "生涯にわたってスポーツに親しむことは、より健康的で充実した日々を過ごすために重要な要素になる。本授業は、バスケットボールを題材とし、スポーツが持つ魅力に触れることで、生涯にわたりスポーツに親しむための土台を作ることを目的とする。バスケットボールの基本技術やチーム戦術を修得するとともに、ゲームを通してバスケットボールというスポーツの楽しさを実感することをねらいとする。バスケットボールはパス、ドリブル、シュートなど個人や複数人により応用されるオープンスキルが必要とされ、時には1対2、2対3などの数的不利な状況をクリアしなくてはならないケースもある。そこで、本授業ではオープンスキルを身につけるために論理的な思考力や問題解決力が求められ、履修する学生は授業を通じてこれらの能力を養いたい。加えて、授業におけるより良いプレーを行うために他学生との協力しながら、コミュニケーション能力を向上させることが重要である。",
        "outcomesMeasuredBy": "・試合をスムーズに行うことができるために必要なルールを理解し、基礎的な技術(ドリブル、パス、レイアップシュート等)を習得する。・バスケットボールの基本的な動き方を習得し、グループ戦術及びチーム戦術の習得を目指すと共に、コミュニケーション能力の向上を図る。・コミュニケーションを取り合い、スムーズに試合を展開する。また、最終的には審判を含め学生が主体となって試合を進められるようにする。",
        "learningOutcomes": "コミュニケーション能力",
        "teachingMethod": "第1回は種目選択のガイダンスをアリーナで実施する。第2回目以降は体育館3Fアリーナにおいて選択したバスケットボール種目で計14回の授業となる。技術を取得する過程においては、教員が学生個々に見合った解決策やコツをフィードバックしながら授業を進めていく。基礎的な技術の練習に加え、バスケットボールの特徴であるシステマチックな戦術理解のため、リーグ戦時に使用できるような戦術パターンの練習を行う。また、バスケットボールは運動量が非常に多いので基礎体力を向上させることにも重点を置いた授業展開をしていく。",
        "notices": "運動に適した服装(トレーニングウエアなどの運動着で、ジーンズなどの私服での参加は認めない)と屋内用のスポーツシューズを用意すること。また、安全の面からアクセサリー類は外すこと。更衣室での盗難事故を防ぐため、荷物を必ず教場まで持っていくこと。初回授業で行われる「全体ガイダンス+種目別ガイダンス」には必ず出席すること。感染防止対策に関する注意事項が記載されているので、Moodleの授業コースを必ず確認すること。",
        "preparatoryStudy": "種目の歴史、ルール、技術等の知識を調べたり、実際のプレー映像を観察しておくと良い。また、授業内で良いパフォーマンスを発揮するために、普段から規則正しい生活をおくることが望ましい。授業後は実践した内容を振り返り、達成できたことと課題を確認し、理解を深める。",
        "gradingGuidelines": "次の観点別により評価する。満点は100点とし、その内訳は【参加意欲...30%、取り組み(意欲・関心・態度)...20%、技能...20%、応用・思考・判断...20%、協調性(関わり合い)...10%】、合計60%以上を合格とする。また，運動に適した服装でない者，欠席や遅刻は減点の対象とする。",
        "textbook": "指定しない",
        "referenceMaterials": "インターネットや市販の書籍等で紹介されている技術等を参考にすること。",
        "courseSchedule": "第1回：全体共通・種目別ガイダンス、履修上の連絡と諸注意第2回：個人技術の習得①※ルール理解を含む第3回：個人技術の習得②※ルール理解を含む第4回：個人技術の習得③第5回：連携技術の理解①1対1、2対2、3対3第6回：連携技術の理解②1対1、2対2、3対3第7回：連携技術の理解①1対2、2対3、3対4第8回：連携技術の理解②1対2、2対3、3対4第9回：3対3ハーフコート第10回：5対5ハーフコート第11回：3対3(総当り戦①)フルコート第12回：3対3(総当り戦②)フルコート第13回：5対5(総当り戦①)フルコート第14回：5対5(総当り戦②)フルコート",
        "courseDataUpdatedAt": "2024\/02\/28"
    },
    "updateAt": "2024\/09\/13"
}