{
    "lectureCode": "L606M12",
    "courseName": "IntegratedEnglishII[5]MS金1",
    "lecturer": [
        "長尾主税(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "講義棟Ａ３０３"
    ],
    "courceDetails": {
        "courseOverview": "IntegratedEnglishIの内容をレベルアップし、より実践的な英語力の向上を目的とする。IntegratedEnglishIと同様に、学生の興味・関心や進路に即した内容を学習することを通じて英語の4技能のスキルアップや国際的教養、ビジネス英語のさらなる修得をめざす。当授業では、ドラマ仕立ての教材をとりあげ、英語運用能力を高める。英語音声についての基本的な知識を得た上で、テキストの動画を視聴し、リスニングやシャドーイングのトレーニングを行う。また設問を通じてボキャブラリーの拡充を図り、重要表現の応用について学ぶ。さらに、言葉をコンテクストに位置づけ、これを発言に結び付ける方法を身につける。テキストで使用される英語のレベルは、以下に適合する。CEFR-A2映画については、まず白黒映画に対する忌避感を解消するだけで膨大な文化資産にアクセスできることを知り、昔の映画を楽しむ方法を考える。また、読解のトレーニングを兼ねて、基本的なフィルムスタディーズの文献を読む。読解資料の英語のレベルはB1＋である。1年時に身に着けた読み書きの方法に基づく。さらに、読解によって得た知識を実際の映画で確認する。前・後期を続けて履修することが望ましい。",
        "outcomesMeasuredBy": "１．語彙力を強化する。２．具体的な事象に関して自らの考えを加えながら説明できる。３．批評的思考（クリティカルシンキング）によって、分析・評価ができる。４．グローバル時代に必要な国際的な教養を身につける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "能動的・自律的な英語学修の方法が身につくように、テキストでは、主としてスピーキングおよびリスニングのトレーニングを行う。授業はテキストに即して行われる。他に補助教材を使用する。授業開始時に、あらかじめ指示した課題についての小テストを行う。当授業では、ドラマ仕立ての教材をとりあげ、英語運用能力を高める。英語音声についての基本的な知識を得た上で、テキストの動画を視聴し、リスニングやリピーティング、シャドーイングのトレーニングを行う。また設問を通じてボキャブラリーの拡充を図り、重要表現の応用について学ぶ。さらに、言葉をコンテクストに位置づけ、これを発言に結び付ける方法を身につける。映画については、白黒映画を忌避感なく観られるように重要な作品についての知識を得る。また、基本的なフィルムスタディーズの文献を読むが、これについてはテキストを使用せず、ハンドアウトやインターネットを利用する。1年時に身に着けた読み書きの方法を最大限に活用していただきたい。さらに、読解によって得た知識を、パブリックドメインに帰した映画の場面で確認し、専門用語や語彙の定着を図る。小テストや課題等へのフィードバックは授業中に随時行う。シャドーイング等のトレーニングをグループで行う。オンライン辞書の使用法等に習熟するため、指示された場合にPCを使用する。",
        "notices": "後期のみ受講する場合は、Part1の動画を視聴し、また前期既習箇所を自習すること。以下のサイトで教材の動画を視聴し、英語のレベルやタイプを確認した上で受講すること。https:\/\/text.asahipress.com\/free\/player\/index.html?bookcode=515683授業に関する詳しい説明を行うため、初回から出席することを単位取得の前提とする。授業には必ず学習用の英和（または英英）辞典を持参すること（電子辞書でもよい）。分からないことや気になることがあったら、辞書を引いてメモをとる習慣を身に付けること。課題提出については、期限を守ること。受講者は授業の場での常識的マナーを守ること。前期後期続けて取ることが望ましい。PCの利用方法については、授業で指示する（PCはスマートフォンと共に指示された時以外に使用することは許されない）。",
        "preparatoryStudy": "予習：指示されたユニットの映像を視聴し、日本語で自分なりのストーリーラインを作成する。テキストの該当箇所の設問に取り組み、辞書やインターネット検索を活用し、不分明なことを調べる。映像の理解できない箇所をチェックする。指定されたフォーマットに従って、以上をMoodleに提出する。復習：頻繁に小テストをおこなうので、その準備を兼ねて、映像を繰り返し見ながら、セリフが自分のものになるまでよく復習する。",
        "gradingGuidelines": "「平常点(30%)」「課題点(30％)」「到達度チェック(40％)」を総合的に評価する。合格点は60％とする。授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。",
        "textbook": "浅利庸子他編著『オリーブ・グリーン:ミステリードラマで学ぶ実用英語（CEFR-A2）』（朝日出版社,2022年）2400円+税ISBN:978-4-255-15683-5映画については、テキストを使用せず、ハンドアウトを配布する。",
        "referenceMaterials": "授業の準備では、これまで使用してきた辞書、文法書などを参照すればよい。手元に英英辞典があれば、これを積極的に利用する。大学図書館では多数の有益な辞書・事典を利用することができる。必要に応じて、ハンドアウトを配布し、紹介する。",
        "courseSchedule": "第1回：導入（Unit7:Reviewを利用した前期既習事項の確認を含む）第2回：Unit8-1第3回：Unit8-2第4回：Unit9-1第5回：Unit9-2第6回：Unit10-1第7回：Unit10-2第8回：これまでの復習第9回：Unit11-1第10回:Unit11-2第11回:Unit12-1第12回：Unit12-2第13回：Unit13第14回：まとめ確認演習",
        "courseDataUpdatedAt": "2024\/01\/26"
    },
    "updateAt": "2024\/09\/13"
}