{
    "lectureCode": "L606M02",
    "courseName": "IntegratedEnglishII[2]MS火1",
    "lecturer": [
        "竹内朋子(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "講義棟Ａ３０２"
    ],
    "courceDetails": {
        "courseOverview": "IntegratedEnglishIの内容をレベルアップし、より実践的な英語力の向上を目的とする。IntegratedEnglishIと同様に、学生の興味・関心や進路に即した内容を学習することを通じて英語の4技能のスキルアップや国際的教養、ビジネス英語のさらなる修得をめざす。本授業では、前期に引き続き{Science}のテーマのもと身の回りにある「科学」を通して実践的な英語を身に付ける。科学に関する専門的な知識は必要なく、理系文系に関わらず興味の持てる生物・健康・技術・宇宙などのテーマを科学という側面からとリあげ、「身近な科学」の面白さについて英語で学ぶ。中級レベルの語彙力と基本的な英文法が身に付いており、長文読解をいとわない、あるいは長文への苦手意識を無くしたい学生向き。前期後期通して履修することを推奨する。",
        "outcomesMeasuredBy": "１．語彙力を強化する。２．具体的な事象に関して自らの考えを加えながら説明できる。３．批評的思考（クリティカルシンキング）によって、分析・評価ができる。４．グローバル時代に必要な国際的な教養力を身につける。\"",
        "learningOutcomes": "国際的な教養コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "1回の授業で一つのUnitを終える。予習課題である本文の内容要約をグループで確認したのち、指名-回答-解説を中心としたアクティブラーニング形式でクラス全体で共有する。その際には、本文の音読も指名して行う。Unit内の英文作成問題等に取り組み、ペアで答えを共有し、ペアワークを通して正答への理解を深める。Unitごとに設定されたトピックについてグループやペアで意見交換を行いクラスで発表することもある。英語で自分の意見をまとめるWriting課題を課すこともある。課題のフィードバックは授業中に行う。Unitによっては、動画などの視聴を通して知識を広げる。また、Unitが2つ終了するごとに単語の小テストを行う。小テストのフィードバックは授業内で行う。PCの使用は必要に応じて指示する。",
        "notices": "・授業への全出席が基本である。・辞書を活用し、わからない単語は必ず調べること。授業内では、オンライン辞書の使用は許可するが、翻訳ソフトなどを辞書代わりに使用することは禁止とする。・提出物は期限を守ること。遅延や未提出は減点となる。・ペアワークやグループワークなどの協同学修の場面では積極的に参加すること。受け身で授業に参加していては何も学べない。・授業内で最低一人一回は発言を求められるので、集中して授業を受けること。・わからないことがあれば、遠慮せずに質問すること。",
        "preparatoryStudy": "・授業準備として、単語を予習しておく。また、配布された予習プリントを使用し本文の大意を把握しておく。本文の音読をしておく。（50分程度）・単語の小テストに備えて、単語や表現の復習をしておく。（20分程度）・毎回既習Unitのリスニング課題が出る。取り組んで提出すること。（10分程度）",
        "gradingGuidelines": "「授業参加姿勢(30%)」「課題点(30％)」「到達度チェック(40％)」を総合的に評価する。合格点は60％とする。授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。課題に対するフィードバックは授業時間内、あるいはMoodleなどを通じて随時行う。",
        "textbook": "DaveRear著;ScienceInspirations;Seibido;ISBN978-4-7919-7287-6;2000円",
        "referenceMaterials": "授業内で適宜指示する。",
        "courseSchedule": "第1回：オリエンテーション第2回：Unit11第3回：Unit12第4回：Unit13(小テストUnit11,12)第5回：Unit14第6回：Unit15（小テストUnit13,14)第7回：到達度チェック第8回：Unit16第9回：Unit17第10回：Unit18(小テストUnit16,17)第11回：Unit19第12回：Unit20第13回：まとめ第14回：到達度チェック",
        "courseDataUpdatedAt": "2025/01/21"
    },
    "updateAt": "2025/03/21"
}