{
    "lectureCode": "L60903",
    "courseName": "英語集中講座[登別]2025夏実施",
    "lecturer": [
        "勝浦寿美(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "グローバル化が加速する社会では、国境を越えて、誰もがグローバル社会の一員であると言える。そのため、世界中で広く使われている英語を運用できる力を身につけることが、これまで以上に重要になっている。本研修（登別EnglishCamp）は、日本工学院北海道専門学校（登別）の教室と寮を利用し、6日間を通して集中的に英語を学ぶことを目的としたプログラムである。英語漬けの6日間を通じて集中的に英語力を鍛え、その成果を実感できるよう設計されている。八王子の学生も蒲田の学生も参加可能である。日程は8月下旬または9月上旬を予定している。",
        "outcomesMeasuredBy": "・自分の考えを英語で伝える。（話す・書く）・英語を読む力を高める。（量・スピード）・集中力を保ち、自己を管理する能力を高める。（聞く・話す）・WorldEnglishとしての英語を実感する。（文法・語彙）・GlobalCommunicationSkillsを身につける。",
        "learningOutcomes": "国際的な教養コミュニケーション能力論理的な思考力",
        "teachingMethod": "・1コマ90分の授業を1日4コマ、6日間連続で受講する。・講師は英語ネイティブの外国人講師か、ネイティブレベルの英語を話す日本人講師。・授業はほぼ英語オンリー。Reading、Listening、Writing、Speakingの4技能を学び、あわせてプレゼンテーションスキルも磨く。・北海道登別という地域について考える授業も行う。・講師以外に、日本人スタッフ、本学教員1名が帯同する。・最終日にプレゼンテーションを行うので、その準備のためにPCは持参すること。・提出物等へのフィードバックは授業内または授業前後に口頭で行う。",
        "notices": "・研修前に、参加方法、ルールなどを説明するオリエンテーションを実施するので必ず参加すること。（Zoomで実施)・現地集合・現地解散とする。交通費は自己負担。宿泊は専門学校の寮（1泊2,200円、朝夕2食付き）を利用する。・EnglishCamp研修費用等については、4月に実施する募集説明会で詳しく説明する。・英語集中講座（選択必修）または海外研修I/II（選択）1単位認定。自分が所属するキャンパスの学務課で確認すること。",
        "preparatoryStudy": "普段からどれだけ積極的に英語を学んでいるかが、英語力向上の鍵である。日ごろから意識的に英語に触れる努力をしていれば、研修の効果はさらに高まる。そのため、大学の授業に積極的に参加し、基礎的な力をつけておくことが重要である。EnglishCampでは、その日に学んだ内容を復習するとともに、講師から出される課題をもとに十分な予習（1～2時間）を行うことが求められる。この取り組みにより、研修の効果を最大限に引き出すことができる。",
        "gradingGuidelines": "・EnglishCampでの取り組み姿勢や成果に対する評価をもとに、本学専任教員が成績判定を行う。・研修前に実施する事前授業にも必ず出席のこと。・研修中に実施するすべての授業に出席すること。・単位認定方法については、所属するキャンパスの学務課で確認すること。",
        "textbook": "テキストを購入する必要はない。詳しくは、研修前のオリエンテーション時に説明する。",
        "referenceMaterials": "特になし",
        "courseSchedule": "第1回：オリエンテーション第2回：ディスカッション①第3回：異文化理解①第4回：プレゼンテーション①第5回：ディスカッション②第6回：異文化理解②第7回：異文化コミュニケーション①第8回：プレゼンテーション②第9回：ディスカッション③第10回：異文化コミュニケーション②第11回：プレゼンテーション③第12回：ディスカッション④第13回：プレゼンテーション④第14回：発表会第15回：振り返り",
        "courseDataUpdatedAt": "2025/01/22"
    },
    "updateAt": "2025/03/21"
}