{
    "lectureCode": "L61501",
    "courseName": "韓国語II[水3]",
    "lecturer": [
        "柳宗伸(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "講義棟Ａ２０１"
    ],
    "courceDetails": {
        "courseOverview": "韓国語Ⅱはゼロから学ぶ韓国語の入門クラスである。前期・後期合わせて履修することで韓国語基礎を固める。授業は次のように行われる。１．韓国語文字と発音基本ルールを覚える２．外国語を覚えるのは、子供が親から言葉を覚える行為と同じ。特に入門の際は、恥らず、深思いせず、たくさん聞いてたくさんしゃべってみることが大切である。３．身近で日常的なもの、例えば食べ物、お菓子の名前から歌やお話などを通して、韓国語を分かりやすく楽しく学ぶ。",
        "outcomesMeasuredBy": "外国語としての韓国語学習における到達目標は以下である。１.外国語としての韓国語文字と基本発音をマスターする。2．基礎会話ができるようになり、韓国語話者とコミュニケーションできるようにする。３．メールやカカオトーク、ラインなどのツールで、韓国語コミュニケーションが出来るようにする。４．韓国における文化などにも興味をもち、自分の関心をもつ物事について調べることができるようになる。\"",
        "learningOutcomes": "国際的な教養コミュニケーション能力問題解決力",
        "teachingMethod": "1．言葉の基本表現から韓国語文法ルールを学ぶ。文法ルールで会話文や文章をどんどん作ってみる。2．当日学習理解度をはかると同時に理解深化のために、必要に応じて小テストや課題を与える。3．会話練習の際は、ペアワークやグループワークも行う。4．韓国語の表現や発音に慣れるため、「歌で覚えよう」というコーナーを設ける。5.授業内、基本的にPC持参の必要はないが、前もって指示があった場合は、持参すること。",
        "notices": "外国語学習は恥らず、たくさん聞いてたくさんしゃべる覚悟で積極的に授業に臨む。欠席厳禁。たくさん読んでたくさん書くために、教科書とノート持参必修。",
        "preparatoryStudy": "学習予定ページの教科書QRコード音声5回以上反復聴取すること。予習・復習をしっかりする。一度習った表現や単語は覚えるようにする。",
        "gradingGuidelines": "授業への参加態度、積極性、出欠等を含め、総合的に評価する。合格点は60点とする。具体的には、1）プレゼンテーション：40点2）授業内小テスト及び学期末テストを含め、授業への参加態度、積極性を反映した総合的評価：60点小テストや課題についてのフィードバックは授業時間内に口頭で、あるいはMoodleを使用して行う。",
        "textbook": "『最新チャレンジ！韓国語《第2版》』金順玉阪堂千津子著白水社出版ISBN9784560018002",
        "referenceMaterials": "",
        "courseSchedule": "第1回：前期の復習と後期韓国語学習の目標第8課日曜日に何をしますか（1）第2回：第8課日曜日に何をしますか（2）第3回：第9課何が好きですか(1)第4回：第9課何が好きですか(2)第5回：第10課週末に何をしましたか？(1)第6回：第10課週末に何をしましたか？(2)※【プレゼンテーション】お話しの練習第7回：第11課明日は何をするつもりですか？（1）第8回：第11課明日は何をするつもりですか？（2）第9回：第12課スープが冷たくておいしいです（1）第10回：第12課スープが冷たくておいしいです（2）第11回：第13課一度遊びに来てください（1）第12回：第13課一度遊びに来てください（2）第13回：【プレゼンテーション】発表ーお話し第14回：総復習",
        "courseDataUpdatedAt": "2025/01/27"
    },
    "updateAt": "2025/03/21"
}