{
    "lectureCode": "L620M05",
    "courseName": "IntegratedEnglishIII[A5]MS",
    "lecturer": [
        "竹内朋子(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "講義棟Ａ３０３"
    ],
    "courceDetails": {
        "courseOverview": "英語の総合的な実践的運用能力をさらに向上させることを目指す。IntegratedEnglishI・IIと同様に、学生の興味・関心や進路に即した内容を扱うが、より専門性や時事性の高い英語の学びを通じて、ディスカッションやプレゼンテーションを含む4技能のスキルアップ、論理的思考力や分析力の向上をめざす。将来のキャリアにおける英語使用、大学院進学に対応した英語学習など、将来、自発的に英語を学習できるような方法論と動機付けも与える。本授業では、英語力を示す一つの指標となるTOEICテストのスコアアップを目指す。TOEICは、英会話力や英文資料から必要な情報を読み取る速読力が求められる。つまり、TOEIC対策は英語の総合力を上げることにも繋がる。中級程度の語彙力と基礎文法力があり、スコアとしては最低でも500点、目指すは600点という目標を本気で達成したい学生や実践的な英語力を身に付けたい学生向き。前期後期を通してTOEICテストに頻出する語彙と文法を広く網羅する。前期後期続けて履修することを推奨する。",
        "outcomesMeasuredBy": "１．語彙力を強化する。２．具体的、抽象的な事柄に関して自らの考えを論理的に組み立て、述べたり書いたりできる。３．批評的思考（クリティカルシンキング）によって、分析・評価ができる。４．グローバル時代に必要な国際的な教養力を身につける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "2回の授業で一つのユニットを終える。授業1では、予習箇所の単語を小テストで確認し、発音練習も行う。リスニング問題に取り組み、問題形式によってはペアワークでの会話練習を通して表現の定着を図る。リーデイング問題では、文法の理解、長文の速読を必要とする設問、などの練習問題に取り組み、TOEICテストに頻出する内容を押さえる。授業2では、授業1で習得した内容の実践的なミニテスト問題に取り組む。解答解説を通して理解を確実にする。文法力強化のために課題を課すこともある。課題のフィードバックは授業中に行う。PCの使用は必要に応じて指示する。",
        "notices": "・授業への全出席が基本である。・教科書忘れ、遅刻は各々1点減点となる。・わからない単語などは必ず辞書で確認する。・発音練習、ペアでの発話練習は英語習得上大変重要である。積極的に声を出すこと。",
        "preparatoryStudy": "・単語の予習をして小テストに備える。（20分程度）・既習のリーデイング問題に出てきた文章を音読し、読めない単語を無くすことで積極的に語彙力をつける。・既習のリスニング問題は、何度も音声を確認しリピート練習をする。配布される英文Scriptも活用する。（40分程度）",
        "gradingGuidelines": "「授業参加姿勢(30%)」「課題点(30％)」「到達度チェック(40％)」を総合的に評価する。合格点は60％とする。授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。",
        "textbook": "NaoyukiBamba著；ScoreBoosterfortheTOEICL\u0026RTest(Intermediate);Kinseido;ISBN978-4-7674-4090-7；2000円",
        "referenceMaterials": "授業内で適宜指示する。",
        "courseSchedule": "第1回：オリエンテーション第2回：Unit1単語小テスト第3回：Unit1第4回：Unit2単語小テスト第5回：Unit2第6回：Unit3単語小テスト第7回：Unit3第8回：到達度チェック第9回：Unit4単語小テスト第10回：Unit4第11回：Unit5単語小テスト第12回：Unit5第13回：Unit6単語小テスト第14回：到達度チェック",
        "courseDataUpdatedAt": "2024\/01\/24"
    },
    "updateAt": "2024\/09\/13"
}