{
    "lectureCode": "L620C08",
    "courseName": "IntegratedEnglishIII[8]CS機械",
    "lecturer": [
        "石塚美佳(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科,工学部機械工学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "講義実験棟３０３"
    ],
    "courceDetails": {
        "courseOverview": "英語の総合的な実践的運用能力をさらに向上させることを目指す。IntegratedEnglishI・IIと同様に、学生の興味・関心や進路に即した内容を扱うが、より専門性や時事性の高い英語の学びを通じて、ディスカッションやプレゼンテーションを含む4技能のスキルアップ、論理的思考力や分析力の向上をめざす。将来のキャリアにおける英語使用、大学院進学に対応した英語学習など、将来、自発的に英語を学習できるような方法論と動機付けも与える。この授業では、映画を教材として用い、それぞれの状況で人々がどのような表現を用いてコミュニケーションをとっているのかを見ることによって、状況に応じた適切な表現とは何か、どのような表現を用いればより豊かで効果的なコミュニケーションをはかることができるかを思考していく。映画のシーンの視聴でリスニング力を養い、リーディングにより映画で取り上げられている文化・社会についての背景情報の理解を深める。レビューを書いたりすることにより発信力を養う。Intermediateレベル（TOEIC500-600レベル）を対象とした授業を行う。授業において同じシーンを繰り返し視聴するため、映画自体に興味がない人には履修をお勧めしないが、映画をよく観る人、興味がある人には履修を勧める。この科目は前・後期続けて履修することをすすめる。",
        "outcomesMeasuredBy": "１．語彙力を強化する。２．具体的、抽象的な事柄に関して自らの考えを論理的に組み立て、述べたり書いたりできる。３．批評的思考（クリティカルシンキング）によって、分析・評価ができる。４．グローバル時代に必要な国際的な教養を身につける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業は教科書のunitに沿って進めていく。予習してきたunitで扱われる語彙を小テストで確認した後、映画の背景情報について書かれた英文を読み、作品への理解を深める。リスニングでは、最初に、１シーンの会話を用いて台詞のディクテーションを行い、次に概要を把握するために1度視聴し、理解度を確認する問題に取り組む。さらに映画の内容に関連したトピックについてペアやグループでの意見交換も行う。意見交換後はGoogleChatを用いてクラス全体で意見を共有する。小テストならびに課題へのフィードバックは授業内で行う。PCは必携。",
        "notices": "・授業は全回出席が基本である。・授業中に小テスト受験、映画の視聴、必要な情報検索を行うため、PCは毎回持参すること。・授業には必ず予習をしてのぞむこと（予習確認小テストを実施）。・毎回の授業には必ず教科書を持参すること。・課題はほぼ毎回出す。課題の提出の遅延、未提出は減点の対象になる。必ず提出期限を守ること。・オンライン辞書の使用は認めるが、翻訳ソフト／サイトを辞書代わりに使うことは禁じる。・１週間に１度のリスニングトレーニングでは、リスニング力の飛躍的向上はのぞめない。日常から英語の音、リズムに触れることによって慣れてくるので、授業外でも意識しながら英語を聞くこと、映画を日本語吹替版ではなく字幕版で観ることを心がける。・わからないことは遠慮せずに質問すること。",
        "preparatoryStudy": "予習・復習を十分行うこと。各Unitに設けられているVocabularyとExpressionsは予習課題として授業始めの小テストで確認するので準備してくること（約30分）。その他、MovieReviewとReadingに目を通して、知らない語句は辞書で意味を確認してくること。語彙リストを作成してまとめておくことが望ましい（約30-45分）。授業の進度によって課題を出すので指示に従って準備してくること。",
        "gradingGuidelines": "「授業参加姿勢(30%)」「課題点(30％)」「到達度チェック(40％)」を総合的に評価する。合格点は60％とする。授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。",
        "textbook": "KayokoShiomi他著;ActiveEnglishThroughMovies;金星堂;ISBN978-4-7647-4125-6;2,000円＋税★映画『ボヘミアン・ラプソディ（BohemianRhapsody）』（字幕版）をPC上で見られるようにYouTube等で購入していただきます。",
        "referenceMaterials": "必要に応じて授業内で適宜紹介する。",
        "courseSchedule": "第1回：導入、英語力向上の方法について第2回：Unit1第3回：Unit1第4回：Unit1\u0026Unit2第5回：Unit2第6回：Unit2第7回：到達度確認チェック①\u0026Unit3第8回：Unit3第9回：Unit3\u0026Unit4第10回：Unit4第11回：Unit4第12回：Unit5第13回：Unit5第14回：Unit5\u0026到達度確認チェック②／まとめ",
        "courseDataUpdatedAt": "2024\/01\/20"
    },
    "updateAt": "2024\/09\/13"
}