{
    "lectureCode": "L621C03",
    "courseName": "IntegratedEnglishIV[3]CS機械",
    "lecturer": [
        "楠元洋子(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科,工学部機械工学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "講義実験棟３０４"
    ],
    "courceDetails": {
        "courseOverview": "授業形態はIntegratedEnglishⅢに準じるが、内容はより程度を高めたものになり、ビジネスや大学院での学びなど実践を想定したより高度な運用能力の習得や、世界の様々な社会と文化をより深く理解するための知識の習得を目指す。また、将来、自発的に英語が学習できるような方法論と動機づけも与える。この授業のテーマはScience\u0026Technology。教科書は使用せず、ウエブサイトのVoiceofAmericaをもとに、基礎的な英語知識はあるものとして授業を進める。TOEIC500点または英検2級程度の中級者対象（CEFRupperA2-B1レベルまたはA1やB2など1年次AcademicEnglishのクラス番号1-3）の授業である。前期に引き続きVOAニュースで読む力とグループ・ディスカッションで自分の意見を述べる力を向上させる。さらに後期はVOAニュースと同トピックの3〜5分の短いTEDTalksなどの動画を視聴し聞く力とノートテイキング力を高めることを目指す。語彙の増強、文法事項の復習も合わせて行う。語彙小テストに加え、スピーキング、リーディング、リスニングの到達度チェックを実施する。授業は基本的にすべて英語で行い、前期・後期続けての履修を推奨する。",
        "outcomesMeasuredBy": "１．語彙力を強化する。２．具体的、抽象的な事柄に関して自らの考えを論理的に組み立て、述べたり書いたりできる。３．批評的思考（クリティカルシンキング）によって、分析・評価ができる。４．グローバル時代に必要な国際的な教養力を身につける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "2回の授業で1つのニュースに取り組む。第1週の授業では、授業の始めに予習した語彙の小テストを行う。授業は予習をしたことを前提に、学生主体でペアワークでの内容理解確認、グループ・ディスカッションなどの活動を中心に展開する。第2週の授業では、扱ったトピックに関連した3〜5分の短いTEDTalks動画を複数回視聴し、聴解能力およびノートテイキング力を向上させ、トピックに関して理解を深めることを目指す。語彙の増強、文法事項の復習を行いながら、コミュニケーションを目的に英語を聞く・話す・読む・書くこと及び積極的な授業への参加が求められる。語彙小テストに加え、グループ・ディスカッション（スピーキング）、リーディング、リスニング＆ノートテイキングの到達度チェックを実施する。小テストや予習・復習課題、タスクへのフィードバックはGoogleClassroom上および授業中に随時行う。ノートPCは指示のある時のみ使用するが、毎回の授業に持ってくること。授業は基本的にすべて英語で行う。",
        "notices": "・この科目はTOEIC500点程度の英語中級者（A1やB2など1年次AcademicEnglishのクラス番号1-3）向けである。・この科目は前・後期続けて履修することをすすめる。・授業は全回出席が基本である。・授業は基本的にすべて英語で行う。・授業には必ず予習をしてのぞむこと（単語小テストを実施）。・毎回の授業にノートPCを持参すること。・課題の提出の遅延、未提出は減点の対象になる。必ず提出期限を守ること。・協同学修を取り入れた授業形態であるため、授業への積極的な参加が求められる（スピーキング到達度チェックはグループ・ディスカッションのため、消極的な人はメンバーの評価を下げてしまいます）。・疑問点は遠慮せずに質問し、わからないままにしないこと。",
        "preparatoryStudy": "予習・復習を十分（1-2時間）行うこと。1週目はニュース記事に出てくるVocabularyは授業の始めに小テストを実施するので、GoogleClassroomに配布されるVocabularylistを作成し、しっかり意味を調べて覚えてくること（30分程度）。ニュース記事は授業中に和訳はせず、予習してきたことを前提にグループ・ディスカッションを行うので、内容をしっかり理解してくること（30分程度）。1週目授業後はGoogleClassroomで配布されるComprehensionCheck復習課題を提出すること（30分程度）。2週目の予習として、トピックに関するDiscussionQuestionsに対する自分の意見を短い英文で表現しGoogleClassroomで提出する（30分程度）。また授業の進度によって課題を出すので指示に従って準備してくること。",
        "gradingGuidelines": "「授業参加姿勢(30%)」「課題点(30％)」「到達度チェック(40％)」を総合的に評価する。合格点は60％とする。授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。",
        "textbook": "教科書は使用しない。ウェブサイト（https:\/\/www.voanews.com）のニュース記事を教材とする。",
        "referenceMaterials": "適宜指示する。",
        "courseSchedule": "第1回：オリエンテーション、Note-taking事前チェック第2回：Biofuel1第3回：Biofuel2\u0026Note-taking第4回：OrigamiTechnology1第5回：OrigamiTechnology2,Note-taking\u0026TEDTalk第6回：AI(foodwaste)1第7回：AI(foodwaste)2,Note-taking\u0026TEDTalk第8回：AI(facialrecognitionsystem)1第9回：AI(facialrecognitionsystem)2,Note-taking\u0026TEDTalk第10回：VR(smelltechnology)1第11回：VR(smelltechnology)2,Note-taking\u0026TEDTalk第12回：Note-taking事後チェック第13回：到達確認チェック（GroupDiscussion）第14回：到達確認チェック（Reading\u0026Listening）、総まとめ",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}