{
    "lectureCode": "L90403",
    "courseName": "地域連携実習II[八王子スマホ相談会]",
    "lecturer": [
        "神子島健(教養学環)",
        "春山翔(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "実習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟３０１"
    ],
    "courceDetails": {
        "courseOverview": "この授業は対象となる地域課題の解決に向けた取り組みに参加することで、学習する専門的な知見の応用力を高めるとともに、社会や地域に貢献するための力を養うための教育プログラムとなります。大学を離れた実践的な現場に関わることで、ラーニング・アウトカムズが定める学習成果に貢献します。特にコミュニケーション能力、問題解決能力を養い、実社会に役立つ人材としての能力向上を目指します。",
        "outcomesMeasuredBy": "1.解決困難な事象に対して、行動することで変化を促していく「問題解決能力」2.行動の結果を受け止め、変化したことへの「分析・評価能力」3.市民と対等に対話し、自らの経験を言葉として伝える「コミュニケーション能力」4.持続可能な社会を目標として、複雑で予測困難な状況に柔軟に対応し、解決に向けたステップを付けられる論理的な思考力以上を評価します。",
        "learningOutcomes": "コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "このプロジェクトでは、高齢者のスマホ個別相談会の実施を通して、スマホが苦手なことによって情報収集等の格差に直面している方へのサポートを行います。若い世代はスマホを当たり前に使っている分、慣れていない方に教えるには、順を追った説明や明確な言語化が必要となります。また、お互いに気持ちよく相談を進めるには、スマホだけでない話題も重要なカギとなります。コミュニケーション能力を磨く絶好の機会となります。また、相談会を実施する高齢者あんしん相談センターの方とともに企画を練る中で、八王子市において、高齢者を支えるためのどのような取り組みをしていて、今後何が必要なのかについても学ぶことになります。ふり返りをまとめた成果は、次年度以降の参加者への引継ぎ、関係団体への報告会のほか、報告書としてまとめて蓄積していきます。教室での授業にノートPCを使用します。相談会では必須ではありませんが、ノートPCがある方がやりやすいです。",
        "notices": "〇地域連携実習Ⅱは後期集中科目となります。〇履修者は12名を上限とします。希望者多数の場合は選抜します。〇事前学習と現地活動、事後学習のすべてに参加することが条件となります。〇5月ごろに予定される履修希望者説明会に参加してください。〇活動は9月～12月、土曜日と水曜日（それぞれ月1回程度）に実施",
        "preparatoryStudy": "〇八王子市の総合計画および高齢者計画のリサーチ〇余裕があれば比較のため、自分の地元の自治体で何が行われているかをリサーチ〇ふりかえりをふまえて、他の地域でのスマホ支援の先進事例をリサーチし、相談会へフィードバック〇ふりかえりをふまえて、プロジェクトをブラッシュアップさせるプランを考える（120分）",
        "gradingGuidelines": "〇プロジェクトへの貢献度（50％）〇報告会資料の完成度とプレゼンテーション技法（30％）〇ブログ・報告書による学習への理解度（20％）授業内で適宜フィードバックを行う",
        "textbook": "特になし",
        "referenceMaterials": "八王子市総合計画八王子市高齢者計画そのほか、必要に応じて指示します。",
        "courseSchedule": "5月中旬履修希望者説明会6月履修者確定7月上旬履修者説明会8月上旬～9月上旬事前学習（2日間）9月～12月スマホ相談会の実施（土曜と水曜、それぞれ月1回程度）土曜日は市内各所（主に片倉周辺）で実施移動・準備・振り返りを含め5時間前後水曜日は大学または八王子みなみ野で実施授業期間中については4限（15：10～16：50）が中心となる（必須ではないが、後期の水曜4限を空けておくことが望ましい）1月～2月事後学習（すべての回で全教員が担当する）スケジュールは受け入れ先との調整が必要なため、履修者説明会または事前学習で調整します。月1回を予定していますが、選択肢を増やすために多めに実施する場合があります。※最低限、土曜日は3回以上参加できることが求められます（履修者内で調整）。水曜が参加できないなど、参加時間の短い学生については相談会実施に必要な作業で代替します。蒲田キャンパスの学生についてはできる範囲で柔軟に対応するので、ご相談下さい。",
        "courseDataUpdatedAt": "2025/03/05"
    },
    "updateAt": "2025/03/21"
}