{
    "lectureCode": "L9060101",
    "courseName": "海外実習II[ベトナムインターンシップ］2026年春実施",
    "lecturer": [
        "石塚美佳(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "実習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "グローバル化が加速度的に進む現代では、国境に関係なく誰もがグローバル社会に属していると言える。そのため、グローバル社会を理解し、世界中で多くの人が使用する英語を運用できる力を身につけることが、より一層重要になってきている。本やインターネットで知識を得ることもできるが、実際に現地に行き、直にその国の人々や文化に触れることは、今後の人生における貴重な経験になるとともに、さまざまな「発見」や「気づき」を得る機会となる。また、海外での就労経験は、異なる文化的・社会的背景をもつ人々とコミュニケーションをとりながら、協力し合って作業を進める貴重な経験であり、今後の人生設計に大きく役立つ。この研修では、ベトナム（ダナン）のFPT大学で１週間ビジネス英語やビジネスマナーを学んだ後、ダナン市内の企業で３週間のインターンシップに参加する。",
        "outcomesMeasuredBy": "・自信をもって、英語で自分の考えを伝える。・自己管理能力を高める。・他国の文化に触れ、異なる価値観を持つ人々への理解を深める。・他国の同僚と働き、GlobalCommunicationSkillsを身につける。・英語を使って実際に働き、より幅広い知見と就業力を身につける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "実施時期：2025年度の約4週間（2025年11月～2026年3月）参加者オリエンテーション（11月）：Zoom事前授業①（12月）：対面（蒲田キャンパスまたは八王子キャンパス）事前授業②（2月）：対面（八王子キャンパスまたは蒲田キャンパス）現地研修（2-3月）：１週目はFPT大学でビジネス英語・ビジネスマナー研修、2-4週目は現地企業でのインターンシップに参加事後授業（3月）：対面（八王子キャンパス）事前授業・事後授業とも、ノートPCを使用するので持参すること。その他、授業で必要なものについては、GoogleClassroomに掲示するので、必ず確認して指示に従うこと。",
        "notices": "・研修前に、参加方法や単位取得条件などを説明するオリエンテーションを実施するので必ず参加のこと。・事前授業は、現地に行く前に様々なことを学ぶ機会であり、出席は単位取得に必須である。・事後授業では、プレゼンテーションの実施およびレポートを提出する必要がある。・海外実習または海外語学研修I/II（選択）2単位取得科目。自分が所属するキャンパスの学生便覧、学務課で確認すること。・参加費・渡航費などについては、ガイダンス、募集説明会で説明する。・TOEIC550以上の英語力が望ましい。",
        "preparatoryStudy": "事前授業・事後授業の準備として、GoogleClassroomで配付される課題に取り組み、期日までに提出すること（1～2時間）。課題は、グループプレゼンテーション準備のためのテーマ別リサーチ、研修参加の目的と目標、ベトナム滞在中のジャーナル、個別プレゼンテーションのスライドなどを含む。また、渡航前にガイドブック、関連サイトなどで事前リサーチをしておくことを勧める。さらに、普段の語学の授業に積極的に参加し、ALICEを活用して英会話力のブラッシュアップを心がけておくこと。",
        "gradingGuidelines": "FPT大学教員、インターン先企業メンターによる評価をもとに、本学教員が成績評価を行う。また、次のすべてに出席し、課題にも期限厳守で取り組むこと。・オリエンテーション（参加者対象説明会）・事前授業①②・現地研修・事後授業（プレゼンテーション）・レポート作成課題に関するフィードバックは、口頭、メール、またはGoogleClassroom上、のいずれかで学生に提供される。※単位認定の詳細については、自分が所属するキャンパスの学務課で確認のこと。",
        "textbook": "教科書は使用しない。",
        "referenceMaterials": "事前授業などで適宜紹介する。",
        "courseSchedule": "第1回（11月）：オリエンテーション：パスポートの取得、事前・事後授業等、研修に参加するにあたっての必要事項の説明、その他第2回（12月）：事前授業①：異文化理解に関するレクチャー、テーマ別リサーチ＆ポスタープレゼンテーション第3回（2月）：事前授業②：ベトナムに関するレクチャー（FPT大学との合同）、研修の準備・行程の最終確認第4～13回（2-3月）：ベトナムでの研修第14回（3月）：事後授業プレゼンテーションおよびレポート作成",
        "courseDataUpdatedAt": "2025/01/22"
    },
    "updateAt": "2025/03/21"
}