{
    "lectureCode": "L9110103",
    "courseName": "海外研修I[フィリピンオンラインプログラム]2024年夏実施",
    "lecturer": [
        "楠元洋子(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "グローバル化が加速度的に進む現代では、国境に関係なく、誰もがグローバル社会の一員であると言える。そのため、世界中で多くの人が話す英語を運用できる力を身につけることが、今まで以上に重要になってきている。大学の語学の授業でしっかり学ぶことも大事だが、実際に英語を公用語とする現地の人々と交わることは、より多くの学びにつながる。この研修は、フィリピンの有名私立大学デラサール・アラネタ大学の附属語学学校とオンラインでつながり、現地の講師からマンツーマンで英語を学ぶ研修である。英語漬けの5日間で集中的に英語力を鍛えることができ、参加した学生からの評価が非常に高い、効果を実感できる研修である。",
        "outcomesMeasuredBy": "・自分の考えを英語で伝える。（話す・書く）・英語を読む力を高める。（量・スピード）・集中力を保ち、自己を管理する能力を高める。（聞く・話す）・WorldEnglishとしての英語を実感する。（文法・語彙）・GlobalCommunicationSkillsを身につける。",
        "learningOutcomes": "国際的な教養コミュニケーション能力論理的な思考力",
        "teachingMethod": "・50分の授業を18コマ受講。日数は5日間（月～金）。・授業はonlineで、マンツーマン。自分のPCで、インターネットに繋がるところからなら、どこからでも参加可能。・講師はフィリピン人の英語nativespeaker。・Reading、Listening、Writing、Speakingの4技能に加え、語彙と文法の授業の総合英語コースである。課題へのフィードバックは授業時間内に行われる。",
        "notices": "・研修前に、参加方法、ルールなどを説明するオリエンテーションを実施するので必ず参加すること。（Zoomで実施)・事前テスト、事後テストを必ず受けること。（別日程）・事前テストはonlineによる筆記試験(2時間）、スピーキングテスト(5分）で、そのスコアで受講するレベルを決める。・現地とonline(Skype)で安定してつながることができるネット環境が必要。・英語集中講座（選択必修）または海外研修I\/II（選択）1単位認定。自分が所属するキャンパスの学務課で確認すること。",
        "preparatoryStudy": "普段からどれだけ積極的に英語を学んでいるかが、英語力向上の大きな秘訣である。5日間の研修の効果を上げるためには、日ごろから英語に触れるようにする必要がある。大学の授業に積極的に参加し、力をつけておくことが重要。毎日予習・復習を十分（1-2時間）行うこと。",
        "gradingGuidelines": "・現地校の講師による成績評価をもとに、本学専任教員が成績判定を行う。・18コマすべての授業に参加しなければならない。・単位認定については、自分が所属するキャンパスの学務課で確認すること。",
        "textbook": "テキストを購入する必要はない。詳しくは研修前のオリエンテーション時に説明する。",
        "referenceMaterials": "特になし。",
        "courseSchedule": "第1回：オリエンテーション第2回：事前レベルチェック第3回：スピーキング、リスニング第4回：語彙、ライティング第5回：リーディング、文法第6回：スピーキング第7回：リスニング、語彙第8回：ライティング、リーディング第9回：文法、スピーキング第10回：リスニング第11回：語彙、ライティング第12回：リーディング、文法第13回：ふりかえり第14回：事後レベルチェック",
        "courseDataUpdatedAt": "2024\/07\/24"
    },
    "updateAt": "2024\/09\/13"
}