{
    "lectureCode": "M000101",
    "courseName": "メディア学入門",
    "lecturer": [
        "柿本正憲(メディア学部メディア学科)",
        "三上浩司(メディア学部メディア学科)",
        "進藤美希(メディア学部メディア学科)",
        "大淵康成(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "皆さんの身の回りにはインターネット上の映像、音楽、地図情報、文字情報、ニュース記事から広告、そしてレビュー情報などがあふれています。さらには、テレビ放送、ラジオ放送、印刷物としての新聞から本、雑誌、DVDなども常に身近にあります。街には多くの看板から電子掲示板などが目につきます。それらを広くメディアと呼んだりしますが、メディア学入門では、それらメディアがどのようなコンテンツであるのか、そしてそれらのコンテンツがどのようにしてユーザーに届けられているのかを体系的に学びます。そこでは、コンテンツ制作の基本手法を理解し、コンテンツの配信手法を学び、ICT技術を基盤にしたメディア社会の全体像について学習します。その上で、これからのメディア社会の将来像を捉えてもらい、これから始まるメディア学部での学びについて理解してもらいます。",
        "outcomesMeasuredBy": "メディアがどのようなコンテンツであるのか、そしてそれらのコンテンツがどのようにしてユーザーに届けられているのかを体系的に理解する。そしてコンテンツ制作の基本手法、コンテンツの配信手法、ICT技術を基盤にしたメディア社会の構成を理解する。そして、メディア学部の学びの全体像を把握する。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力",
        "teachingMethod": "【授業形態：講義】主要な話題ごとに専門の教員が3コマから4コマを担当します。授業ごとに学ぶべき項目を明記します。ノートPCは毎回必携とします。授業スライドによる講義形式を基本とし、履修生の質問への回答を行ったり、教育目標に関係する小テストを出題します。詳細の授業方法は各授業回担当の教員によって異なりますので、講義ページ（Moodle）を参照してください。",
        "notices": "常に、自分の身の回りにあるメディアをイメージして、また進み具合に応じて、インターネットにアクセスして自分で確認することを励行してください。",
        "preparatoryStudy": "主要な話題ごとに、教科書の指定箇所の予習を指示し、予め調べておくべき内容の理解を図ります。履修生は各回授業に対応する教科書該当部分や授業資料を事前に読みこむ準備学習を行います。予習復習それぞれ120分程度を目安とします。",
        "gradingGuidelines": "授業内課題・小テスト・レポートの点数を合計して100点満点で採点し、合計60点以上を合格とします。４名の教員の担当する授業回によって評価基準が異なる場合があり、講義ページ（Moodle）に詳細を明記します。授業回によっては実施済小テスト提出解答の統計分析や前回課題の提出解答からの紹介と解説などのフィードバックを行います。",
        "textbook": "柿本正憲・大淵康成・進藤美希・三上浩司著「改訂メディア学入門」、コロナ社(2020.03)",
        "referenceMaterials": "東京工科大学メディア学部編「メディア学キーワードブック―こんなに広いメディアの世界―」、コロナ社（2018.03）（この参考書は「フレッシャーズゼミⅠ」の教科書に指定されています。）上記のほか、必要に応じて随時、参考書を提示します。",
        "courseSchedule": "第1回:ガイダンス・メディア学概要（表現、環境、技術）（柿本）第2回:メディアのためのディジタル技術（アナログとデジタル、標本化、量子化、ビット、バイト）（柿本）第3回前半:AI時代の社会を知る（ICT社会、AI、AIが社会に与える影響）（進藤）第3回後半:ソーシャルグッドの実現（SDGs、NGO、NPO、教育、社会貢献）（進藤）第4回:ディジタルジャーナリズム（ジャーナリズム、マスメディア、ニュース、調査報道）（進藤）第5回:ディジタルマーケティングと広告（経営学、ビジネス、広告、マーケティング、サービスデザイン）（進藤）第6回:音声音響言語処理（音声認識、音声合成、立体音響、機械翻訳）（大淵）第7回:映像画像CG処理（可視化、3次元CG、画像処理）（大淵）第8回:ヒューマンインタフェース（CUI、GUI、マルチモーダル、VR）（大淵）第9回:ネットワーク（インターネット、携帯電話、ルーティング）（大淵）第10回:メディアコンテンツ概略（ゲーム、CG\/アニメコンテンツ、実写映像コンテンツ）（三上）第11回:リニアコンテンツ（CGの制作技法、映像技法、撮影編集\/VFX技法）（三上）第12回:インタラクティブコンテンツ（ゲーム、VR\/ARコンテンツ、アプリデザイン）（三上）第13回:音楽とサウンドデザイン（コンテンツにおける音楽の役割、サウンド設計）（三上）第14回:メディア学入門のまとめ（メディア社会、メディア技術、メディアコンテンツ）（柿本）",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}