{
    "lectureCode": "M000506",
    "courseName": "先端メディアゼミナールII[IoTシステム実践]",
    "lecturer": [
        "寺澤卓也(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年"
    ],
    "numberOfCredits": 4,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "InternetofThings(IoT)は現在、大変注目されており、コンピュータ機器以外のものもインターネットに接続し活用する技術である。この科目では、理論の習得とともに実際のシステムの設計・実装を通して問題の把握と解決策の検討、実践を行う。また、実装を完了させるだけでなく、性能評価の手法を検討し、実際に評価を行ってレポートにまとめる。",
        "outcomesMeasuredBy": "実際にテーマで定めたシステムを設計・実装して、評価を行う。研究のスタイルをとるため論文を探して読んだり、新規性や独自性のある成果を目指す。優秀な成果が見込める場合は学会発表を目指す。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ごく少人数で実施する。教員との対話や作業を通じて理解を深める。必要に応じて卒研室の余剰機材を用いる。ノートPC必携。また、数回のレポートを課す。",
        "notices": "履修者は5名程度を上限とする。希望者多数の場合は面接し、技術力を確認して選抜する。累積GPAが2.7以上であることが受講資格の必要条件である。加えて、以下の履修条件を課す。1年次「インターネットシステム入門」がA評価以上であること。いずれかのプログラミング言語で、プログラム系の専門演習程度の経験があること。寺澤のプロジェクト演習「サーバ構築・管理」を前、後期履修していることが望ましい。",
        "preparatoryStudy": "Java、PythonもしくはC++をある程度習得しておくこと。予習復習に関しては以下の通り。・理論の学習とシステム設計段階：次回トピックに応じた予習（240分程度）をしておくこと。復習では授業内で扱った内容の定着を図ること（240分程度）。・実装段階：授業時間外の作業に向けて、授業の時間は教員とのディスカッションを行うので、予定の時間外作業をこなすこと。この作業が予習でもあり復習でもある（各240分程度）。・評価・レポート作成段階：過去の研究を材料に評価手法と評価の進め方を議論する。論文を読んでくること（予習として240分程度）。最終レポートを作成すること（復習および発展として240分程度）。",
        "gradingGuidelines": "システムの提案時および設計時のレポート各15%、実装の完成度40%、性能評価のレポート（手法の提示、および結果の分析）30%の割合で合計100%を100点満点に換算し60点以上で単位認定とする。S評価は対外発表を要する。",
        "textbook": "特になし",
        "referenceMaterials": "IoT,M2M関係図書を適宜紹介する。",
        "courseSchedule": "第1回：IoT概論（社会的意義、応用分野）第2回：デバイスの体験（micro:bit、RaspberryPi）第3回：システム設計法（ハードとソフトの分担・連携、さまざまな設計法）第4回：テーマ案の検討（新規性、オリジナリティ、レポート）第5回：先行研究調査（論文の探し方、読み方）第6回：システムの設計（フローチャート、UI、レポート）第7回：中間発表準備（発表資料の作り方、発表の仕方）第8回：中間発表とシステムの実装法（ソフト開発環境、ライブラリ、フレームワーク）第9回：ソフトウェアの実装（コーディングルール、命名）第10回：ハードウェアの実装（ブレッドボード、はんだ付け）第11回：システムの完成（デバッグ手法、テスト技法）第12回：性能評価手法（定性的評価、定量的評価）第13回：性能評価の実施（データのとり方、結果の考察）第14回：レポートの作成（論文的記述法、出典の示し方）",
        "courseDataUpdatedAt": "2025/01/31"
    },
    "updateAt": "2025/03/21"
}