{
    "lectureCode": "M000209",
    "courseName": "先端メディア学I[先端ProceduralAnimation]",
    "lecturer": [
        "菊池司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": 4,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本授業では、CG映像のなかでも「ビジュアルエフェクト（VFX）」分野で用いられる様々なシミュレーション手法を、各種CGソフトウェア（3dsMax、Maya、Houdhini、RealFlowなど）を使用しながら学ぶ。パーティクルベース、およびグリッドベースの流体シミュレーション、FurやClothのシミュレーションなどにおいて、具体的なアルゴリズムを理論的に学ぶと同時に、実際のCGソフトウェアではどのように実装されいるのか、どのような表現の違いと可能性があるのかなどを、論文輪講と作品制作を通して理解・体験していく。",
        "outcomesMeasuredBy": "授業終了時の目標は、「ビジュアルシミュレーションに関する専門的な知識を有し、かつCG映像制作に関する“ジェネラリスト”になれる基礎を身につける」である。さらに、新しいシミュレーション手法を自ら考案、実装が可能となる応用力を身につけることを目標とする。実際に考案した新しいシミュレーション法は、積極的に外部発表を行う。ラーニング・アウトカムの「実学に基づく専門能力」、「論理的な思考力」、「分析・評価能力」、「問題解決力」を養う。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "SIGGRAPHなどのトップカンファレンスに採録されている論文を輪講すると同時に、様々なCGソフトウェアを実際に使いながら、論文で提案されているアルゴリズムが実際にどのように実装されているのかを体験しながら学ぶ。流体シミュレーション（炎を含む）、Fur、およびClothシミュレーションを「３クール」に分け、それぞれにおいて論文の輪講とCGソフトウェアでの演習を相互に繰り返す。演習は毎回「ハンズオン」形式（1人1台のPCを使用しての個人作業）とし、少人数制で行う。ノートPCは必携とする。",
        "notices": "累積GPAが2.7以上であることが受講資格の必要条件である。履修希望者が多数の場合、GPAなどにより選抜を行う。",
        "preparatoryStudy": "予習と復習、および授業時間以外での自主学習（論文調査やCGソフトウェアのオペレーション学習など）は必ず行うこと。",
        "gradingGuidelines": "３クールそれぞれにおける論文調査の「レポート課題」と最終作品を、それぞれ30％・70％の割合で計100点として総合成績に反映する。60点以上を単位認定要件とする。レポート課題、および作品課題は最終回（第14回）に講評する。",
        "textbook": "特に指定はない。本演習用に作成した資料を使用する。",
        "referenceMaterials": "特に指定はない。別途指示する。",
        "courseSchedule": "第1回：本授業に関するガイダンス。自己紹介とmoodleの使用状況確認も行う。第2回：流体シミュレーションに関する論文調査（第1回：パーティクルベースシミュレーションに関する論文輪講）第3回：流体シミュレーションに関する論文調査（第2回：グリッドベースシミュレーションに関する論文輪講）第4回：流体シミュレーションに関する実装演習（第3回：演習）第5回：Furシミュレーションに関する論文調査（第1回：論文輪講①）第6回：Furシミュレーションに関する論文調査（第2回：論文輪講②）第7回：Furシミュレーションに関する実装演習（第3回：演習）第8回：Clothシミュレーションに関する論文調査（第1回：論文輪講①）第9回：Clothシミュレーションに関する論文調査（第2回：論文輪講②）第10回：Clothシミュレーションに関する実装演習（第3回：演習）第11回：炎のシミュレーションに関する論文調査（第1回：論文輪講①）第12回：炎のシミュレーションに関する論文調査（第2回：論文輪講②）第13回：炎のシミュレーションに関する実装演習（第3回：演習）第14回：最終課題制作と講評会",
        "courseDataUpdatedAt": "2024\/01\/28"
    },
    "updateAt": "2024\/09\/13"
}