{
    "lectureCode": "M100601",
    "courseName": "インターネットシステム入門",
    "lecturer": [
        "寺澤卓也(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月5",
        "水2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ３０２"
    ],
    "courceDetails": {
        "courseOverview": "インターネットは、電気や水道などと同様に、すでに我々の生活に欠かすことのできないインフラとなっている。WWW（WorldWideWeb）やSNS（SocialNetworkingService）、動画配信など、インターネット上のサービスを多くの人が利用しているが、真にそれらの価値を理解し、活用していくためには、インターネットの仕組み、歴史、現状、問題などを理解する必要がある。本授業では、インターネットの基本的な仕組みとアプリケーションを学修し、これからも進化を続けていくインターネットが各自が目指す学問分野や、将来の職業にどう関わっていくのかを考え、対応していくための基礎体力をつけることを目的としている。",
        "outcomesMeasuredBy": "この科目の到達目標は以下のとおりである。・コンピュータネットワークの基本的な仕組みを理解すること・インターネット上の様々なサービスを知ること・インターネットの歴史から最近のトピックまでを体系的に理解すること・セキュリティとインターネットの利用倫理に関する知識を深めること",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "ノートPCを使用するので必ず持参すること。一部の回ではグループ作業を行うことがある。授業中には発言を求める。あてられた者は自分の考えを述べること。講義を聞くだけではなく参加する姿勢を求める。",
        "notices": "毎回、授業時間内に提出する簡単な小レポートを課す。ノートPCを使用するので必ず持参すること。",
        "preparatoryStudy": "毎回の授業の終わりに、その回のまとめと次回の予定を説明する。復習は公開した授業資料を基にポイントを整理し、知識の定着を図ること（120分程度）。予習は、参考書や事前配布資料、Webサイトなどを参考に次回の授業に関する基礎的な概念を理解してくること（120分程度）。",
        "gradingGuidelines": "毎回の小レポート（計10%）、2回の授業に1回の割合のレポート課題（計70%）、最終レポート課題（20%）の合計を100点満点換算し、60点以上を得た者に単位を与える。小レポートについては、次の回の授業中に解説を行う。",
        "textbook": "特に使用しない。",
        "referenceMaterials": "授業トピックに応じて適宜紹介する。",
        "courseSchedule": "第1回：インターネットとは（役割、位置付け、所在）第2回：コンピュータ通信の基礎（ディジタル信号、エンコード）第3回：インターネットの通信方式（パケット通信、IPアドレス、ポート番号）第4回：ネットワークへの接続（LAN、ハブ、Ethernet）第5回：インターネットの構成（ルータ、同一ネットワーク内通信）第6回：データ伝達（IPパケットのルーティング、RIP、OSPF）第7回：確実なデータ伝達の方法（TCP、応答確認、UDP）第8回：End-to-Endの通信制御（フロー制御、輻輳制御）第9回：インターネット接続の様々な形態（電気、光、電波）第10回：インターネット利用の方式（サーバ\/クライアント通信、P2P、DNSとメール）第11回：インターネットのアプリケーション（WWW、SNS、音声と動画の伝送）第12回：インターネットの高度な利用（仮想化とクラウド、IoT）第13回：IPv6とインターネットセキュリティ（IPv4とIPv6、セキュリティ）第14回：まとめと復習課題の解説（まとめ）",
        "courseDataUpdatedAt": "2024\/03\/21"
    },
    "updateAt": "2024\/09\/13"
}