{
    "lectureCode": "M100101",
    "courseName": "映像創作入門[2023年以前入学者]",
    "lecturer": [
        "山脇伸介(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "金5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "テレビ局で30年以上にわたり番組制作に従事した実務経験に基づき、映像クリエイターになるための基礎を解説する実践的科目である。映像の歴史を知り、過去の名作の素晴らしさに触れ、現代の映像制作に通じる知識・教養を身につける。また、映画・テレビ・制作プロダクションなど、映像制作にかかわる会社や仕事についても、随時学んで行く。",
        "outcomesMeasuredBy": "１：映像の歴史を学び、著名な監督の作品について知る。２：映像作品を鑑賞するだけではなく、分析的に捉える。（左目はプロの目、右目は視聴者の目）３：映像を撮影・編集する上での基礎的な知識を学ぶ。４：映像制作にかかわるスタッフの仕事について知る。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力",
        "teachingMethod": "ノートPC必携。映像制作の基本となる撮影・編集の技法について解説し、参考映像を見せる。指名-回答-解説を中心としたアクティブラーニング形式で授業を行う。また、映像業界の第一線で活躍するプロフェッショナルによるゲスト講義も行う予定である。",
        "notices": "映画・テレビ・動画配信などで多くの映像作品を見ることはもちろん、世の中の動きに関心を持ち、自分の意見を持つことができる学生を求める。学習や課題に必要な映像は授業内で上映するが、紹介する映画の全てを上映・配布することはできない。DVDレンタル（図書館利用）や映像配信サービスなどで、授業で紹介した映画を視聴できる環境を整えることを推奨する。",
        "preparatoryStudy": "授業前に教科書を読んでおくこと。授業では、各回テーマに沿った様々な映像を見せ、感想・意見などの発言を求めるのでその準備をしておくこと（120分程度）。また授業後に、授業で扱った映画の全編を見ることを推奨する（120分程度）。",
        "gradingGuidelines": "中間リポート+最終リポート【70％】と授業中の発言【30％】で評価する。60％以上を合格とする。提出されたレポートは、授業内にフィードバックを行う。",
        "textbook": "佐々木和郎・羽田久一・森川美幸著「メディア学大系14クリエイターのための映像表現技法」コロナ社",
        "referenceMaterials": "",
        "courseSchedule": "第1回：イントロダクション(視聴者の視点、制作者の視点）第2回：映像の誕生（エジソン、リュミエール兄弟）第3回：編集のない映像の応用（ワンショット、長回し）「カメラを止めるな！」第4回：映像編集の誕生（モンタージュ、クレショフ効果）第5回：カメラ撮影の基本（画角、アングル）第6回：カメラ撮影の動き（パン、ティルド）第7回：映像編集の基本（静止画、動画）第8回：ケネディ大統領暗殺の衝撃（初日米中継、秘された８ミリ映像）第9回：ゲスト講義（予定）「映像クリエイターの思考法（仮）」作家・映像クリエイター浅生鴨氏（広告・番組制作の現場、ハートネットTV）第10回：番組制作の現場・前半（プレ・プロダクション、スタンバイ）第11回：番組制作の現場・後半（撮影・収録、ポスト・プロダクション）第12回：ゲスト講義（予定）「映像の未来とデザインを考える（仮）」TBSアクト未来技術推進部、青木貴則氏（バーチャル・プロダクション、メディア・アートの最前線）第13回：アニメーション（歴史、クール・ジャパン）第14回：まとめ（新しい価値観、これからの制作者に求められるもの）",
        "courseDataUpdatedAt": "2025/01/30"
    },
    "updateAt": "2025/03/21"
}