{
    "lectureCode": "M101101",
    "courseName": "メディア文化と社会[2023年以前入学者]",
    "lecturer": [
        "榎本美香(メディア学部メディア学科)",
        "森川美幸(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ２０２"
    ],
    "courceDetails": {
        "courseOverview": "私たちは「メディア」に取り囲まれて生活している、としばしば語られまたそう考えている。では、「メディア」はどこに存在し、どうやって私たちに影響を与えているのか。そう問うと、必ずしも明確に答えられない。手元のスマホがメディアなのか、その中のニュースアプリがそれなのか、それとも電車で楽しむゲームがそうなのか。この講義前半では、身の回りから「メディア」を自覚的に発見し、それがどのように組み立てられ、また構造を持っているかを検証する。そこから、そうした「メディア」が歴史的にどんな経過をたどって生まれ、発展してきたかを考え、現在の「メディア」のあり方を知る。後半では，「メディア」の中で語られる言葉と聴衆とのコミュニケーション，そこから生まれる新たなコミュニティについて考える．そして、もう一度＜私たちに影響を与える＞仕組みを考えることを通じて、「メディア」相互の関連、「メディア」と人間の関連、「メディア」と人間が混合した過程の現在と未来を展望する。",
        "outcomesMeasuredBy": "＜私たちに影響を与える＞仕組みを考えることを通じて、「メディア」相互の関連、「メディア」と人間の関連に関する知識を得るばかりでなく、「メディア」と人間が混合した過程の現在と未来を展望できる人材となる。",
        "learningOutcomes": "論理的な思考力分析・評価能力",
        "teachingMethod": "基本的には講義形式で行うが，授業内で複数回の課題を課す。毎回PCが必要である。",
        "notices": "事前に習得しておくべき科目は特にない。本講義では積極的な授業参加を求める。",
        "preparatoryStudy": "授業の予習として、参考書を予め読んでおくこと。また、毎回授業内で課題を出すので、その日の授業内容を復習しながら問題を解くこと。予習・復習時間は各120分を目安とする。",
        "gradingGuidelines": "複数回の課題（身の回りのメディアの記録や分析）50点と、期末試験50点の合計100点とし，60点以上を単位認定基準とする。課題に関しては、毎回フィードバックを行う。",
        "textbook": "無し",
        "referenceMaterials": "水越伸『21世紀メディア論』宮澤淳一『マクルーハンの光景メディア論が見える』伊藤明己『メディアとコミュニケーションの文化史』世界思想社三宅和子・岡本能里子・佐藤彰(編)『メディアとことば』１〜４ひつじ書房",
        "courseSchedule": "第1回：先史時代から中世へかけてのメディア文化（文字の誕生、印刷技術）榎本第2回：中世から現代へかけてのメディア文化（電子メディア、ネット時代）榎本第3回：〈マス〉メディアの語り（CMの好感度、テレビや広告の背景にあるフレーム）榎本第4回：オーディエンスを巻きこむ意味の生成（視聴者に味方を誘導するテロップ、漫才師の身体）榎本第5回：電子メディアの対話（チャット、携帯メール、LINE）榎本第6回：コミュニティ・ソリューション（自発的コミュニティ、問題解決能力の可能性）榎本第7回：到達度チェック課題(メディア文化、コミュニケーション)榎本第8回：日常の中のメディア（メディアの定義、コミュニケーションモデル、送り手と受け手）森川第9回：マクルーハンのメディア論（「メディアはメッセージである」、人間拡張の原理、熱いメディアと冷たいメディア）森川第10回：マスメディアが作る個人と社会１／報道系メディア（クロスオーナーシップ、デジタルシフト）森川第11回：マスメディアが作る個人と社会2／娯楽系メディア（製作と制作、映画ビジネス）森川第12回：個人メディアの台頭（ブログ、YouTube、オウンドメディア）森川第13回：オンライン時代のコミュニケーション戦略（広報・PR、宣伝・広告）森川第14回：メディアの未来（メディア環境の変化、AI）森川",
        "courseDataUpdatedAt": "2024\/03\/19"
    },
    "updateAt": "2024\/09\/13"
}