{
    "lectureCode": "M101701",
    "courseName": "プログラミング入門[2023年以前入学者]",
    "lecturer": [
        "大淵康成(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "プログラミング、すなわちプログラムの作成とは、ソフトウェアが内部で行っている処理を記述することである。本科目では、メディア学部の様々な科目で必要となるプログラミング技術の習得の基礎として、プログラミングの基本的な考え方と、簡単なプログラミングを行うための概念や方法の理解を目指す。ソフトウェアを利用していて見えている部分はプログラムの一部でしかなく、内部では様々な処理が行われている。これらの処理は様々なロジックやアルゴリズムの組合せによって実現されている。それを自ら組み上げる力を身に付けていく。また、既存のプログラムを理解することもプログラムを作る上では重要な技術である。やみくもにコピー＆ペーストするのではなく、何が書かれているのかを読み理解したうえで自分のプログラムに組み込む(コピー＆ペーストする)ことはプログラムの再活用という面では重要である。本科目は講義科目ではあるが、講師の実務経験に基づくプログラミング課題も並行して行うため、自らプログラミングを行う力を身に付けることができる実践的科目である。",
        "outcomesMeasuredBy": "プログラミング言語の文法の背後にある考え方を論理的に理解する力をつける。また、そのような論理的思考に基づき、簡単なプログラムを作って動作させるとともに、自らの問題を解決するためのプログラムを設計できるようになる。",
        "learningOutcomes": "論理的な思考力問題解決力",
        "teachingMethod": "ノートＰＣ必携のアクティブラーニング科目である。通常の講義に加えて、ノートＰＣを用いて実際のプログラミングを行う。",
        "notices": "毎回ノートＰＣを持参すること。",
        "preparatoryStudy": "講義資料はMoodleで公開するのであらかじめ目を通しておく(120分)。授業中に扱ったサンプルプログラムについては、自分なりに変更を加えて動作を確認してみること(120分)。",
        "gradingGuidelines": "授業内課題・理解度チェックにより評価する。授業内課題・理解度チェックについては基本的に翌週の授業でフィードバックを行う。",
        "textbook": "特になし",
        "referenceMaterials": "ケイシー・リース,ベン・フライ著「Processingをはじめよう」(オライリー・ジャパン)近藤邦雄,田所淳編「ProcessingによるCGとメディアアート」(講談社)",
        "courseSchedule": "第1回：前半の講義概要（講義の進め方、プログラミングとは）第2回：プログラムが動くまで（コンパイラ、インタプリタ）第3回：変数と演算子（データ型、スコープ）第4回：制御構造（繰り返し、条件分岐）第5回：関数（引数と返り値、値渡しと参照渡し）第6回：配列（メモリ構造、多次元配列）第7回：前半のまとめ（基本的なプログラミング、理解度チェック）第8回：後半の講義概要（講義の進め方、基本的なプログラミングの復習）第9回：ファイルの読み書き（ディレクトリ構造、テキストファイルとバイナリファイル）第10回：デバッグ・イベント処理（デバッガの使い方、マウス処理）第11回：プログラムを読みやすくするために（命名規則、コーディングルール）第12回：クラスとオブジェク（フィールド、メソッド、コンストラクタ）第13回：様々なプログラミング言語と開発環境(言語の特徴、使用例)第14回：後半のまとめ（プログラミングの学び方、理解度チェック）",
        "courseDataUpdatedAt": "2024\/02\/07"
    },
    "updateAt": "2024\/09\/13"
}