{
    "lectureCode": "M102101",
    "courseName": "ソーシャルリサーチ",
    "lecturer": [
        "山崎晶子(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火4",
        "木"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ５０３"
    ],
    "courceDetails": {
        "courseOverview": "本授業では、以下の６つを身につけることを目標とする。（１）会話分析の基本的な考え方を理解する。（２）会話分析の基本的な方法を身につける。（３）調査票の作成技法を身につけて、研究や調査に応用出来るようにする。（４）調査票の作成に必要な仮説の立て方、様々なサンプリング技法等を理解する。（５）社会調査を行う対象としてニュースを見る。（６）社会調査に関わる社会的倫理を身につける。社会の様々な事柄を理解するためには、調査を行い、データに則って対象となる社会事象を把握しなければならない。しかし、社会事象を理解するための社会調査には様々な方法があり、アンケート（調査票、質問紙法）を代表とする沢山のデータをとってコーディングを行う量的方法以外にも、インタビューやフィールドワーク、会話分析などの質的方法がある。社会の中の多様な現象を理解するためには、その調査対象や目的に適した調査方法を選ばなければならない。ここでは、量的方法の代表であり最も膾炙している質問紙法（アンケート）調査と会話分析をとり上げる。これらの調査法の特徴を学び、会話分析の方法と質問紙法における調査の設計と質問紙の作成法を理解して身につける。",
        "outcomesMeasuredBy": "現代社会に必要な調査法として二つの代表的な社会調査法を理解する。（１）会話分析の基本的な考え方を身につけ、ビデオデータや録音データの分析法を理解できるようにする。（２）会話分析の基本的な方法を理解する。ビデオデータや録音データを分析する方法を身につけ、他の授業などや卒業研究に応用する。（３）調査票の作成技法を身につけ、二年前期の統計法の授業をともに受けることによって、質問紙法の調査ができるようにする。（４）調査票の作成に必要な、仮説の立て方、様々なサンプリング技法を理解する。仮説という考え方や、サンプリングという考え方を知り、演習によって理解を行う。（５）調査票に作成に必要な、社会のニュースに目を配るようにする。社会調査をするためには、社会に関する問題意識が必要である。（６）調査において重要な社会的倫理を理解する。どのような調査であっても、被験者の人権と情報の保護を一番に行動しなければならない。また、このような倫理事項は、真摯な科学のやり方として最も重要なものである。これらの６つの項目を、講義、講義内演習、小テスト、課題などにより、身につける。これらにより、社会調査の基礎を身につけることを目標とする。",
        "learningOutcomes": "論理的な思考力",
        "teachingMethod": "・各回のテーマに応じて講義を行うが、テーマに付随して演習を行う。・質問を授業内に受ける。これらを理解するために、必要に応じて板書または詳細説明スライドの内容を書き取ること。・PCは必携である。・下にある授業計画は、質問や理解の程度によって、変更することがある。・ビデオデータの文字化を行うため、イヤホンなどを持ってくること。",
        "notices": "特に調査票は、毎回課題を解かないと完成しない。また、会話分析はビデオを授業内で提示する。",
        "preparatoryStudy": "予習：アップされた論文などの資料を読む（100分）．それに質問をフォームなどから行う（20分）。復習：授業のまとめを書き（20分）、宿題を行う（100分）。",
        "gradingGuidelines": "単位を取得するためには、授業内で提示する授業内課題とレポート２回の提出が必須である。それぞれの割合は授業内課題（40%）とレポート２回（60%）である。これらの結果から単位認定を行う。授業内課題はそれぞれ授業で良いものを取り上げたり、正解を示しフィードバックをする。レポートに関しても同様に良いものを取り上げて、フィードバックをする。そして最終授業で全体に関するフィードバックを行う",
        "textbook": "特になし",
        "referenceMaterials": "ガイドブック社会調査第２版森岡清志日本評論社2007年定価2900円プラス税実践エスノメソドロジー入門山崎敬一有斐閣（絶版なので、教科書としませんが、図書館にありましたら借りて下さい。）日本人と日系人の物語世織書房エスノメソドロジー・会話分析ハンドブック、山崎敬一他編、新曜社",
        "courseSchedule": "第1回:授業の紹介：授業計画の提示第2回:社会調査を使って何がわかるか：質的調査と量的調査、調査票入門（質的調査、量的調査、調査票）第3回:量的調査法：質問紙法（アンケートの作成、量的調査、質問紙法）第4回:調査法とサンプリング（サンプリング、量的手法）第5回:調査票の作成技法１)仮説の作成（仮説形成、量的な代表制）第6回:調査票の作成技法２）フェイスシートの作成（フェイスシート、属性）第7回:調査票の作成1)質問文作成と構成（選択肢、ダブルバーレル）第8回:調査票の作成2)授業内実習（質問紙作成、ワーディング）第9回:調査票の報告方法（コーディング、相関）第10回：質的調査法とフィールドワーク、会話分析（質問、インタビュー）第11回:会話分析：会話の順番取りシステム（質的調査、会話分析）第12回:会話分析：発話と視線（会話分析、視線）第13回:会話分析：発話と身体配置（会話分析、身体配置）第14回:質的調査の報告の仕方(トランスクリプト）（会話分析、文字起こし、トランスクリプション）",
        "courseDataUpdatedAt": "2024\/05\/10"
    },
    "updateAt": "2024\/09\/13"
}