{
    "lectureCode": "M200901",
    "courseName": "教育メディア論",
    "lecturer": [
        "松永信介(メディア学部メディア学科)",
        "飯沼瑞穂(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月4"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ５０２"
    ],
    "courceDetails": {
        "courseOverview": "教育とは、他者への学習支援活動であり、その教育者たる親や教師、その教具たる教材や教室などが創出するメディア環境全体を表している。昨今、この教育・学習の環境が、ICTの飛躍的な進展により変容しつつある。本講義の前半では、まず教育という普遍的な人間・社会活動において、その時々のメディア（各種資料、教具・デバイス等）が、時代の要請に応えてどのように編み出され、そしていかなる役目を果たしてきたのかを概観する。また、学習観の変遷とそれに基づくICTの導入ならびに教授理論について理解する。一方、講義の後半では、まず昨今のICT環境のもとで効率的な教育を展開する上でのプラットフォームやそれを活用した学習支援環境について学ぶ。さらに、この基本的なICTプラットフォーム環境を学校教育の域を超えたインフォーマル教育に活かす試みについて理解を深める。",
        "outcomesMeasuredBy": "時代の流れや社会文化の移り変わりとともに発展してきた教育メディアの歴史的変遷を認識する。また、各種学習観に基づく学習理論が、どのような教育メディア技術を築き上げていったのかを理解する。さらに、昨今のICTの進展が今後どのように教育に活かされるのかという展望に関する視点を身に付ける。",
        "learningOutcomes": "コミュニケーション能力分析・評価能力",
        "teachingMethod": "講義を中心に進める。その講義資料は、原則として学生ポータルの授業ページに掲載する。また、扱うテーマにより、SNSを活用したディスカッションを行ったり、CSCL（コンピュータ支援協調学習）を実践したりするため、ノートPCは必携とする。",
        "notices": "1年次で履修した科目（とりわけ社会コース系の科目）をよく復習して臨むこと。",
        "preparatoryStudy": "教科書をもとに，各回の講義前には予定されているトピックについて、事前に十分に予習しておくこと（120分程度）。また、講義後は速やかに講義内容について自力でまとめてみること（120分程度）。",
        "gradingGuidelines": "期末試験の成績70%、レポート・演習の成績30%の割合で素点を100点満点に換算し、成績評価を行う。60点以上が単位認定の要件となる。なお、レポート・演習については適時、解説や全体講評を行う。",
        "textbook": "稲葉竹俊，松永信介，飯沼瑞穂：メディア学体系6教育メディア，コロナ社（2015）",
        "referenceMaterials": "随時紹介",
        "courseSchedule": "第1回：イントロダクション（講義のねらいとスケジュール，講義内容の概観）（松永・飯沼）第2回：教育メディアの概観1（メディアの発展と教育への活用，メディアの種類と教育，教育メディアの歴史）（飯沼）第3回：教育メディアの概観2（教育の情報化，情報リテラシー，21世紀スキル，デジタルデバイド）（飯沼）第4回：学習理論と教育メディアの変遷1（行動主義とCAI，認知主義と知的CAI・ITS）（松永）第5回：学習理論と教育メディアの変遷2（状況主義，最近接発達領域，正統的周辺参加，CSCLと協調スクリプト）（松永）第6回：インストラクショナルデザイン1（学習者中心主義，インストラクショナルデザイン，ADDIEモデル）（松永）第7回：インストラクショナルデザイン2（学習課題，教授事象，レッスンプラン，目標準拠評価とルーブリック）（松永）第8回：ICTによる学習支援1（遠隔教育とeラーニング，学習管理システム，教育リソースの共有・再利用）（松永）第9回：ICTによる学習支援2（知の社会還元，オープンエデュケーション，OCW／MOOC（※CSCL体験））（松永）第10回：生涯教育とメディア（生涯教育と学習，インフォーマル／ノンフォーマル教育，エデュテインメント）（飯沼）第11回：ネットワーク時代の教育メディア（知識創造型教育，ソーシャルキャピタル，SNSと学習ネットワーク）（飯沼）第12回：教育メディアの新しい展開1（GBS理論，ゲームと教育，シリアスゲーム）（松永）第13回：教育メディアの新しい展開2（VRと教育，ユビキタスラーニング，RFID）（松永）第14回：まとめ（授業の要点の確認）（松永・飯沼）",
        "courseDataUpdatedAt": "2024\/01\/31"
    },
    "updateAt": "2024\/09\/13"
}