{
    "lectureCode": "M201201",
    "courseName": "メディア特別講義II",
    "lecturer": [
        "吉岡英樹(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "現在は音楽業界全体が大きく変化する時代です。音楽産業全体の展開において「ライブ・エンタテインメント」は、新しい市場開拓の中心として、その存在感を非常に強めています。ローリング・ストーンズやマドンナの例に見るように、世界中のアーティストが「CD販売による展開」から「ライブを中心とした360度ビジネス」へと転換を進めています。これは「より直接的な体験としての音楽を求める」観客側のニーズの現れでもあります。こうした時代状況を受けて本講義では「ライブ・エンタテインメント」に関連するさまざまなテーマを通じて、音楽産業全体のありかたを論じ、新しい時代を築くために必要な情報と知識を解説します。授業は、音楽業界ライブ業界での実務経験者をゲスト講師として迎え、現代におけるトピックを解説する実践的科目です。",
        "outcomesMeasuredBy": "「創作する・表現する・伝える」。こうしたアクティブな仕事について知りたいというモチベーションを持って「ライブ・エンタテインメント論」を受講し、これからの音楽業界や、ライブ・エンタテインとメントの時代を生き抜く力を身につけます。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力",
        "teachingMethod": "各回ともゲスト講師を招いて、ご自身の専門領域について、講義を担当していただきます。ノートPCを使います。ゲスト講師は、音楽業界の様々な分野からお招きします。音楽プロデュースからアーティスト・マネジメント、あるいはコンサート運営から劇場経営、チケット流通、著作権ビジネスまで、各界の第一線で活躍する講師の方々から講義をしていただきます。それぞれの現場における今日的視点から、ビビッドな情報に基づく「ライブ・エンタテインメント論」を幅広く展開していただきます。提出されたレポートや質問の内容については、各回の授業中に紹介して受講生へのフィードバックをおこないます。",
        "notices": "音楽業界の各ジャンルより、第一線のゲスト講師にお出でいただきます。他では聞くことの出来ない貴重な講義ですので、出来れば全回出席を目指して下さい。Web出席システムによる出席データをとります。授業時間中の積極的な質問や、感想の提出にも取り組んでください。",
        "preparatoryStudy": "自分の好きな音楽ジャンルについて、そのビジネス形態（CD販売、コンサート運営、ネット・コンテンツの展開、広告展開）などの状況を調べてみよう。音楽ビジネスにかかわる、法制度や著作権の問題などについて、自分なりに調べ、自分自身の問題意識を持って、講義に臨んで下さい。予習(120分)：登壇するゲスト講師のプロフィールを参考に、該当する業界の動向を調査し、事前質問フォームより聞きたい質問を投稿してください。なお、集めた質問は事前に講師の方に提出し、授業内容に反映して頂きます。復習：(120分)：授業中に書いたメモを見ながら、授業中に理解できなかった用語や内容についてインターネットで調査をし、改めて分かった事をノートにまとめましょう。",
        "gradingGuidelines": "期末試験は行いません。成績判定は、レポートと下記の「質問」から総合的に行います。各回の講師の先生にむけて、事前に「質問」を集めます。講義内容について予習をして自分なりの興味や疑問を持って書いてください。この質問も小レポートとしての評価対象とします。中間レポート+最終レポート:60ポイント\/質問や小レポート：40ポイント（100点満点で、60点以上であること）レポートや質問の内容と評価については授業中に随時フィードバックいたします。",
        "textbook": "教科書の指定はありません、以下の「参考書」などの書籍を通じて予習して下さい。",
        "referenceMaterials": "「ライブ・エンタテインメント新世紀」北谷賢司（ぴあ総研）「ライブ・エンタテインメントの著作権」福井健策\/二関辰郎（社団法人著作権情報センター）",
        "courseSchedule": "第1回:オリエンテーション\/ライブ・エンタテインメント論を受講する皆さんへ第2回:誰にでも分かる音の楽しみ方（音響工学）第3回:Jポップからロックまで\/デジタル時代の音楽第4回:都市における総合型エンタテインメント（ライブ事業）第5回:音楽の創造\/アーティストの立場から（音楽制作）第6回:生活の中のエンタテインメント（劇場経営と芸術の創造）第7回:テレビ放送とライブ・エンタテインメント（映像配信）第8回:海外ビジネスへのチャレンジ（日本コンテンツの海外進出）第9回:マネージメントの未来（プロダクション経営展開）第10回:今日的ライブ運営（ライブ事業展開）第11回:コンテンツ産業の将来を考える（経済産業省の政策方針）第12回:ライブ・エンタテインメント新世紀（音楽業界の再生と経済発展）第13回:音楽プロデューサーとは\/クリエイティブ・マインドの育て方第14回:日本のコンテンツ政策\/世界におけるジャパンコンテンツ",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}