{
    "lectureCode": "M201201",
    "courseName": "メディア特別講義II",
    "lecturer": [
        "吉岡英樹(メディア学部メディア学科)",
        "竹島由里子(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "コンサート・プロモーターズ協会の調査によると、ライブの公演数は20年前の２倍上に、さらに来場者数は３倍以上に増えており、ライブ・エンタテインメント業界が急成長していることが分かります。ライブ・エンタテインメントとは、音楽ライブのみならずスポーツやミュージカルのように、多くの人を集客する多様な娯楽のことを指します。また、これらのイベントに集客するためにはSNSや動画配信サービスなどを活用し、日頃から情報発信をすることで、コンテンツ・ユーザーの興味関心を情報から読み取ることが重要です。また、世界的にもSDGsが注目されているのと同様に、エンタテインメント業界においても環境や人権に配慮した持続可能な活動が必要不可欠です。本講義では、ライブ・エンタテインメント業界を中心としたエンタテインメント・ビジネスの多様なテーマを取り上げ、業界の構造やビジネスの仕組みについて学びます。また、新しいメディア技術により、これらのエンタテインメント・ビジネスが発展してきた経緯を学び、将来の可能性について考察します。本講義は、エンタテインメント業界の最前線で活躍している実務経験者をゲスト講師として迎え、現代における最新トピックを解説する実践的科目です。",
        "outcomesMeasuredBy": "エンタテインメント業界の第一線で活躍するゲスト講師から、現場で培った実学に基づく専門能力について学びます。また、これからの業界で生き抜くために、メディアを活用したコミュニケーション能力を活用する力を身につけます。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力",
        "teachingMethod": "ゲスト講師が用意した資料を表示して講義を行います。資料の内容は業界の最新情報等が含まれていることから、配布することが出来ません。受講生はメモをとりながら講義を聞き、授業終了後に授業の考察を課題として提出します。なお、ゲスト講師のプロフィールを事前に公開しますので、インターネットで該当する業界などについて調査を行い、質問を投稿してもらいます。集めた質問は事前にゲスト講師に提出し、それらの内容を踏まえて授業を進行いたします。また、授業終了後に時間に余裕がある場合は、挙手により質問することも可能です。このように、ゲスト講師と受講生がコミュニケーションをとりながら、アクティブラーニング形式で授業を進めます。・パソコンで質問を集めたり、課題に取り組んだりするため、各自のノートパソコンを持参して下さい。",
        "notices": "・授業中に投影された授業資料をスマートフォン等で撮影することは固く禁じます。",
        "preparatoryStudy": "コンサートプロモーターズ協会(ACPC)のホームページにアクセスし、ライブ・エンタテインメント業界の動向(興行の変遷、ACPCの役割、公演数や動員数の変化など)について調査しておくと、授業内容をより理解することができるでしょう。その他、ゲスト講師のプロフィールが公表されたら、事前に該当する業界について調査を行っておきましょう。予習(120分)：登壇するゲスト講師のプロフィールを参考に、該当する業界の動向を調査し、事前質問フォームより聞きたい質問を投稿してください。なお、集めた質問は事前に講師の方に提出し、授業内容に反映して頂きます。復習：(120分)：授業中に書いたメモを見ながら、授業中に理解できなかった用語や内容についてインターネットで調査をし、改めて分かった事をノートにまとめましょう。",
        "gradingGuidelines": "期末試験は行いません。成績判定は、毎回提出する「①課題(授業の考察)」と、任意で提出する「②質問(講師への事前質問)」の合算により行います。「①課題(授業の考察)」を70%、「②質問(講師への事前質問)」を30%の配点とし、合計点が100点中60点以上を単位認定要件とします。",
        "textbook": "教科書の指定はありません。",
        "referenceMaterials": "「ライブ・エンタテインメント新世紀」北谷賢司（ぴあ総研）「ライブ・エンタテインメントの著作権」福井健策/二関辰郎（社団法人著作権情報センター）",
        "courseSchedule": "第1回:オリエンテーション（ライブ・エンタテインメント、コンテンツビジネス、SDGs）第2回:音楽イベントとSDGs（サステイナブル、環境問題、森林保護）第3回:アニメ産業の現状（コンテンツビジネス、コンテンツの輸出入、業界構造）第4回:エンタテインメントとデータ（チケッティングビジネス、データ収集、マーケティング）第5回:音楽の創造（作曲、編曲、音楽制作）第6回:ラジオ（音声コンテンツ、企画立案、メディアミックス）第7回:著作権管理事業（著作権、著作隣接権、著作権ビジネス）第8回:海外ビジネスへのチャレンジ（プロダクション、日本由来コンテンツ、海外進出）第9回:スタートアップ企業（起業、会社設立、上場）第10回:音楽プロデュース（プロデュース、作曲、AI）第11回:総合エンタテインメント（グローバルビジネス、ローカライズ、企業理念）第12回:ゲーム産業（アーケードゲーム、企画、マーケティング）第13回:スポーツ産業（産業構造、コンテンツビジネス、コンテンツ配信）第14回:アニメと音楽（声優、コンテンツ企画、ライブ）",
        "courseDataUpdatedAt": "2025/01/30"
    },
    "updateAt": "2025/03/21"
}