{
    "lectureCode": "M2011S3",
    "courseName": "メディア専門演習I[デジタルテキストデザイン]",
    "lecturer": [
        "松永信介(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火",
        "火2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "昨今、電子マガジンや電子カタログ、電子教科書などのデジタル化された出版物（電子ブック）への関心が急速に高まっている。実際、電子ブックの閲覧用タブレットの市場では、AmazonのKindleや楽天のKoboなどの専用端末、iPadやNexusなどの多目的端末が続々と登場している。また、流通するコンテンツは、マスメディア、エンターテインメント、教育など多岐の分野に渡るが、既存の紙媒体では実現できなかった音声や動画などのマルチメディアを取り入れることで、その魅力や利便性は着実に進化の一途を辿っている。このような背景のもと、本演習では、Pagesというオーサリングソフトを用いて、マルチメディアを取り込んだ配信型デジタルテキストの立案・設計・開発のプロセスを一通り実地に体験する。",
        "outcomesMeasuredBy": "電子ブックにはさまざまなジャンルやスタイルがあり、その特性に応じた標準的な情報デザインがあることをまず認識する。その上で、Pagesで用意されている基本的な機能を組み合わせて、読者を惹きつけるようなインタラクティブ性のある電子ブックを制作するスキルを身に付ける。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "演習の前半は、情報分析やテキスト構成の技法の学習とPagesの基本操作やウィジェット機能の習得を並行して進める。一方、演習の後半では、各自（／各グループ）で設定したテーマを最終プレゼンテーションに向けて作品の形にしていく。なお、制作するコンテンツのテーマは、グルメ・ファッション・スポーツ等に関する情報マガジン、自然や科学等の学術内容をわかりやすく視覚的に伝えるサイエンスマガジン、英語や地理等の小中高校で学ぶ内容を取り扱う電子教科書などの中から自身（／グループ）の関心に応じて決定する。なお、本演習は、原則として毎回大学のMac専用の教室（演習室）で行う。したがって、個人のノートPCを必携とはしない。",
        "notices": "本演習には課題が多くあり、継続的かつ計画的に取り組む姿勢が求められる。特に、3回目以降からは実質的にグループワークとなるので、他のメンバーに迷惑をかけないようにすること。また、本演習ではプレゼンテーションも重視している。企画立案後、情報分析後、構成案作成後、さらには最終課題着手後に3回、前に出ての発表を課している。プレゼンテーションは卒業研究では当たり前のように行わなければいけないことであるので、この演習をそのよい練習の機会と考え、積極的に取り組むこと。",
        "preparatoryStudy": "各回の講義前には予定されているトピックについて、指定参考書や図書館の書籍などを読んで予習しておくこと（120分程度）。また、講義後は速やかにて講義内容について自力でまとめてみるとともに、課題は必ず試みること（120分程度）。",
        "gradingGuidelines": "企画書10%（資料5%＋発表5%）、情報分析15%（レポート10%＋発表5%）、テキスト構成案15%（レポート10%＋発表5%）、最終課題60%（制作物40%＋発表20%）の割合で素点を100点満点に換算し、成績評価を行う。60点以上が単位認定の要件となる。各課題に対しては、発表時に講評を行う。",
        "textbook": "指定しない",
        "referenceMaterials": "随時紹介",
        "courseSchedule": "第1回ガイダンス，デジタルテキスト概論，テーマの立案・企画書の作成第2回Pagesの基本，個別企画提案第3回ブックデザインの基本1，課題テーマ・グループの確定第4回ブックデザインの基本2，Web情報分析第5回編集の基本フロー，分析レポート発表第6回レイアウト設計，テキスト構成技法第7回Pagesの高度な使い方，構成案レポート発表第8回最終課題制作1第9回最終課題制作2第10回最終課題中間発表第11回最終課題改善・制作1，グループ間クロスチェック1第12回最終課題プレ発表第13回最終課題改善・制作2，グループ間クロスチェック2第14回最終課題本発表",
        "courseDataUpdatedAt": "2024\/05\/23"
    },
    "updateAt": "2024\/09\/13"
}