{
    "lectureCode": "M202101",
    "courseName": "ニュースメディア論",
    "lecturer": [
        "野島卓(片柳研究所)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ３０３"
    ],
    "courceDetails": {
        "courseOverview": "電車の中では多くのサラリーマンが新聞を広げ、テレビのニュースは視聴率１５％程度を記録していた時代にテレビ局に入局した者にとって、今のマスコミの姿は想像を絶するものである。時代が変化していくスピードが加速度的に増していくなか、メディアは、ニュースはどう姿を変えていくのか。混迷の中にいると思われるテレビニュースの制作者に様々な項目について取材した内容を授業で伝えたうえで、今後進むであろうメディアの在り方を考察する科目である。また、いまや学生も情報発信者＝メディアの一端を担っている。発信することの意義や責任についても議論を重ね、グループワークを通じて映像ニュースを制作し、どんな時代にも通底する取材と発信について学ぶ。技術の進歩によって生み出された利点がある一方、ディープフェイクやフィルターバブルなど、知らないうちに事実誤認をしてしまったり思考が偏ってしまう恐れがある現代において、自ら考えること、多角的な視点を持つことの重要性を認識してもらうことも大きな柱となる。",
        "outcomesMeasuredBy": "自らが発信者となることで情報発信のための基礎的能力を身につける。また多角的な視点を持つためにはコミュニケーション能力が不可欠。一方的に情報を遮断せず、多くの観点があることを知る。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力",
        "teachingMethod": "５～６人程度のグループを組み、毎回提示される課題について各自が意見を表明して議論し、グループとしての方向性を見出す。短時間で考えをまとめ多人数の前で表明する経験は社会に出てからの糧となる。グループワークの集大成として９０秒程度の映像ニュースを作成する。Moodleを使用するためノートPC必携。",
        "notices": "テレビを持たない学生が大多数だが、各テレビ局ともニュースをYouTubeで配信している。映像ニュースとテキストだけのニュースの表現の違いについて興味を持って読み解いてほしい。",
        "preparatoryStudy": "予習として、少なくとも授業前日か当日の映像ニュースを事前にチェックし、局や媒体による切り口の違いを確認する(120分）授業においてほかの人の意見が理解できなかった場合、周辺情報などを調べ、なぜそこに至ったかを復習しておく（120分）",
        "gradingGuidelines": "講義中の発言２割・講義の課題の内容１割・ニュース制作３割・期末レポート４割。１００点満点中６０点以上で単位認定とする。",
        "textbook": "指定しない",
        "referenceMaterials": "稲増一憲『マスメディアとは何か』中公新書古川勝久『北朝鮮核の資金源国連捜査秘録』新潮社澤田哲生『御用学者と呼ばれて』双葉新書中野信子『フェイク』小学館新書",
        "courseSchedule": "第1回：テレビニュースの現状（視聴率、制作能力）第2回：変わりゆく取材とメディアスクラム（第四の権力、取材方法）第3回：実名報道は必要か（被害者意識、個人情報）第4回：報道と政治との関わり（権力の監視、情報入手）第5回：フェイクニュースとの闘い（ディープフェイク、チェック機能）第6回：災害報道（全国とローカル、速報性）第7回：自衛隊を巡る認識の変遷（憲法論議、国際環境）第8回：エコーチェンバー、フィルターバブル（ネットとテレビ、偏り）第9回：ニュースを発信する意義と責任（取材、確認）第10回：ニュースの作り方（ネタ決め、取材）第11回：ニュース制作前半グループの発表（映像、取材）第12回：ニュース制作中盤グループの発表（映像、取材）第13回：ニュース制作後半グループの発表（映像、取材）第14回：これからのニュースとメディアの行方（方向性、民意）第15回：",
        "courseDataUpdatedAt": "2024\/01\/25"
    },
    "updateAt": "2024\/09\/13"
}