{
    "lectureCode": "M202601",
    "courseName": "CG数理の基礎",
    "lecturer": [
        "柿本正憲(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "コンピュータグラフィックス（CG）と画像処理のための基礎的数学の知識とアルゴリズムとプログラミングを解説する。CGのもっとも基礎的な技術を学ぶ。CG・画像の各種技法の多くは他の講義科目に譲り、本科目は少数のテーマを厳選して、各種技法の基礎となる数学やアルゴリズムをきちんと理解することを目的とする。この科目を受講することによって、ディジタル画像やCG映像がどのような原理でつくられているかを深く理解することができる。その後に受講する関連授業や演習の内容を正確に理解する手助けとなる。",
        "outcomesMeasuredBy": "CGの基本的な概念（各回授業で解説する5～10個の専門用語）について正しく区別し説明できるようになることを到達目標とする。CGの基礎的なアルゴリズムの原理を理解し、結果として、各手法の各処理ステップにおける出力（たとえば画素の輝度値）がどうなるか正しく判定できるようになることを到達目標とする。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "授業資料は予習のために事前配布する。履修生は事前に質問を提出することができる。スライドを使った講義がメインだが、履修生の事前質問への回答に重点を置く。それに加え以下のような方法で受講生の理解を深める。・授業中にサンプルプログラムを各自が実行し、習ったことを実際にCG表示して確かめるアクティブラーニングを実施する・小テストを行い、授業時間内に正答率を確認し講師が解説を行う・レポート課題として、プログラムを実行した結果やプログラムを改良した結果を提出するプログラム言語としてProcessingを用いる。各回の授業で、Processingを用いたプログラミングの説明にも時間を割く。授業にはノートPC持参のこと。",
        "notices": "高校の数学のうち「座標」「関数のグラフ」「ベクトル」の基本的な概念を復習しておくことを推奨する。「行列」については、「数学基礎」または「数学概論」の復習のほか、2年次前期の「CG・ゲームのための数学」を履修しておくことが望ましい。Processingプログラミングについては「基礎演習Ⅰ」の該当部分を復習しておくこと。2年次前期の「CG制作の基礎」を修得済であることが望ましい。本科目と並行して2年次後期の「ディジタル映像表現論」「イメージメディア処理論」を履修することを推奨する。3年次後期の「情報可視化」の受講予定者は、本科目を受講しておくことを推奨する。3年次前期の「3次元コンピュータグラフィックス論」は本科目の修得が履修の前提となる。本科目を修得することによって、授業範囲に関してはCG-ARTS協会のCGエンジニア検定ベーシック相当以上の力がつく。ただし、実際の検定受験にあたっては、授業範囲外の分野の自己学習が必要である。",
        "preparatoryStudy": "毎週の授業の予習のために一週間前をめどに授業資料を公開する。事前質問（任意）を提出することを推奨する。また、教科書や参考書の該当ページを読み、どのようなCG画像が出力されるかを理解しておくことを勧める。また、毎授業後はレポート課題を提出すること。各回授業の復習として、スライド全体を見直すほか、教科書や参考書の該当ページを読んで多角的な観点から内容を理解することを推奨する。また、小テストを再度解答し、内容理解が問題解決に結びついているかを確認すること。予習・復習それぞれ120分程度を目安とする。",
        "gradingGuidelines": "課題の評価と期末試験結果を50:50の比率で総合成績に反映する。総合成績が100点満点で60点以上の場合に単位認定とする。授業中の小テストは、教員による理解度確認と出席確認が目的で、原則として成績には反映しない。ただし、提出回数が極端に少ない場合は成績判定に影響する。小テスト実施直後に、フィードバックとして解答分布を表示し誤答の多い部分は解説を行う。事前質問の提出頻度と内容に応じて総合成績に最大10点を加点する。",
        "textbook": "CG数理の基礎（コロナ社メディア学体系シリーズ）この教科書は本講義の内容をほぼすべてカバーしており、授業資料と併用することで講義内容の理解促進が期待できる。",
        "referenceMaterials": "(1)ビジュアル情報処理-CG・画像処理入門-（CG-ARTS協会）この参考書はCGエンジニア検定ベーシックの出題範囲である。(2)コンピュータグラフィックス（CG-ARTS協会）この参考書はCGエンジニア検定エキスパートの出題範囲である。また、「3次元コンピュータグラフィックス論」の教科書として使用する。(3)ProcessingによるCGとメディアアート（講談社）",
        "courseSchedule": "第1回:ガイダンス、ディジタル画像と図形の数学表現第2回:線分や円の描画（ブレゼンハムのアルゴリズム、定式化）第3回:三角形の塗りつぶし（ラスタ化、塗りつぶし）第4回:アンチエイリアシング（重み付平均、マルチサンプリング）第5回:幾何学的変換（移動、回転、拡大／縮小）第6回:座標変換・同次座標と行列（一次変換、2次元アフィン変換）第7回:ディジタルカメラモデルと投影変換（ビューイングパイプライン、ビューボリューム、透視投影、画角）第8回:画像の濃淡処理（トーンカーブ、空間フィルタ、画像間演算）第9回:画像の幾何学的変換（再標本化、バイリニア補間）第10回:色の表現（表色系、カラーモデル、スペクトル）第11回:形状モデリングの基礎（サーフェスモデル、ソリッドモデル、CSG表現、集合演算）第12回:曲線の表現（パラメトリック表現、ベジエ曲線、B-スプライン曲線）第13回:立体形状の各種表現（ポリゴン曲面、ボクセル、フラクタル、メタボール、パーティクル）第14回:CGアニメーションの基礎技術（キーフレーム法、モーションブラー）",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}