{
    "lectureCode": "M202701",
    "courseName": "統計データ分析",
    "lecturer": [
        "松永信介(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火5"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "本格的な情報化社会に入り、多種多様なデータが種々のメディアを通じて身近なものとなってきている。しかし、データはただ眺めているだけでは意味がなく、適切な意味解釈を通じて初めて有益な情報資源となる。本講義では、基礎的な確率・統計手法を用いて、収集データの見方や分析の基本を学ぶとともに、その背後にある社会や経済の諸現象などを把握・検証する術について学ぶ。具体的には、授業の前半は、基本統計量などを通じたデータの解釈や初歩的な分析手法を習得する。一方、授業の後半では、調査演習を交えつつ、検定や分散分析の基本的な考え方への理解を深める。",
        "outcomesMeasuredBy": "基本統計量の種類と意味を理解するとともに、分布などをグラフとして視覚化できるようになる。また、複数のデータ間の関係性を見極めた上で適切な分析処理ができるようになる。さらに、自らデータを収集して分析・評価ができるようになる。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力",
        "teachingMethod": "講義と並行する形で演習を行う。演習には提出用のものとそうでないものとがあるが、提出用のものは他人との相談なしに取り組み、各自で提出する。一方、提出の必要性ない演習に関しては、必要に応じて学生同士で議論しても構わない。",
        "notices": "必須要件ではないが、前年度までに1年次後期の「ソーシャルリサーチ」を受講していることが望ましい。ノートPCは必携とする。演習はMSExcelを基本ツールとして進める。各回で配信する演習用のワークシートもExcel形式である。ただし、別に使い慣れている統計ソフトがあり、Excelデータとの互換ができるのであれば、その統計ソフトを用いて演習を行って構わない。",
        "preparatoryStudy": "各回の講義前には予定されているトピックについて、指定参考書や図書館の書籍などを読んで予習しておくこと（120分程度）。また、講義後は速やかにて講義内容について自力でまとめてみるとともに、課題は必ず試みること（120分程度）。",
        "gradingGuidelines": "期末試験の成績60%、レポート・演習の成績40%の割合で素点を100点満点に換算し、成績評価を行う。60点以上が単位認定の要件となる。なお、レポート・演習については適時、解説や全体講評を行う。",
        "textbook": "指定しない",
        "referenceMaterials": "・東京大学教養学部統計学教室：基礎統計学統計学入門，東京大学出版会（1999）・森敏昭，吉田寿夫：心理学のためのデータ解析テクニカルブック，北大路書房（1990）・上田太一郎監修：Excelでかんたん統計分析，オーム社（2007）",
        "courseSchedule": "第1回：イントロダクション（授業の位置づけと概観，統計の2つの立場，Excelの準備）第2回：データの整理1（データの種類と尺度，単純集計，基本統計量，データの整理例）第3回：データの整理2（サンプリング，欠損値と外れ値・異常値，データの視覚化）第4回：データ間の関係（クロス集計，散布図，相関と回帰，相関係数）第5回：記述統計1（分布，中心とバラツキ，各種特性値）第6回：記述統計2（ヒストグラム，四分位とパーセント点，箱ひげ図）第7回：種々の分布1（正規分布，2項分布，指数分布，ポワソン分布）第8回：種々の分布2（t分布，F分布，χ2（カイ2乗）分布）第9回：統計的推定（標本誤差，点推定と区間推定，母平均・母比率の推定）第10回：統計的検定1（帰無仮説と対立仮説，検定の仕組み，有意水準と棄却域，母平均の差の検定）第11回：統計的検定2（独立性の検定，適合度の検定）第12回：分散分析1（要因と水準，一元配置，分散分析表，多重比較）第13回：分散分析2（二元配置の分散分析，交互作用，共分散分析）第14回：発展的内容（ノンパラメトリック検定，多変量解析）",
        "courseDataUpdatedAt": "2024\/01\/11"
    },
    "updateAt": "2024\/09\/13"
}