{
    "lectureCode": "M301701",
    "courseName": "映像文化論",
    "lecturer": [
        "山脇伸介(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "テレビ局で30年以上にわたり番組制作に従事した実務経験に基づき、映像をより専門的に学ぶ学生に向け、優れた映像作品を紹介し、解説する実践的科目である。シド・フィールドが提唱した脚本術をもとに、構成・ストーリー・原作にかかわる問題に加え、その物語世界を可視化させる映像技術との関係を考える。",
        "outcomesMeasuredBy": "１：すぐれた映像作品のストーリー構成を分析する。２：オリジナリティあるアイデアの作り方を考える。３：最新の映像制作環境を理解し、考察する。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力",
        "teachingMethod": "ノートPC必携。映像構成の基本となる「ファースト10」「三幕構成」について解説し、参考映像を見せる。指名-回答-解説を中心としたアクティブラーニング形式で授業を行う。また、映像業界の第一線で活躍するプロフェッショナルによるゲスト講義も行う予定である。",
        "notices": "映画・テレビ・動画配信などで多くの映像作品を見ることはもちろん、世の中の動きに関心を持ち、自分の意見を持つことができる学生を求める。学習や課題に必要な映像は授業内で上映するが、紹介する映画の全てを上映・配布することはできない。DVDレンタル（図書館利用）や映像配信サービスなどで、授業で紹介した映画を視聴できる環境を整えることを推奨する。",
        "preparatoryStudy": "授業の早い段階でシド・フィールドの「ファースト10」「三幕構成」の考え方について解説するので、自分なりにその思考を進化させること。その後の授業では、各回テーマに沿った様々な映像を見せ、感想・意見などの発言を求めるのでその準備をしておくこと（120分程度）。また授業後に、授業で扱った映画の全編を見ることを推奨する（120分程度）。",
        "gradingGuidelines": "中間リポート+最終リポート【70％】と授業中の発言【30％】で評価する。60％以上を合格とする。提出されたリポートは、授業内にフィードバックを行う。",
        "textbook": "指定しない",
        "referenceMaterials": "シド・フィールド著「映画を書くためにあなたがしなくてはならないこと」フィルムアート社",
        "courseSchedule": "第1回:イントロダクション（授業概要、名作映画に学ぶ制作技法）第2回:映画分析の手法（ファースト10、三幕構成）「バック・トゥ・ザ・フューチャー」第3回:若者の成長を描く・前半（映画と音楽、映画とファッション）「卒業」「プラダを着た悪魔」第4回:ゲスト講義（予定）「デジタル・コミュニケーションビジネスの可能性（仮）」SoVeC株式会社（ソニーグループ）代表取締役社長・上川衛氏（ARコンテンツ、XR体験の最新状況）第5回:若者の成長を描く・後半（映画と自動車、フラッシュバック）「レディ・バード」第6回:戦争の悲劇を描く・前半（時代背景、クロスカット）「ダンケルク」「プライベート・ライアン」第7回:戦争の悲劇を描く・後半（音響効果、スターシステム）「プライベート・ライアン（続き）」「戦場のピアニスト」第8回:ゲスト講義（予定）「VR動画の現状と未来（仮）」株式会社NeoRealX（日本テレビグループ）代表取締役・安藤聖泰氏（VR動画、地方再生の試み）第9回:編集のない映画（ワンカメ、ワンショットの効果）「ストレンジャー・ザン・パラダイス」第10回:ヌーヴェル・ヴァーグの「革命」（スタジオ撮影、屋外ロケ）第11回:ヌーヴェル・ヴァーグ（ジャンプ・カット、ゲリラ撮影）「勝手にしやがれ」第12回:黒澤明の映画（ドラマツルギー、望遠レンズ）「生きる」「蜘蛛巣城」第13回:アジア映画の躍進（韓国映画、日本アニメ）第14回:まとめ（これからの映像作家にもとめられる想像力、企画力）",
        "courseDataUpdatedAt": "2025/01/30"
    },
    "updateAt": "2025/03/21"
}