{
    "lectureCode": "M301401",
    "courseName": "社会経済論",
    "lecturer": [
        "榊俊吾(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "金4"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "経済の基本的なメカニズムを理解するための入門的な講義で、経済ニュースや企業の意思決定、政府の経済政策を理解できるようになることを目標にする。マクロ経済統計の分析と、こうした事実を元にした（エビデンスベースの）消費者・企業のミクロ的な意思決定原理を合わせて理解していくことが本講義の中心的なテーマになる。具体的なテーマの選定については、下記講義計画の通りであるが、本年度の経済情勢等を鑑み、多少の変更がありうる。また、現実の経済社会への問題意識を深め、日本経済の現状を数量的に把握できるような視座を養っていくように、ミクロ・マクロの統計および情報化に関するデータの紹介を行っていく。",
        "outcomesMeasuredBy": "本講義は主として以下の二つの問題関心から構成されている。講義範囲は主として以下の（1）に相当し、その中で（2）の考え方について理解を深めていく。それぞれの到達目標は以下の通りである。(1)経済情報の編集・分析・社会・経済システムの構造を数量的な視点で理解する。・主要な官公庁統計情報の内容を理解し、編集、分析技術を身につける。・国民経済計算の構造を理解し、マクロ経済を会計的な面から理解する。・以上の分析手法の学習を通じて、経済ニュースを批判的に検討できる能力を身につける。(2)意思決定の考え方・情報と経済的行動との関係について基礎的な原理を理解する。・企業の会計的な構造を理解し、理論と現実面での意思決定原理を理解する。・以上の理論的な手法の習得を通じて、現実の企業行動を、マスコミ等の経済ニュースから読み解けるような技能を身につける。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力",
        "teachingMethod": "講義を中心とする。適宜、演習課題(統計処理等)を実施するため、その際にノートパソコン(表計算ソフト)が必要である。",
        "notices": "受講者は不定期に出題される課題を提出する必要がある。また、経済学のモデルは細かい論理を積み上げて構成されるので、毎回講義開始に遅れないよう、出席する必要がある。当科目履修にあたって前提となるものはない。また、線形代数、微分･積分、ゲーム理論、統計学に関する基礎的な学力を持っていることが望ましいが、非常に初歩的なレベルのものであり、必要な単元に関しては講義中に適宜補足紹介する。ただし、トピックによっては、受講生諸君には細かな論理を積み上げていく忍耐が求められる。また、最低限必要な講義資料はＷＥＢ上に掲載するが、板書がかなり多いので、毎回しっかりノートを取る姿勢が求められる。",
        "preparatoryStudy": "本講義の予習として、毎日各界に関連する経済ニュースを読み(120分)、復習としては各回の例題等を再度確認、計算すること(120分)。",
        "gradingGuidelines": "不定期に出題する複数の課題による。毎回の評価要件は、必要最低限の要件(概念の解説、経済指標の計算等100点中60点)および、モデルの理論構成、政策含意等に関する理解度･解説の詳細さ(100点中40点)に応じて加点する。各回の合計で60％以上を合格とする。上記の課題等については、講義中に適宜解説を行う。",
        "textbook": "コロナ社「ICTビジネス」を使用する。また、講義に必要なテキスト等の資料は授業ページに掲載する。",
        "referenceMaterials": "吉川洋「マクロ経済学」岩波書店を挙げておく。講義中に適宜指示する。",
        "courseSchedule": "第1回:講義概要・スケジュールの紹介(マクロ経済学、ミクロ経済学)第2回:国民経済のシステム(経済主体、相互依存関係)第3回:統計情報による日本経済の概要(物価指数、失業率)第4回:国民経済計算による日本経済の分析（GDP、寄与度）第5回:商業統計による日本経済の分析（品目別統計、寄与度）第6回:工業統計による日本経済の分析（産業別統計、在庫循環図）第7回:全国消費実態調査による所得分布の不均一性、ローレンツ曲線の作成と分析第8回:全国消費実態調査による所得分布の不均一性、ジニ計数の作成と分析第9回:回帰分析による消費関数の推定第10回:回帰分析による財務データを使用した推定第11回:回帰分析による弾力性の推定第12回:SNAの構造（GDP、国民経済計算：SNA)第13回:物価指数の基礎（CPI、CGPI、CSPI、デフレータ）第14回:物価指数の作成（ラスパイレス型、パーシェ型）",
        "courseDataUpdatedAt": "2025/01/07"
    },
    "updateAt": "2025/03/21"
}