{
    "lectureCode": "MK07501",
    "courseName": "ゲームデザイン論基礎",
    "lecturer": [
        "安原広和(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "ゲームデザイン論基礎は、ゲーム産業を取り巻く現在の世界状況、マーケット、ハードウェアなどの周辺事情を具体例を出しながらゲームをプレイする消費者側ではなく、産業として作るクリエイター側の視点からゲームを解説します。日本、北米、欧州のゲーム開発スタジオ、大手パブリッシャーでの開発者、監督としての実務経験に基づき、ハードウェアの進化に伴って「ゲーム」が変遷してきた過程や、国内海外とのゲームの文化的相違、全世界に市場を持つ巨大なゲーム産業、という多角的な現場からの視点でゲームを設計デザインするために想定するべき必要な基礎知識を主に学習する実践的科目です。",
        "outcomesMeasuredBy": "「ビデオゲーム」を作るための基礎的な常識・知識、また産業としてのゲーム業界の構造を学び、最終的に初歩的なゲームデザインのフレームを理解し、実際の業務を想定ながらゲームを設計する基礎的な知見を会得すること。実際に自分の作りたいゲーム、自分のゲームの嗜好を批判的思考（criticalthinking）やメタ視点で客観的に見る習慣を養い、アイデアを企画に落とし込む手法を学びます。そしてそれを応用し、自分のアイデアを明瞭かつ的確に他者に伝える手段を創造しながら実践することで、その知見を身につけます。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "動画で多くのゲームや関連参考素材の具体例を見ながらその背景を解説していく、インタラクティブなクイズ形式の教材を用いるなど、単なる通読や座学ではない講義を行います。またその授業で話した内容についての課題の回答と提出、それに関する授業内での実戦的な課題への評価を行ないます、次回の講義で課題の回答、提出された課題の評価を行います。授業内で課題ページにアクセスするために「スマートフォン」によるQRコードの読み取りが必須となります。スマートフォンを各自用意してください。PCは使用しません。",
        "notices": "本講義は、2年次後期と3年次前期のメディア専門演習「ゲームプロデューシング」、ならびに4年次のゲームコンテンツ系卒業研究を履修する上での基本となる科目です。これらの科目を履修予定の場合は、本講義を履修してください。",
        "preparatoryStudy": "準備学習：予習：ゲームやメディアを通じて提供される受け身のためのエンタティメントが好きな一般の消費者・視聴者ではなく、製作者側になるための知識を習得する目的意識を持ちながら、幅広い分野のゲーム（ボード、カードゲームも含む）をプレイして分析すること。（120分）復習：講義で聴いた内容に当てはまる事例を探したり、好きなゲームを改めて「なぜ好きなのか」「なぜたのしく、おもしろいのか」を分析する視点で見直し、講義内容とともに検証してみる。（120分）",
        "gradingGuidelines": "授業ごとに出題する「課題」に対する回答を授業時間内に提出をすることで成績を評価します。期末試験は行いません。また授業内で行うアンケートへの回答、毎回のクイズへの回答も同時に評価して加点します。課題提出が30％、内容の評価が70％、課題未提出の場合は無評価、（欠席は無評価です）という目安で評価を行います。課題への回答が本講義で採用された場合は、随時加点します。課題に対するフィードバックは、その次の授業で行います。100点満点中60点以上で単位認定とします。（60点に満たなければ単位取得できません。）",
        "textbook": "指定しない授業中に使用する教科書を特に買う必要はありません（「参考書」に書いた書籍から引用した授業を行います。）",
        "referenceMaterials": "「あそびと人間」(ロジェ・カイヨワ)「ファスト＆スロー」（ダニエル・カーネマン）「千の顔を持つ英雄」（ジョーゼフ・キャンベル）「ゲーマーズブレイン」（セリア・ホデント）「メディア学体系２「CGとゲームの技術」、「子どもとあそび―環境建築家の眼（仙田満、岩波新書)」、「誰のためのデザイン？」（D.A.ノーマン）、「シド・フィールドのシナリオ演習」（シド・フィールド）、「あそびのひみつ―指導と理論の新展開」（河崎道夫）など",
        "courseSchedule": "第1回：ガイダンス「ゲームやインタラクティブなエンタティメント」第2回：「マーケットとクリティカルシンキング」（ゲームの歴史、ハードウェアとマーケット）第3回：「宣伝とマーケット」の考察（ゲームマーケットのデモグラフィ、地域文化によるマーケットの嗜好）第4回：「比べるとおもしろい・比較の不思議」（文化比較、宣伝広告費、DAU,MAU）第5回：「ヒトに備わる脳のシステム」（知覚perception、同定identification、認識re-cognition）第6回：「直感と思考」（ゲームのエコシステム、ヒューリスティック）第7回：「動くモノ」（ヒトの習性、制限と緊張）",
        "courseDataUpdatedAt": "2025/01/31"
    },
    "updateAt": "2025/03/21"
}