{
    "lectureCode": "MK07601",
    "courseName": "ゲームデザイン論",
    "lecturer": [
        "安原広和(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "「ゲームデザイン論」では、ゲームデザイン論基礎を踏まえて、ヒトの認知の特徴、これまでのヒトの無意識にしてしまう行動をどのようにゲームの設計やUIの設計に生かすのか？よいインタラクティブコンテンツのデザインはどうあるべきなのか？など、実務経験からの知見と学際的な知識を用いて紐解き、気づかずにしてしまうヒトの行動を分析しながら、「ゲーム」をデザインするために有用なヒトの認知に関する知見を学ます。ヒトの「欲求」、「学習」、「報酬」の関係、「物語」の果たす役割など、自分たちで「あそび」をデザインをするための具体的なデザイン設計方法を学際的に学び、応用していく実践的科目です。",
        "outcomesMeasuredBy": "「ビデオゲーム」を作るための基礎的な認知、学習、報酬の関係、物語の果たす役割、あそびがヒトに及ぼす影響や効果などを学際的に学び、その関係性を有機的に結びつけ、実際の業務を想定しながらゲームデザインに応用する手段を獲得することを目標とします。実際に自分の作りたいゲームを客観的に見る習慣を養い、プレイヤーに飽きさせず、長くあそんでもらうゲームデザインにまとめる設計手法を学びます。それを応用し、自分のアイデアを実際に一つのあそび、ゲームに構築する実践を行うことで、その知見を身につけます。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "動画で多くのゲームや関連参考素材の具体例を見ながらその背景を解説していきます。またインタラクティブなクイズ形式の教材を用いるなど、単なる通読や座学ではない講義を行います。その授業で話した内容についての課題の回答と提出、それに関する授業内での実戦的な課題への評価を行ないます、次回の講義で課題の回答、提出された課題の評価を行います。授業内で「スマートフォン」によるQRコードの読み取りが必須となります。スマートフォンを各自用意してください。ノートPCはmoodleにアクセスするために使用します。",
        "notices": "本講義は、2年次後期と3年次前期のメディア専門演習「ゲームプロデューシング」、ならびに4年次のゲームコンテンツ系卒業研究を履修する上での基本となる科目です。これらの科目を履修予定の場合は、本講義を履修してください。",
        "preparatoryStudy": "準備学習：予習：ゲームやメディアを通じて提供される受け身のためのエンタティメントが好きな一般の消費者・視聴者ではなく、製作者側になるための知識を習得する目的意識を持ちながら、幅広い分野のゲーム（ボード、カードゲームも含む）をプレイして分析すること。（120分）復習：講義で聴いた内容に当てはまる事例を探したり、好きなゲームを改めて「なぜ好きなのか」「なぜたのしく、おもしろいのか」を分析する視点で見直し、講義内容とともに検証してみる。（120分）",
        "gradingGuidelines": "授業ごとに出題する「課題」に対する回答を授業時間内に提出をすることで成績を評価します。また授業内で行うアンケートへの回答、毎回のクイズへの回答も同時に評価して加点します。課題提出が30％、内容の評価が70％、課題未提出の場合は無評価、欠席は言わずもがな無評価、という目安で評価を行います。課題への回答が本講義で採用された場合は、随時加点します。課題に対するフィードバックは、その次の授業で行います。100点満点中60点以上で単位認定とします。（60点に満たなければ単位取得できません。）",
        "textbook": "指定しない授業中に使用する教科書を特に買う必要はありません（「参考書」に書いた書籍から引用した授業を行います。）",
        "referenceMaterials": "「あそびと人間」(ロジェ・カイヨワ)「ファスト＆スロー」（ダニエル・カーネマン）「千の顔を持つ英雄」（ジョーゼフ・キャンベル）「ゲーマーズブレイン」（セリア・ホデント）「メディア学体系２「CGとゲームの技術」、「子どもとあそび―環境建築家の眼（仙田満、岩波新書)」、「誰のためのデザイン？」（D.A.ノーマン）、「シド・フィールドのシナリオ演習」（シド・フィールド）、「あそびのひみつ―指導と理論の新展開」（河崎道夫）など",
        "courseSchedule": "第1回：「制限とご褒美」（成長曲線、緊張の解放）第2回：「学習」（報酬系、学習、ナラティブ）第3回：「貢献と役割」（FixedRatio、VariableRatio、内的報酬、外的報酬、シナリオの円環構造、3幕構成）第4回：「ごっこあそび」（コミュニティへの帰属、通過儀礼、オキシトシン、模倣と進化）第5回：「ルールの成立Ⅰ」（対立のフレーム、シミュレーション、ロールモデル）第6回：「ゲームの成立Ⅱ」（緊張と対立、個の利益、集団の利益、定量化、数量、時間、成否）第7回：「ゲームとあそびの要素」（カイヨワのあそびの要素、「おもしろい」の構造と学習）",
        "courseDataUpdatedAt": "2025/01/31"
    },
    "updateAt": "2025/03/21"
}