{
    "lectureCode": "MK08201",
    "courseName": "視聴覚情報処理の基礎II",
    "lecturer": [
        "永田明徳(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月4"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "研究棟Ａ３０２"
    ],
    "courceDetails": {
        "courseOverview": "本講義では、人の聴覚情報処理のしくみについて学ぶ。とりわけ情報システムとして「脳の仕組み」を捉える考え方を知り、それに基づいて、聴覚独自の特性についての事例を学習する。錯覚などの現象事例だけでなく、生理学的な構成に起因するシステムのモデル化についても学習する。",
        "outcomesMeasuredBy": "すなわち、「聴覚で行われる情報処理や基本的心理特性」について、その生理学的な構成及び、その構成に起因する現象の事例を説明できるようになることを目標とする。具体的には、必要な情報を効率的に伝えるための、人の聴覚系に適合した、「人に優しく」、「効率的な」、情報の表示・伝送・記録システムを構築する際に必要となる基礎知識を身につけることを目標とする。",
        "learningOutcomes": "論理的な思考力問題解決力",
        "teachingMethod": "教科書と配布資料を中心に講義形式で授業を進める。基本的にプロジェクタで資料を投影して行うが、場合により手元のPC画面を活用するので、ノートPCを持参するのが望ましい。",
        "notices": "履修にあたって、事前に習得しておくべき科目は特にありません。",
        "preparatoryStudy": "予習・復習を充分に行うこと。各回の授業配布資料の他に過去年度分の補足資料が授業資料ページの最初にまとめてアップしてあるので、その資料を参考に次回のテーマ内容確認しながら十分予習しておくとよい。なおこの補足資料は通年だった時の過去授業の14回分あるので、全部丹念に読むと14×100分＝1400分程度の分量がある。本授業ではその後半部分が該当する。事前にアップされる授業資料と突き合わせて、必要であれば適宜読むとよい。また、各回のミニテストはその回の理解しなければならない事柄を含むので、回答できなかった場合はその回の講義内容を振り返り、該当部分の教科書や資料を理解できるまで復習することが望ましい（必要であれば授業の振り返りを含め60分程度くらいかかるかもしれない）。また、各回の授業配布資料には授業内で時間的に触れることができない記述もあるので、授業後にきちんと読んで各自理解しておくとよい（参考のURLなどを記述している場合もあり、それらを参照すると30分以上時間を取ることもある）。また授業内で扱った事柄を日常にあてはめ、生活の中で各生理現象を考えながら毎日を過ごすのが望ましい(日々10分程度)",
        "gradingGuidelines": "授業中に実施するミニテスト(3割)と理解度チェックの成績(7割)を勘案し成績評価を行う。毎回のミニテストに関しては基本的に翌週フィードバックを行う。",
        "textbook": "福島邦彦,大串健吾,斎藤秀昭共著「視聴覚情報処理」（森北出版）",
        "referenceMaterials": "岩宮眞一郎著「よくわかる最新音響の基本と仕組み」（秀和システム）近藤、相川、竹島共著「視聴覚メディア」（コロナ社）",
        "courseSchedule": "第1回:聴覚情報処理①音の物理的性質とその構造、耳の構造の話（音の物理的性質、聴覚系の構造と機能）第2回:聴覚情報処理②聴覚の音の高さの知覚（基底膜における周波数分析、聴神経における符号化）第3回:聴覚系の生理学的メカニズムのモデル（二音抑圧、位相固定）第4回:聴覚の基本知覚現象①音の大きさについての知覚（大きさ、高さ）第5回:聴覚の基本知覚現象②音の質についての知覚（音色、協和性、シャープネス）第6回:聴覚の基本知覚現象③音の聞こえ方の話（臨界帯域と聴覚フィルタ、マスキング、両耳による知覚）第7回:後半まとめ理解度チェック",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/09\/13"
}