{
    "lectureCode": "MK09301",
    "courseName": "音楽産業入門",
    "lecturer": [
        "吉岡英樹(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "人類は古くから音楽を奏でていますが、19世紀後半に録音技術が発明され、その後音質の改良を重ねたことにより、20世紀半ばからレコード産業が急速に成長しました。また、その歴史はメディアと深い関係があり、雑誌・ラジオ・テレビ・インターネットとメディアの変遷と共に、音楽ビジネスの状況も変化し続けています。この授業では音楽ビジネスの仕組みについて、実際の事例をもとに解説します。具体的には、音楽産業の構造、レコード会社やプロダクションなど音楽関連企業の役割、著作権や著作隣接権といった音楽制作者の権利、着信音や音楽配信などのコンテンツ配信技術について学びます。授業ではJASRACや日本レコード協会のデータを参照し、日本における音楽市場の現状やユーザーの購買意識を理解します。さらに、音響技術や電子楽器が音楽産業に与えた影響にも触れます。時代の変化をいち早く取り入れてきた音楽産業について知ることにより、これからのコンテンツ産業がどのように発展するか予想する力を身につけます。",
        "outcomesMeasuredBy": "音楽産業における歴史を具体的な事例やデータから学ぶことにより、これからの産業を予測するための実践的な専門能力を修得します。また、音楽産業に関わるデータを分析することにより、論理的な思考力を身につけます。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "スライドや授業動画を利用した講義形式の授業です。授業中にチャットで発言をしてもらい、その内容について議論するなどアクティブラーニング形式で授業を進めます。また、毎回授業内容をしっかり理解したかを確認するために、「授業内課題」に回答してもらいます。簡単なパソコンの操作も行うため各自のノートパソコンを持参して下さい。",
        "notices": "初回授業で実施するガイダンスに必ず参加してください。参加できなかった場合は、授業サイトにアップロードする資料を必ず確認してください。",
        "preparatoryStudy": "音楽産業について、書籍やインターネットで調査しておくと授業内容をより理解することが出来ます。予習(120分)：次の授業内容に該当する教科書のページを読み、分からない用語や内容についてインターネットや書籍で調査を行う。調査した内容はWord等で保存し、授業中に参照する。復習(120分)：配布する授業資料(PDF)を読み、理解していない箇所について改めてインターネットや書籍で調査をし、Word等で保存する。",
        "gradingGuidelines": "授業内での課題(全7回)【100％】で評価し、60点以上を単位認定要件とします。授業内の課題のフィードバックは、次週の冒頭で行います。また、その他音楽産業に関わる質問を受け付け、回答します。",
        "textbook": "大山昌彦、吉岡英樹、伊藤謙一郎著「ミュージックメディア」（コロナ社）",
        "referenceMaterials": "・安藤和宏「よくわかる音楽著作権ビジネス-基礎編」（リットーミュージック）・西内啓「統計が最強の学問である」（ダイヤモンド社）・生明俊雄「ポピュラー音楽は誰が作るのか-音楽産業の政治学」（勁草書房）・津田大介『だれが「音楽」を殺すのか？』翔泳社",
        "courseSchedule": "第1回:音楽産業とは（音楽産業に関わる人、コンテンツ市場、世界の音楽産業市場）第2回:音楽に関わる権利とビジネスの仕組み（音楽産業の構造、音楽著作権、売上分配）第3回:著作権管理事業者の役割と音楽の使用（プラーゲ旋風、著作権管理事業、実演家）第4回:メディア技術の変遷と音楽産業（放送、録音、音楽制作、インターネット）第5回:音楽配信サービスの変遷（ダウンロード、着信メロディー、サブスクリプション）第6回:ライブエンタテインメント（コンサートプロモーター、音楽イベント、ライブビューイング）第7回:音楽産業の将来（シンギュラリティ、デジタルツイン、SDGs）",
        "courseDataUpdatedAt": "2025/01/30"
    },
    "updateAt": "2025/03/21"
}