{
    "lectureCode": "MS01323",
    "courseName": "メディア専門演習I[サイレント・コミュニケーション]3Q",
    "lecturer": [
        "吉岡英樹(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "新生児の約1,000人に1人から2人が、聴覚に何らかの障害を持って生まれてきます。聞こえない、もしくは聞こえにくい子どもは、早期に発見して適切な支援を開始することでコミュニケーションの形成や言語発達の面で大きな効果があります。聴覚障害は先天性（生まれつき）の障害だけでなく、だんだん聞こえなくなる進行性や、突然聞こえなくなる後天性の障害もあります。聴覚障害の原因は、遺伝によるもの、はしかや水ぼうそうなどの感染症、結核などの治療剤による副作用、加齢によるものなどが考えられます。さらに近年では、若者を中心にスマートフォンなどで大音量の音楽を長時間聞く習慣があることから聴覚障害になるケースも増えています。足に障害があり車椅子に乗っていたり、視覚障害があり白杖をついているのとは異なり、聴覚障害は見ただけでは分かりにくいという特徴があります。また、補聴器や人工内耳をして聞こえが改善したとしても、健聴者と同じように聞こえることはありません。2016年4月1日より施行された「障害者差別解消法」により、障害者に不利益がないような社会環境の整備が求められています。東京オリンピックに向けて、東京都では多目的トイレの設置や点字ブロックの設置が進みました。本法律は2024年4月1日に改正され、合理的配慮が全ての事業者に対して義務化されましたが、聴覚障害者に対する必要な配慮がまだ周知されていないため、「聞こえのバリアフリー」はまだあまり進んでいないのが実情です。本演習は、音声に頼らないコミュニケーション手段を体験することにより、聴覚障害に対する理解を深めることを目的とします。吉岡研究室にて独自に開発した音響シミュレーションによる体験コンテンツにより、聞こえなかったり、聞こえにくかったりする状況を擬似体験します。またジェスチャー・指文字・手話など、音声に頼らないコミュニケーション手段を使う体験もします。また、音声をテキストに変換するリアルタイム字幕を使い、文字情報によるコミュニケーションも体験します。これらの体験を通じて聴覚障害への理解が進み、「聞こえのバリアフリー」を促進させる一助となることを期待します。",
        "outcomesMeasuredBy": "本演習の主な到達目標は実学に基づく専門能力と問題解決力を身につけることです。聴覚障害への理解を深める調査や実習を通じて、実学に基づく専門能力を身につけます。また、新しいテクノロジーを活用したソリューションを体験し、メディア技術を活用した問題解決力を身につけます。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・ノートパソコンを使い、情報収集や資料作成を行います。・グループでの手話実習、決められたテーマについてディスカッションするグループワークを行うことがあります。・課題はフォームから提出を行います。・ノートPCを利用するため持参して下さい。",
        "notices": "・聴覚障害に限らずあらゆる障害を持っている学生は、初回授業に必要な配慮について相談をして下さい。",
        "preparatoryStudy": "授業において、聴覚障害に関する用語を使用することがあるため、事前にホームページで伝える用語リストや参考書を予習をしておくこと。予習：次回テーマについてインターネットで調査をお行う等の予習(60分)を行うこと。復習：毎回提供する授業資料(PDF)を見直して復習(60分)する。",
        "gradingGuidelines": "毎回の授業で与える課題（50%）、最終審査（50%）を評価し、100点満点のうち60点以上を単位認定要件とします。なお、提出された課題に対するフィードバックは、次回の授業で行うものとします。",
        "textbook": "特になし。",
        "referenceMaterials": "必要に応じホームページや授業中に紹介する。",
        "courseSchedule": "第1回：音響シミュレーションによる体験、聴覚障害とは第2回：ジェスチャーと指文字によるコミュニケーション体験第3回：手話講座「ジェスチャーと手話の違い、音韻論」第4回：手話講座「CL(Classifier)の理解」第5回：手話講座「手話の読み取り、空間・位置の表現」第6回：手話講座「ロールプレイ」、リアルタイムテキスト体験第7回：最終審査",
        "courseDataUpdatedAt": "2025/01/30"
    },
    "updateAt": "2025/03/21"
}