{
    "lectureCode": "MS02302",
    "courseName": "メディア専門演習II[映像と音楽・音響デザイン]3Q",
    "lecturer": [
        "伊藤謙一郎(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "日常生活で私たちは多種多様な情報を得ています。これは外界からの刺激を感覚器官が捉え、それを電気信号に変換して脳で情報処理されるプロセスを経て行われることです。知覚のおよそ8割が視覚、1割が聴覚と言われており、目の前で起きている事象やその様相の変化、モノの形を見たり、話し声や周囲の音を聞いたりして、その場の状況を意識的・無意識的に把握しています。同時にさまざまな心理的変化も生じますが、その度合いや印象は人によって異なるものでしょう。映画やドラマ、アニメなどの映像作品は、こうした視覚・聴覚の特性を踏まえつつ、作品が目指す表現を実現するためにディテールへの緻密な配慮と工夫が凝らされています。その中でも、付与される「音楽」や「音響」は映像の印象を大きく変える強い働きを持ちます。１つのシーンがサウンドの違いによって意味が変わるばかりでなく、前後のストーリー、ひいては作品そのものの「見え方」に大きく影響します。本演習では、映像とサウンドとの関係を紐解きつつ、互いが融合することで生まれる表現の多様性と可能性を、実習を通して考えていきます。",
        "outcomesMeasuredBy": "課題の映像の特徴を分析的に捉え、自身が意図する表現に即して「音楽」「音響」を付与し、作品として発表・口頭説明できるようになることを目指します。その過程では、作品制作に使用するDAWの基本的な操作方法を習得します。本科目のラーニングアウトカムズの重点項目は「実学に基づく専門能力」「コミュニケーション能力」「論理的な思考力」「分析・評価能力」「問題解決力」ですが、特に「論理的な思考力」「分析・評価能力」を重視します。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "全7回の授業の前半は、講義とディスカッションがメインとなりますj。サウンドに着目して実際の映像作品を視聴し、表現の意図について互いに論じ合います。また、１つのシーンに複数の異なるサウンドを付与し、それぞれの効果や表現の印象の違いを見ていきます。これらのレクチャーを通して、各自が課題映像（数分程度）を多角的に分析する作業に取り組みます。併せて、本演習で使用するDAWの操作方法についても説明します。中盤から後半にかけては、各自の作品制作がメインとなります。課題映像に対して、自身の表現意図を踏まえつつ、必要な箇所に音楽や音響（効果音を含む）を付与します。これらの音楽や音響は、DAWを使って制作してもフリー素材を利用しても構いません。音楽の制作にあたっては、作曲の指導も行います。最終回では、各自がサウンドを付与して完成させた映像作品の発表を行います。それぞれの作品に対して教員や他の学生が講評します。本演習は演習室のPCを使用して作業するのでノートPCは必携ではありませんが、独自に資料の調査・検索、データの収集を行い、情報を保存する場合は持参することを推奨します。",
        "notices": "本演習では、映像にサウンドを付与する作業すべてをDAWで行います。映像専用のソフトウェアは使用しません。演習名に「音楽・音響デザイン」とあるように、サウンドを主体に考え、映像にアプローチするスタンスをとります。映像制作や音楽・音響制作の経験がなくても問題ありませんが、上記の方法で演習を進めていくことから、DAWに関する知識と基本的なスキルがあると良いでしょう。",
        "preparatoryStudy": "さまざまな映像作品を視聴しておくことを推奨します。また、音楽・音響、映像関係の科目を履修しておくと、本演習での作品制作に大いに役立つでしょう。作品制作は、授業内だけでは時間が足りません。空いている時間に演習室を利用するなど、授業時間外での自主的な活動【120分程度】が望まれます。",
        "gradingGuidelines": "各回の課題提出【30％】、制作作品【40％】、作品に関するプレゼン【10％】、作品レポート【20％】で評価し、60点以上を単位認定要件とします。",
        "textbook": "使用しません。",
        "referenceMaterials": "資料を適宜配布します。制作の参考となる映像資料を紹介します。",
        "courseSchedule": "第1回：授業概要説明／DAWの基本操作(1)第2回：ディスカッション(1)／作品構成プラン策定／DAWの基本操作(2)第3回：ディスカッション(2)／音楽・音響制作(1)第4回：ディスカッション(3)／音楽・音響制作(2)第5回：作品制作(1)第6回：作品制作(2)第7回：作品発表と講評／まとめ",
        "courseDataUpdatedAt": "2025/02/27"
    },
    "updateAt": "2025/03/21"
}