{
    "lectureCode": "MS08901",
    "courseName": "ディジタル映像表現基礎論",
    "lecturer": [
        "川島基展(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "本講義は、ＣＧによる映像コンテンツ制作のプロフェッショナルになるために必要な基礎知識を習得することを目的とします。映像制作技術の基本的な原理と、ディジタル映像表現のさまざまな技法を、講義と実習課題による体験を通じて実践的に学習します。メディア学部生にふさわしく、知識と技術の両方をバランスよく身につけることが、本講義のねらいです。多くのテレビ番組、劇場映画、ゲームコンテンツ制作に携わってきた実務経験を踏まえ、各技術が商業作品の中でどのように活用されるかを具体的に解説する実践的科目です。演習授業やサークル活動などでプロのCGクリエイターを目指してトレーニングを積んでいる方にも、これからこの分野に挑戦してみたい、という方にもお勧めです。",
        "outcomesMeasuredBy": "・CGクリエーターになるために必要な基礎知識を習得する・CGクリエーター検定エキスパートに合格するためのポイントを理解する・ソフトウェアを用いた実習を通じて、CGによる映像コンテンツ制作の基礎オペレーションを理解する。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "ＣＧアニメーションやゲームグラフィックスの制作手法は、実写映像制作や、作画、人形を使ったアニメーション、コンピュータによるシミュレーションなど、さまざまな技術・ノウハウの複合体です。本講義では、基本的なＣＧアニメーションの制作手法だけでなく、そのような周辺の技術のほか、次世代の制作手法についても解説します。また、履修者の理解を深めるため、講義中に多くの作品を上映し、そのメイキングを紹介します。ＣＧソフトウェアを用いたアニメーション制作の基礎的な実習を行いますので、ラップトップ必携です。",
        "notices": "事前に修得しておくべき科目は、とくにありません。「これまで演習授業やサークル活動等で映像コンテンツ制作に積極的に取り組んできたが、さらに専門的な知識をしっかり身につけておきたい」という方はもちろん、「映像コンテンツ制作に興味がある」「これからチャレンジしてみたい」という方も歓迎です。講義を聴くだけでなく、実習や課題を通じて、積極的に参加する意欲のある方の履修を期待しています。レポート課題で用いるラップトップは斡旋機で構いませんが、調子の悪い場合は、必ず、OSの再インストールや修理を済ませておいてください。課題が多く、毎回しっかり出席し、すべての課題を提出しないと、単位取得は困難です。ドラマやアニメ、ゲームは好きだけど、自分の将来には無関係だと思っている方には向かない授業です。",
        "preparatoryStudy": "映像コンテンツ制作系の講義やプロジェクト演習を履修していると、本講義の理解がさらに深まります。次の点について予習・復習それぞれ120分程度取り組む必要があります。予習：教科書の該当ページと前回の授業資料、授業ページを確認し、当日の講義に備えること。復習：授業資料および教科書の内容を十分に復習のうえ、ミニレポートに取り組むこと。授業中や授業終了直後にミニレポートを提出した場合、復習が不十分であるとみなします。",
        "gradingGuidelines": "次の項目により、成績を評価します・授業中に提示するミニレポート[各10点]・実習課題[30点]100点満点中60点以上を単位認定要件とし、詳細については履修規定第８条に準拠します。第2回以降の授業中にミニレポート課題の提出内容に応じたフィードバックを行います。",
        "textbook": "ディジタル映像表現－CGによる映像制作－[改訂新版]/公益財団法人画像情報教育振興協会（CG-ARTS協会）上記に加え、独自に作成したテキストを使用します。",
        "referenceMaterials": "授業中に随時、紹介します。新旧問わず、あらゆる映像作品、ゲームコンテンツ等を参考にしてください。",
        "courseSchedule": "第1回:イントロダクション（基礎知識、CG技術の歴史、制作プロセス、制作スタッフの構成・役割）第2回:プリプロダクション（企画立案、設定書・シナリオ作成、映像演出の基礎）～モデリング～第3回:モデリングの基礎（概要、実際、質感設定、マッピング技法）第4回:キャラクタモデリング（キャラクタアニメーションとモデリング、リギング、セットアップ）～アニメーション～第5回:アニメーション（CGアニメーション手法概要、キーフレーム、プロシージャル、サンプリング）第6回:キャラクタアニメーション（キャラクタアニメーション手法概要・実際、フェイシャルアニメーション）第7回:シーン構築（レイアウト、カメラワーク、ライティング、各種映像演出手法）",
        "courseDataUpdatedAt": "2025/01/31"
    },
    "updateAt": "2025/03/21"
}