{
    "lectureCode": "P022928",
    "courseName": "プロジェクト演習III[インタラクティブ・ゲーム制作＜プロデューシング＞]2023年以前入学者",
    "lecturer": [
        "三上浩司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "この演習は，全体を通じてコンピュータを使ったゲームを「作る」ために必要となる工程を理解しそのスキルを実体験を通じて身に付けることを目的としています．チームを形成し企画したゲームを3年後期までに展示会などに出展できるレベルまで完成させることを目的とします．その目的のために，他の演習で学んだ技術を終結させ，チーム一丸となって完成させます．2年次，3年次ではゲーム制作に必要な要素技術ごとに別れ，企画しているゲームの制作が中心となります．その中でもプロデューシングはゲームの分析や企画書の作成手法やプレゼンテーション，制作管理などの基礎技術を学び，「プログラミング」，「グラフィックス」，「サウンド」の履修者と一体となって完成まで導きます．この授業では少人数のチームを結成し，プロトタイプ開発を行います．",
        "outcomesMeasuredBy": "東京ゲームショウへの出展を意識し，ゲームの企画を立案し，ディスカッションを通じて仕様をまとめて，プロトタイプを開発する．アイデアから，企画を経てプロトタイプを作ることで，クリエイティブコンテンツの開発手法を習得する．コミュニケーション能力，論理的な思考力，分析・評価能力，問題解決力などの向上を目標とします．＜本授業のラーニングアウトカム重点項目＞「論理的な思考力」「問題解決力」",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "2年次3年次は主にグループワークにより，自らが企画したゲームを制作します．授業では主に他のグループを巻き込んだディスカッションやプレゼンテーションを多く行い，客観的な視点を強化していきます．※ノートPC必携",
        "notices": "演習時間以外にも多くの準備が必要です．他の履修教科との時間配分に充分留意してください．自ら問題にとりくみ，仕組みを作り出し，工夫をする意欲のある学生を歓迎します．あらかじめ用意されている答えを知りたいタイプの学生には向きません．また基本的に継続して履修することを前提とします．2年次など途中から履修を希望する場合は履修前に相談すること．「インタラクティブ・ゲーム制作」の他のコースや「アニメーション」，「プログラミング」，「サウンド」などの技術を他のプロジェクト演習で習得している場合は履修を許可することがあります．",
        "preparatoryStudy": "自分が制作したい思うゲームに関連するコンテンツはゲームに限らず，必ず分析すること．その際にユーザの視点ではなく，それを自分で作ることを意識して分析してください．（60分程度）授業で得たフィードバックをもとに改善すること（60分程度）",
        "gradingGuidelines": "演習ですので，出席し，同じ時間を共有することが最重要なのは言うまでもありません．その上で，ディスカッション・プレゼンテーションへの積極的な参加（30％），レポート（30％），作品（40％）をもとに評価します．100点中60点以上を単位認定の要件とします．毎回の発表に対して常に教員からのフィードバックがあります．",
        "textbook": "ゲームとCGの技術（コロナ社）",
        "referenceMaterials": "特になし",
        "courseSchedule": "第1回:ガイダンス，前期の発表第2回:3年生春休み成果報告第3回:2年生ペラ企画コンテスト第4回:3年生企画発表・進捗報告・ディスカッション1第5回:3年生企画発表・進捗報告・ディスカッション2第6回:2年生企画発表1第7回:3年生アルファ版発表第8回:3年生OC報告第9回:2年生企画発表2第10回:3年生企画発表・進捗報告・ディスカッション3第11回:2年生企画発表3第12回:3年生ベータ版発表第13回:3年生OC報告報告2第14回:2年生成果発表",
        "courseDataUpdatedAt": "2024\/01\/31"
    },
    "updateAt": "2024\/09\/13"
}