{
    "lectureCode": "P022950",
    "courseName": "プロジェクト演習III[サウンドクリエイター入門]2023年以前入学者",
    "lecturer": [
        "吉岡英樹(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "サウンドクリエイターを目指すには、自らの音楽スタイルを確立し、その音楽を制作する環境を整える必要があります。1970年代、1980年代には、テクノロジーの革新により音楽制作環境が大きく変化し、様々な音楽ジャンルが生まれました。1990年代以降はデジタル化が加速し、音楽制作環境がより小規模になり、安価にもなったことで、個人による音楽制作が進みました。さらに2000年代以降はインターネットの普及により、個人でも世界中に自らの音楽を発信できるようになり、クリエイションからディストリビューションまでを行うことが容易になりました。一方で、サウンドクリエイターが多様化する音楽ジャンルの中で自らの音楽スタイルを確立し、他のクリエイターとの差別化を図ることは容易ではありません。本演習では、自己分析と音楽制作環境の整備を中心に、サウンドクリエイターとして仕事をするための基礎力を修得します。本演習では、特に制作している音楽の方向性について自己分析し、どのような改善が可能か検討し検証します。",
        "outcomesMeasuredBy": "本演習では、音楽の専門家である演習講師との対話により自己分析を行い、自らの音楽スタイルを確立するための論理的な思考力を身につけます。また、自らの音楽スタイルを確立するためには、音楽制作環境を整えたり、新たな音楽と出会ったりすることで、現状の課題を解決する力も必要となります。音楽理論、テクノロジー、音楽文化に関する理解を深め、問題解決力を修得します。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "面談形式により、個別の音楽制作状況に合わせて指導をします。制作した音楽を聞かせてもらったり、制作進行状況の報告をしてもらい、実践的なアドバイスをします。また、指導内容の連携のためノートPCを必須とします。",
        "notices": "・すでに自分で音楽制作をしている学生を対象とします。・音楽制作環境は自分で用意して下さい。",
        "preparatoryStudy": "・音楽制作に関わるプロジェクト演習を受講したり、講義科目の「音楽入門」及び「音楽創作論」を受講することを推奨します。予習：授業の最後に次週の授業内容に関する予習課題を与えます。復習：授業ページで授業資料を共有し、授業終了後に見返して復習してもらいます。",
        "gradingGuidelines": "授業における課題提出と最終課題を40:60の比率で総合成績に反映します。100点満点で60点以上を合格とします。なお、提出された課題に対するフィードバックは、次回の授業で行うものとします。",
        "textbook": "大山昌彦、吉岡英樹、伊藤謙一郎著「ミュージックメディア」（コロナ社）",
        "referenceMaterials": "第1回：プロジェクト説明会、選抜第2回：音楽スタイル分析第3回：音楽制作環境の平面図作成第4回：機材リスト及びソフトウェアリストの作成第5回：音楽制作の目標設定［１］第6回：目標設定［１］の音楽制作第7回：目標設定［１］の評価第8回：音楽制作の目標設定［２］第9回：目標設定［２］の音楽制作第10回：目標設定［２］の評価第11回：音楽制作の目標設定［３］第12回：目標設定［３］の評価第13回：目標設定［３］の音楽制作第14回：最終発表",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/31"
    },
    "updateAt": "2024\/09\/13"
}