{
    "lectureCode": "P0229021",
    "courseName": "プロジェクト演習III[和声]",
    "lecturer": [
        "伊藤謙一郎(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "私たちが普段よく耳にするポップス、ロック、ジャズといった調性音楽のほとんどは、17〜19世紀の西洋音楽（クラシック）にみられる「機能和声」という理論体系をもとにして作られています。この「機能和声」とは調性音楽における＜文法＞であり、素材となる個々の「和音」は＜単語＞に譬えられます。このプロジェクトでは、和声課題の実習を通して「機能和声」を理解することで、作品創作につながるような音楽的感性を高めていきます。［定員］8名程度（※後期の合計人数。継続履修者を含む）［選抜方法］「音程」「音階」を中心とした基礎的な楽典に関する筆記試験を行います。選抜は説明会終了後に実施します。説明会（選抜）の日程は、学内Webページで告知します。",
        "outcomesMeasuredBy": "バス課題・ソプラノ課題に対し、適切な和音の配置・連結とともに、音楽的な観点からの思考を通して個々の音を吟味できるスキルの習得を目標とします。また、和声課題の実習を通して、実際の楽曲での和声の用法について理解できるようになることを目指します。本科目のラーニングアウトカムズの重点項目は「実学に基づく専門能力」「コミュニケーション能力」「論理的な思考力」「分析・評価能力」「問題解決力」ですが、特に「実学に基づく専門能力」「論理的な思考力」を重視します。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "少人数のグループ・レッスン、または個人レッスンの形態で、各自が実施した和声課題を添削します。また、希望により随時、創作作品のアドヴァイスも行います。ノートPCは使用しません。",
        "notices": "選抜試験（楽典）の合格者のみ履修を認めます。和声課題の実施には多くの時間と労力を必要とするので、高度な作曲技術を身につけるために理論からしっかり学ぶ意志のある人のみ履修を考えてください。遅刻や欠席、課題を実施してこないなど、真剣に取り組む姿勢が見られない場合は指導を中止し単位不認定とするので、その点を念頭に置いて受講してください。",
        "preparatoryStudy": "各回のレッスンに向けての和声課題の実施［予習］、およびレッスン後の添削内容の確認［復習］が不可欠です【60分程度】。レッスン後は、添削を受けた和声課題をそのままにするのではなく、自身の実施とレッスンで示された実施例を必ず比較し、可能であればピアノ等で弾奏して、耳からその違いを感じ取ることが大切です。このような復習を通して留意すべき点を把握した上で、次の和声課題に取り組んでください。",
        "gradingGuidelines": "毎回のレッスンに向けて実施した和声課題の内容（適切な和音設定と声部進行、音楽的な観点からのさまざまな配慮など）【70％】と課題実施の進度【30％】で評価し、60点以上を単位認定要件とします。期末試験は実施しません。履修者へのフィードバックは、実施した和声課題の添削によって行います。",
        "textbook": "伊藤謙一郎、柳田憲一著「改訂新版学生のための和声の要点第１巻」（サーベル社）",
        "referenceMaterials": "・島岡譲ほか著「和声理論と実習I」（音楽之友社）・島岡譲ほか著「和声理論と実習II」（音楽之友社）・島岡譲ほか著「総合和声実技・分析・原理」（音楽之友社）",
        "courseSchedule": "第1回：選抜試験（※「授業概要」を参照のこと）第2回：借用和音(1)v度Vの和音［基・1転］第3回：借用和音(2)v度Vの和音［2転・3転］第4回：借用和音(3)その他の副Vの和音第5回：借用和音(4)準固有和音第6回：根音省略形第7回：V9の和音第8回：副V9の和音(1)第9回：副V9の和音(2)第10回：II7の和音第11回：転位音第12回：転位音を含むソプラノ課題（借用和音を含まず）の実施第13回：転位音を含むソプラノ課題（借用和音を含む）の実施(1)第14回：転位音を含むソプラノ課題（借用和音を含む）の実施(2)",
        "courseDataUpdatedAt": "2024\/07\/22"
    },
    "updateAt": "2024\/09\/13"
}