{
    "lectureCode": "P023221",
    "courseName": "プロジェクト演習VI[TikTok動画制作による地域メディアデザイン]2023年以前入学者",
    "lecturer": [
        "千種康民(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "2016年に登場した15秒から60秒のショートムービーを共有するSNSであるTikTokは2022年末には15億人を超えていると予想され、YouTubeに並ぶ動画SNSとなっている。また2018年にiPhone7を使用して撮影したソダーバーグ監督の「狂気の真実」というホラー映画が話題になった。スマートフォンを使用して高品質の映画制作もできる時代の到来である。そこで本プロジェクト演習では、TikTokに投稿するコンテンツ制作技術を学修する。併せて、テーマについては国連が2015年に定めたSDGs(SustainableDevelopmentGoals、持続可能な開発目標)の目標11「住み続けられるまちづくりを」を題材とする。これにより地域創生・地域活性化分野において世界中でも注目されているTikTokをプラットフォームとした事例研究を通じた自分自身が制作する地域活性化に貢献するショートムービー制作法について学修していく。メディア学部のディプロマポリシーにおいて記載されている「メディア学部の教育理念・教育目標である生活や社会を豊かにする情報・コンテンツの創出及びそれらを人から人に正しく円滑に伝達するディジタル技術の創造・活用に貢献できる人材の育成」の具体的な課題設定として本プロジェクト演習を位置づける。",
        "outcomesMeasuredBy": "本プロジェクト演習は、地域社会に赴き、該当テーマにおけるステークホルダーたちとのコミュニケーションを通じて地域課題の様々な状況について問題意識を養成し、課題解決案を策定するとともに、動画コンテンツの制作における企画から完成までの制作過程を横断的に学ぶとともに、それらの成果を地方創生に活かす。また、課題理解のために、地域社会における該当テーマのステークホルダーたちとのコミュニケーションをはかるとともに、実際のグループワークにおいて各自の担当を担いながら建設的な意見交換により、よりよいコンテンツ制作に貢献する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ノートPC必携とする。毎回、トピック的な小テーマを与え、そのテーマに対して、事例調査および企画案の発表を実施していく。",
        "notices": "授業では積極的に参加し発言すること。また、フィールドワークに行くことがある。",
        "preparatoryStudy": "普段から多種多様な地域貢献系の動画の事例に興味を持つこと。予習・復習あわせて60分程度が必要である。",
        "gradingGuidelines": "個人課題（50点）、自由課題（50点）の合計により成績評価を行なう。また演習に対する積極的な取り組み態度（最大20点）を勘案して成績に加点評価をする。100点満点中、合計60点以上を合格とする。課題にはその都度コメントすることによってフィードバックを行う。",
        "textbook": "なし。",
        "referenceMaterials": "『映像制作入門』（ナカニシヤ出版）鈴木誠一郎、喜多千草2009",
        "courseSchedule": "第1回：オリエンテーションとSDGs各自の興味・関心のヒアリングなど第2回：撮影基礎基礎技術について過去の名作およびYoutubeを題材に基本的な技法を学ぶ[カット割り、構図、レンズ、照明]第3回：撮影演習リハーサルも含め学んだ基本的技法を実際の撮影に取り入れる第4回：撮影事例発表撮影した内容の報告会第5回：編集基礎映像編集アプリケーションの基本的な使い方を学ぶ第6回：編集演習簡単な映像編集への挑戦第7回：編集事例発表編集して完成させた動画の報告会第8回：企画発表課題テーマに基づいた映像の企画書作成と発表第9回：企画撮影各自の考えた企画の発表・講評第10回：企画編集企画撮影事例発表課題制作開始各自企画の映像化に向けての作業第11回：自由企画リハーサル途中経過の発表を通して企画をより良いモノにしていく第12回：自由企画撮影企画編集事例発表課題制作完了最終発表のための映像制作第13回：自由企画編集第14回：最終発表自由企画の事例発表と講評",
        "courseDataUpdatedAt": "2024/01/30"
    },
    "updateAt": "2024/12/13"
}