{
    "lectureCode": "P0230391",
    "courseName": "プロジェクト演習IV[サーバー構築・管理(後期)]",
    "lecturer": [
        "寺澤卓也(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "インターネットが発達し、クラウドサービスが普及した現代では、インターネット上の各種のサービスがどのようにして構築されているのかが分かりにくくなっている。しかし、このような時にこそ基本的なサーバ技術を身に着けておくことが重要である。このテーマではPCサーバとネットワークの基本を学び、サービスの構築法を体験的に習得するのが目的である。また、応用として、各種サービスの運用・管理をできるようにする。特にLinuxの利用法について学ぶ。",
        "outcomesMeasuredBy": "この演習の到達目標は、以下のとおりである。・コンピュータの仕組みとサーバの役割を理解すること・ネットワークの基本的な仕組みを理解すること・Linuxの利用法を習得すること・サーバの設計と構築ができるようになること・サーバの運用・管理の基礎技術を習得すること・仮想化技術を理解し、仮想サーバ環境を構築できること",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "技術の習得では、すべて自分で実際に実行してみることが重要である。この演習では各個人でPCを組み立て、OSをインストールして必要な能力を持つサーバ機を構築する。PC機材のほかに、各自のノートPCを主要なツールとして使用するので必ず持参すること。毎回の演習は、基本的な技術や操作方法の講義の後、それに基づき各回に設定されている課題に取り組むスタイルとなる。",
        "notices": "この演習では、仕組みを理解し、それを確かめる作業を通して得た知識をもとに、応用作業に取り組むことになるので、集中してよく考えること。また、トラブルシューティングは格好の演習材料である。解決できるまで粘り強く取り組む姿勢が大切である。基本事項と手順、調べ方の解説のほかは、細かいことは教えない。各自が調べ、考えて進めることを期待しているので、趣旨をよく理解して履修すること。1年次後期での履修は内容的に困難が想定される。希望する場合は、担当教員によく相談すること。「インターネットシステム入門」の内容の復習をしておくこと。各自のノートPCを使用するので、不調の場合は修復しておくこと。Linuxに関する知識があることが望ましいが必須ではない。",
        "preparatoryStudy": "授業時間外にも作業を行うことになるため、授業時間中に生じた疑問や不都合は時間内に解消すること。そのため、あらかじめ、利用する外部サービスについてWeb上の情報等も用いて予習しておくこと（30分程度）。演習はそれまでの内容を理解していることを前提に進めるので、不明な点は必ず復習し、解消しておくこと（30分程度）。",
        "gradingGuidelines": "毎回の課題の達成度や演習への取り組み姿勢、演習への貢献度などにより総合的に評価する。数回のレポートを含む課題の達成度が70％、その他の項目が30％の割合を占め、合計100点満点に換算した際に60点以上を合格とする。",
        "textbook": "授業資料（Moodleで公開）のみ",
        "referenceMaterials": "Linux関連書籍サーバ関連書籍",
        "courseSchedule": "第1回:コンピュータ概論・OS概論と現代PCの基礎知識第2回:PCを組み立てる第3回:Linuxのインストール第4回:Linuxの基本的な使い方第5回:IPv4ネットワークの基礎-サブネット構築演習（机上演習）第6回:PCルータの構築第7回:サーバ構築（1）Webサーバ第8回:サーバ構築（2）DNSサーバ第9回:サーバ構築（3）メールサーバ第10回:サーバ構築（4）ファイルサーバ第11回:ログ解析と最終課題についてのプレゼンテーション第12回:仮想化（1）第13回:仮想化（2）第14回:最終課題（各自の任意のサーバ構築）",
        "courseDataUpdatedAt": "2025/02/20"
    },
    "updateAt": "2025/03/21"
}