{
    "lectureCode": "P023437",
    "courseName": "プロジェクト演習VIII[クリエイティブ・アプリケーション]",
    "lecturer": [
        "戀津魁(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "メディア学は現代社会における諸課題の解決のため幅広い分野を結びつけ、前進する力へ変えていくかを模索する学問です。たとえばネットワーク社会は通信技術だけでは成り立ちません。通信と他分野の専門性がメディアによって結びつき我々の生活の基盤となっています。現代社会では主たる専門技術の習得に加え他分野と連携できる造詣が望まれています。特に生産に携わる専門技術と他分野の連携を得意とするメディア学の修得は大きな強みとなります。これを踏まえ本演習では2つのテーマを取り扱います。まず分野を連携するメディア学の有意性を知るため、メディア史を紐解き議論を通してメディアの理解を深めます。メディア史はすなわち人類の分野交流と試行錯誤の記録です。生産に携わる歴史上の専門家や表現者の試行錯誤を辿り現代にも通底する生産のための優れた感性を獲得します。これを踏まえメディア学の知見を生産技術で活かす訓練を行います。特にソフトウェア開発に注目しiOSApp開発に導入します。プログラムを作るだけでなく他分野との連携を思索しメディア性を併せ持つApp開発と実現・社会実装を目指します。演習講師は渡邉賢悟が担当します。二年後期は特に基礎的な科目と専門的な科目の交差を意識しながらキーワードの理解をします。",
        "outcomesMeasuredBy": "メディア学の基礎知識の習得、その実践として視覚プログラミングの基礎,ロジック構築の習得、Appの開発と社会実装を目指します。習得した知識と技術を自己表現や目標実現に応用する俯瞰的な観察力、論理的な思考力、判断力を育成します。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "メディア学講座と開発演習を2コマ開講します。いずれか一方の受講も可能ですが併せての受講を推奨します。・メディア学講座メディア学を修めるために有益な知識の広げ方とつなげ方、継続性のある能動的な学び方をメディア史の知識習得を通じて触れていきます。Wikiを通した知識情報の記録と共有、議論の進め方・意見の採り入れなどを実践します。・開発演習初学者はSwiftPlaygroundBooks教材を通して視覚プログラミングに導入します。同時に視覚情報のメディア性について考察し、より良いソフトウェア表現を模索します。次にその発展としてメディア性を備えたソフトウェア開発に挑戦し、有益なソフトウェアの社会実装を目指します。特にiPhone/iPad/macでの開発を推進します。",
        "notices": "本演習では修士1年次程度の内容を学部１年生から3年生向けに行います。毎週の授業についての不明点や理解が難しい点などを整理し受講の効果を自主的に高めるよう努めてください。必要に合わせて講師に質問、相談して補ってください。",
        "preparatoryStudy": "回が進むごとに過去の回の演習内容を前提とする内容が増えるため、復習するようにしてください。（60分程度）",
        "gradingGuidelines": "期末のWikiレポート【50％】と開発物の提出【25％】、演習内議論への参加【25％】で評価し、60点以上を単位認定要件とする。Wikiレポートの講評でフィードバックします。",
        "textbook": "なし。演習内で必要な資料を提示します。",
        "referenceMaterials": "初期不要。随時、演習内で紹介します。",
        "courseSchedule": "第1回：CreativeApplicationとは*第2回：メディア実装の基礎1:自分の思考を形にする「ノート」第3回：メディア実装の基礎2:主格の交差と相互作用「メッセージング」第4回：メディア実装の基礎3:交流で加速する表現「コミュニティ」第5回：メディア実装の基礎4:記録して継ぐ「アーカイブ」第6回：メディア実装の勘所1:知覚の連携「マルチモーダル・メディウム」第7回：メディア実装の勘所2:存在と現象「ヴァーチャル。リアリティ」第8回：メディア実装の勘所3:折衷と合一「マルチメジャー・メディウム」第9回：メディア実装の勘所4:美を溶かす「ビューティフル・エヴォケーション」第10回：メディア実装の勘所5:長く在る「メディア・インフラストラクチャ」第11回：メディア実装の実践1:メディア場–交流・企画・設計第12回：メディア実装の実践2:メディア表現–試行・検証・研磨第13回：メディア実装の実践3:メディア創発–開花・継承・浸透第14回：CreativeApplication総論",
        "courseDataUpdatedAt": "2025/03/03"
    },
    "updateAt": "2025/03/21"
}