{
    "lectureCode": "P023231",
    "courseName": "プロジェクト演習VI[インタラクティブ・ゲーム制作＜グラフィックス＞]2023年以前入学者",
    "lecturer": [
        "川島基展(メディア学部メディア学科)",
        "三上浩司(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "3年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本演習では、3～5名のグループに分かれてゲームビジュアルの制作を行います。将来、ゲーム制作におけるビジュアルアーツ、テクニカルアーツ関連の仕事につきたいと考えている人のためのプロジェクトです。ビジュアルアーティスト、テクニカルアーティストは人気職種で競争が激しいため、本演習は継続履修により多くの時間をかけてスキルアップを図ることができるようになっています。本演習では、集大成としてセミプロレベルのシェーディングをはじめとするテクニカルアートスキルについて学びます。",
        "outcomesMeasuredBy": "・プロのゲームクリエイター、とくにビジュアルアーティスト、テクニカルアーティストになるための制作スキルを身につける",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業では、ハンズオン形式でゲームビジュアル制作の基礎知識とソフトウェアの使用方法を学びます。授業では、世界的に評価の高いUnrealEngineやAutodeskMayaなどのプロフェッショナルツールを活用し、魅力のあるゲームビジュアルを制作するスキルを身に着けることができます。グループワークは原則として授業の空き時間や放課後など、各自のスケジュールで授業時間外に進めます。教室のPCを使いますので、ノートPCの持参は必須ではありません。",
        "notices": "CGの制作やゲーム開発の経験は問いません。興味と強い熱意があれば、どなたでも参加可能です。",
        "preparatoryStudy": "ゲームコンテンツや劇場映画などにおける優れた映像表現に興味を持ち、いろいろな作品の表現方法を分析してみてください。毎回の授業に際しては、次の通り予習・復習を合わせて60分程度行ったうえでグループワーク・制作課題に取り組むものとします。予習：グループワーク・制作課題の取り組みにつき、作業報告と今後の計画について報告するための準備を行う。復習：授業の内容を十分に復習のうえ、作品制作に役立てるためのノートを作成する。また、ソフトウェアのオペレーションについて反復練習を行う。",
        "gradingGuidelines": "次の項目により、成績を評価します。・企画書・設定書の完成度：20点・作品の完成度：50点・授業態度・グループワークへの貢献度：30点総合点60点以上かつ，期限までに、企画書・仕様書どおりに作品を提出することが、単位認定の最低要件になります。",
        "textbook": "独自に作成したテキストを使用します。",
        "referenceMaterials": "新旧問わず、あらゆるゲームコンテンツ、映像作品等を参考にしてください。",
        "courseSchedule": "第1回:オリエンテーション、チーム編成第2回:UnrealEngineでのトゥーンシェーディング①ノンフォトリアリスティックレンダリングの基礎理論第3回:UnrealEngineでのトゥーンシェーディング②トゥーンシェーディングの実装第4回:シェーディングテクニック構造色マテリアルの実装①SurfaceShaderでの構造色の実装第5回:シェーディングテクニック構造色マテリアルの実装②FragmentShaderでの構造色の実装第6回:Niagaraによるビジュアルエフェクト表現③Houdini-Niagara連携第7回:Niagaraによるビジュアルエフェクト表現④TexthreSheetsを用いたリアリスティックマテリアル表現第8回:ファジー理論を用いたAI表現①ファジー理論の基礎第9回:ファジー理論を用いたAI表現②ファジー理論の実装基本フレームワークの実装第10回:ファジー理論を用いたAI表現③ファジー理論の実装ビヘイビアの実装第11回:インベントリシステム①スケーラブルなUI設計の基礎第12回:インベントリシステム②インベントリの実装第13回:マスタリング・パフォーマンス・チューニング第14回:グループワーク作品の制作指導",
        "courseDataUpdatedAt": "2025/01/07"
    },
    "updateAt": "2025/03/21"
}