{
    "lectureCode": "P023170",
    "courseName": "プロジェクト演習Ｖ[就活に活かす自分史とESの書き方]2023年以前入学者",
    "lecturer": [
        "千種康民(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "3年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "就活において準備する皆さんのガクチカはどんな感じでしょうか。就活やインターンシップの入口において最重要なのは、完成された良いエントリーシート(ES)ではなく、それを構築するまでに実施した充実し入念な反復を伴うプロセスである。メディア学部生の自分史には様々なユニークな経歴があるにもかかわらず、実際の就活におけるエントリーシート(ES)や自己PR文・志望動機文などの就活用ドキュメントには反映されておらず貧弱である。一番の問題は、過去の「成果」～「現状」に至る就活用ドキュメントが一つの美しいシナリオを形成してなく、訴求力が極めて弱く、就活で苦戦することになる。これに対して、このプロジェクト演習は、中学高校以降の各自の学年ごとのキーワードを抽出した自分史キーワード表を作成し、その自分史キーワード表から自分史を作成する。その際に積極的にChatAIを活用し、活用のパターンも併せて学ぶ。そして、それらを様々な就活用ドキュメントにブレイクダウンしていく方法論を学修し、これらの成果物をインターンシップおよび就活に活用できるドキュメントとして活用していく。",
        "outcomesMeasuredBy": "本プロジェクト演習は、就活を成功に導くために重要なガクチカをはじめとした自分史\/ESの執筆とその完成を踏まえた模擬面接のロールプレイの２本立てである。通常のキャリア教育ではいったん作成したものはそのまま使用し続けることが多いが、この演習では、随時、ロールプレイで上手く対応できなかった部分を分析し、内容に不足がある場合は充実させ、表現に問題がある場合には表現を自分で普段説明できる表現に修正するという手順を繰り返すことにより全体の完成度を高めながら、それを自分史\/ESにも模擬面接にも反映させて改善していくという手法を実施する。またロールプレイの面接官役を担うことにより実際の面接時に就活生としてでなく、客観的に就活生としての自分自身を客観的に俯瞰することができるようになり、極めて有益である。さらに、模擬面接後に、グループワークとして、どこをどうすればよりよくなるか、という視点に立ってアドバイスしたり、指摘を受けることにより、学生間のレベルの底上げに役立て、建設的な意見交換になり、よりよいコミュニケーション法を学修していく。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ノートPC必携とする。全体14コマを序盤4週、中盤前3週、中盤後7週、と3分割して、それぞれ、序盤では自分史作文、中盤ではES作文、終盤では模擬面接とその結果を反映した自分史\/ESの追加修正、と実践的なドキュメンテーションと面接技法を学んでいく。作文の時間は授業時間外にも必要な場合がある。授業内では、成果物としてのドキュメントを共有して意見交換を中心に行っていく。実際に、良いコミュニケーションを実現するには、自己PRにおける自分史あるいはESを自分の言葉で説明することからスタートする。また就活でされる質問は典型的な10パターンが全体の90％程度を占めている。この条件を設定して、面接官と就活生の役割に分けてロールプレイを実施し、就活や実践的なコミュニケーションスキルを養成する。",
        "notices": "授業では積極的に参加し発言すること。",
        "preparatoryStudy": "毎回、授業中のフィードバックしたドキュメント内容について加筆修正を行ない、次回の授業前までに準備を行なうこと。予習・復習あわせて60分程度が必要である。",
        "gradingGuidelines": "個人ワーク（50点）、模擬面接ワーク（50点）の合計により成績評価を行なう。また演習に対する積極的な取り組み態度（最大20点）を勘案して成績に加点評価をする。100点満点中、合計60点以上を合格とする。課題にはその都度コメントすることによってフィードバックを行う。毎回、事前準備したドキュメント内容について、授業中に多様な視点からフィードバックを行なうことにより、より優れたESとして仕上げていく。",
        "textbook": "なし。",
        "referenceMaterials": "第1回:ガイダンスと自分史第2回:自分史キーワード抽出（大学入学～現在まで）第3回:自分史キーワード抽出（高校およびそれ以前）第4回:ChatAIを活用した自分史作文とエピソードの追加第5回:対象企業の設定とキーワード抽出第6回:対象企業のキーワード群と自分史キーワードのマッチング第7回:志望動機文の作成第8回:ChatAIを活用した想定質問の提示と回答内容第9回:ロールプレイによる模擬面接１第10回:ロールプレイによる模擬面接２第11回:ロールプレイの反省とESの修正第12回:ロールプレイによる模擬面接３第13回:ロールプレイによる模擬面接４第14回:まとめと振り返り",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/09\/13"
}