{
    "lectureCode": "P023214",
    "courseName": "プロジェクト演習VI[オリジナルCGアニメーション制作]2023年以前入学者",
    "lecturer": [
        "川島基展(メディア学部メディア学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "3年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本演習では、３～５名のチームを編成し、オリジナル企画のCGアニメーション作品の制作を行います。将来、CGクリエイター関連の仕事につきたいと考えている方のためのプロジェクトです。本演習では、CGアニメーションの企画立案、映像演出、CGの基礎技術、モデリング、アニメーションなどのプロの制作現場における各種技法を学ぶとともに、AutodeskMAYAなどのプロフェッショナルソフトウェアのオペレーションを学習します。単に技術を学ぶだけでなく、グループワークによって実際に独自のCGアニメーション作品制作を目標とします。本演習を履修することにより、CGアニメーション制作の基礎知識を習得するとともに、作品制作スキルを身に付けることができます。本演習では、はじめてCGアニメーション制作に取り組むか、基礎学習の継続を希望する方向けに初歩レベルのポストプロダクションスキルを学びます。",
        "outcomesMeasuredBy": "CGアニメーション制作技術の基礎を習得し、自身のCGクリエーターとしての適性を確認します。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業ではアニメーション制作の基礎知識とソフトウェアのオペレーション技法を学びます。グループワークは原則として授業の空き時間や放課後など、各自のスケジュールで授業時間外に進めます。教室のPCを使いますので、ノートPCの持参は必須ではありません。",
        "notices": "CGの制作経験は問いません。興味と熱意があればどなたでも参加可能です。",
        "preparatoryStudy": "事前に修得しておくべき科目は、とくにありません。意識して優れたアニメーション作品やゲームコンテンツを多く視聴・プレイしておくと、本演習の理解がさらに深まります。毎回の授業に際しては、次の通り予習・復習を合わせて60分程度行ったうえでグループワーク・制作課題に取り組むものとします。予習：グループワーク・制作課題の取り組みにつき、作業報告と今後の計画について報告するための準備を行う。復習：授業の内容を十分に復習のうえ、作品制作に役立てるためのノートを作成する。また、ソフトウェアのオペレーションについて反復練習を行う。",
        "gradingGuidelines": "次の項目により、成績を評価します。・企画書・設定書の完成度：20点・作品の完成度：50点・授業態度・グループワークへの貢献度：30点総合点60点以上かつ，期限までに、企画書・仕様書どおりに作品を提出することが、単位認定の最低要件になります。",
        "textbook": "独自に作成したテキストを使用します。",
        "referenceMaterials": "新旧問わず、あらゆる映像作品、ゲームコンテンツ等を参考にしてください。",
        "courseSchedule": "第1回:演習概要の説明、制作チーム編成、映像制作入門第2回:企画立案について、AutodeskMayaの基本オペレーション第3回:映像演出の基本、モデリング入門（プロップのラフ）第4回:モデリング入門（プロップのディテール）第5回:シェーディング、マッピング第6回:モデリング入門（キャラクタの頭部）第7回:モデリング入門（キャラクタモデル完成）第8回:キーフレームアニメーション第9回:キャラクタセットアップ第10回:キャラクタアニメーション第11回:フェイシャルアニメーション第12回:ライティング第13回:シーン構築・レンダリング第14回:映像編集",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/09\/13"
}