{
    "lectureCode": "R1070",
    "courseName": "科学論[デザイン]",
    "lecturer": [
        "詫間直樹(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水4"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１０１４教室"
    ],
    "courceDetails": {
        "courseOverview": "◆授業のねらい今日、科学と技術は融合しており、「科学技術」という複合体として認識されている。それだけではなく、その「科学技術」がさらに社会と相互作用を行っている。本授業では、そのような「科学技術」と社会との相互作用を論理的に理解する能力を養うことを目指す。そのために有用な概念や枠組をいくつか提供するので、それらに習熟してもらい、社会における科学技術を様々な観点から理解できるようになることを目指す。◆全体的内容：科学技術のアウトプットは社会に多大な（正負両面の）影響を与える。逆に、科学技術の側も社会の制約を受ける。つまり、科学技術と社会は相互に影響しながらお互いを形成していくと捉えることができる。従って、たとえ将来科学者やエンジニアの職に就く場合であっても、科学技術と社会の相互作用を理解する能力が必須となる。本授業では、教科書（平川秀幸『科学は誰のものか』）の講読を通じて、こうした相互作用を論理的に理解するために有用な諸概念と、それらの具体例への適用の仕方を学ぶ。",
        "outcomesMeasuredBy": "１．科学技術が社会と相互作用しながら発達する様子を、様々な概念や枠組を用いて論理的に理解する。２．上述の概念や枠組を具体的事例に適用できるようになる。３．科学技術の振る舞い方は社会的条件（国・地域の違い、政治・経済・文化の違いなど）によって異なってくることを理解し、国際的な観点を身につける。なお、１．と２．はラーニングアウトカム「論理的な思考力」に関連し、３．はラーニングアウトカム「国際的な教養」に関連する。",
        "learningOutcomes": "国際的な教養論理的な思考力",
        "teachingMethod": "科学技術社会論の様々な重要概念がコンパクトにまとめられている優れたテキスト：平川秀幸『科学は誰のものか―社会の側から問い直す』（NHK出版生活人新書，2010年）をベースに、重要概念と関連事例の解説を行う。解説は主にPowerPointを用いて行う。毎回の授業後、リアクションペーパーをMoodleの課題機能を使って提出してもらう。その日の授業で扱ったトピックの中から一つを選んで、それに対するごく簡単な考察を行ってもらう。また、中間レポートでは、環境管理型権力の事例とユニバーサルデザインの事例を身の回りで探してもらうという、ちょっとしたフィールドワークを行ってもらう。",
        "notices": "配慮が必要な特別な事情がある場合は、早めに担当者まで申し出てください。",
        "preparatoryStudy": "予習・復習を十分に行うこと。教科書の該当箇所を事前に読んでおくこと。",
        "gradingGuidelines": "講義参加（リアクションペーパー等）（30%）。中間レポート（20%）。期末試験（50%）。（なお、リアクションペーパーや中間レポートに対するフィードバックは講義内に行う。）",
        "textbook": "平川秀幸『科学は誰のものか―社会の側から問い直す』NHK出版生活人新書(電子書籍)(2010年)。（参考価格：Kindle版税込価格628円）。※紙媒体の新品書籍は品切れですので、有隣堂での教科書販売等で購入することはできません。紙媒体の中古本を購入したい人は、古本屋やネット通販などで購入してください。",
        "referenceMaterials": "第1回:ガイダンス（講義目的、授業の進め方など）およびイントロダクション（「科学」「技術」「社会」の相互関係）第2回:教科書第２章「『統治』から『ガバナンス』へ」を学ぶ（その１）（科学技術ガバナンスの登場、ほか）第3回:第２章「『統治』から『ガバナンス』へ」を学ぶ（その２）（参加型テクノロジーアセスメントの誕生、ほか）第4回:第２章「『統治』から『ガバナンス』へ」を学ぶ（その３）（BSE問題が引き起こした「信頼の危機」、ほか）第5回:第２章「『統治』から『ガバナンス』へ」を学ぶ（その４）（「公共空間」で議論する、ほか）第6回:第３章「科学は『完全無欠』か」を学ぶ（その１）（「地震予知は困難」と認めた学者たち、ほか）第7回:第３章「科学は『完全無欠』か」を学ぶ（その２）（実験室の科学はまだ「途半ば」、ほか）第8回:第３章「科学は『完全無欠』か」を学ぶ（その３）（それでも残る科学の不確実性、ほか）第9回:第３章「科学は『完全無欠』か」を学ぶ（その４）（「理想化」による不確実性、ほか）第10回:第４章「科学技術と社会のディープな関係」を学ぶ（その１）（「共生成」という捉え方、ほか）第11回:第４章「科学技術と社会のディープな関係」を学ぶ（その２）（人工物に埋め込まれた政治性、ほか）第12回:第４章「科学技術と社会のディープな関係」を学ぶ（その３）（作動条件の不適合、ほか）第13回:第４章「科学技術と社会のディープな関係」を学ぶ（その４）（構造的問題としての市場の力、ほか）第14回:第６章「知ることと、つながること」を学ぶ（知的協働のアクション・チャート、ほか）第15回:まとめ",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/15"
    },
    "updateAt": "2024\/09\/13"
}