{
    "lectureCode": "R1180",
    "courseName": "物理の世界[デザイン]",
    "lecturer": [
        "須田拓馬(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１０１４教室"
    ],
    "courceDetails": {
        "courseOverview": "物理学は自然科学の中で最も基本的な学問の一つであり，自然界のあらゆる現象を理解する上で重要な役割を果たす。本講義では，物理学の基礎である力学を中心に、その応用である天文学について学ぶ。天文学は宇宙現象を解明する学問であると同時に、人類の宇宙に対する認識を広げ自己を見つめ直すきっかけをつくることのできる学問でもある。この授業を通じて、(1)天文学の発展の歴史を理解し、宇宙と人類との関わりについて説明できる、(2)身近な宇宙の現象について科学的に説明できる、(3)授業終了後も天文学や自然科学に関するニュースに興味を持ち続ける、ことを目指す。",
        "outcomesMeasuredBy": "1.人類がどのようにして自然現象を理解してきたのかについて理解し、適切な言葉を用いて文章としてまとめることができる。2.宇宙という対象を記述するのと同様に、物事を単純化あるいは細分化する視点を身に付ける。その際、自身の専門分野において求められる能力へと応用する視点を持つ。",
        "learningOutcomes": "国際的な教養論理的な思考力",
        "teachingMethod": "地球や月、太陽系といった小さいスケールから星、銀河、宇宙といったより大きなスケールについて現在の天文学・宇宙物理学の理解の最前線について概観する。また、宇宙に関する疑問や話題を取り上げ、科学的な視点から解説する。内容の理解のために、初歩的な数学や物理学の基礎的な概念について説明する。動画などを駆使して、分かりやすく幅広い知識が身につくような内容を目指すとともに、簡単な実験を行い科学的発見を体験する。ノートPCは使用しないが、授業資料は授業前にダウンロードできる。毎回質問を受け付け、次回の授業時間内に回答することでフィードバックを行う。第15回：総まとめおよびレポート作成の練習では、レポート作成のヒントとなるような例を示したり、レポート作成の練習を行う。",
        "notices": "本授業では特に物理学の基礎知識等は要求せず、計算演習を行うこともないが、ただ漫然と講義を聴くだけでなく、授業内容について質問をしたり、時間外学習をしたりするなど主体的に授業に参加することが望ましい。",
        "preparatoryStudy": "予習：天文学に関連するニュースにアンテナを張っておき、発表された内容について簡単な文章としてまとめておく(120分)。復習：講義で扱った内容について理解を深めるため、資料を調べたり、文章としてまとめておく(120分)。その他：天文学に関係した市民向け講演での聴講や天文関連のイベントへの参加を推奨する。",
        "gradingGuidelines": "各回の確認テスト（20%）、実験演習（20%）、レポート（60%）で評価する。準備学習のその他で示した活動を時間外学習として認めた場合に成績評価に加点する。",
        "textbook": "使用しない。",
        "referenceMaterials": "1.宇宙のダークエネルギー-「未知なる力」の謎を解く、土居守・松原隆彦著（光文社新書）2.宇宙は何でできているのか素粒子物理学で解く宇宙の謎、村山斉（幻冬舎）3.宇宙の果てまで–すばる大望遠鏡プロジェクト20年の軌跡、小平桂一（早川書房）",
        "courseSchedule": "第1回：ガイダンス・天文学概論-人類の宇宙観、さまざまな天体と天体現象、科学と非科学の境界第2回：物体の運動の初歩-運動の法則、ケプラーの法則、重力第3回：重力-教室での実験で宇宙の距離を測定する第4回：月・惑星・太陽系-さまざまな惑星、太陽系惑星の定義第5回：太陽と彗星-太陽系小天体、太陽フレア、人類滅亡の可能性、太陽系外惑星-太陽系外惑星発見の歴史第6回：アストロバイオロジー（宇宙生物学）-地球外生命体、地球外文明探査第7回：恒星の進化-星の誕生とその一生、元素の工場としての恒星第8回：恒星の進化-星の誕生とその一生、暗い太陽のパラドックス第9回：恒星の最後と宇宙の物質循環-星の一生の最後と超新星爆発、宇宙で最初に誕生した星第10回：ブラックホール-ブラックホールとは何か、ブラックホールを見る第11回：銀河の姿-より遠くの宇宙の姿、銀河宇宙論、ダークマター第12回：大規模シミュレーション天文学、宇宙の観測-光・赤外線で見る宇宙第13回：膨張する宇宙-宇宙の進化、宇宙の歴史とその終わり第14回：宇宙の始まりと宇宙の謎-様々な宇宙モデル、なぜ人類は宇宙に存在するのか？第15回：総まとめおよびレポート作成の練習",
        "courseDataUpdatedAt": "2024\/01\/29"
    },
    "updateAt": "2024\/09\/13"
}