{
    "lectureCode": "R2090",
    "courseName": "社会連携実習I",
    "lecturer": [
        "酒百宏一(デザイン学部デザイン学科)",
        "中島敏博(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "実習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１１１１教室"
    ],
    "courceDetails": {
        "courseOverview": "社会連携実習は、講義によって社会参加や社会貢献することの意義を理解し、市民活動に参加する体験を通じて理解を深める授業です。私たちが暮らす社会には様々な課題があり、課題解決に向けた市民自治による取り組みがあります。授業を通じて、地域にともに暮らす一市民であることに気づき、解決が難しい課題への取り組み方について参加しながら考える機会を提供します。授業ではグループワークによるPBL（ProjectBasedLearning）を取り入れます。受講生同士で考えや体験を言語化することで、難しい社会課題を他者に伝えるための自分の言葉を身に付けます。自分の言葉を身に付けることで、他者と協働して社会課題に取り組む力を養います。この授業では社会人基礎力の根幹となる自分の思いを伝え、協働するためのコミュニケーション能力を磨くことができます。受講後には実学主義を体現するように、所属する専門知識や技術を実践する現場の幅を広げられることを期待します。",
        "outcomesMeasuredBy": "1.地域における実際の社会貢献活動を通じて、他者との協働性、他者のニーズの把握、コミュニケーションスキルを身につける「コミュニケーション能力」2.ボランティアの意義や社会におけるその構成と活動、市民性についての知識を習得し、社会課題について考察する「論理的な思考力」3.地域課題に対する社会貢献活動への参加とふり返りを通して、課題の改善についての見通しを考える「問題解決力」4.社会貢献・ボランティアという考えに対する価値観を考察し、社会の一員となる重要性について考えをまとめる",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "社会連携実習を履修する学生は第1週の授業ガイダンスに出席し、授業の流れについて確認することが必要です。この授業では座学講義と地域貢献・社会貢献活動への参加で構成されます。座学講義は地域社会の状況や地域貢献・社会貢献活動の意義、地域で出会う多様な人たちと向き合う姿勢やチームで協働することへの理解を深めます。座学講義は社会連携実習Ⅱ（3年次開講）と共同運営し、地域貢献活動・社会貢献活動は社会連携実習Ⅱ受講生が主導するプロジェクトに参与して、情報を収集した上で、活動や体験について考察し、仲間とともにディスカッションして自分なりの思考を深め、発表・レポートとして成果をまとめる力を養います。",
        "notices": "〇この授業は年間集中科目として変則的な日程で開催します。〇履修希望者は必ず第1週のガイダンスに出席すること。〇調査や視察など配属グループの活動への参加は原則必須とする。（証明のある病欠、公共交通機関が発行する遅延届のある遅刻、教員が認める特例は免除する。）講義に関する遅刻・欠席も、同様の書類等を必要とする。〇地域社会で体験・活動する上で求められること：•地域社会には多様な人がいて、価値観も多様であることを学ぶ•地域社会での活動において、状況に応じた行動をとる対応力を身につける•地域社会での活動と学習により社会への認識を深める〇調査や活動については「受け入れていただく」意識を持ち、協力いただける方々への感謝と敬意を忘れないこと。",
        "preparatoryStudy": "〔予習〕講義をふまえつつ、参加する活動テーマについてあらかじめ調べておくこと。（60分）〔復習〕体験をふまえ、ふり返りの簡易的なメモを取り、レポートを作成に備える。（30分）",
        "gradingGuidelines": "成績評価の比率：〇グループ活動への貢献度40％〇講義への積極的な参加0％〇最終レポート20％〇最終発表（スライド・パネル作成）30％合計得点で60%以上を獲得した者を合格とする。フィードバックは講義内で随時行う。※十分な活動参加がない場合は不合格とする。",
        "textbook": "指定しない。",
        "referenceMaterials": "本授業では特定の教科書を使用しません。ただし、授業内容の理解を深め、自習・予習・復習に役立つ地域社会や市民活動に関する文献やウェブサイトを活用することを推奨します。また授業内で適宜、教員が関連する文献や記事、ウェブリンクを紹介します。これらを活用して、自身の興味に応じたリサーチを行ってください。また実際に地域の市民活動に参加することや自身が住む地域や関心のある課題について情報収集を行うと学びが一層深まります。",
        "courseSchedule": "教室で講義実施する場合は水曜日5限を基本とします。各自で活動する、最終成果物の作成などは変則的な日程となります。日程は状況に応じて変更される可能性があります。〇第1回前期1週目ガイダンス（中島・酒百）〇第2回前期3週目ボランティアとは（中島・酒百）〇第3回前期8週目コミュニケーション・ワーク（中島・酒百）大田区のイメージでワーク実施〇第4回前期10週目テーマ学習（中島・酒百）※大田区参加予定〇第5回前期12週目テーマ学習（中島・酒百）〇第6回7月上旬大田区担当課を訪問して意見交換（各自で調整し、受け入れ先の指示に従うこと）〇第7回前期14週目中間報告に向けた状況整理・調査法（酒百）〇第8回8-9月中地域活動に参加あるいは調査（各自計画に従い活動）〇第9回8月下旬中間報告（中島・酒百）※大田区参加〇第10回後期1週目大田区の総合計画を使ったワーク（中島・酒百）〇第11回0月中地域活動に参加あるいは調査（各自計画に従い活動）〇第12回1月中大田区担当課との意見交換（各自で調整し、受け入れ先の指示に従うこと）〇第13回後期13週目成果物作成および発表に向けた準備（中島・酒百）〇第14回月下旬発表準備（午後3～5限で活動見込）（中島・酒百）〇第15回月下旬活動成果発表※大田区参加（中島・酒百）",
        "courseDataUpdatedAt": "2025/03/16"
    },
    "updateAt": "2025/03/21"
}