{
    "lectureCode": "R2090",
    "courseName": "キャリアデザインIII［デザイン］",
    "lecturer": [
        "篠山雅美(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "本授業は、前期「キャリアデザインⅡ」で学んだ学修成果をもとに、社会人基礎力の3つの能力「チームで働く力」「考え抜く力」「前に踏み出す力」を確立するとともに、就職対策のための実践的な講義、演習を取り入れながらきたるべき将来の自分をイメージしてゆく授業です。具体的には、PBL(問題解決型学習)を通じて学びを深めるとともに、キャリア形成の一環として自身の社会人基礎力における強み・弱みを確認し、将来を見据えた上で改善・行動化できる目標を立てます。授業ごとのテーマにレクチャーとグループワークを基本として、学生自らの主体的な学び（アクティブラーニング）を促します。",
        "outcomesMeasuredBy": "「キャリアデザインⅡ」に引き続き、講義・演習を通じて社会人としての基礎力を身につけることが大きな目標となります。以下にあるキャリア形成プロセスを通じて、能動的に問題を発見、解決に導くことを到達目標にします。・講義、演習を通じて個々の進路に方向性を見つけること・社会人基礎力となる論理的な思考能力、コミュニケーション能力、分析・評価能力、問題解決力、及び、発表する力を高めること・デザイン学部の学生として、学びにより得られる強みを知ること",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業ごとのテーマに対してのレクチャーとグループワークを基本として、学生自らの主体的な学び（アクティブラーニング）を促します。また、就職活動の準備を意識しながら進めていきます。企画書作成やプレゼンテーションは個人単位で実施しますが、準備段階で学生同士でグループディスカッションを複数回実施し、考察を深めながら自身の企画内容やプレゼンテーションの精度を高めます。授業の最後に、毎回、リアクションペーパーの提出があります。詳細は、毎回Moodleに掲載します。",
        "notices": "キャリアデザインとは就職活動が最終的な目的ではなく、卒業後の進路について考える授業です。そのために具体的に考えていくことが社会人の基礎となります。授業内容をよく理解して十分に復習を行ってください。社会人基礎としての科目であるので、受講のマナーを守り、特に遅刻をしないようにしてください。宿題は、次回授業の他学生とのグループディスカッションに直接関わる内容になるため、必ず行ってください。授業の詳細については、毎回事前にMoodleで確認してください。",
        "preparatoryStudy": "普段から新聞、ニュースサイト、雑誌、書籍などで情報を取得したり、学生同士で話し合う機会を意識して持つように心がけてください。その上で、授業ごとのテーマに対して、積極的に準備して臨み、授業後には授業の内容を振り返り、次回の予習も含めて準備学修を行ってください。",
        "gradingGuidelines": "期末テストは行わず、以下の内容と割合をふまえ、総合評価を行います。(1)授業の態度（各授業終了時に提出するリアクションペーパーの内容、受講態度）（50%）(2)2つの課題による提出物（50%）なお、単位認定要件は60点以上とします。最終授業で全体に対するフィードバックを行います。",
        "textbook": "なし。必要に応じて資料を配付します。授業資料は、適宜、Moodleにも掲載します。",
        "referenceMaterials": "必要に応じて資料を配付します。",
        "courseSchedule": "第1回：オリエンテーション（授業の目的と進め方）第2回：チームで働く力Ⅰ（PBL・PDCA･グループディスカッション）第3回：考え抜く力Ⅰ（情報収集、企業研究をする）第4回：考え抜く力Ⅱ（課題発見力を養う）第5回：考え抜く力Ⅲ（創造力を養う）第6回：考え抜く力Ⅳ（計画力を養う①）第7回：考え抜く力Ⅴ（計画力を養う②）（課題①企画立案書レポート）第8回：チームで働く力Ⅱ（発信力・プレゼンテーション力を養う）第9回：チームで働く力Ⅲ（チーム内で発表し、自身を振り返る）第10回：前に踏み出す力Ⅰ（自分について知る）第11回：前に踏み出す力Ⅱ（キャリアデザインシートを作成する）第12回：前に踏み出す力Ⅲ（行動計画レポートを作成する）第13回：前に踏み出す力Ⅳ（目標を宣言する）（課題②行動計画レポート）第14回:ビジネスマナーについて第15回：まとめ\/就職アンケート",
        "courseDataUpdatedAt": "2024\/02\/04"
    },
    "updateAt": "2024\/09\/13"
}