{
    "lectureCode": "R3030",
    "courseName": "キャリアデザインIV[デザイン]",
    "lecturer": [
        "野条美貴(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "「キャリアデザインⅣ」は、デザイン学部での学びをもとに、自分の卒業後の進路について考え、就職活動をするための基本的な知識とスキルの修得を目指す授業です。２年次の「キャリアデザインⅡ・Ⅲ」で学修した動機付けに加え、自己分析と企業研究、業界研究での理解がベースとなります。学部での学びを就職活動の強みに繋げ、一人一人にとって進路・就職活動に結びつけていく実践的な講義と、演習を通して学修する授業です。",
        "outcomesMeasuredBy": "・社会人として必要なコミュニケーション能力を高めるとともに、就職活動で実際に役立つ基本的な知識を修得し、面接対策、履歴書作成のための実学に基づく専門能力を身につける。・希望する業界の中で具体的な企業の現状を知り、ターゲットを明確に把握することを通じて分析・評価能力を高める。・インターンシップのための企業選びと、エントリーのための方法を修得する。・レポート作成や各研究をもとに、自身の進路選択を通じて、論理的な思考能力、問題解決力を高める。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "この授業は就職特任講師、講義内容に応じて専門の講師が授業を担当、講義と演習などを必要に応じて実施します。授業の最後に、毎回、リアクションペーパーの提出があります。詳細は、毎回Moodleに掲載します。",
        "notices": "キャリアデザインとは、就職活動・内定が最終的な目標ではなく、卒業後の進路について考える必修授業です。授業に臨むにあたり、どのような準備が必要となるのか予習テーマを自ら考えていくことが大切です。授業の詳細については、事前にMoodleで確認してください。",
        "preparatoryStudy": "２年次の「キャリアデザインⅡ・Ⅲ」の授業内容を復習するようにしてください。予習：授業までに新聞やインターネット等の情報を客観的に把握し、社会、経済、環境情勢の理解に努めること。復習：自己のキャリアビジョンに基づき、事前に自主的な進路就職対策も本科目と合わせて行ってください。",
        "gradingGuidelines": "期末テストは行わず、以下の内容と割合をふまえ、総合評価を行います。(1)授業の態度（各授業終了時に提出するリアクションペーパーの内容、受講態度）（50%）(2)履歴書添削提出1回、模試試験2種の受検(50%)なお、単位認定要件は60点以上とします。最終授業で全体に対するフィードバックを行います。",
        "textbook": "必要に応じて授業時にプリントを配布します。授業資料は、適宜、Moodleにも掲載します。",
        "referenceMaterials": "必要に応じて授業時にプリントを配布します。",
        "courseSchedule": "第１回：オリエンテーション学部の学びを就職活動に生かすには（野条）第２回：就職活動の基本姿勢と働くこととは（マナー）（外部講師）第３回：インターンシップ対策Ⅰ（選び方\/就活サイト登録）（外部講師）第４回：自己分析Ⅰ適性を考える（外部講師）第５回：企業での働き方とデザインの可能性を考える（外部講師）第６回：キャリアガイドブック、TUT就職NAVI活用（キャリアサポートセンター）第７回：インターンシップにおける筆記試験とマナーを知る（野条）第８回：履歴書作成のポイントを押さえる（外部講師）第９回：履歴書（志望動機）の核を作る（課題①添削用履歴書提出）（外部講師）第10回：6つの力と社会人基礎力（野条）第11回：自己分析Ⅱ経験の棚卸（篠山講師）第12回：自己分析Ⅲエントリシートの書き方（篠山講師）第13回：SPI3模擬試験（課題②模試受検）（外部講師）第14回：一般常識模擬試験（課題③模試受検）（外部講師）第15回：まとめ「キャリアデザインⅤ」に向けて（野条）",
        "courseDataUpdatedAt": "2024\/02\/04"
    },
    "updateAt": "2024\/09\/13"
}