{
    "lectureCode": "R3040",
    "courseName": "キャリアデザインV[デザイン]",
    "lecturer": [
        "野条美貴(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "「キャリアデザインⅤ」は、６つの「学部が目指すデザインの力」をベースに、デザイン学部独自のキャリアデザインファイル作成を通して３年間の学びを振り返り、企業・業界研究、先にある卒業後の進路について考えます。また具体的な就職活動の準備として、適性検査試験や一般常識試験などの対策や、履歴書の作成、エントリーシートの記入について復習を行うことで、本格的な進路・就職活動につながる知識と高いスキルの修得を目指します。",
        "outcomesMeasuredBy": "就職活動に必要となる知識を理解するとともに、適性検査試験や一般常識試験の対策のためのスキルを身につけ、以下を目標とします。・社会人として必要なコミュニケーション能力を高めるとともに、就職活動で実際に役立つ基本的な知識を修得し、面接対策、履歴書作成のための実学に基づく専門能力を身につける。・希望する業界の中で具体的な企業の現状を知り、ターゲットを明確に把握することを通じて分析・評価能力を高める。・企業選びとエントリーのための方法を修得する。・レポート作成や各研究をもとに、自身の進路選択を通じて、論理的な思考能力、問題解決力を高める。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業はデザイン学部就職委員会と連携して就職特任講師が担当します。また講義内容に応じて専門講師が授業を担当します。授業種別では講義と演習を必要に応じて実施します。授業の最後に、毎回、リアクションペーパーの提出があります。詳細は、毎回Moodleに掲載します。",
        "notices": "キャリアデザインとは就職活動が目的ではなく卒業後の進路について自分自身で考え、具体的な準備を行うための大切な授業です。そのため講義での知識の習得とともに実際の演習によるスキルの修得と課題の作成が必要となり、授業のための準備と復習を十分に行うことを習慣にするよう努めてください。授業の詳細については、事前にMoodleで確認してください。",
        "preparatoryStudy": "前期「キャリアデザインⅣ」の授業内容を復習するようにしてください。予習：授業までに新聞やインターネット等の情報を客観的に把握し、社会、経済、環境情勢の理解に努めること。復習：自己のキャリアビジョンに基づき、事前に自主的な進路就職対策も本科目と合わせて行ってください。",
        "gradingGuidelines": "期末テストは行わず、以下の内容と割合をふまえ、総合評価を行います。(1)授業の態度（各授業終了時に提出するリアクションペーパーの内容、受講態度）（50%）(2)添削用エントリーシート提出・キャリアデザインファイル提出(50%)なお単位認定要件は６０点以上とします。最終授業で全体に対するフィードバックを行います。",
        "textbook": "必要に応じて授業内でプリントを配布します。授業資料は、適宜、Moodleにも掲載します。",
        "referenceMaterials": "必要に応じて授業内でプリントを配布します。",
        "courseSchedule": "第1回:オリエンテーション(野条)第2回:GPSアカデミック受検（野条・学務課）第3回:GPSアカデミック振り返り（外部講師）第4回:キャリアデザインファイルⅠ（野条）第5回:キャリアデザインファイルⅡ（野条）第6回:キャリアデザインファイルⅢ（野条）第7回:就職筆記試験・WEBテスト対策（外部講師）第8回:履歴書対策（外部講師）第9回:エントリーシート対策（課題①添削用エントリーシート提出）（外部講師）第10回:仕事理解Ⅰ仕事を知る（課題②キャリアデザインファイル提出）第11回:就職活動における面接対策（篠山講師）第12回:就職活動のための模擬面接（篠山講師）第13回:仕事理解Ⅱ業界・企業を知る第14回:仕事理解Ⅲデザイン学部先輩からのアドバイス第15回:まとめ\/就職アンケート",
        "courseDataUpdatedAt": "2024\/02\/04"
    },
    "updateAt": "2024\/09\/13"
}