{
    "lectureCode": "S1050",
    "courseName": "立体表現の基礎",
    "lecturer": [
        "酒井正(デザイン学部デザイン学科)",
        "未定(所属なし)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "ものや空間をデザインするにあたって、素材についての知識、経験は必要不可欠である。様々な素材についての認識を深め、また素材とデザインの密接な関係性を理解することで、生活空間に存在する様々なモノや場所の見方が複眼的になり、発想力や表現力の幅も広がる。本講義では素材についての特性や加工法などを知り認識を深めること、そして素材とデザインの関係を意識した演習課題を通して、デザイン全般に必要な立体表現力、空間表現力、デザインに関する問題解決力を養う。さらに大学での課題制作やデザイン提案時に必要となるプロトタイプや模型、モックアップ製作時に必要となる素材についての情報や加工方法もレクチャーする。",
        "outcomesMeasuredBy": "各種造形素材について幅広く知識を得ること。それらを踏まえ、論理的な思考力をベースに素材の特性を活かしたデザインを提案することにより、素材とデザインの関係性を理解して、実学に基づく専門能力の基礎を身につけることを目標とする。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "スライドと映像を取り入れた講義が主体となる。テーマ毎にレポートや演習課題を課す。",
        "notices": "立体デザイン・空間デザインに興味・関心を持っていること。※この授業科目は工業・空間デザイン系のデザインワークに関連する内容であり、２年次系選択に関する重要科目である。",
        "preparatoryStudy": "Moodleの授業ページや毎回講義内で準備学習方法について指示する。それ以外に日常生活で「目にする」「触れる」様々なモノや空間の素材に考察する習慣を身につけておくこと。",
        "gradingGuidelines": "レポート50％、演習課題25％、授業への取り組み25%、以上により総合的に評価し、60%以上を単位認定要件とする。",
        "textbook": "毎回授業内容に沿った資料を配布する。",
        "referenceMaterials": "授業内で提示する。",
        "courseSchedule": "第1回：ガイダンス講義内容、ねらい、スケジュールについて説明（酒井・長尾）第2回：「立体表現とは」立体表現特有のモノの見方、考え方についてのレクチャー（長尾）第3回：「立体デザインの仕事の現場」などの映像を用いて仕事の現場を紹介（長尾）第4回：素材の特性を生かしたデザイン製品の解説を椅子を題材とし行う（長尾）第5回：「木材1」木材の特性や使用用途、表現方法の解説（長尾）第6回：「木材2」木材の加工技術の参考例を挙げ解説（長尾）第7回：「演習課題１木材の特性を生かした製品のデザイン提案を行う」（長尾）第8回：「金属1」（長尾）第9回：「金属2」（長尾）第10回：「演習課題２金属の特性を生かした製品のデザイン提案を行う」（長尾）第11回：「陶磁器-セラミック」（長尾）第12回：「樹脂（プラスチック）」（酒井）第13回：「模型・プロトタイプ・モックアップ制作時の素材と加工方法」（酒井）第14回：「光-照明」（長尾）第15回：まとめ、レポートについて（酒井・長尾）※上記内容は変更する場合がある。Moodleの授業ページを確認すること。",
        "courseDataUpdatedAt": "2025/03/18"
    },
    "updateAt": "2025/03/21"
}