{
    "lectureCode": "S2010",
    "courseName": "デザイン史",
    "lecturer": [
        "暮沢剛巳(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１０１４教室"
    ],
    "courceDetails": {
        "courseOverview": "別名を「応用美術」（appliedart）とも言うように、デザインは美術の一種であるが、鑑賞のみを目的とした絵画や彫刻とは異なり、何らかの実用性を有している点に大きな特徴がある。この授業はデザインの歴史全般を広く紹介し、受講者に基礎的な知識を身につけてもらうことを目的としているが、その目的を実現するために、美術史的観点と社会史的観点の双方からデザイン史へとアプローチしていく。内容としては近代(19世紀)以降の時代を対象に、前半では海外の、後半では日本のデザインを取り上げ、それぞれ時代順に重要な動向や作品を多くの画像を通じて紹介する。扱う対象はデザイン領域全般にわたるが、近年のデザインに関しては、デザイン学部のコースを踏まえて、視覚伝達デザイン、視覚情報デザイン、工業ものづくりデザイン、空間演出デザインといった観点を重視する予定である。",
        "outcomesMeasuredBy": "デザイン史は、国際的な活躍が期待される人材が身に付けるべき基礎的な教養である。この授業では、その修得や文章課題を通じて論理的な思考力、分析・評価能力や問題解決力の向上を目指していく。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力分析・評価能力問題解決力",
        "teachingMethod": "画像や動画で多くのデザインを紹介し、それについて解説していく。最初は海外のデザイン、次いで日本のデザインという順番で進めていく。進行はいずれも時代順。内容の一部は同じ教員が担当する美術史と重複することが予想される。一方通行の講義にならないように、授業中に随時質問する予定。対面形式を基本とするが、状況次第で遠隔形式となる場合もある。",
        "notices": "授業開始前に出席登録を行うこと。また授業終了後、指定された時間までにフィードバックに回答すること。この2つが揃って出席とみなされる。",
        "preparatoryStudy": "事前に教科書や参考書などに目を通し、デザイン史の流れをつかんでおくこと。ウェブサイトを活用してもよい。開講期間中に首都圏で開催される重要な展覧会は授業中に紹介するのでぜひ見ておくこと。",
        "gradingGuidelines": "学期末にレポートを課す。レポート課題や提出にあたっての留意点は授業の中で指示する。教場試験は行わない。成績判定の目安は平時の取り組み60％、レポート40％の予定。",
        "textbook": "暮沢剛巳＋伊藤潤＋山本政幸＋天内大樹＋高橋裕行『カラー版図説デザインの歴史』（学芸出版社）",
        "referenceMaterials": "森山明子ほか『日本デザイン史』（美術出版社）『図鑑デザイン全史』（東京書籍）その他、授業中に指示する。",
        "courseSchedule": "第1回：ガイダンスデザイン史とは何か第2回：近代デザインの源流アーツ・アンド・クラフツ運動ほか第3回：19世紀末のデザインアール・ヌーヴォーの時代第4回：20世紀初頭のデザインドイツ工作連盟やウィーン工房など第5回：20世紀前半のデザイン（１）アール・デコなど第6回：20世紀前半のデザイン（２）バウハウスとデ・ステイル第7回：20世紀前半のデザイン（３）モダニズムから統制へ第8回：第2次世界大戦後のデザイン（１）ミッドセンチュリー第9回：第2次世界大戦後のデザイン（２）ポストモダンとその前後第10回：第2次世界大戦後のデザイン（３）現代のデザイン第11回：近代日本のデザイン（１）明治～大正時代第12回：近代日本のデザイン（２）第2次世界大戦まで第13回：近代日本のデザイン（３）高度成長期から軽薄短小の時代へ第14回：近代日本のデザイン（４）現代のデザイン第15回：まとめSDGsのデザイン",
        "courseDataUpdatedAt": "2024\/03\/10"
    },
    "updateAt": "2024\/09\/13"
}