{
    "lectureCode": "S2040",
    "courseName": "感性演習I（伝える）[クラス共通]",
    "lecturer": [
        "早瀬交宣(デザイン学部デザイン学科)",
        "田邉雄一(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3",
        "月4",
        "月5",
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "デザイン学部デザイン学科視覚デザイン専攻",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "３１３０１デザイン演習室１",
        "３１３１５デザイン演習室４"
    ],
    "courceDetails": {
        "courseOverview": "私たちの日常生活の中で、視覚から受け取る刺激や情報は、大きな役割を果たしている。人は、目に映る図像からイメージ（情緒、雰囲気、趣、世界観など）や情報を受けとる。優しい、楽しい、悲しい、寂しい、美しいなどといった感情を抱いたり、温かさ、冷たさ、粗さ、滑らさといった質感も視覚からも受け取ることがある。さらに、受け取ったイメージや情報が、憧れ、希望、誇りといった目に見えない価値に昇華されたり、判りやすさや使いやすさを叶え、社会で機能性や安全性を高める役割を果たすことにも繋がっている。そのような、視覚を刺激することで心理的にまたは物理的に伝える表現を的確に作り出せるようになるためには、視覚的な表現の基本要素である、色、形、構成、質感についてよく理解し、的確に組み合わせられるようになることが、重要である。「感性演習Ⅰ（伝える）」と「感性演習Ⅱ（伝える）」を通じて、これらの諸要素ごとに、リサーチと分析を行い、課題を通じてデザインの分野でどのように使われるのか考察する。リアルなサイズ感や質感といったオンラインでは理解しづらいことを、実際に経験して理解するために、手作業による制作を主とした課題を出題する。この授業は視覚伝達デザイン、視覚情報デザインの両コースに共通する視覚デザインの基礎として位置付けている。２年次後期に開講される各コースの「専門演習I」に向けて、「感性演習Ⅰ（伝える）」と「感性演習Ⅱ（伝える）」の全課題に取り組み、到達目標を達成してほしい。",
        "outcomesMeasuredBy": "(1)視覚表現の基礎要素である、色、形、構成、質感の４要素のうち、質感、色、形について理解する。(2)リサーチと分析を行い、課題を通じてデザインの分野でどのように使われるのか考察する。（分析・評価能力を養う）(3)自分の制作物の内省し、改善案を見出せるようになる。（問題解決力を身につける）(4)講評会での発表、グループ講評において他者の制作物を的確に分析し伝え合うなど、コミュニケーション能力を養う。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "実際に手を動かした制作が中心になるので、1年次で使用した画材や道具類は用意しておくこと。インターネットでの情報検索、課題によっては制作などに用いるためノートPCは必携とする。制作過程において必要に応じて検討会を行い、作品についてのフィードバックを行う。",
        "notices": "授業開始１週間前にMoodleを公開する。初回授業の教室や準備するものを記載するため、授業開始の数日前には必ず確認すること。課題は授業時間で作品制作を行うが、制作にかかる時間は個々の表現したい内容やスキルによるので、時間外での制作も考慮しておく。学外でフィールドワークを行う場合は、移動に公共交通機関を使う。",
        "preparatoryStudy": "授業で制作が進められるように、課題内容に応じて事前に情報収集をすること。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①発想段階【20%】（調査内容、コンセプト、G：ディスカッションの参加）②制作段階【20%】（試作等の表現に至る過程、計画的な作業進行、G：作業の参加）③結果段階【40%】（提出期限、作業密度、相手への意識）④プレゼンテーション段階【20%】（わかりやすさ、伝え方、G：発表の参加）※Gはグループワーク",
        "textbook": "必要に応じて演習内で資料を配布する。",
        "referenceMaterials": "演習内で参考作品や参考資料を紹介する。",
        "courseSchedule": "第1回：ガイダンス\/導入課題（全教員）第2回：Texture(1)リサーチ（全教員）第3回：Texture(2)制作（全教員）第4回：Texture(3)制作（全教員）第5回：Texture(4)制作（全教員）第6回：発表会（全教員）第7回：Color(1)課題説明\/エクササイズ\/リサーチの準備（全教員）第8回：Color(2)リサーチ\/学外でのフィールドワーク（全教員）第9回：Color(3)制作（全教員）第10回：発表会（全教員）第11回：Form（1）：課題説明\/制作1（全教員）第12回：Form（2）：制作2（全教員）第13回：Form（3）：制作3（全教員）第14回：発表・講評（全教員）第15回：課題のまとめ（全教員）＊授業の進行は状況をみて調整する可能性がある。",
        "courseDataUpdatedAt": "2024\/03\/10"
    },
    "updateAt": "2024\/09\/13"
}