{
    "lectureCode": "S2130",
    "courseName": "視覚デザイン論",
    "lecturer": [
        "松本章(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "この授業では、人と人との効果的なコミュニケーションを計画するための視覚デザインのあり方について学びます。対象とする領域は幅広く、文字・記号といったコミュニケーションエレメントから、広告などの印刷媒体やCM映像、さらには製品デザインなどを身近な暮らしや社会的な視点から取り上げます。過去から現在までのデザインの様々な事例や出来事を通して、その役割や責任などについて深く考察し、専門的な立場から思考・提案する力を養います。",
        "outcomesMeasuredBy": "視覚デザインの社会的な役割や人に及ぼす心理的な作用などについて、多角的で広い視野から考える習慣を身につけます。身の周りのさまざまなモノやコトが、それぞれ独自の背景や意味をもつことに気づき、自ら発見・考察する力を修得します。本学の3ポリシーで定める6つの能力のうち「国際的な教養」「実学に基づく専門能力」「論理的な思考力」「分析・評価能力」「問題解決力」の向上を目指します。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "Powerpointを用いた講義が中心となりますが、簡単な演習やクイズ、アンケート調査などアクティブラーニング的なワークを取り入れながらより深い理解につなげます。毎回、授業の要旨をまとめたプリントを配布しますので、それをノート替わりに使用してください。なお、授業においてはノートPCの使用を強制するものではありません。",
        "notices": "毎回の授業後に回収する「講義についての感想・意見」は、その一部を履修者相互の意見共有として講義の中で活用することがありますが、同時に授業への出席と参加状況の確認でもあります。授業づくりへの協力という意味でも、ひとりひとりの主体的・建設的な参加を求めます。",
        "preparatoryStudy": "暮らしの中で心に引っかかったデザイン、関心をもった物事などに日々意識を向け、分析的に観察するように心がけてください。予習・復習に関しては、シラバスで各回の講義テーマを事前に確認しておいてください（予習）。授業後は講義で取り上げたデザイン事例や重要語句などについて調べ、理解を深めるようにしてください（復習）。",
        "gradingGuidelines": "授業後に回収する「講義についての感想・意見」（70％）、学期末レポート（30％）をもって評価します。",
        "textbook": "指定しない。",
        "referenceMaterials": "必要に応じて講義内容に関連する書籍を紹介します。",
        "courseSchedule": "第1回：オリエンテーション「コミュニケーションデザインと想像力」第2回：暮らしの中のデザイン-1「日常の観察と気づき」第3回：暮らしの中のデザイン-2「イメージとかたち」第4回：暮らしの中のデザイン-3「デザインと心理効果」第5回：暮らしの中のデザイン-4「伝わるデザイン」第6回：暮らしの中のデザイン-5「かたちの伝達性」第7回：暮らしの中のデザイン-6「欧文タイポグラフィの基礎知識」第8回：暮らしの中のデザイン-7「タイポグラフィの近・現代史」第9回：暮らしの中のデザイン-8「広告が描く時代のメッセージ」第10回：暮らしの中のデザイン-9「言葉の力、ビジュアルの力」第11回：デザインの今日的課題-1「デザインの評価について考える」第12回：デザインの今日的課題-2「デザインの価値について考える」第13回：デザインの今日的課題-3「デザインの類似性を考える」第14回：デザインの展望-1「未来への想像力」第15回：デザインの展望-2「デザインの今、デザインのこれから」",
        "courseDataUpdatedAt": "2025/03/16"
    },
    "updateAt": "2025/03/21"
}