{
    "lectureCode": "S2210",
    "courseName": "映像論",
    "lecturer": [
        "伊藤英高(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "現在のSNSで広く認識されているいわゆる「動画」というキーワードからも分かるように、映像というものは、様々なメディア・デバイスにおいてコミュニケーションのツールとして重要な意味を持つものになっています。この授業では、多様なかたちで増殖していく映像の、人間に対する原理的な働きを理解したうえで、映像デザイン（情報伝達・コミュニケーションのための映像表現）としての役割と技術的知識を学びます。本授業は、映像メディア分野の専門的な実務経験を有する教員による、映像デザインの考え方、コンセプト立案や企画・表現について数多くの事例をもとに講義を行う実践的科目です。",
        "outcomesMeasuredBy": "デザイン分野における映像の役割と機能を学び、映像デザイン表現に必要な知識と能力を身につけます。情報伝達とコミュニケーションデザインのための「論理的な思考力」を養い、映像デザイン表現の「発想力」「企画力」「提案力」を身につけます。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力問題解決力",
        "teachingMethod": "映像デザイン表現の数多くの事例を示し、映像表現の原理と目的・企画内容・表現方法を分析しながら講義を行います。また、講義内容に基づき論理的な考え方で企画・発想力を養う（プランニング能力を高めるための）エクササイズ課題を授業内や宿題として行っていきます。講義内ではノートPCを使用する場合があるので指示に従ってください。",
        "notices": "「映像」はあらゆるデザイン領域に関わるものになっています。自分が関心のある分野でどのように映像が活用されているか、日常的に意識した上で受講してください。毎回、小レポートの提出があります。",
        "preparatoryStudy": "予習について：授業の終わりに次回の授業テーマについて触れ、授業までに事前に調べておく事柄を予習として課します。復習について：授業内容に即した形で宿題として「演習課題」または「レポート課題」を課します。",
        "gradingGuidelines": "授業内レポート＋宿題として課す課題【70％】、受講態度等、授業への取り組みに対する評価【30％】を加えた割合で総合的に評価します。単位認定要件は60点以上とします。",
        "textbook": "必要に応じてプリントまたは資料データを配布します。",
        "referenceMaterials": "参考となる作品や資料映像を上映します。参考図書は必要に応じて授業時に紹介します。",
        "courseSchedule": "第1回：ガイダンス／授業の概要と目的・映像の現在・映像デザインを考える第2回：映像技術と表現の歴史1第3回：映像技術と表現の歴史2第4回：映像表現の基礎技術1「見ること」と認識第5回：映像表現の基礎技術2撮影・構成第6回：映像表現の基礎技術3ポストプロダクション第7回：映像デザインとアイデア1ワークショップ第8回：映像デザインとアイデア2ワークショップ第9回：映像デザインとアイデア3第10回：映像メディアの展開1鏡と身体第11回：映像メディアの展開2映像デザインの多面性＜広告・情報＞第12回：映像メディアの展開3リマスター、アーカイブ＜媒体＞について第13回：映像メディアの展開4物語、マスメディアとSNS＜社会と映像＞第14回：映像メディアの展開5デジタル、ノンリニア、インタラクション＜体験のデザイン＞第15回：言語としての映像・これからの展望",
        "courseDataUpdatedAt": "2024\/03\/10"
    },
    "updateAt": "2024\/09\/13"
}