{
    "lectureCode": "S2240",
    "courseName": "工業・空間デザイン演習",
    "lecturer": [
        "田崎咲絵(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月3",
        "月4",
        "月5",
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 6,
    "classroom": [
        "３１３１１デザイン演習室２",
        "３１３１３デザイン演習室３"
    ],
    "courceDetails": {
        "courseOverview": "この授業は、メーカーでのインハウスデザイナーやフリーランスデザイナーとしての幅広いデザイン分野での実務経験を活かし、課題発見からアイデア立案、表現とその伝達を演習形式で理解するよう構成された実践的科目です。課題1では、実際の商品を分解・計測・記録することで、ものの構造や人との関係性を深く理解します。課題2、課題3では、学校や地域（蒲田）を題材にした課題に取り組み、フィールドワークを通じて観察・分析を行いながら課題を発見。その解決に向け、個人制作とグループワークを組み合わせ、アイデアの立案と実施を進めます。課題を通じて、発想力、実現力、チーム力を養い、論理的思考や社会性を備えた提案力を育成します。",
        "outcomesMeasuredBy": "制作を中心とした演習課題を通じて、工業デザインと空間デザインにおける基礎的なデザインプロセスを学び、「ものともの」「ものと人」「ものと空間」「ものと環境」など、さまざまな要素間の関係を構築するスキルの習得を目指します。まず、工業デザインおよび空間デザインの視点から、ものの構造や寸法体系、さらに人との関係性についての理解を深めます。次に、観察やリサーチを通じて課題を把握し、ユーザー視点を反映したアイデアを立案。さらに、それらのアイデアを具現化し、伝えるためのプレゼンテーションを行うという、実際のデザインプロセスに即した課題に取り組みます。これにより、デザインに必要な論理的思考力、分析力、問題解決力を養います。また、グループワークを通じ、責任感や協調性の向上、コミュニケーション能力の獲得にも努めます。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "課題ごとに設定されたテーマに沿い、作品制作を中心にすすめる。課題に対して様々な観点からの考察を行いながら、デザインに関わる者に必要とされる視点や表現を学ぶ。個人制作だけではなく、グループワークにも取り組みつつ、ものごとの関わりを多角的に学修する。作品完成時に行う発表会の他、課題進行中には随時検討会を行う。なお、授業資料の閲覧や作品制作のためにノートPCを必携とする。",
        "notices": "作品制作が中心となる演習科目であるため、各自が主体性と目的意識をもち、制作に取り組む姿勢が要求される。また個人としての制作はもちろん、グループワークも重視するため、協調性をもって積極的に授業に参加することが求められる。",
        "preparatoryStudy": "授業中に実際に手を動かし制作ができるよう、作品の構想・アイディアスケッチ・調査・素材集めなどの予習を行うこと。また授業後は、授業内容に即して出題する課題に取り組み、内容について各自理解を深めること。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準に対応した詳細については学生ポータルを参照すること。①発想段階【20%】（調査内容、コンセプト、G：ディスカッションの参加）②制作段階【20%】（試作等の表現に至る過程、計画的な作業進行、G：作業の参加）③結果段階【40%】（提出期限、作業密度、相手への意識）④プレゼンテーション段階【20%】（わかりやすさ、伝え方、G：発表の参加）※Gはグループワーク",
        "textbook": "指定しない。",
        "referenceMaterials": "演習内で参考作品や参考資料を紹介する。",
        "courseSchedule": "第1回：オリエンテーション、課題1説明（全教員）第2回：（課題1)リサーチ①_ものと空間、人との関係考察/個人（全教員）第3回：リサーチ②_ものの分解、計測、記録/グループ（全教員）第4回：リサーチ③_空間における寸法の計測、記録/グループ（全教員）第5回：制作_リサーチ結果のまとめ/個人（全教員）第6回：課題1プレゼンテーション、課題2説明（全教員）第7回：（課題2)フィールドワーク・リサーチ①/グループ（全教員）第8回：リサーチ②_人・時・場/グループ（全教員）第9回：リサーチ③_人・時・場発表/グループ（全教員）第10回：立案、制作①_アイデア展開と具現化/グループ（全教員）第11回：立案、制作②_アイデア展開と具現化/グループ（全教員）第12回：立案、制作③_アイデア展開と具現化/グループ（全教員）第13回：立案、制作④_アイデア展開と具現化/グループ（全教員）第14回：立案、制作⑤_プレゼン資料作成/グループ（全教員）第15回：課題2プレゼンテーション、課題3説明（全教員）第16回：（課題3)フィールドワーク・リサーチ①/個人（全教員）第17回：フィールドワーク・リサーチ②_人・時・場/グループ（全教員）第18回：フィールドワーク・リサーチ③_人・時・場（全教員）第19回：立案、制作①_アイデア展開と具現化/グループ（全教員）第20回：立案、制作②_アイデア展開と具現化/グループ（全教員）第21回：立案、制作③_アイデア展開と具現化/グループ（全教員）第22回：立案、制作④_プレゼン資料作成/グループ（全教員）第23回：課題3グループ制作プレゼンテーション/グループ、個人制作説明（全教員）第24回：立案、制作⑤_アイデア展開と具現化/個人（全教員）第25回：立案、制作⑥_アイデア展開と具現化/個人（全教員）第26回：立案、制作⑦_アイデア展開と具現化/個人（全教員）第27回：立案、制作⑧_アイデア展開と具現化/個人（全教員）第28回：立案、制作⑤_プレゼン資料作成/個人（全教員）第29回：課題3個人制作プレゼンテーション①（全教員）第30回：課題3個人制作プレゼンテーション②（全教員）",
        "courseDataUpdatedAt": "2025/03/16"
    },
    "updateAt": "2025/03/21"
}