{
    "lectureCode": "S3080",
    "courseName": "専門スキル演習(デジタルコンテンツデザイン)",
    "lecturer": [
        "中嶋亮介(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月",
        "月2"
    ],
    "targetDepartment": "デザイン学部デザイン学科視覚デザイン専攻",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１１１５デザインクリエーションルーム２"
    ],
    "courceDetails": {
        "courseOverview": "今後の社会では、文系・理系・芸術系を問わず、誰もが最低限のプログミングの概念を理解して仕事を進めることが必須となっていくことが予想される。すでに高校で「情報」の授業が必修化し、大学入試に組み込まれていくことからもこの流れは動かしがたいものとなっている。本授業では、「デザイン」と「インタラクション」に特化したプログラミング環境(Processing,p5.js)を用いて、アルゴリズムによるCG描画について学ぶ。これまでの一部の専門的なプログラマーが使うためのプログラミングツールは、誰もが使うためのツールとして進化・改良されてきている。プログラミングによってコンテンツを完成させるプロセスを通して、論理的な思考力と問題解決力の養成を目指す。",
        "outcomesMeasuredBy": "・プログラミングの基礎とアルゴリズムの理解・アルゴリズムを用いた描画と動きの実現・インタラクションについての理解と実践",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "配布資料とスライドを使った演習形式。教科書は辞書的に補助のために用いる。授業での小課題の提出、それに加えて中間・期末課題を課す。授業資料の入手先は初回授業でリンク先を提示する。",
        "notices": "・履修に先立って自宅のPCにフリーウェアのProcessingをインストールして自習環境を整えておくこと。Processinghttp:\/\/www.processing.org\/・欠席をした場合は必ず担当教員に連絡した上で、授業資料に沿って自習を行い、次回からの参加に備えること。・プログラミングの経験の有無については問わない。Webアクセス、タッチタイピング等、基本的なコンピュータの操作に慣れていることを前提とする。・授業への出席、毎授業での小課題を期限までに提出することが必須となる。・各自の必携ノートPCを使用する。なお、授業期間中に修理に出さないといけなくなる事例が毎年数件あり、その間は授業が円滑に受講できないケースが散見される。OSのアップデートを行い、不要なファイルを整理してHDD（SSD）の空き容量を確保するなど、PCの整備は事前に各自で行っておくこと。",
        "preparatoryStudy": "・予習前回の授業内容を自宅でも実践し、確認すること。・復習実践演習の課題を行うこと。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①制作段階【45%】（授業理解、丁寧な作業、期限内提出、集中度）②結果段階【45%】（課題理解、スキル・知識の理解、独自の発想、スキル・知識の応用、十分な作業量、提出期限、完成度）③プレゼンテーション段階【10%】（作品意図、的確な説明）",
        "textbook": "近藤邦雄・田所淳編,ProcessingによるCGとメディアアート,講談社,2018年",
        "referenceMaterials": "CaseyReas(著),BenFry(著),船田巧(翻訳),Processingをはじめよう第2版(Make:PROJECTS),オライリージャパンMattPearson(著),久保田晃弘(監修),沖啓介(翻訳),[普及版]ジェネラティブ・アート―Processingによる実践ガイド,ビー・エヌ・エヌ新社,2014年DanielShiffman(著),尼岡利崇(監修),鈴木由美(編集),株式会社Bスプラウト(翻訳),NatureofCode-Processingではじめる自然現象のシミュレーション,ボーンデジタル,2014年",
        "courseSchedule": "第1回：ガイダンス第2回：プログラミングでの描画の基礎1第3回：プログラミングでの描画の基礎2第4回：プログラミングでの描画の基礎3第5回：プログラミングでの描画の基礎4第6回：プログラミングでの描画の基礎5第7回：中間発表第8回：インタラクションの設計1第9回：インタラクションの設計2第10回：インタラクションの設計3第11回：インタラクションと描画1第12回：インタラクションと描画2第13回：インタラクションと描画3第14回：期末課題制作第15回：期末発表",
        "courseDataUpdatedAt": "2024\/03\/12"
    },
    "updateAt": "2024\/09\/13"
}