{
    "lectureCode": "S3090",
    "courseName": "専門スキル演習（空間系CAD）",
    "lecturer": [
        "小山祐輔(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月",
        "月2"
    ],
    "targetDepartment": "デザイン学部デザイン学科工業デザイン専攻",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１１１６デザインクリエーションルーム３"
    ],
    "courceDetails": {
        "courseOverview": "本授業では、実学に基づく専門能力として、CADソフトウェアを活用した三次元モデリングおよびレンダリング技術を習得する。前半では、基本操作を中心に、実在する立体物や建築空間の再現を通じて基礎スキルを学ぶ。後半では、テーマに基づいた空間デザインの提案と制作を行い、プレゼンテーションを通じて論理的な思考力を鍛える。これらのプロセスを通じて、制作物の評価やデザインの質を高めるための分析・評価能力を向上させ、課題に対して適切な解決策を導き出す問題解決力を養う。",
        "outcomesMeasuredBy": "空間デザイン分野において、以下のスキルを習得することを目指す。・実学に基づく専門能力を背景に、CADソフトを活用した基本的な三次元モデリング、テクスチャ設定、光源やカメラ設定、効率的なレンダリング技術を身につける。・デザイン意図や提案を明確に伝える論理的な思考力を育成する。・制作物を基に空間デザインの質を向上させるための分析・評価能力を習得する。・制作プロセスや課題に対して柔軟かつ効果的に対応する問題解決力を身につける。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本授業では、ノートPC必携とし、3DCADソフト「Rhinoceros3D」を使用する。前半は、ソフトウェア操作の基礎を学び、特に空間デザイン分野で必要なコマンドや機能の習得に重点を置く。中盤では、実践的な空間モデリングを行い、応用力を養う。後半では、建築ビジュアライゼーションソフト「Twinmotion」等を併用し、デザイン提案やプレゼンテーションを通じて制作物を効果的に伝えるスキルを磨く。",
        "notices": "・毎回、PC、マウス、電源チャージャー、教科書を必ず持参すること。・授業開始10分前までに着席し、授業がスムーズに始められるよう準備を整えること。・指定教科書を必ず購入し、授業内容に活用すること。・使用するソフトウェアはPCへの負荷が大きいため、日頃からファイル管理やPCのメンテナンスに注意すること。PCの状態管理は各自の責任で行うこと。・授業外での自主学習や予習を推奨する。",
        "preparatoryStudy": "基本的な図面表現の理解や、三次元モデリングに関する基礎知識を予習しておくこと。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目に基づき、点数化して評価を行い、60点以上を単位認定の要件とする。評価は、制作段階40%、結果段階40%、プレゼンテーション段階20%の配分で行う。評価基準の詳細については学生ポータルに掲載されたラーニングアウトカムズの基準を参照すること。・制作段階では、理解度、作業の丁寧さ、提出期限の遵守を評価する。遅延は減点対象とする。・結果段階では、スキルや知識の理解度、独自性、応用力、作業量、完成度を評価する。具体的には、デザインの新規性や実用性、レンダリング技術の習熟度を重視する。・プレゼンテーション段階では、作品意図の明確さ、論理的で的確な説明、視覚資料の完成度を評価する。論理的思考力とコミュニケーション能力の発揮が求められる。また、各評価段階でのフィードバックを重視し、学生が制作・発表を通じて自らの成長を実感できるようにする。授業内で優れた制作例や評価ポイントを共有することで、評価基準を明確にする。",
        "textbook": "１：建築設計者のためのRhinoceros２：Twinmotionデザインテクニック上記２冊のテキストを活用し、3Dスキルの体得を目指す。",
        "referenceMaterials": "授業内で配布、またはアナウンスする。",
        "courseSchedule": "第1回：オリエンテーション第2回：基本操作1第3回：基本操作2第4回：基本操作3第5回：基本操作4第6回：基本操作5第7回：中間課題制作第8回：中間課題発表と講評第9回：実践操作1第10回：実践操作2第11回：実践操作3第12回：最終課題制作第13回：最終課題制作第14回：最終課題発表と講評第15回：ブラッシュアップ",
        "courseDataUpdatedAt": "2025/01/16"
    },
    "updateAt": "2025/03/21"
}