{
    "lectureCode": "S3090",
    "courseName": "専門スキル演習（空間系CAD）",
    "lecturer": [
        "小山祐輔(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月",
        "月2"
    ],
    "targetDepartment": "デザイン学部デザイン学科工業デザイン専攻",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１１１６デザインクリエーションルーム３"
    ],
    "courceDetails": {
        "courseOverview": "本授業では、実学に基づく専門能力として、CADソフトウェアを用いた立体物、建築物、建築空間などの三次元製図データの制作手法と、そのレンダリング技法を学ぶ。前半ではソフトウェアの基本操作を習得し、実在する立体物、建築物、建築空間を対象にCADソフトウェアでの再現を目指す。後半では、テーマに基づいて空間のデザインを考え、CADソフトウェアを用いて画像を制作し、アイデア、コンセプト、デザイン等に関するプレゼンテーションを通じて、論理的な思考力および問題解決力を養う。",
        "outcomesMeasuredBy": "空間デザイン分野において、CADソフトを使用した、基本的な三次元モデリング、テクスチャ設定やマッピングといった質感表現、多種光源やカメラ設定を利用した画像演出、レンダリング設定の適正化等のスキルを習得する。レンダリングを利用した立体物、建築物、建築空間の画像生成によって、デザインの内容的なレベルだけでなく、プレゼンテーション用素材として十分なクオリティのCG制作を目指し、空間デザインにおける分析・評価能力を養う。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "3DCADソフト「Rhinoceros3D」を使用し、前半はソフトウェアの操作について、特に空間デザイン分野で用いるコマンド（機能）を中心に学修する。中盤ではソフトウェアを用いた実践的な空間のモデリングを行う。後半では建築ビジュアライゼーションソフトである「Twinmotion」を併用し、デザイン提案とプレゼンテーションを行う。",
        "notices": "・教科書を使うので必ず購入すること。・3DCADソフトはPCにかかる負荷が大きいため、PCのパフォーマンスを下げないよう日頃からファイル管理やメンテナンスに気をつけること。（自分のPCの状態は自分で責任を持って管理する）",
        "preparatoryStudy": "基本的な図面表現について理解しておくこと。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①制作段階【45%】（理解度、作業の丁寧さ、提出期限）②結果段階【45%】（スキル・知識の理解度、独自性、スキル・知識の応用力、作業量、提出期限、完成度）③プレゼンテーション段階【10%】（作品意図、的確な説明）",
        "textbook": "１：建築設計者のためのRhinoceros２：Twinmotionデザインテクニック上記２冊のテキストを活用し、3Dスキルの体得を目指す。",
        "referenceMaterials": "授業内で配布、またはアナウンスする。",
        "courseSchedule": "第1回：オリエンテーション第2回：基本操作1第3回：基本操作2第4回：基本操作3第5回：基本操作4第6回：基本操作5第7回：中間課題制作第8回：中間課題発表と講評第9回：実践操作1第10回：実践操作2第11回：実践操作3第12回：最終課題制作第13回：最終課題制作第14回：最終課題発表と講評第15回：ブラッシュアップ",
        "courseDataUpdatedAt": "2024\/03\/12"
    },
    "updateAt": "2024\/09\/13"
}