{
    "lectureCode": "S3200",
    "courseName": "人間工学",
    "lecturer": [
        "小山祐輔(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "人間工学は、「使いやすい」「わかりやすい」を形にする学問であり、視覚デザイン、情報デザイン、工業デザイン、空間デザインのどの分野でも活用できる。本授業では、「どうしてこのデザインは直感的に使えるのか」「この空間はなぜ心地よいのか」といった日常の疑問を通じて、人間工学の理論や手法を学ぶ。これにより、デザイン活動で役立つ実学に基づく専門能力を身につけることを目指す。授業では、視覚的に効果的なグラフィック、分かりやすい情報構造、手に馴染む製品、快適な空間設計などを例に挙げ、人間工学がどのように応用できるかを学ぶ。分析・評価能力や問題解決力を高め、プレゼンテーションやディスカッションを通じてコミュニケーション能力を鍛える。前半では、人間工学の基礎知識や感覚・知覚、身体特性について学び、後半では具体的なデザイン事例をもとに、自分のデザイン活動に役立つ新たな視点を得ることができる。",
        "outcomesMeasuredBy": "日常にあるデザインを見直し、「なぜこれが便利なのか」を考える視点を身につける。視覚デザイン、情報デザイン、工業デザイン、空間デザインの各分野で、人間工学の知識や手法を応用し、自分のデザインに活かせるようになる。授業では、デザイン意図を伝えるスキルを磨き、分析・評価能力や問題解決力を高める。また、プレゼンテーションやディスカッションを通じて、デザイナーとして必要なコミュニケーション能力を伸ばし、国際的な教養を備える基盤を築く。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "本授業は、配布資料やスライドを用いた講義形式を基本とし、画像や映像を活用してわかりやすく解説を行う。また、Moodleを活用し、設問への回答や課題提出を通じて学びを深める。課題では、授業内外で得た知識を応用する形式を採用し、提出後にはフィードバックを行い、学生が次の課題に向けた改善点を学ぶ仕組みを設ける。さらに、授業内ではアクティブラーニングを重視し、提出された成果物をアーカイビングして公開する。学生同士が互いの成果を比較・評価し、相対的な視点を得る機会を設けることで、批評的に物事を捉える力を養う。公開された成果物については、投票などを通じて意見を共有し、その結果を基に授業内で議論を行う。このアクティブラーニングのプロセスにより、学生は批評的視点を深めるとともに、成果物の改善や自身の成長につなげる。",
        "notices": "本授業は全15回で構成されており、全回出席を前提とする。本授業で定める出席回数に満たない場合は、不合格となる。また、授業内容や課題に関して不明点や気になることがあれば、気軽に教員に質問すること。特に、授業前後に直接問い合わせることが最も確実である。メールでの問い合わせは見落としの可能性があるため、直接確認を推奨する。授業内容によっては事前に準備する道具を指示することがあるので、忘れ物のないよう注意すること。必要な道具の指示はMoodleを通じて連絡するため、定期的に確認すること。",
        "preparatoryStudy": "毎授業後、配布した資料やスライドを再度読み直し、授業内容を復習すること。その上で、「このデザインが便利な理由は何か」「どのように人間工学が活かされているか」など、自分なりの質問を設定し、日常生活や製品デザインに応用例を探すことが望ましい。また、次回の授業内容に関連する課題や資料が提示された場合は、それに目を通しておくことで、授業をより深く理解し、実践的な学びを得る準備を行うこと。",
        "gradingGuidelines": "本授業は全15回の講義を通じて構成されており、全回出席を前提とする。本授業で定める出席回数に満たない場合は不合格となる。また、単なる出席や課題の提出のみでは単位認定の要件を満たさない。評価は、各回の課題および最終課題の合計点（100点満点）を基準に行い、合計60点以上を単位認定の要件とする。課題は、授業内容の理解度、完成度、創意工夫などを基準に採点し、一定の水準に達していることが求められる。ただ課題を提出するだけでは評価基準を満たさず、質の高い成果物と授業への積極的な取り組みが必要である。授業の取り組み状況（出席、授業態度など）と課題の得点を総合的に評価し、最終成績を判定する。学修内容の定着を目的に、授業内で課題のフィードバックを行う。",
        "textbook": "配布資料",
        "referenceMaterials": "「人間工学の基礎」石光俊介・佐藤秀紀（養賢堂）「新装インテリアの人間工学」小原二郎監（ガイアブックス）「生物から見た世界」ユクスキュル／クリサート著（岩波文庫）「新版アフォーダンス」佐々木正人著（岩波書店）「誰のためのデザイン？増補・改訂版」D.A.ノーマン著（新曜社）「視覚ワールドの知覚」ジェームズ.J.ギブソン著（新曜社）「融けるデザイン」渡邊恵太著（BNN新社）「SpeculativeDesign」AnthonyDunne＆FionaRaby著（BNN新社）「SPECULATIONS」川崎和也監（BNN新社）などその他参考書は授業中に紹介する。",
        "courseSchedule": "第1回：授業概要説明第2回：人間の身体1第3回：人間の身体2第4回：人間の身体3第5回：人間の感覚・知覚1第6回：人間の感覚・知覚2第7回：人間の感覚・知覚3第8回：人間の感覚・知覚4第9回：人間の感覚・知覚5第10回：フィールドワーク第11回：バリアフリーデザイン第12回：ユニバーサルデザイン第13回：インターフェイスデザイン第14回：デザインリサーチ第15回：これからの人間工学とデザイン",
        "courseDataUpdatedAt": "2025/01/16"
    },
    "updateAt": "2025/03/21"
}