{
    "lectureCode": "S3290",
    "courseName": "工業ものづくりデザインコース専門演習III",
    "lecturer": [
        "相野谷威雄(デザイン学部デザイン学科)",
        "堀川卓哉(デザイン学部デザイン学科)",
        "田崎咲絵(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木3",
        "木4",
        "木5",
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "デザイン学部デザイン学科工業デザイン専攻",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 6,
    "classroom": [
        "３１５１１卒業研究室１"
    ],
    "courceDetails": {
        "courseOverview": "「工業ものづくりデザインコース専門演習Ⅲ」の前半第3クォーターでは、「スピーカのデザインとプロトタイピング」をテーマに、デザイン開発・プロトタイピングによる提案を行います。後半第4クォーターでは、「持続可能な社会を実現するための工業デザイン」をテーマに、ヒト・コト・モノを意識した新しい製品の企画とそのデザイン開発・提案を行います。専門演習I・Ⅱで学修した工業デザインにおける基礎的な開発プロセスを、さらに高度なテーマで応用展開した体験をすることで、「工業デザイン」について考察を深める場とします。企画から制作、プレゼンテーションに至るデザインのプロセスにおいて、経験を十分に活かして教育する実践的科目です。",
        "outcomesMeasuredBy": "一連のデザインプロセスを経験することで、より実践的なデザイン能力（課題解決能力、論理的思考力、発想力、プレゼンテーション能力など）の習得を目指します。特に3Qではプロトタイピングに関する知識や技術習得、4Qでは卒業研究に繋がるデザインアプローチの研究を目指し、実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力、問題解決力を修得します。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "PBL（Project-BasedLearning=課題解決型学修）を取り入れることで、実践的な演習内容とします。各学生が登壇してプレゼンテーションを行い、学生自らの主体的な学び（アクティブラーニング）を促します。ノートPCは必携とします。授業内容の共有にMoodleを用います。またclassroomやmiroなどのオンライン共有ツールなどを活用します。",
        "notices": "関連授業として、「スキル演習(基礎製図)」、「工業デザイン論」を履修していることが望ましい。",
        "preparatoryStudy": "予習：授業の終わりに次回テーマに触れ、事前に調べておく課題を指示する。スケッチ等の課題を指示する。復習：授業中のレクチャー内容や演習過程でのスケッチや制作物を記録し、授業の最後に提出するポートフォリオのために整理をしておくこと。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①発想〜立案段階【20%】（調査、アイデア、考えの伝達）②制作段階【20%】（試作と検討、集中度〈G：役割を果たし積極的な参加〉）③結果段階【50%】（提出期限、独自な視点で社会的な価値ある提案、完成度）④プレゼンテーション段階【10%】（コンセプトや制作意図が明確か）",
        "textbook": "指定しません。",
        "referenceMaterials": "授業時に適宜指示します。",
        "courseSchedule": "第1回：3Q課題説明（全教員）第2回：コンセプト立案（全教員）第3回：イメージコラージュの制作（全教員）第4回：造形スケッチ展開1（全教員）第5回：造形スケッチ展開2（全教員）第6回：造形CAD展開（全教員）第7回：プロトタイピング1（全教員）第8回：プロトタイピング2（全教員）第9回：中間講評（全教員）第10回：プロトタイピング3（全教員）第11回：CADからCMFへの展開1（全教員）第12回：CADからCMFへの展開2（全教員）第13回：ブランドへの展開：グラフィックデザイン1（全教員）第14回：ブランドへの展開：グラフィックデザイン2（全教員）第15回：3Qの最終プレゼンテーション（全教員+特別講師）第16回：4Q課題説明（全教員）第17回：リサーチ1（全教員）第18回：リサーチ2（全教員）第19回：リサーチプレゼンテーション（全教員）第20回：アイデア展開1（全教員）第21回：アイデア展開2（全教員）第22回：中間プレゼンテーション（テーマ・コンセプト）（全教員）第23回：デザイン制作1（全教員）第24回：デザイン制作2（全教員）第25回：デザイン制作3（全教員）第26回：中間プレゼンテーション(制作確認）（全教員）第27回：デザイン制作4（全教員）第28回：プレゼンテーション制作1（全教員）第29回：プレゼンテーション制作2（全教員）第30回：4Qの最終プレゼンテーション（全教員+特別講師）",
        "courseDataUpdatedAt": "2024\/03\/12"
    },
    "updateAt": "2024\/09\/13"
}