{
    "lectureCode": "T0100",
    "courseName": "哲学[医療]",
    "lecturer": [
        "山中健義(兼任講師)"
    ],
    "regularOrIntensive": "基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "この授業では、西洋哲学史における代表的な哲学者たちを取り上げ、彼らの根本的な問い、問いへのアプローチの仕方、解決策などを紹介しながら哲学の基本的な考え方や思想内容を学ぶとともに、哲学とはどのような学問なのかを考えていく。哲学は専門用語や概念を覚えるだけの単なる暗記科目ではない。哲学とは人間の経験や思考の根源や成り立ち、あるいはその可能性をめぐって展開される思考の道筋そのものであり、端的に言えば、私たち人間のあり方ないし生き方を意味すると言える。したがって、授業ではただ単に哲学者たちの学説や概念を羅列する紹介に終始するのではなく、受講者自身が「自ら考える」ことを実践し、哲学者たちの思考の道筋を追体験することを目指す。こうしたことを通じて、哲学とはどのようなものかを体験してもらうことが、この授業の狙いである。",
        "outcomesMeasuredBy": "西洋哲学史における各哲学者の基本思想、概念、術語等を理解すること、各哲学者の哲学的思考の道程を学ぶことを通じて論理的な思考力を身に付けること。そしてこれらを通じて、国際的な教養と物事を根源的に自ら考える力を養うことを目標とする。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "パワーポイントによる講義形式。事前に配布する資料の内容に沿って解説していく。配布資料はMoodleから各自でダウンロードしておくこと。また不定期でリアクションペーパーの提出を求める。授業ではMoodleを使ってアンケートや投票など参加型の問いかけを行うこともある。ノートPC必携。",
        "notices": "履修希望者は必ず初回の授業に出席すること。授業中の私語は厳禁。予備知識は必要ないが、哲学の性質上、抽象的な議論も多いため、高い集中力と粘り強い思考力が求められる。資料は平易な文章で書かれた初学者向けの入門書・解説書等を用い、具体例なども交えながらできる限り分かりやすい解説を行う。哲学を理解するためには、毎回きちんと出席し、何とか理解しようという積極的な取り組みが必要となる。",
        "preparatoryStudy": "予習：配布資料を事前に熟読しておく。（60～90分程度）復習：講義スライド、ノートやメモなどを見直しながら授業内容をよく振り返る。そのうえで配布資料をもう一度じっくりと読み直し、理解を深める。（90～120分程度）",
        "gradingGuidelines": "成績評価は不定期のリアクションペーパー（20％）と期末試験（80％）で行う。100点満点中60点以上で単位認定となる。リアクションペーパーのフィードバックは授業内で全体に対して行う。",
        "textbook": "指定の教科書はない。その都度資料を配布する。",
        "referenceMaterials": "納富信留『プラトンとの哲学－対話篇をよむ』岩波書店、2015年津崎良典『デカルトの憂鬱－マイナスの感情を確実に乗り越える方法』扶桑社、2018年石川文康『カントはこう考えた－人はなぜ「なぜ」と問うのか』筑摩書房、2009年仲正昌樹『ハイデガー哲学入門－『存在と時間』を読む』講談社、2015年池田喬『ハイデガー『存在と時間』を解き明かす』NHK出版、2021年その他、授業内で適宜紹介していく。",
        "courseSchedule": "第1回：ガイダンス、イントロダクション第2回：ソクラテス（1）：「哲学」という「生き方」第3回：ソクラテス（2）：不知の自覚第4回：ソクラテス（3）：魂への配慮第5回：デカルト（1）：コギトへの「旅」第6回：デカルト（2）：方法的懐疑第7回：デカルト（3）：コギト命題第8回：カント（1）：「理性」とは何か第9回：カント（2）：理性のパラドクス（アンチノミー）第10回：カント（3）：コペルニクス的転回第11回：ハイデッガー（1）：「存在への問い」とは何か第12回：ハイデッガー（2）：「現存在」について①第13回：ハイデッガー（3）：「現存在」について②第14回：ハイデッガー（4）：「世界内存在」について第15回：まとめ",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/12"
}