{
    "lectureCode": "T1700",
    "courseName": "集中実技I（野外活動）[医療]",
    "lecturer": [
        "佐久間裕司(教養学環)"
    ],
    "regularOrIntensive": "基礎教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "野外活動のねらいは、「自然・人・体験など諸々の多くの出会いを通して心の豊かさ，生きるための創造力を涵養する」ことである。特に，自然の世界に入り込み，直接自然に触れることで感じる心と感覚を養うことができる。さらに，自然の中で生活をする事は衣食住をはじめ「生きる」ことを見つめ直す絶好の機会となる。サステイナブル・テクノロジーを目指す本学の学生こそ，こうした野外活動を体験し，豊かな心と賢いからだづくりを実践するきっかけをつくることは重要となる。今後さらに頭と身体，仕事とレクリエーション，都市生活と自然界とが調和した健康的なライフスタイルの開発が求めらていく中で，健康に対するリテラシーとからだづくりを融合させた教養としてのウェルネスはより期待されるが、とりわけ野外活動はその期待に応える有効な教育手段と考えられ，社会人として巣立つ最終の教育機関で体験できる意義はとても大きいと考える。野外活動の学修効果としては，炊飯を始めとする仲間との協同作業が信頼関係やコミュニケーション能力を構築したり，刻々と変化する環境下での活動が適応力を高めたり，自身の持つ能力やその限界を知り，安全管理能力（判断力）を鍛えたり，社会人基礎力の強化・育成手段として有効であることが認められている。しかし，こうした学修効果は全て副産物であり，本当に学ぶべきことは，肌から自然への理解を深め，生きることの大切さと生きている事への感謝，人を見る目を養い，他人を気にかけ大切に思うことである。キャンプや野外活動をあまり体験したことのない人でも安心して実習に参加できる様に，安全で快適な空間のある実習地を選び，楽しいプログラムを用意している。非日常的な生活空間で仲間らと一から協働で成し遂げたり，創り上げたりする体験を通して「コミュニケーション能力」を高め，「実践的な知恵」や非常災害時での汎用性の高い「応用スキル」を身に着けながら、「問題解決力」や「論理的な思考力」を磨き上げていくことができる。自然に心を開き，自然の中で生を実感し，命のつながりや尊さに気づくことは持続可能な生き方の礎になると確信している。",
        "outcomesMeasuredBy": "○自然がもたらす恩恵を理解し，自然を維持する行動や行為，生き物の生活や命を保護する態度を養う。○仲間との生活や協働作業に欠かせない会話に必要な「心の扉」を開く勇気と努力ができる。〇仲間との協働作業を通じて論理的な考えに基づいた意見交換や構想の提案ができる。〇グループ内の役割を通じて責任を全うし，その役割でのリーダーシップを発揮することができる。〇周囲の環境や天候の変化などを見極め，速やかに安全な判断と行動の選択ができる。○限られた時間内で効率よく作業を進めるための手順や必需品を事前に計画，準備することができる。○失敗を恐れず、その失敗を次に活かすことができる。○まったく体験したことのない事態や問題が発生した際に，どうやってそれを解決・改善・軽減するか，考えて行動できる。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "現時点では，「白州・尾白の森名水公園べるが（山梨県）」にて，夏季休業中（8月下旬～9月上旬）の４泊５日で実施する予定である。履修者を複数のグループに分け、プログラムによってグループ毎に活動を行っていく。体験を内面化し，学びを深めていくために，1日の活動終了時にグループで振り返りを行う。また，活動の真っ最中にも振り返りをすることでより学修を深め、メタ認知能力（自己の認知活動を客観的に捉え、評価したうえで制御することができる心理的な能力）を高めていく。",
        "notices": "受講者は学内で行われる事前授業４回に出席し、野外活動を行う上での大切な知識や安全管理について聴講することを義務付ける。募集の掲示を６月頃に学内掲示板・学生ポータルにて行うので，希望者は実習説明会（ガイダンス）に出席し，実施概要・履修方法等の具体的な情報を入手すること。なお，事前授業を無断で2回以上欠席した者は履修不可とする。",
        "preparatoryStudy": "事前授業では次のことを学ぶ。○アイスブレイクとグループづくり…初期交流○野外活動の心得…野外活動の基礎知識と自然の摂理の理解○自然の中でのリスクマネジメント理論と実践…安全対策○自然環境の理解…「尾白の森と水」「人と自然の共生」について○自然災害時での汎用性の高い「応用スキル」とは○命の教育",
        "gradingGuidelines": "事前授業の受講，現地実習での取り組み，各人の課題達成度等を総合的に評価し，合否を判定する。具体的には，①事前授業への参加と知識の習得度（30％），②実技課題の達成度（30％），③実技への取り組み姿勢，マナー・協調性、安全配慮等（20％）、④感想文（20％），計100％（100点満点）とし，60点以上を合格とする。",
        "textbook": "特に指定しない。",
        "referenceMaterials": "レイチェル・カーソン著（1996）「センス・オブ・ワンダー」新潮社陳冲・望月泰博著（2020）「頭をよくしたければ体を鍛えなさい」中央公論社養老孟子著（2003）「一番大事なこと-養老教授の環境論」集英社新書養老孟子著（2008）「虫とる子だけが生き残る」小学館",
        "courseSchedule": "第1回：履修に関するガイダンス：実施概要の説明、履修希望調査書の記入と提出第2回：事前授業（1）自身の自然認識を深める(自然観について)第3回：事前授業（2）自然環境と野外活動の意義第4回：事前授業（3）仲間を理解する(アイスブレイクと自己開示)第5回：事前授業（4）安全に活動するために(リスクマネジメント―事故から学ぶ)第6回：現地授業（1）：集合、現地移動、開講式、第1日目/午後活動（衣食住を整える。「テント設営」）、ディブリーフィング（1）第7回：現地授業（2）：第2日目/午前活動（生き物から食べ物へ。命をいただく意味を考える。「ニジマスつかみ＆塩焼き」）第8回：現地授業（3）：第2日目/午後活動（川での活動「キャニオニング」名水百選の尾白川を歩く。）、(星空観察)ディブリーフィング（2）第9回：現地授業（4）：第3日目/午前活動（チームでの探究活動）第10回：現地授業（5）：第3日目/午後活動（創作野外料理に挑戦）、(ソロタイム暗闇で歩く。一人に時間を体感)、ディブリーフィング（3）第11回：現地授業（6）：第4日目/午前活動（ハイキング）第12回：現地授業（7）：第4日目/午後活動（ハイキング）、(キャンプファイヤー)、ディブリーフィング（4）、授業評価アンケート、第13回：現地授業（8）：第5日目/午前活動（生活拠点の撤収、ブリーフィング）第14回：現地授業（9）：第5日目/午後活動（ふりかえり）、閉校式、後片付け、現地撤収・移動、解散",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/12/09"
}