{
    "lectureCode": "T4212",
    "courseName": "海外研修I[シンガポール]2024年夏HS",
    "lecturer": [
        "石塚美佳(教養学環)"
    ],
    "regularOrIntensive": "他学部・他大学科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "グローバル化が加速度的に進む現代では、国境に関係なく、誰もがグローバル社会の一員であると言える。そのため、世界中で多くの人が話す英語を運用できる力を身につけることが、今まで以上に重要になってきている。大学の語学の授業でしっかり学ぶことも大事だが、実際に英語を公用語とする現地の人々と交わることは、より多くの学びにつながる。シンガポールはマレーシアの南に位置する島で、気候は熱帯気候に属し、国内には多様な文化が存在している。地震がないため、非常にユニークな建築物も数多くある。この研修では、実際にシンガポールを訪れ、小さい国ながら世界的に存在感を増すシンガポールを体験し、独特のSingaporeEnglishを話す人々と交流する。約1週間という短期研修だが、非常に実り多い体験ができる内容になっている。海外研修1単位認定科目。",
        "outcomesMeasuredBy": "以下を到達目標とする。・自分の考えを英語で伝える。・世界で話されている英語への理解を深める。(WorldEnglish）・グローバルな視野と行動力をはぐくみ、今後の人生設計に役立つ知見を身につける。・自分と異なる文化的背景を持つ人々の価値観に対する理解を深め、国際的な感覚を身につける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・教員と共にシンガポールを訪問する。期間は1週間程度。（2024年度は8\/24～9\/1を予定）・午前中は、現地の学校で、シンガポールという国を様々な角度から学びつつ、英語を話す練習をする。午後は現地ガイドと共に実際に街を歩き、学んだことを体感する。有名な建築物を見学したり、人気のマリーナベイサンズ、ガーデンズバイザベイ、セントーサ島、シンガポールズーなどを訪れることも可能。・現地の大学生との交流会もあり。課題等へのフィードバックは、研修前の事前授業（2回）、研修中、研修後の事後授業（1回）、GoogleClassroomなどで行う。",
        "notices": "・研修前に、参加方法などを説明するオリエンテーションを実施するので必ず参加のこと。・事前授業・事後授業も実施。現地に行く前に様々なこと学ぶ機会なので、必ず出席のこと。・研修後はプレゼンテーション＋レポート提出が課される。詳しくはガイダンス時に説明する。・海外研修1単位として認定。・研修費用についてはガイダンス、募集説明会で説明する。",
        "preparatoryStudy": "普段からどれだけ積極的に英語を学んでいるか、英語を学ぶ意欲があるか、他国の文化に興味があるか、が英語力向上の大きな秘訣である。研修の効果を上げるため、日ごろから積極的に英語に触れるようにするとよい。またガイドブック、関連サイトなどでの事前リサーチは必須。",
        "gradingGuidelines": "次のすべてに出席し、課題にも期限厳守で取り組むこと。・オリエンテーション・事前授業・現地研修・事後授業（プレゼンテーション）・レポート作成",
        "textbook": "特になし。",
        "referenceMaterials": "特になし。",
        "courseSchedule": "オリエンテーション事前授業2日間（終日）現地研修7日間事後授業回（終日）現地での基本スケジュールは基本的に下記の通り。AM語学学校での学習（英語、文化、歴史）PM現地視察（マリーナベイツアー、チャイナタウン、アラブストリート、リトルインディアなど）現地大学生との交流会自由行動の日も設定されている。",
        "courseDataUpdatedAt": "2024\/02\/16"
    },
    "updateAt": "2024\/09\/12"
}