{
    "lectureCode": "T4211",
    "courseName": "海外研修I[韓国]2024年夏HS",
    "lecturer": [
        "楠元洋子(教養学環)"
    ],
    "regularOrIntensive": "他学部・他大学科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "社会は刻々と変化を続け、ますますグローバル化が進んでいる。このような社会では、日本にいても、国境のないグローバルな社会に所属しているといえる。したがって、グローバルという概念を理解することが重要なのだが、本やインターネットを通して学んでも実感はなかなか湧かないのが実情である。本コースでは、海外へ行き、そこでじかに現地の人々の社会・言語・文化に触れ、異なった言語・文化・習慣・価値観への理解を深める。今後の自分のビジョンを、外から日本を見る経験を基して描いてみることも目的の一つである。この研修では韓国ソウルに滞在し、韓国の歴史・文化について見識を深め、現地学生との交流を通して、国際交流、相互理解の重要性を体感する。",
        "outcomesMeasuredBy": "・自信をもって、英語で自分の考えを伝える。・自己管理能力を高める。・他国の文化に触れ、異なる価値観を持つ人々への理解を深める。・GlobalCommunicationSkillsを身につける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "今年度は下記の内容で実施予定。実施時期：2024年夏の5泊6日間（6月～9月）参加者オリエンテーション：Zoom事前授業①：対面（八王子キャンパス）事前授業②：対面（蒲田キャンパス）現地研修：韓国ソウル（国立中央博物館、烏頭統一展望台、西大門、東大門、北村韓屋村など）事後授業：対面（八王子キャンパス）",
        "notices": "・研修前に、参加方法や単位取得条件などを説明するオリエンテーションを実施するので必ず参加のこと。・事前授業・事後授業も実施。現地に行く前に様々なこと学ぶ機会であり、出席は単位取得に必須である。・研修後は事後授業でのプレゼンテーションの実施およびレポートを提出する必要がある。・海外研修1単位認定。・渡航費などについてはガイダンス、募集説明会で説明する。",
        "preparatoryStudy": "事前授業・事後授業の準備としてGoogleClassroomで配布される課題に取り組み期日までに提出すること（1～2時間）。課題は、グループプレゼンテーションの準備のテーマ別リサーチ、研修参加の目的と目標、韓国滞在中のジャーナル、個別プレゼンテーションのスライドなどを含む。また渡航前にガイドブック、関連サイトなどで事前リサーチをしておくことを勧める。",
        "gradingGuidelines": "次のすべてに出席し、課題にも期限厳守で取り組むこと。・オリエンテーション・事前授業・現地研修・事後授業・レポート作成課題、プレゼンテーションなどのタスクへのフィードバックはGoogleClassroom上および授業中に随時行う。",
        "textbook": "教科書は使用しない。",
        "referenceMaterials": "事前授業などで適宜紹介する。",
        "courseSchedule": "第1回（6月）:オリエンテーション①：パスポートの取得、事前・事後授業等、研修に参加するにあたっての必要事項の説明、その他第2回（7月）:事前授業①-1：Icebreaking第3回（7月）:事前授業①-2：異文化理解に関するレクチャー第4回（7月）:事前授業①-3：テーマ別リサーチ＆ポスタープレゼンテーション第5回（8月）:事前授業②-1：韓国の文化、歴史に関するレクチャー第5回（8月）:事前授業②-1：日韓関係に関するレクチャー第6回（8月）：オリエンテーション②：出発の案内、研修の準備・行程の最終確認第7～13回（8-9月）:現地研修第15回（9月）:事後授業プレゼンテーションおよびレポート作成",
        "courseDataUpdatedAt": "2024\/02\/16"
    },
    "updateAt": "2024\/09\/12"
}