{
    "lectureCode": "U2215",
    "courseName": "数学（応用解析学）",
    "lecturer": [
        "須田拓馬(教養学環)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "1年次後期に学んだ微積分学の基礎の元に，臨床工学技士として，理解し知っておかねばならない数学を学ぶ。特に、「微分方程式」「ラプラス変換」「フーリエ変換」を中心に学ぶ。ここで学んだ内容は，3年次以降の専門科目で学ぶ内容の基礎となると同時に、そのまま国試に出題されることもある。国試では問題に即答することが求められるが、その背景となる数学的知識を獲得することで、丸暗記に頼ることなく合理的な思考によって解答を導くことができるようになる。本授業では、国試に出題される問題の背景となる数学について、演習問題を通じて理解を深めていく。国試の過去問だけでなく、電気回路のような、他の授業とも関連する演習問題にも取り組み、臨床工学技士としての基礎力を鍛え上げることを目指す。",
        "outcomesMeasuredBy": "1.変数分離法、定数変化法といった微分方程式の解法を習得し、2階定数係数線形微分方程式を解けるようになる。2.ヘビサイド法を用いて部分分数分解を迅速に行うことができる。3.ラプラス変換を用いて微分方程式を解くことができる。4.簡単な周期関数に対してフーリエ級数展開ができる。5.フーリエ変換とは何かを説明することができ、簡単な関数についてフーリエ変換を行うことができる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力",
        "teachingMethod": "-板書を主体とし、計算演習を通じて新しい概念を習得するとともに、微分方程式の解法を身につける。-授業開始前までに授業資料をMoodleにアップロードする。授業中に板書する内容の大部分は授業資料に書かれているので、原則として授業中に板書を書き写す必要はない。-毎回の授業の冒頭で、前回の内容について復習する小テストを行う（初回は除く）。10分間程度の解答時間が与えられ、時間内にMoodleに解答を入力する必要がある。小テストの時間中は教科書、ノートなどを参照してはならない。授業開始前にしっかりと復習しておくこと。-小テストの解答、解説は小テスト直後に行うとともに、解答例は後日Moodleにアップロードする。-小テストの得点(10点満点)と平均点、満点者の人数、3点以下の人数を公表する。-授業時間内で演習の時間をとり、実際の計算問題に慣れてもらう。計算演習はペアかグループで行うことが望ましいので、授業開始時にペアやグループを作りやすいように着席すること。-小テストの得点が低い状態が続いた学生は、学修支援センターの利用を促されることがある。",
        "notices": "本授業は1年次後期の「数学（微分積分）」の内容を前提とする。簡単な関数の微分と積分の計算をスムーズに行うことができることが授業についていくための最低条件となる。授業時間中には演習問題に取り組む時間がある。ペアやグループでの活動を推奨するので、解答を見せ合ったり、相談しながら解くなど各自で工夫してほしい。授業をやむを得ない事情で欠席する場合は、事情を説明する証明書の写真をメール添付で送るか、授業時間の前後に証明書類を見せること（原本の提出は求めない）。やむを得ない事情と証明書類の一例は以下の通り（これがすべてではない）。-病欠：病院の日付入りの領収書-忌引：告別式の案内やむを得ない事情による欠席が認められれば、小テストは免除扱いとなり、成績評価において不利になることはない。病院実習についても申告すれば、小テストは免除となり、何回欠席してもX評価の対象となる欠席としてカウントされない。授業中の飲食は推奨しないが、水分補給は禁止しない。授業に関する内容について学生同士で話し合うことは推奨するが、私語は周囲の学生が授業を受ける権利を侵害するので十分に留意すること。居眠りや他の授業の課題を行うといった行為は効率性の観点から推奨しないが、各自の事情を考慮して注意はしない。ただし、スマートフォンでゲームをするといった行為は極めて非生産的であり、見つけ次第止めるよう注意する。電車の遅延による遅刻が見込まれる場合は授業開始前にメールで、科目名、学籍番号、氏名、遅延している路線名を明記の上連絡をすること。場合によっては小テストの開始時刻を遅らせることがある。",
        "preparatoryStudy": "1年次後期の「数学（微分積分）」の内容を復習しておくこと。その理解度を確認するため，第1回目冒頭に小テストを行う。予習：次週の内容を教科書で予習する(60分)復習：小テストで間違った箇所を解き直したり、授業中の演習時間に終わらなかった問題を解いて理解する(180分)必要に応じて適宜学修支援センターを利用すること。",
        "gradingGuidelines": "各回の小テスト（全14回を予定）の合計と期末試験によって評価する。小テストの合計点を30点満点、期末試験の得点を70点満点として換算し、100点満点で評価する。60点以上を合格の目安とする。ただし、欠席が多い場合は合格基準を満たしてもX評価となる。成績評価の段階で合格基準に満たなかった者は再試験レポートを提出する機会が与えられる。再試験レポートの合格基準は一律ではなく、小テストの合計点と期末試験の得点に応じて個別に決定される。小テストと期末試験の得点が低い者ほど、合格に必要なレポートの得点は高くなる。提出すれば自動的に合格となるわけではないことに注意すること。",
        "textbook": "LIBRARY工学基礎\u0026高専TEXT「応用数学」（河東泰之監修）数理工学社",
        "referenceMaterials": "授業内容と教科書の内容が厳密に対応しているわけではないので、教科書のページ番号はおおよその目安であることに注意。第1回：微分積分の復習(微積分学の理解度確認小テスト)第2回：微分方程式の導入、直接積分型(p.1-8)第3回：変数分離型(放射線、落下運動)(p.9-11)(同次形を除く)第4回：1階線形(RC直列回路の過渡現象)(p.15-17)第5回：1階微分方程式に関する演習(p.23-25)第6回：定数係数2階線形微分方程式(斉次形)(p.26-28)第7回：定数係数2階線形微分方程式(非斉次形)(p.29-33)第8回：微分方程式の応用例(LCR直列回路など)第9回：ラプラス変換(基本的関数の変換)(p.81-89)第10回：ラプラス変換(逆変換、部分分数展開)(p.92-99)第11回：ラプラス変換(線形微分方程式への応用、1次・2次遅れ系)(p.101-104)第12回：フーリエ級数展開の導入(p.113-116)第13回：フーリエ級数展開の計算(p.116-120)第14回：フーリエ変換(p.128-132)第15回：離散フーリエ変換、スペクトル分析",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/12"
}