{
    "lectureCode": "U5102",
    "courseName": "解剖学実習",
    "lecturer": [
        "阿部達彦(医療保健学部リハビリテーション学科作業療法学専攻)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "実習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木3",
        "木4",
        "木5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "Ｍ３０１臨床検査実習室２",
        "Ｍ３０２臨床検査実習室３"
    ],
    "courceDetails": {
        "courseOverview": "解剖学が対象としている内容は多岐に亘っていることは前期の講義時に注意した。検査技師として形態学を修めることは臨床診断時に役立つだけではなく、活躍の範囲を基礎研究にも広げる時に大きな武器になる。本実習では人体を視るうえで最も重要な骨学と、顕微鏡を用いた解剖学である組織学を実習する。",
        "outcomesMeasuredBy": "人体ならびに細胞と組織の形態学的構造の基本を習得し、病理学・細胞病理学のバックグラウンドとなる基礎知識を確立する。そのために、観察のポイントを解説し、演習試験を行い、理解不足のポイントンついて顕微鏡を用いた観察（input）と、スケッチ（output）を行うことで形態を正しく記憶させる学習を行う。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "毎回のテーマに応じた観察のポイントについて解説を行い、次いで理解度を測る演習試験を行う。この問題で不正解となったポイントに関連する標本を観察し、指示した項目をスケッチする。予習および学習経過は全て無地のノートに記載および添付し、実習最終回で提出して学習成果を評価する。",
        "notices": "スケッチの目的は組織や細胞の特徴を理解することであるので、美しいスケッチを目指す必要はない。「その細胞の形はどのようであるか」、「大きさは？」、「色調は？」、または「形が楕円形であるならば縦と横ではどちらが大きいのか」、「それらの細胞の集まり方に法則性はあるのか」などと詳細に調べ上げていくのが観察であり、スケッチはその記録にすぎない。スケッチしきれないことを言葉で記載れば良いので、各自の学習の工夫が望まれます。観察の成否は絵を描く能力以前の問題です。",
        "preparatoryStudy": "教科書等を複数あたって予習することを勧める。既習と思われる内容でも様々な教科書や論文等で勉強を深める癖をつけること。インターネットで安易に調べても良いが、出典先によっては引用を認めないこともあるので、予め成書等で調査しておく必要があります。また、実習時にも教科書は必携とする。",
        "gradingGuidelines": "認定要件実習の最終回にノートを提出させ評価を行う。指示に従った学習や課題の内容で学習効果の判定を行い、成果が認められない場合は期末試験を受験させて100点満点中60点以上で単位認定とする。判定要件毎回の予・復習と演習試験の成果および不正解内容に対する課題の成否など。",
        "textbook": "ひとの組織学梶ヶ谷博・他著株式会社インターズー",
        "referenceMaterials": "バーチャルスライド組織学駒﨑伸二著羊土社組織細胞生物学内山安男監訳南江堂他の参考図書については個別に相談すること。",
        "courseSchedule": "第1回：呼吸器と骨・軟骨の組織①第2回：呼吸器と骨・軟骨の組織②第3回：呼吸器と骨・軟骨の組織③第4回：消化管の組織①第5回：消化管の組織②第6回：消化管の組織➂第7回：消化腺の組織①第8回：消化腺の組織②第9回：消化腺の組織➂第10回：内分泌系の組織①第11回：内分泌系の組織②第12回：内分泌系の組織➂第13回：泌尿器・生殖器の組織①第14回：泌尿器・生殖器の組織②第15回：泌尿器・生殖器の組織③",
        "courseDataUpdatedAt": "2025/01/26"
    },
    "updateAt": "2025/03/21"
}