{
    "lectureCode": "U5202",
    "courseName": "公衆衛生学",
    "lecturer": [
        "川又紀彦(医療保健学部臨床検査学科)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３０２１２教室"
    ],
    "courceDetails": {
        "courseOverview": "臨床医学が個人の健康問題を扱うのに対し、公衆衛生学は人々の生活の場に焦点をあてた生活環境・社会システムの改善を目的として、集団からのアプローチによって人々の健康問題に対応する。人々の健康を保持・増進し、疾病を予防する公衆衛生活動に必要な基礎的知識を学び、衛生統計、感染症予防、環境衛生を含む地域保健活動全般について講義する。この科目は、教官が、日本（東京医科歯科大学病院・順天堂大学病院）ならびに米国（シーダス・サイナイ医療センター・カリフォルニア大学ロサンゼルス校UCLA附属病院・シティーオブ・ホープ病院）において、患者の診療ならびに公衆衛生行政に当たっていた実務経験に基づき、大学で学ぶ基礎的な知識が実際の臨床や公衆衛生行政の場で、どのように利用されているかについて解説する実践的科目である。この授業は本学の川又紀彦先生と外部講師の今村倫敦先生が、それぞれが専門とする講義を担当する。",
        "outcomesMeasuredBy": "疾病の予防、治療を個人の問題として取り扱うだけでなく、社会全体で考えることが重要であることを理解する。代表的な疾病予防について、日本だけでなく他国との違いを公衆衛生学的見地から理解するとともに医療専門職としてどのように関与できるかについて説明できる能力を身に付ける。以上により国際的な教養を身に付け、実学に基づく専門能力を習得する。また、医療法を含めた、医療者として備えておく必要のある法律知識を身に着ける。同時に、患者や家族へ提供できるサービス（医療行為）が、行政の中で、どのような公的機関（国・都道府県・市町村）の、どのような法律に基づいて規定されているかを知り、患者・家族に適切な情報提供が出来る知識を身に着ける。統計学・疫学の知識を身に着け、これらを用いて優良な医療（予防や治療）が、どのように行われているかを知る。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "パワーポイントを用いて講義を展開する。また、一部の領域については公的機関のホームページに記載されているデータを参照しながら進める。",
        "notices": "インターネットにアクセスしながら授業をするので、各自、スマホあるいはタブレットを持参すること。持ってない者は、隣の人に見せてもらいながらアクセスすること。",
        "preparatoryStudy": "「個人の力だけでは改善できない健康問題には、どのようなことがあるか」新聞・テレビなどのニュース・論説などに関心を持ち、自分の考えをまとめること。",
        "gradingGuidelines": "期末試験の偏差値40以上で合格とする。期末試験の難易度・出題形式は国家試験問題に準ずる。",
        "textbook": "「よくわかる専門基礎講座公衆衛生」松木秀明編金原出版株式会社",
        "referenceMaterials": "「国民衛生の動向2020/2021年版」厚生労働統計協会なるべく新しいもの",
        "courseSchedule": "授業のスケジュールに変更があった場合は、メールならびにMoodlで最新の情報を告知するので、必ず授業スケジュールを確認すること。第1回:公衆衛生とは第2回:健康保険制度第3回:介護保険制度他第4回:国際保健第5回:健康と予防第6回:疫学概論第7回:疫学研究方法論・ｽｸﾘｰﾆﾝｸﾞ・統計学第8回:関係法規第9回:成人保健各論第10回:食品衛生・口腔保健第11回:感染症第12回:精神保健制度第13回:衛生法規・行政制度第14回:人口統計と保健統計第15回:期末試験",
        "courseDataUpdatedAt": "2025/01/18"
    },
    "updateAt": "2025/03/21"
}