{
    "lectureCode": "U601022",
    "courseName": "解剖学I[言語]",
    "lecturer": [
        "姉帯飛高(医療保健学部看護学科)",
        "東雅啓(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３０２０１教室"
    ],
    "courceDetails": {
        "courseOverview": "解剖学Ⅰでは人体の正常構造と機能を学修する。解剖学は、病気や機能障害を理解し、それに基づき医療行為を行ううえでの基礎となる。医療行為は人体へのさまざまな介入が含まれるため、人体の構造と機能についての正確な理解を欠けば、行為そのものが害悪をもたらすことになりかねない。本科目は、総合病院において一連のリハビリテーション業務に従事した実務経験に基づき、言語聴覚士に必要な人体の正常構造と機能について解説する実践的科目である。",
        "outcomesMeasuredBy": "言語聴覚士に必要な人体の正常構造と機能について説明できる。",
        "learningOutcomes": "実学に基づく専門能力問題解決力",
        "teachingMethod": "教科書をベースとしたPowerPoint資料による講義を行う。また、アクティブラーニングの一環として、講義中に確認小テストや小課題提出を課すことがある。",
        "notices": "解剖学は暗記頼りの学修に陥ると辛く苦しい。常に余裕を持って、それぞれの構造の名がもつ意味を理解しながらじっくり学修を進めることが肝要である。試験直前に慌てて勉強をはじめると、もれなく暗記地獄が待っている。人体は最も身近な存在であると同時に、最も未知な物質の1つである。自身のからだ・物質的基礎を構成するさまざまな器官（部品）を1つ1つ丁寧に見つめ、人体の精密さと機能（美）をひも解いてゆくように、興味をベースに堅苦しさを抜きにして学修を進めていくのが理想的である。",
        "preparatoryStudy": "講義内容に関連した事前予習課題を課す。その課題の内容と関連付けながら、教科書や参考書の該当範囲に目を通しておくこと。",
        "gradingGuidelines": "期末試験（80％）、提出課題、小テスト、講義態度（20％）を総合的に評価する。",
        "textbook": "系統看護学講座専門基礎分野人体の構造と機能[1]解剖生理学著／坂井建雄・岡田隆夫・宇賀貴紀医学書院",
        "referenceMaterials": "新版からだの地図帳監修／佐藤達夫講談社イラスト解剖学著／松村譲兒中外医学社グレイ解剖学翻訳／秋田恵一エルゼビア・ジャパン",
        "courseSchedule": "第1回：解剖学総論：人体の構成要素・階層性、人体の見方など（姉帯・東）第2回：骨の解剖学：全身の骨と関節（姉帯）第3回：筋の解剖学：頭頸部の筋、呼吸筋、その他大型筋（姉帯）第4回：中枢神経系の解剖学１：脳と脊髄の基本構成、付帯構造（姉帯）第5回：中枢神経系の解剖学２：伝導路（姉帯）第6回：末梢神経系の解剖学１：脳神経（姉帯）第7回：感覚器の解剖学（姉帯）第8回：末梢神経系の解剖学２：脊髄神経、自律神経（姉帯）第9回：循環器系の解剖学：心臓、血管（姉帯）第10回：呼吸器系の解剖学１：気道、発声（姉帯）第11回：呼吸器系の解剖学２：肺、肺胞、呼吸運動など（姉帯）第12回：消化器系の解剖学：消化管と消化腺の基本構成（姉帯）第13回：泌尿生殖器・内分泌器の解剖学（姉帯）第14回：特別講義第15回：口腔解剖学・まとめ（東・姉帯）",
        "courseDataUpdatedAt": "2024\/03\/11"
    },
    "updateAt": "2024\/09\/12"
}