{
    "lectureCode": "U60204",
    "courseName": "小児科学",
    "lecturer": [
        "高木健志(医療保健学部リハビリテーション学科理学療法学専攻)",
        "小原明(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "水"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "小児の発育発達の特徴に基づいて、小児を対象にしたリハビリテーションに必要な小児疾患と小児期の障がいの病態・病像、そしてそれらの診断と治療の概要を学修する。これによって小児リハビリテーションに必要な子どもの観察と評価分析を適切に行う為の医学的背景を理解し、論理的な思考を経て問題解決できる能力の獲得を目指す。特に小児リハビリテーションに関連の深い正常小児の発達、小児神経筋疾患、脳性麻痺などの原因疾患については深く学修する。",
        "outcomesMeasuredBy": "1．健康小児の発育発達を理解し説明できる。2．小児の代表的な疾患の病態と症状について説明できる。3．脳性麻痺の原因病態、原因疾患とその症状について説明できる。4．小児疾患・障がいが、子どもの生活・成長発達・家族に与える影響について説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "15回の講義を授業計画に基づき行う。講義内で適時Web動画・資料動画の供覧、解説する。適時学習に関する指示（課題・振り返りテスト等）をMoodle上に出す。教科書及び授業で配布するスライド資料、Moodle掲載する復習用講義ビデオ、振り返りテストで学習する。課題・振り返りテストは期限1週間での提出・受験を求める。次回の講義で課題の解説を行う。遠隔講義となった場合はオンデマンドビデオ形式で実施する。",
        "notices": "指定教科書は必ず必要。講義終了後復習を、指定教科書と対応させて復習用講義ビデオ、振り返りテスト等を利用して確実に行うことが、履修において鍵となる。復習は課題に取り組む時間を含めて1時間半は最低必要である。講義を受動的に聴講しているだけでは履修できない。",
        "preparatoryStudy": "1年次に履修した解剖学、医学概論、医療科学の基礎、2年時の病理学、公衆衛生学などとの関連があり、それぞれの内容について復習し、授業に臨んでほしい。",
        "gradingGuidelines": "学期末試験の成績(80%)、課題・振り返りテスト（20％）課題、振り返りテストは期限1週間での提出、受験を求める。講義時の出席クリック、振り返りテスト提出、課題が求められた場合は課題の提出、以上の2点（または3点）が揃って、「講義の出席」とみなす。",
        "textbook": "理学療法学作業療法学共通＜標準理学療法学・作業療法学専門基礎分野＞「小児科学」（第5版）医学書院作業療法学＜標準作業療法学＞「発達過程作業療法学」（第3版）医学書院言語聴覚学「言語聴覚士のための基礎知識小児科学・発達障害学」(第3版)医学書院",
        "referenceMaterials": "PT/OTビジュアルテキスト小児理学療法学（第1版）羊土社有益なWeb情報とあわせて講義時とMoodleに紹介する。",
        "courseSchedule": "遠隔講義にともなう内容変更、講義の順番を変更することがある。講義の進行に合わせて変更する事がある。第1回:発達(1)：オリエンテーション・発達理論・運動発達（高木）第2回:新生児（小原）第3回:神経(1)脳性まひ（小原）第4回:神経(2)けいれん・意識障害（小原）第5回:感染症（小原）第6回:呼吸器疾患・アレルギー・予防接種（小原）第7回:血液疾患・小児がん（小原）第8回:先天形態異常・染色体異常（高木）第9回:内分泌・代謝疾患・腎疾患（OT）第10回:循環器疾患（池田）第11回:発達（2）；発達検診・各種評価（高木）第12回:発達（3）；発達障害（OT）第13回:発達（4）；児童発達支援・特別支援教育（OT）第14回:発達（5）；言語・嚥下の発達と疾患（池田）第15回:発達（6）；関連法規（池田）",
        "courseDataUpdatedAt": "2025/03/07"
    },
    "updateAt": "2025/03/21"
}