{
    "lectureCode": "U60206",
    "courseName": "一般臨床医学",
    "lecturer": [
        "清水潤(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "リハビリテーション治療が必要となる患者は、さまざまな合併疾患を伴っていることが多く、これらの内科疾患に関する理解は治療の上で必須である。療法士がリハビリ治療をする患者の背景を理解するのに必要な内科学を中心とした一般臨床医学を理解する。近年、リハビリ治療の対象患者は脳血管障害、整形外科疾患、神経疾患のみならず、内部障害患者や癌患者のリハビリ、生活習慣病の予防などと、療法士の担当範囲は広がっている。講義では幅広く内科疾患を知ることで、将来におけるリハビリ治療をする上で必要な知識を身につける。",
        "outcomesMeasuredBy": "患者の持つ、さまざまな合併要因の病態を理解し、個人の症状や障害にどのように影響を及ぼしているか、分析し評価する能力（分析・評価能力）を身に着けることを目標とする。また、分析・評価の結果、個々の患者に実際にどのような治療を還元できるかを考察する論理的な思考力を身に着けることも目標とする。",
        "learningOutcomes": "論理的な思考力",
        "teachingMethod": "パワーポイントのスライドを用い必要ポイントをノートに記載したものをMoodleに提示し、同時に同じものをプリントした資料を配布して講義がおこなう。毎回の講義の後にGoogleフォームでの小テストをおこない、知識の定着を測り、出来なかった部分の自己チェックを行い復習に役立てる。疑問内容に関してはメールでまたはオフィスアワーに質問し、疑問点を自ら確認の上でさらに追加説明を受けることで理解を深める。",
        "notices": "膨大な量であるが、ただ、まる暗記するのでなく、以前習った生理、解剖に積み重ねて理解していくことが必要である。次回の講義前に小テストを行うので授業後に資料や教科書を見ながら、よく復習をして知識を定着させてほしい。また、15回、毎回違う項目となるため、一回でも欠席するとその部分は欠落することになる。やむを得ず欠席した場合はプリントをもらい、その部分を自己学修して補うことが必要である。",
        "preparatoryStudy": "講義は臓器の疾患ごとにおこなう。毎回の講義のテーマに関係する臓器の解剖学、生理学の知識の復習しておくこと。１年で学習した内容である。（目途：60分程度）毎回の講義のあとには小テストが課題として出されるので復習すること。（目途：30分程度）",
        "gradingGuidelines": "期末試験（100％）で評価する。授業終了後に行う小テストおよび授業に対する取り組みも評価に加味する。",
        "textbook": "なるほど、なっとく内科学南山堂",
        "referenceMaterials": "",
        "courseSchedule": "第1回：内科学の概念、診療の実際第2回：バイタルサイン、診察・診断過程第3回：生活習慣病(1)第4回：生活習慣病(2)第5回：消化器疾患第6回：肝胆膵疾患第7回：前半のまとめテスト第8回：血液疾患第9回：循環器疾患(1)第10回：循環器疾患(2)、呼吸器疾患(1)第11回：呼吸器疾患(2)、感染症第12回：腎疾患、ビタミン、ホルモン第13回：内分泌疾患・アレルギー・膠原病第14回：悪性腫瘍第15回：後半のまとめテスト",
        "courseDataUpdatedAt": "2025/03/07"
    },
    "updateAt": "2025/03/21"
}