{
    "lectureCode": "U61202",
    "courseName": "人間発達学（理学療法）",
    "lecturer": [
        "高木健志(医療保健学部リハビリテーション学科理学療法学専攻)",
        "眞邉一近(兼任講師)",
        "土屋順子(医療保健学部リハビリテーション学科理学療法学専攻)",
        "田中周(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１００３教室"
    ],
    "courceDetails": {
        "courseOverview": "理学療法の対象は全ての年代にまたがっており、治療場面では対象者の心理面や身体面の状態、生活環境を理解した上で、目標設定や治療計画を立てることが重要となる。人間発達学は、人と関係する職種にとって、人間の基礎となる知識を学びとることができる学問の一つである。本講義では、胎児期から老年期までのライフスパンにおいて発達・学習する、身体・運動・心理・社会性の特徴や課題を学ぶと共に、障害がどの過程で生じるかについて学修する。また、乳幼児期における粗大運動機能の獲得がどのようにされるのかについて学び、臨床で適用可能な知識と論理的な思考能力の習得を目指す。また，ディスカッションを通してコミュニケーション能力の習得を目指す。この科目は、実務経験を有する専門職がその経験に基づいた講義を行う実践的な科目です。",
        "outcomesMeasuredBy": "１）胎児期から老年期に発達・学習する身体・運動・心理・社会性の特徴を説明することができる。２）社会性の発達経過の概要が説明できる。３）運動機能の発達過程の概要が説明できる。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力",
        "teachingMethod": "教科書と配布プリントに沿って講義を進める。幼児のイメージを持ちやすくするため、視聴覚教材を取り入れながら授業を行う。幼児の写真から発達経過を予測する課題では、グループワークと発表を行い、学生の主体的な学び（アクティブラーニング）を促す。ノートPC必携。講義中・講義後に外部講師へ質問できなかった場合は，高木が質問を受け付け外部講師からの回答を得るものとする．",
        "notices": "臨床で重要な正常発達の知識や国家試験で出題される可能性のある点は、配布資料に書きとること。胎児期から老年期まで、人間の発達過程を身体・運動・精神の各領域において経時的に理解できるように努めること。",
        "preparatoryStudy": "教科書は授業に対応する章を事前に読んでおくこと。発達は各過程における変化を理解することが重要であり、講義内容を常に復習し、次週の講義に備えること。",
        "gradingGuidelines": "期末試験（80％），講義課題（20％）。加点減点要件：授業態度・授業への貢献度全ての授業への出席を基本とする",
        "textbook": "指定しない",
        "referenceMaterials": "発達を学ぶ―人間発達学レクチャー協同医書出版社",
        "courseSchedule": "第1回：オリエンテーション・社会性の発達1(認知能力の発達)（高木・眞邉）第2回：社会性の発達2(情動・愛着の発達)（眞邉）第3回：社会性の発達3(道徳性の発達)（眞邉）第4回：社会性の発達4(社会性の発達)（眞邉）第5回：社会性の発達5(家族関係の発達)（眞邉）第6回：幼児理解1(発達障害の理解)（眞邉）第7回：幼児理解2(保護者の心理の理解)（眞邉）第8回：運動機能面の発達1（運動発達の理論・原始反射）（高木）第9回：運動機能面の発達2（姿勢と粗大運動）（土屋）第10回：運動機能面の発達3（姿勢と粗大運動）（土屋）第11回：運動機能面の発達4（筋・骨関節）（高木）第12回：運動機能面の発達5（歩行）（田中）第13回：運動機能面の発達6（神経系）（土屋）第14回：運動機能面の発達7（目と手・上肢機能）（田中）第15回：総括（高木）",
        "courseDataUpdatedAt": "2024\/01\/25"
    },
    "updateAt": "2024\/09\/12"
}