{
    "lectureCode": "U63205",
    "courseName": "認知・学習心理学",
    "lecturer": [
        "眞邉一近(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "ヒトが外界の情報を感覚器官を通して受容する感覚・知覚、その情報を処理する認知、その内容を記銘する記憶、それまでに蓄えられた情報を元に分析・整理・結合して新たな表象を得る思考などの認知心理学の領域についてリハビリテーションに関連する実学に基づく専門的な内容について講義する。その後、ヒトの行動が形成・維持・変容する要因の中で学習に関連する非連合学習・連合学習・技能学習・観察学習・ルール支配行動と、学習心理学のトピックとして学習性無力症やその他のトピックスについて講義する。リハビリテーションで用いられる訓練にとって、学習心理学に関連する知識や技能の獲得は、専門能力の獲得のために必要とされる学修である。",
        "outcomesMeasuredBy": "認知心理学および学習心理学に関連した実学に基づく専門能力および論理的な思考力を身につける。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "初回を除く各授業の前に提示された動画あるいは資料を基に学習した内容の確認テストを実施した後、その授業回の内容について講義し、再度、確認テストを行い、知識の定着を図る。授業中にGoogleClassroomによる小テストを実施することがあるので、ノートＰＣ必携。",
        "notices": "各回の具体的な予習・復習の情報が事前に通知されますので、必ず確認し、その指示内容に従って学修を進めてください。また、確認テストは必ず受験するようにしてください。",
        "preparatoryStudy": "事前に掲載された動画あるいは資料をあらかじめ視聴したうえで授業に臨むこと(授業ではその振り返りなど一部反転授業形式で行う)。受講後は、理解度チェックテスト（小テスト）の結果を振り返り、誤った設問や理解が十分でない内容について復習を行う。",
        "gradingGuidelines": "理解度チェックテスト（60％）、およびまとめテスト（40％）の総合点で評価する。フィードバックは、GoogleClassroomにより行う。",
        "textbook": "指定しない",
        "referenceMaterials": "眞邉一近著(2020).ポテンシャル学習心理学,サイエンス社山田弘幸編(2020).言語聴覚士のための心理学医歯薬出版株式会社",
        "courseSchedule": "第1回：（感覚）感覚の種類と感覚器官および順応や残像等の知覚現象について概説する。第2回：（知覚）奥行き知覚・知覚の恒常性・運動知覚・錯視・異種モダリティー間の相互作用・乳児の知覚測定法・知覚の法則等、知覚に関する現象について概説する。第3回：（認知と動機づけ）認知閾・プライミング効果・認知地図・認知的不協和・誤帰属・ステレオタイプ・ストループ効果・ハロー効果・単純接触効果等の認知に関連する現象および要求水準と達成動機等の動機づけについて概説する。第4回：（記憶）記憶の種類と記憶の測定法、および系列位置効果等の記憶に関連する現象や理論について概説する。第5回：（思考）思考の過程・問題解決・アルゴリズム・ヒューリスティック法・推論概念形成等思考に関連する現象や理論について概説する。第6回：（言語）ヒトの言語の基礎とその発達および言語の機能について概説する。第7回：（学習の定義）生得的および習得的行動と初期学習について概説する。第8回：（非連合学習）馴化と鋭敏化について概説する。第9回：（連合学習Ⅰ）般化・自発的回復・分化条件づけ等、レスポンデント条件づけの基礎と応用について概説する。第10回：（連合学習Ⅱ）部分強化等、オペラント条件づけの基礎について概説する。第11回：（連合学習Ⅲ）オペラント条件づけの応用について概説する。第12回：（連合学習Ⅳ）学習性無力症・洞察学習・試行錯誤学習・潜在学習等のトピックスについて概説する。第13回：（感覚運動（技能）学習）練習の効果やフィードバックの効果について概説する。第14回：（観察学習）代理強化・モデリング・般化模倣について概説する。第15回：（ルール支配行動とその他のトピックス）言語的ルールによる行動変容について概説する。その後、選択行動に関連する心理的問題や、社会的促進（抑制）等、認知・学習に関連するトピックスについて概説する。",
        "courseDataUpdatedAt": "2024/12/25"
    },
    "updateAt": "2025/03/21"
}