{
    "lectureCode": "W1104",
    "courseName": "基礎看護技術II（日常生活の援助技術）",
    "lecturer": [
        "岩波浩美(医療保健学部看護学科)",
        "飯塚敏子(医療保健学部看護学科)",
        "宮首由美子(医療保健学部看護学科)",
        "繁永元樹(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "金",
        "金2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１７０２看護実習室２",
        "３１７１４多目的実習室",
        "３１７１６看護実習室３"
    ],
    "courceDetails": {
        "courseOverview": "看護技術の根拠や原理・原則、その技術が提供される対象や場の状況に応じた援助方法を考える基盤を学ぶと共に、看護実践の特徴や看護技術の基本的考え方を学習する。健康的な日常生活行動を促進する援助技術の基本的な知識・技術・態度を学び、それらの成果を活用しシミュレーション演習を行う。また、看護の対象となる人々の日常生活の自立を支援することを通して対象者の健康の保持、増進、回復に貢献するという看護の専門性への理解を深める。1年次前期の「基礎看護技術Ⅰ」、2年次の「基礎看護技術Ⅲ」「看護過程」「ヘルスアセスメント」と共に、専門職として看護を提供するために不可欠な能力を獲得する基盤となる科目である。この科目は、看護の実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "1.日常生活援助技術に必要な基礎的知識について説明する。2.活動・運動を支援し、休息・睡眠を促す援助に必要な知識と具体的方法について説明する。3.活動・運動を支援する援助について、必要な知識を活用し、実施・評価する。4.安楽確保の援助に必要な知識と具体的な援助方法について説明する。5.安楽確保の援助について、必要な知識を活用し、実施・評価する。6.身体の清潔を援助する技術に必要な知識と具体的な援助方法について説明する。7.身体の清潔を援助する技術について、必要な知識を活用し、実施・評価する。8．食事・栄養摂取を促す技術に必要な知識と具体的な援助方法について説明する。9．食事・栄養摂取を促す技術について、知識を活用し、実施・評価する。10.排泄を促す技術に必要な知識と具体的な援助方法について説明する11.排泄を促す技術について、必要な知識を活用し、実施・評価する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "対象の日常生活を援助するために必要な活動・休息、清潔、食事、排泄について、講義・演習を行う。講義では、基本となる知識を習得する。演習では、実際の看護技術の方法を患者・看護師役体験やグループワークを通して、看護技術を思考しながら学習する。これら授業は、知識だけでなく感性や思考を深められるよう、展開する。",
        "notices": "１．講義形式だけでなく、演習を取り入れた授業のため、積極的な講義への参加が必須となる。講義内容の復習、演習に向けた事前課題や指定する動画の視聴も不可欠である。２．各回の授業内容が連動して展開されること、演習が多い科目のため、遅刻・欠席がないように、健康管理をすること。３．演習では、事前学習が不十分な場合、身だしなみが整っていない場合に参加を認めないことがあるため、注意すること。４．本科目は、基礎看護学実習の先行要件科目である。",
        "preparatoryStudy": "事前にテキストを読んで授業に参加すること。視聴覚教材によりイメージ化を図る、要点をまとめるといった事前学習により、授業中の学習がより円滑になる。",
        "gradingGuidelines": "定期試験60％、中間実技試験20％、課題レポート10％、授業態度10％の総合評価とする。",
        "textbook": "任和子他：系統看護学講座専門分野Ⅰ基礎看護学[2]基礎看護技術Ⅰ,医学書院．任和子他：系統看護学講座専門分野Ⅰ基礎看護学[3]基礎看護技術Ⅱ,医学書院．任和子他：根拠と事故防止から見た基礎・臨床看護技術，医学書院",
        "referenceMaterials": "深井喜代子編集：新体系看護学全書基礎看護学②基礎看護技術Ⅰ,メヂカルフレンド社.深井喜代子編集：新体系看護学全書基礎看護学③基礎看護技術Ⅱ,メヂカルフレンド社.",
        "courseSchedule": "第1回：ガイダンス、日常生活援助技術、活動・運動を支援する技術１（講義）（岩波）第2回：休息・睡眠を促す技術２（講義）第3回：活動・運動を支援する技術（演習）車椅子・ストレッチャー、歩行介助（全教員）第4回：活動・運動を支援する技術（演習）車椅子・ストレッチャー、歩行介助（全教員）第5回：安楽確保の援助（講義）（岩波）第6回：安楽確保の援助（演習）罨法（全教員）第7回：身体の清潔を援助する技術１（講義）（宮首）第8回：身体の清潔を援助する技術２（講義）（宮首）第9回：身体の清潔を援助する技術（演習）寝衣交換、シーツ交換（全教員）第10回：身体の清潔を援助する技術（演習）寝衣交換、シーツ交換（全教員）第11回：中間実技試験第12回：中間実技試験第13回：中間実技試験第14回：中間実技試験第15回：身体の清潔を援助する技術３（講義）（宮首）第16回：身体の清潔を援助する技術４（講義）（宮首）第17回：身体の清潔を援助する技術（演習）部分浴（全教員）第18回：身体の清潔を援助する技術（演習）部分浴（全教員）第19回：身体の清潔を援助する技術（演習）洗髪（全教員）第20回：身体の清潔を援助する技術（演習）洗髪（全教員）第21回：身体の清潔を援助する技術（演習）清拭（全教員）第22回：身体の清潔を援助する技術（演習）清拭（全教員）第23回：食事・栄養摂取を促す技術（講義）（岩波）第24回：排泄を促す技術（講義）（岩波）第25回：食事・栄養摂取を促す技術（演習）食事援助（全教員）第26回：食事・栄養摂取を促す技術（演習）食事援助（全教員）第27回：排泄を促す技術（演習）床上排泄、陰部洗浄（全教員）第28回：排泄を促す技術（演習）床上排泄、陰部洗浄（全教員）第29回：食事、栄養摂取を促す技術（演習）、口腔ケア（全教員）第30回：総合演習（全教員）",
        "courseDataUpdatedAt": "2025/03/04"
    },
    "updateAt": "2025/03/21"
}