{
    "lectureCode": "W1103",
    "courseName": "基礎看護技術I（看護共通技術）",
    "lecturer": [
        "岩波浩美(医療保健学部看護学科)",
        "飯塚敏子(医療保健学部看護学科)",
        "宮首由美子(医療保健学部看護学科)",
        "繁永元樹(医療保健学部看護学科)",
        "安井大輔(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３１７０２看護実習室２",
        "３１７１４多目的実習室",
        "３１７１６看護実習室３"
    ],
    "courceDetails": {
        "courseOverview": "看護技術の根拠や原理・原則、その技術が提供される対象や場の状況を考慮した援助方法について、考えられる基盤を学ぶと共に、看護実践の特徴や看護技術の基本的な考えを学習する。看護実践の過程に共通する援助技術の基本的な知識・技術・態度を学ぶ。本科目の受講を通し、「実学に基づく専門能力」、「コミュニケーション能力」、「論理的な思考力」、「分析・評価能力」、「問題解決力」を養う。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "1.患者にとっての基本技術の必要性や意義を説明できる。2.感染予防を推進する技術に必要な知識と具体的な測定方法を説明できる。3.感染予防を推進する技術について、必要な知識を活用し、実施・評価できる。4.快適な環境をつくる技術に必要な知識と具体的な測定方法を説明できる。5.快適な環境をつくる技術について、必要な知識を活用し、実施・評価できる。6.人間関係を成立・発展させるための技術に必要な知識と具体的な測定方法を説明できる。7.効率的で安楽な動きを作り出す技術に必要な知識と具体的な測定方法を説明できる。8.効率的で安楽な動きを作り出す技術について、必要な知識を活用し、実施・評価できる。9.バイタルサインの測定に必要な知識と具体的な測定方法を説明できる。10.バイタルサインの測定に必要な知識を活用し、実施・評価できる。11.看護者としての基本的態度を養うことができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "看護実践の過程に共通する援助技術について、知識と技術の修得を目標とする。授業では、知識だけでなく感性や思考を深められるよう、講義や演習を展開する。",
        "notices": "１．講義だけでなく、演習を取り入れた授業のため、積極的な講義への参加が必須となる。２．授業内容が連動して展開されること、演習が多い科目のため、遅刻・欠席がないように、健康管理をすること。３．演習では、事前学習が不十分な場合、身だしなみが整っていない場合に参加を認めないことがあるため、注意すること。４．本科目は基礎看護学実習の先行要件科目となる。",
        "preparatoryStudy": "事前にテキストや参考書を読んで授業に臨むこと。看護学概論との学習が並行するが、概念と方法を関連付けながら援助技術の根拠を考え、学びを深めること。",
        "gradingGuidelines": "定期試験80％、課題レポート10％、授業態度10％の総合評価とする。",
        "textbook": "任和子他：系統看護学講座専門分野基礎看護学[2]基礎看護技術I，医学書院任和子他：系統看護学講座専門分野基礎看護学[3]基礎看護技術II，医学書院任和子他：根拠と事故防止から見た基礎・臨床看護技術，医学書院",
        "referenceMaterials": "深井喜代子編集：新体系看護学全書基礎看護学②基礎看護技術Ⅰ,メヂカルフレンド社.深井喜代子編集：新体系看護学全書基礎看護学③基礎看護技術Ⅱ,メヂカルフレンド社.",
        "courseSchedule": "第1回:ガイダンス、実習室の使い方（講義）（安井）第2回:感染予防を推進する技術（講義）（安井）第3回:感染予防を推進する技術（演習）：手洗い、個人防護具（マスク、未滅菌手袋）（全教員）第4回:感染予防を推進する技術（演習）手洗い、個人防護具（マスク、未滅菌手袋）（全教員）第5回:快適な環境をつくる技術（講義）（宮首）第6回:快適な環境をつくる技術（演習）環境調整、ベッドメーキング（全教員）第7回:快適な環境をつくる技術（演習）環境調整、ベッドメーキング（全教員）第8回:人間関係を成立・発展させるための技術（講義）（安井）第9回:効率的で安楽な動きを作り出す技術（講義）（安井）第10回効率的で安楽な動きを作り出す技術（演習）体位変換、安楽な体位（全教員）第11回:バイタルサイン測定の技術（講義）（宮首）第12回:バイタルサイン測定の技術（演習）血圧測定（全教員）第13回:バイタルサイン測定の技術（演習）血圧測定（全教員）第14回:バイタルサイン測定の技術（演習）バイタルサイン測定（全教員）第15回:バイタルサイン測定の技術（演習）バイタルサイン測定（全教員）",
        "courseDataUpdatedAt": "2024\/04\/18"
    },
    "updateAt": "2024\/09\/12"
}