{
    "lectureCode": "W1203",
    "courseName": "ヘルスアセスメント",
    "lecturer": [
        "岩波浩美(医療保健学部看護学科)",
        "飯塚敏子(医療保健学部看護学科)",
        "宮首由美子(医療保健学部看護学科)",
        "繁永元樹(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火4",
        "火5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１７０２看護実習室２",
        "３１７１４多目的実習室",
        "３１７１６看護実習室３"
    ],
    "courceDetails": {
        "courseOverview": "医療の高度化・重症化・複雑化に伴い、安全で高度な看護技術の必要性とその能力の獲得が強く望まれている。ヘルスアセスメントは、的確な看護判断と適切な看護実践の提供のための科学的根拠を提供する症状・生体機能管理技術の一つである。本科目は、へルスアセスメントの概念と構成要素を理解し、アセスメントに必要な基本的知識・技術・態度を習得することを目指す。1年次の「基礎看護技術Ⅰ」「基礎看護技術Ⅱ」、2年次の「基礎看護技術Ⅲ」「看護過程」と共に、専門職として看護を提供するために不可欠な能力を獲得する基盤となる科目である。同時に、ヘルスアセスメントは、看護の対象となる人々の健康状態を査定する手段であり、あらゆる発達段階、健康レベルの人々への応用が求められるため、この科目の学習内容は、3年次以降の学習成果を確実に累積するためにも不可欠である。本科目は、看護の実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "１．ヘルスアセスメント・フィジカルアセスメントの意義・目的・技術の概要を述べる。１）ヘルスアセスメント・フィジカルアセスメントの意義・目的を述べる。２）フィジカルアセスメント技術（問診・視診・触診・聴診・打診）の概要を説明する。３）ヘルスアセスメントにおける身体診査・心理的側面・社会的側面のアセスメントの概要を説明する。２．対象者に対する倫理的配慮の必要性を説明し、演習中に実施する。３．全身状態を把握するために必要な健康歴聴取を、5W1Hに沿って実施する。４．人体構造の基礎的知識とフィジカルアセスメント技術を用い、事例について、系統的に状態把握する方法を検討する。５．事例について、主にフィジカルアセスメント技術を用いて情報収集し、アセスメントする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "テキスト、視聴覚教材、既習科目の授業資料を基に事前学習に取り組み、講義に参加する。講義に加え、グループでの演習を実施する。",
        "notices": "1.事前学習・講義・演習を通してヘルスアセスメントの能力を習得する。演習では講義をふまえ技術の習得を目指す。2.各回の授業内容が連動しているため、欠席することのないよう健康管理に十分注意する。3.演習では、事前学習が不十分な場合、身だしなみが整っていない場合に参加を認めないことがある。フィジカルアセスメントに必要なステート等の準備が必要である。4.本科目は、基礎看護学実習の先行要件科目である。",
        "preparatoryStudy": "授業中に事前課題を課すことがある。また、本科目は、既習の専門基礎科目、基礎看護技術Ⅰ・Ⅱ・Ⅲの学習内容の知識を活用する必要がある。シラバス、授業開始時に配布する授業計画を参考に、関連する既習内容を復習しておく。",
        "gradingGuidelines": "定期試験80％、課題レポート10％、授業態度10％の総合評価とする。",
        "textbook": "・茂野香おる他：系統看護学講座専門分野基礎看護学[2]基礎看護技術I,医学書院．・横山美樹：はじめてのフィジカルアセスメント第２版,メジカルフレンド社.",
        "referenceMaterials": "・鎌倉やよい監修：実践するヘルスアセスメントｰ身体の構造と機能からアセスメントを導く，学研.・松尾ミヨ子ほか編：ナーシング・グラフィカ基礎看護学(2)基礎看護技術Ⅰコミュニケーション／看護の展開／ヘルスアセスメント・深井喜代子編集：新体系看護学全書基礎看護学②基礎看護技術Ⅰ,メヂカルフレンド社.",
        "courseSchedule": "第1回:授業ガイダンス、ヘルスアセスメントの概要：講義（岩波）第2回:フィジカルイグザミネーション総論①：講義（岩波）第3回:フィジカルイグザミネーション総論②、バイタルサイン：講義（岩波）第4回:呼吸器系のフィジカルアセスメント：講義（岩波）第5回:循環器系のフィジカルアセスメント：講義（岩波）第6回:消化器系のフィジカルアセスメント：講義（岩波）第7回:呼吸器・循環器・消化器系のアセスメント：演習（全教員）第8回:呼吸器・循環器・消化器系のアセスメント：演習（全教員）第9回:筋・骨格系および神経系のフィジカルアセスメント：講義（岩波）第10回:頭頸部と感覚器のフィジカルアセスメント：講義（岩波）第11回:心理・社会状態のアセスメント：講義（岩波）第12回:事例演習（全教員）第13回:事例演習（全教員）第14回:試験（全教員）第15回:まとめ（全教員）（詳細は第一回授業時に提示する）",
        "courseDataUpdatedAt": "2025/03/04"
    },
    "updateAt": "2025/03/21"
}