{
    "lectureCode": "W1202",
    "courseName": "看護過程",
    "lecturer": [
        "岩波浩美(医療保健学部看護学科)",
        "飯塚敏子(医療保健学部看護学科)",
        "宮首由美子(医療保健学部看護学科)",
        "繁永元樹(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義・演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１７１４多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "看護過程では、看護を系統的に実践するために必要な、知識体系に基づく思考過程を学ぶ。学習内容は、看護過程の概念と構成要素、アセスメントの方法、看護上の問題の特定とその記述、看護計画の構成要素と立案時の留意点、実施・評価であり、講義や演習により学ぶ。これらの学習過程の中で、論理的な思考や判断力を養い、看護観や人間観を深める。1年次の「基礎看護技術Ⅰ」「基礎看護技術Ⅱ」、2年次の「基礎看護技術Ⅲ」「ヘルスアセスメント」と共に、専門職として看護を提供するために不可欠な能力を獲得する基盤となる科目である。同時に、看護過程は、発達段階や健康レベルに関わらず、看護の対象となる個人や家族に看護を提供するための方法論であるため、この科目の学習内容は、3年次以降の学習成果を確実に累積するためにも不可欠である。本科目は、看護の実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "１.看護の対象を全人的に捉えるための必要な情報を収集する。２.看護の対象の情報を、ゴードンの機能的健康パターンをもとに分類し、アセスメントする。３.看護の対象の全体像を把握する。４.看護の対象の看護上の問題を明らかにする。５.抽出した看護上の問題に適切な優先順位をつけ、成果を定める。６.看護上の問題に対する具体的な看護計画を立案する。７.実施した看護による目標達成状況を査定し、それに基づき看護計画を評価、修正する。８.看護職者が看護過程を展開する意義を認める。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義に加え、個人ワーク、グループワークを取り入れながら進める。授業内容の理解や事例展開の課題には、既習科目の知識を活用する必要がある。それらに必要な知識について、授業中に説明を加えるが、自主的に、既習内容の想起、復習により、修得の不十分な知識を補完することが不可欠である。",
        "notices": "１．講義に加え、事例展開を行うため、個人及びグループワークを取り入れている。そのため、事前課題への誠実な取り組みや積極的な授業への参加が必須である。２．１回ごとの学習内容がその後の学習の基盤になるため、遅刻・欠席がないように、健康管理をして参加すること。３．本科目は、基礎看護学実習の先行要件科目である。",
        "preparatoryStudy": "講義前には、テキスト、授業開始時に配布する授業計画を参照し、各回の事前学習を行い参加する。事例展開の個人ワーク、グループワークには、特に人体構造学、人体機能学、病理病態学など、基礎専門科目の知識が不可欠であるため、主体的に復習することを求める。",
        "gradingGuidelines": "定期試験70％、課題（事例展開）20％、授業態度10％の総合評価とする。",
        "textbook": "・任和子他：系統看護学講座専門分野Ⅰ基礎看護学[2]基礎看護技術Ⅰ,医学書院．・リンダJ.カルペニート：看護診断ハンドブック,医学書院.・医療情報科学研究所編：看護がみえるvol.４看護過程の展開,メディックメディア",
        "referenceMaterials": "・黒田裕子：しっかり身につく看護過程改訂第2版，照林社・江川隆子編：ゴードンの機能的健康パターンに基づく看護過程と看護診断,NOUVELLEHIROKAWA．",
        "courseSchedule": "第1回：看護過程とは（岩波）第2回：看護過程の展開アセスメント（１）（岩波）第3回：看護過程の展開アセスメント（２）（岩波）第4回：看護過程の展開看護問題の明確化（１）（岩波）第5回：看護過程の展開看護問題の明確化（２）（岩波）第6回：事例展開演習(アセスメント）（全教員）第7回：事例展開演習（アセスメント）（全教員）第8回：事例展開演習(看護問題の明確化）（全教員）第9回：事例展開演習(看護問題の明確化）（全教員）第10回：看護過程の展開計画立案（岩波）第11回：看護過程の展開実施・評価（岩波）第12回：看護過程の展開実施・評価（岩波）第13回：事例展開演習(計画立案）（全教員）第14回：事例展開演習(実施・評価）（全教員）第15回：事例展開演習まとめ（全教員）",
        "courseDataUpdatedAt": "2025/03/04"
    },
    "updateAt": "2025/03/21"
}