{
    "lectureCode": "W1205",
    "courseName": "小児看護学概論",
    "lecturer": [
        "白石裕子(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３０２１１教室"
    ],
    "courceDetails": {
        "courseOverview": "次世代を担う子どもとその家族の健康生活のために、小児看護が果たす役割と課題について学ぶ。さらに子どもの成長発達の特徴について理解し、成長発達のレベルに応じた日常生活の援助と、母親を中心とした家族に対する支援について学修する。この科目は実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "1．小児看護の対象とその特徴、小児看護の役割を述べることができる。2．小児看護の歴史と将来、関連理論の特徴を述べることができる。3．子どもの最善の利益とは何かについて考察することができる。4．子どもの成長・発達の特徴を述べることができる。5．子どもと家族の特徴を述べることができる。6．子どもを守るための施策と保健活動について述べることができる。7．子どもの成長発達段階に応じ起こりやすい健康障がいと生活援助に必要な内容を説明できる。8．子どもと家族がおかれている状況と健康課題に関心を持ち続けることができる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業計画に基づき、教科書及び授業で配布する資料、視聴覚教材を使用し、パワーポイントに沿って講義する。講義以外に、バズセッション・ワークショップなど参加型の授業形態を取り入れる。毎回、知識確認テストを実施する。",
        "notices": "学修を進める上で専門基礎科目の「家族社会学」、選択科目の「発達心理学」も参考になる。",
        "preparatoryStudy": "シラバスを参考に教科書を一読し、各自目的意識を持って授業に臨んでください。小児看護学概論の学修には、基礎知識として1年次に履修した看護学概論などの知識が不可欠です。また、この科目は、今後学修する各看護学の基礎となるので確実に知識をつけていくことが求められます。授業中の課題には積極的に取り組み、予習・復習などの授業準備を確実にして臨んでください。",
        "gradingGuidelines": "課題レポート（15％）、中間試験（15％）、期末試験（70％）の成績を総合的に評価する。課題や試験のフィードバックはMoodle等を通して行う。",
        "textbook": "1.奈良間美穂他著：系統看護学講座専門分野小児看護学[1]小児看護学概論小児臨床看護総論（医学書院）2.奈良間美穂他著：系統看護学講座専門分野小児看護学[2]小児臨床看護各論（医学書院）",
        "referenceMaterials": "1．ナーシング・グラフィカ小児看護学(2)：小児看護技術第4版(MCメディカ出版）",
        "courseSchedule": "第1回：ガイダンス、子どもとは、小児看護とは、子どもの権利と看護（白石）第2回：小児看護の変遷、子どもと家族をめぐる統計（白石）第3回：子どもの成長発達（白石）第4回：子どもの健康・子どもと遊び（白石）第5回：小児看護で用いられる理論（白石）第6回：子どもと家族（特別講師）第7回：子どもを守るための施策・保健活動の実際現代社会に生きる子どもの健康問題（白石）第8回：まとめと中間試験（全員）第9回：子どもの成長発達と看護（白石）第10回：子どもの健康生活と看護1乳児期の子どもの健康生活（白石）第11回：子どもの健康生活と看護2子どもの栄養と食生活（白石）第12回：子どもの健康生活と看護3幼児期の子どもの健康生活（白石）第13回：子どもの健康生活と看護4学童・思春期の子どもの健康生活（白石）第14回：子どもの健康生活への支援（演習）（小児教員全員）第15回：子どもの健康障がい-医療を受ける子ども権利を擁護する看護の役割-（白石）",
        "courseDataUpdatedAt": "2024\/03\/11"
    },
    "updateAt": "2024\/09\/12"
}