{
    "lectureCode": "W1202",
    "courseName": "看護過程",
    "lecturer": [
        "岩波浩美(医療保健学部看護学科)",
        "飯塚敏子(医療保健学部看護学科)",
        "宮首由美子(医療保健学部看護学科)",
        "繁永元樹(医療保健学部看護学科)",
        "安井大輔(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義・演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１７１４多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "看護過程では、看護を系統的に実践するために必要な、知識体系に基づく思考過程を学ぶ。学習内容は、看護過程の概念と構成要素、アセスメントの展開方法、看護上の問題の特定とその記述方法、計画立案の構成要素と留意点、実施・評価であり、講義や演習で学ぶ。これらの学習過程の中で、論理的な思考や判断力を養い、看護観や人間観を深めていく。本科目の受講を通し、「実学に基づく専門能力」、「コミュニケーション能力」、「論理的な思考力」、「分析・評価能力」、「問題解決力」を養う。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "１.看護の対象を全人的に捉えるための必要な情報を収集できる。２.看護の対象の情報をゴードンの機能的健康パターンをもとに分類し、アセスメントできる。３.看護の対象の全体像を把握することができる。４.対象の看護上の問題を明らかにすることができる。５.抽出した看護上の問題に適切な優先順位をつけ、成果を定めることができる。６.看護の対象の看護上の問題に対する具体的な看護計画を立案できる。７.看護実践の評価とそれに基づいた修正ができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義だけでなく、個人ワーク、グループワークを取り入れながら進めていく。講義内容や事例展開では、今までの学習が基礎となる科目であるため、今まで学習した科目の想起や復習が必要な知識として求められる授業である。",
        "notices": "１．講義だけでなく、事例展開の中で個人及びグループワークを取り入れている。そのため、事前課題の取り組みや積極的な授業への参加が必須となる。２．遅刻・欠席がないように、健康管理をして参加すること。３．本科目は基礎看護学実習の先行要件科目である。",
        "preparatoryStudy": "講義前には、講義に使用するテキストやシラバスを参照し事前学習を行い参加する。看護過程の演習に臨むにあたり、人体構造学、人体機能学、病理病態学などの基礎専門科目の知識が必要となるため復習しておくことが必要である。",
        "gradingGuidelines": "定期試験70％、課題レポート20％、授業態度10％の総合評価とする。",
        "textbook": "・黒田裕子：しっかり身につく看護過程改訂第2版、照林社・リンダJ.カルペニート、看護診断ハンドブック",
        "referenceMaterials": "江川隆子編：ゴードンの機能的健康パターンに基づく看護過程と看護診断,NOUVELLEHIROKAWA．",
        "courseSchedule": "第1回：看護過程とは、アセスメント（安井）第2回：看護過程の展開アセスメント（１）（安井）第3回：看護過程の展開アセスメント（２）（安井）第4回：看護過程の展開看護問題の明確化（安井）第5回：看護過程の展開看護問題の明確化（安井）第6回：事例展開演習(アセスメント）（全教員）第7回：事例展開演習（アセスメント）（全教員）第8回：事例展開演習(看護問題の明確化）（全教員）第9回：事例展開演習(看護問題の明確化）（全教員）第10回：看護過程の展開計画立案（安井）第11回：看護過程の展開実施・評価（安井）第12回：看護過程の展開実施・評価（安井）第13回：事例展開演習(計画立案）（全教員）第14回：事例展開演習(実施・評価）（全教員）第15回：事例展開演習まとめ（全教員）",
        "courseDataUpdatedAt": "2024\/04\/18"
    },
    "updateAt": "2024\/09\/12"
}