{
    "lectureCode": "W1302",
    "courseName": "母性看護学II（産褥期・新生児期の看護）",
    "lecturer": [
        "野澤美江子(医療保健学部看護学科)",
        "望月良美(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１７０２看護実習室２",
        "３１７１４多目的実習室",
        "３１７１６看護実習室３"
    ],
    "courceDetails": {
        "courseOverview": "マタニティサイクル期にある母性看護の対象に対する看護の方法論を学ぶ科目である。特に2年次に「母性看護学Ⅰ」で学習した妊娠期、分娩期の対象に対する看護に引き続き、産褥期、新生児期の対象の特徴とその看護について学ぶ。具体的には、産褥期・新生児期にある対象の特徴を理解し、ウェルネスの視点から各時期における対象の健康の保持増進、健康逸脱の予防、健康への回復過程における看護の目的・方法を学ぶ。また、事例を通して各対象のニーズに応じたウェルネス志向の看護過程の展開方法を学ぶ。加えて、褥婦・新生児の観察と看護援助の方法について技術演習を通して学ぶ。この科目は、医療現場において母性看護に従事した実務経験に基づき、大学で学ぶ基礎的な看護の知識や技術が実践場面でどのように活用されているかについて解説する実践的科目である。",
        "outcomesMeasuredBy": "1.産褥の経過と褥婦の身体的・心理社会的特徴について説明できる。2.褥婦とその家族への看護について説明できる。3.新生児の正常な経過と生理的・形態学的特徴について説明できる。4.新生児とその家族への看護について説明できる。5.産褥期・新生児期に生じやすい疾患とその看護について学ぶ。6.褥婦と新生児、その家族に対する看護過程の展開方法について事例を通してイメージできる。7.褥婦、新生児の観察と援助の方法が理解できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1.授業計画に基づき、教科書及び授業で配布する資料、パワーポイントを用いて行うが、事前課題をもとに指名-解答-解説を中心にしたアクティブラーニング形式を取り入れて行う。2.対象の特徴や看護場面のイメージ化を図るために、モデルやDVDなど視聴覚教材を用いる。3.毎回授業開始時に「リアクションシート」（出席表を兼ねる）を受け取り、考えたことや感じたこと等を記載して授業終了後に提出する。",
        "notices": "1.本科目は、3年次の領域別実習の先行要件となっている。2.母性看護学実習に直結する学修内容であるため、積極的に講義に参加することが必要である。3.ウェルネス志向の看護過程の展開方法を習得し、母性看護学実習に備えてほしい。",
        "preparatoryStudy": "1.授業計画を参考に教科書を一読し、事前課題に取り組んだ上で授業を受ける。一人一人、目的意識をもって授業に臨んでほしい。2.基礎知識として、1年次に履修した「人体構造学」、「人体機能学」、「人体構造機能学演習」、2年次に履修した「疾病治療論Ⅲ」、「母性看護学概論」、「母性看護学Ⅰ」などの知識が不可欠である。関連科目の予習・復習も並行して行い、授業準備を確実にして臨んでほしい。",
        "gradingGuidelines": "課題（30％）、期末試験（70％）を総合的に評価する。最終授業で全体に対するフィードバックを行う。",
        "textbook": "森恵美他編：系統看護学講座専門分野母性看護学[2]母性看護学各論（医学書院）荒木奈緒他編：ナーシンググラフィカ母性看護技術（メディカ出版）",
        "referenceMaterials": "毎回の講義時に関連した書籍を紹介する。",
        "courseSchedule": "第1回：ガイダンス、新生児の理解と看護（1）（望月）第2回：新生児の理解と看護（2）（望月）第3回：新生児期の異常と看護（望月）第4回：新生児のアセスメントの実際（望月）第5回：褥婦とその家族の理解と看護（1）（望月）第6回：褥婦とその家族の理解と看護（2）（望月）第7回：褥婦とその家族の理解と看護（3）（望月）第8回：産褥期の異常と看護（望月）第9回：帝王切開を受けた褥婦の看護（黒川／野澤）第10回：褥婦のアセスメントの実際（望月）第11回：ウェルネス志向の看護過程（1）（全員）第12回：ウェルネス志向の看護過程（2）（全員）第13回：ウェルネス志向の看護過程（3）（全員）第14回：褥婦・新生児のアセスメントと援助：全身観察、バイタルサイン測定（全員）第15回：まとめ：母性看護学実習に向けて（全教員）",
        "courseDataUpdatedAt": "2025/01/19"
    },
    "updateAt": "2025/03/21"
}