{
    "lectureCode": "W1309",
    "courseName": "在宅看護学演習",
    "lecturer": [
        "浅海くるみ(医療保健学部看護学科)",
        "大木正隆(医療保健学部看護学科)",
        "久長正美(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月4",
        "月5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３０２１１教室"
    ],
    "courceDetails": {
        "courseOverview": "療養者・家族の状態が多様化する在宅看護の現状に対応するよう、在宅看護における援助技術、および具体的な看護の展開を演習（事例展開やグループワーク）を通して学ぶ。また在宅看護学で特に重要とされる多施設・多職種連携、社会資源の有効活用、ケアマネジメントの実際について理解することにより、在宅療養支援の実際と看護職の専門性を学ぶ。演習では、療養者本人の疾患や生活に対するアセスメントのみならず、家族も看護の対象として捉えることで様々な家族像を理解し、思いや希望を尊重した支援の在り方を学ぶ。本科目は2年後期の在宅看護学Ⅰからの継続科目であり、3年後期の在宅看護学Ⅱ、4年前期の在宅看護学実習の基礎となる科目である。また本科目は、実務経験を有する専門職がその経験に基づいた演習を行う実践的科目である。",
        "outcomesMeasuredBy": "1.在宅看護における援助技術、および具体的な看護の展開方法を理解する。2.在宅療養支援の実際と看護職の専門性について理解を深めるために在宅看護における多施設・多職種連携、社会資源の有効活用、ケアマネジメントの実際について理解する。3.在宅療養者・家族の療養上の課題をアセスメントし、必要な看護課題の抽出・計画立案ができる。4.上記の到達目標を理解した上で、本科目の位置づけについて説明できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義・演習(事例展開やグループワーク）",
        "notices": "本科目で課す課題にスムーズに取り組めるよう2年次で配布・使用した授業資料、教科書を熟読して授業に臨むこと。事例展開・グループワークでは、積極的かつ主体的にメンバー間で協力しながらよりよい学習成果があがるように意識して進めること。本科目の単位は在宅看護学実習の履修要件となる。本科目は在宅看護学実習の基礎となる科目であるため、本科目を通して在宅看護の特徴を十分理解することを求める。",
        "preparatoryStudy": "本科目で課す課題にスムーズに取り組めるよう2年前期：在宅看護学概論、2年後期：在宅看護学Ⅰで配布した授業資料および教科書を熟読し、知識を整理の上、授業に臨むこと。",
        "gradingGuidelines": "授業毎の成果物（30％）・リフレクションシートの記載内容（20％）、最終提出課題（50％）、授業の取り組み状況を加味し、総合的に評価する。",
        "textbook": "・ナーシング・グラフィカ地域・在宅看護論➀地域療養を支えるケア第7版・看護実践のための根拠がわかる在宅看護技術第4版メヂカルフレンド社",
        "referenceMaterials": "第1回：在宅における看護過程の展開（浅海）第2回：股関節置換術後の療養者・家族における初回訪問の事例展開（浅海）第3回：糖尿病の独居療養者における事例展開（浅海）第4回：人工呼吸器（TIV）を装着されているALS療養者・家族における事例展開（大木）第5回：在宅経管栄養法・膀胱留置カテーテルを必要とする脳血管疾患後遺症の療養者・家族における事例展開①（大木）第6回：在宅経管栄養法・膀胱留置カテーテルを必要とする脳血管疾患後遺症の療養者・家族における事例展開②（大木）第7回：在宅がん終末期にある療養者・家族における事例展開（大木）第8回：在宅非がん終末期にある療養者・家族におけるGW（大木）第9回：在宅ケアマネジメント（ケアプラン）①（久長・浅海）第10回：在宅ケアマネジメント（ケアプラン）②（久長・浅海）第11回：在宅リハビリテーションの実際①（武藤）第12回：在宅リハビリテーションの実際②（武藤）第13回：終末期における医学的管理①（吉田）第14回：終末期における医学的管理②（吉田）第15回：まとめ",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/03\/05"
    },
    "updateAt": "2024\/09\/12"
}