{
    "lectureCode": "W1320",
    "courseName": "認知症ケア",
    "lecturer": [
        "安井大輔(医療保健学部看護学科)",
        "佐藤智子(医療保健学部看護学科)",
        "篠田巴留香(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１７１４多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "認知症の類型および特性を理解し、認知症の人それぞれの健康と自尊心を維持できる生活を支援するための理論やケア方法について学ぶ。また、認知症の人を支える家族が抱える諸問題や課題を知り、社会資源の活用を理解することにより、QOL向上に向けた看護介入を学修する。本科目の受講を通し、「認知症の正しい理解」、「コミュニケーション技法の習得」、「論理的な思考力」、「アセスメントに基づいたケア実践方法の工夫」等の知識技術を養う。この科目は、医療介護の現場において認知症者への看護に従事した経験を有する専門職,看護管理者や認知症者とともに暮らす経験をした家族などが、大学で学ぶべき認知症看護の基礎的な知識・技術について解説する実践的科目である。",
        "outcomesMeasuredBy": "１.認知症の病態と関連要因を説明できる。2．認知症を伴いながら生活する高齢者を理解し、エビデンスに基づいたかかわりやケアを説明できる。3．認知症者の思いを理解し、専門的なアプローチについて説明できる。4．認知症者の家族の話を聞き、家族支援について考え説明できる。5．認知症を伴いながら生きることの困難を学び、認知症看護が担う役割を考察することができる。6．組織で認知症ケアの質改善に取り組む必要性を考察することができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1．学修の手引きに基づき、教科書や配布資料を参考に視聴覚教材を基にした講義を行う。2．体験型授業、グループワーク、課題発表により授業を進める。3．毎回リアクションペーパーに授業の感想・質問等を記載し、授業終了後に提出する。4．授業当日までに事前課題に取り組み、授業後は事後課題に取り組み、反復学習の積み重ねにより授業内容の理解を深める。",
        "notices": "1．予習復習を前提に授業を進めるので必ず予習を行い授業に参加しましょう。2．授業はグループワークやクラス討議・体験型授業を含む授業形式です。積極的かつ自主的な学修態度が求められるため、意見を述べる準備を整えましょう。4．事前・事後課題の提出期限や方法は必ず守ってください。5．指定された教科書は必ず持参してください。6．授業で配布する資料は必ず目を通し、個々にファイルしてください。授業中は積極的にメモしましょう。",
        "preparatoryStudy": "・認知症高齢者とその家族への理解を深めるため、教科書を読み、自身が考えたことをまとめておきましょう。",
        "gradingGuidelines": "●事前・事後課題25％●定期試験70％●授業態度5％",
        "textbook": "1.酒井郁子,鈴木みずえ著：パーソン・センタード・ケアでひらく認知症看護の扉.南江堂,2017",
        "referenceMaterials": "参考書1.鈴木みずえ著:アセスメントフローで学ぶパーソン・センタード・ケアに基づく急性期病院の高齢者看護.日本看護協会出版会,20212.Dr.BereMiesen・矢吹知之著：わたしが私であるために－認知症の人がもつ不安，恐れ，そして安心－,ワールドプランニング",
        "courseSchedule": "1．4/10認知症ケア総論2．4/17パーソン・センタード・ケアの理念と枠組み3.4/24認知症者への基本的な対応、ICFの考え方、社会資源4．5/8せん妄ケアと認知症ケア5．5/15組織で取り組む認知症ケア6．5/22在宅で暮らす認知症高齢者へのケア7．5/29急性期病院における認知症ケアと課題8．6/5確認テスト",
        "courseDataUpdatedAt": "2025/03/05"
    },
    "updateAt": "2025/03/21"
}