{
    "lectureCode": "W1326",
    "courseName": "成人看護学実習[2021年以前]",
    "lecturer": [
        "岩月すみ江(医療保健学部看護学科)",
        "西尾奈緒美(医療保健学部看護学科)",
        "折坂真理(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 5,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本科目は1年次からの既習知識および、２～３年次の「成人看護学概論」「成人看護学Ⅰ」「成人看護学Ⅱ」「成人・高齢者看護技術演習」で学んだ知識と技術を用いて、成人期の様々な健康状態にある対象者（患者とその家族）への看護の実際を学び実践する科目である。対象者の発達段階、生活背景を理解し、疾患や治療が日常生活にどのような影響を及ぼすのかを理解し、セルフケアを促進する看護について学修する。受け持ち事例実習では、急性期、リハビリテーション期、慢性期ならびに、終末期にある対象者の看護をとおして、その人らしく生きる過程を支援する知識と技術について学ぶ。専門分野実習では、高度化および専門分化する保健、医療および福祉の現場で療養する患者の理解を深め、看護の実際と役割について学ぶ。この科目は、医療現場において実務経験の豊富な指導者と担当教員の下でなされる実践的科目である。",
        "outcomesMeasuredBy": "1.対象者の全体像を踏まえ論理的思考に基づいた個別性ある看護を看護過程を用いて展開できる。2.対象者の健康状態、治療を理解するために必要な知識・技術を判断し、看護実践に活用できる。3.専門分野（手術室、退院支援・退院調整等）における看護実践と継続看護について理解できる。4.看護学生としてふさわしい責任感、倫理観を養い、対象者との関係を築く態度・能力を培う。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1．初日の学内ではオリエンテーションを受け、知識と技術の準備状況を確認する。2．病院実習初日では、臨床指導者から病棟オリエンテーションを受ける。3．受持ち事例実習は、急性期、周手術期、リハビリテーション期、慢性期、終末期にあるいずれかの対象者を受け持ち、看護過程を展開し、科学的根拠に基づいた看護実践を行う。4．専門分野実習では、手術室や外来で実施する治療や検査などを見学する。5．毎日のカンファレンスで実践を振り返り、その学びをグループメンバーと共有する。6．臨地実習で得た学びを、文献を活用しながら客観的かつ内省的に言語化しレポートとして学習成果をまとめる。",
        "notices": "1．成人看護学実習要項を熟読し、自らの実習目標を明確にしたうえでその達成のために自主的に学修する。2．実習では、臨地実習指導者、担当教員への報告・連絡・相談・確認を適時行う。3．自身の健康状態に留意し、食事・睡眠・活動などを管理すると共に、感染症予防行動をとる。4．事故防止、感染防止、守秘義務ならびに看護学生として留意すべき事項については、「臨地実習のてびき」を必ず精読し実習に臨む。",
        "preparatoryStudy": "1．学習課題、実習目標を設定し、規定の用紙に整理する。2．実習病院および、実習病棟の概要と特徴について調べる。3．「人体構造学」「人体機能学「病理病態学Ⅱ」「疾病治療論Ⅰ・Ⅱ」「成人看護学概論」「成人看護学Ⅰ」「成人看護学Ⅱ」「成人・高齢者看護技術演習」を復習しておく。4．予め、提示された事前課題に取り組み、実習中に活用できるよう準備する。",
        "gradingGuidelines": "成人看護学実習における目的・目標に照らし合わせ、主体的な実習への参加状況、実習記録、提出課題を総合的に評価表に基づいて判断して評価する。実習記録および、提出課題については、ルーブリック評価を用いて評価する。",
        "textbook": "指定しない",
        "referenceMaterials": "成人看護学概論、成人看護学Ⅰ、成人看護学Ⅱで使用した教科書や参考図書成人・高齢者看護技術演習で配布した資料",
        "courseSchedule": "第1回（月）：学内オリエンテーション（全教員）第2回（火）～第9回（木）：病棟実習：急性期にある患者を受持ち看護過程を展開（全教員）第10回（金）：第2回～第9回の実習のまとめ第11回（月）：学内オリエンテーション（全教員）第12回（月）～第14回（木）：手術室または、外来での見学実習（全教員）第15回（金）：第12回～第14回の実習のまとめ第16回（月）：学内オリエンテーション（全教員）第17回（火）～第24回（木）：病棟実習：慢性期、終末期にある患者を受持ち、看護過程を展開（全教員）第25回（金）：第16回～実習のまとめ（全教員）",
        "courseDataUpdatedAt": "2024\/01\/12"
    },
    "updateAt": "2024\/09\/12"
}