{
    "lectureCode": "W1401",
    "courseName": "在宅看護学実習（ステーション）",
    "lecturer": [
        "大木正隆(医療保健学部看護学科)",
        "浅海くるみ(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "地域包括ケアシステムにおける病院と地域との多職種・多施設連携、社会資源の活用の実際から継続看護に必要とされる知識・技術・態度を修得する。さらに自宅等で生活を送る療養者・家族がもつ健康課題を理解し、課題解決に必要な在宅看護の知識・技術・態度を統合する。以上から様々な健康レベルにある療養者・家族の生活を支える地域包括ケアシステムのあり方を考える。また本科目は看護の統合分野に位置づけられていることからも、在宅看護学分野のみならず既修の全看護分野の知識・技術を統合して学ぶことで地域包括ケアシステムのあり方を考える。この科目は、医療現場において実務経験を有する専門職が、その経験に基づいた実習を行う実践的科目である。",
        "outcomesMeasuredBy": "１.退院支援(調整)部門１.退院支援(調整)を必要とする患者・家族について理解を深める。２.退院支援(調整)の実際を通し、退院後の療養生活に向けたケアの継続性について学ぶ。３.退院支援(調整)部門のスタッフの役割(院内の病棟看護師等との役割分担)について理解する。４.退院に向け院外との多職種・多施設連携、社会資源の活用の実際から、地域包括ケアシステムの在り方を考える。訪問看護ステーション１.看護提供の実際について、同行訪問等を通して理解を深める。２.在宅療養者・家族の療養上の課題をアセスメントし、必要な看護援助の抽出ができる。３.訪問看護ステーションの機能と訪問看護師の役割について理解する。４.在宅療養者・家族の療養生活を支える多職種・多施設連携、社会資源の活用の実際から、地域包括ケアシステムのあり方を考える。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "病院の退院支援(調整)部門、および訪問看護ステーションにて実習を行う。具体的な実習の展開方法については、実習オリエンテーションの際に明示する。実習終了後に評価面接を実施し、実習での学びのプレゼンテーションとディスカッションを行う。",
        "notices": "履修に際しては先行要件を満たしていること。実習施設では、日常業務の上に、学生のための実習指導を受け入れてくれていることを忘れないこと。学生が遅刻したり、集合場所を間違えたりすれば業務を妨害することになる。健康管理をしっかり行い、欠席・遅刻をしないこと。地域住民と接する機会が多い他、利用者宅にあがり、療養者(児)とその家族に接することになる。服装、挨拶、自己紹介、立ち振る舞いなどの基本的マナー、そして看護学生としてのモラルを守ること。",
        "preparatoryStudy": "実習に向けて事前課題を課すため、指定された期限内に必ず提出すること。",
        "gradingGuidelines": "在宅看護学実習の目的・目標に基づいた実習への取り組み・態度、実習記録等を含む評価表に沿って評価する。また学習内容の定着のため、現場・学内でのカンファレンスを通して全体に対するフィードバックを行う。",
        "textbook": "これまでの講義・演習で使用したもの。",
        "referenceMaterials": "",
        "courseSchedule": "第1回：初日退院支援部門における学内オリエンテーション（全教員）第2回：1週目退院支援部門等での実習（全教員）第3回：2週目訪問看護ステーションでの実習（全教員）第4回：最終日学内でのまとめ・カンファレンス（全教員）",
        "courseDataUpdatedAt": "2025/01/16"
    },
    "updateAt": "2025/03/21"
}