{
    "lectureCode": "W5103",
    "courseName": "一般検査学・寄生虫学",
    "lecturer": [
        "奥橋佑基(医療保健学部臨床検査学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１０１４教室"
    ],
    "courceDetails": {
        "courseOverview": "一般検査学では、尿、髄液、穿刺液、胃液、十二指腸液、喀痰、糞便などの臨床検体の成分分析について学ぶ。これらの検査はスクリーニング検査として行われることが多く、診療において重要な役割を果たす。授業内容は種々の検体の採取・保存法、成分分析法、臨床的意義について学ぶ。寄生虫病は複雑な寄生適応現象や生活史、ヒトの社会行動などが背景に成立する感染症であり、公衆衛生学的にもユニークな位置づけにある。最近の食生活の変化やペットなど動物との接触の濃密化に伴って寄生虫病も多様化し、増加している。この講義ではそのようなヒトの内部および外部寄生虫の病害を教授し、その診断に必要な知識と技術を涵養する。",
        "outcomesMeasuredBy": "講義において習った知識を実習で十分に活用することで、実学に基づく専門能力および分析・評価能力を養い、3年次の臨地実習先で十分に活用できることを目標とする．",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "教科書に沿った講義にスライドを用いて、検体の取り扱い方や測定方法などを視覚的にわかりやすく説明する。各章の終了時に国家試験を意識した習熟度の確認を行う。またZoomを併用し、適宜理解度確認テストを行いながら講義を行う学生参加型の講義を行う。",
        "notices": "一般検査学では扱う検体の種類が多種であり、欠席するとその部分が欠落するため、注意すること。寄生虫学では基礎的な生物学、生化学の知識はすでに習得済みとして講義を進める。",
        "preparatoryStudy": "（予習）講義内容に関する配布資料や教科書の該当箇所を読んでくる(90分）（復習）配布資料や教科書などについて復習する(90分）毎回Moodleに小テストをアップするので予習復習として活用すること。",
        "gradingGuidelines": "筆記試験による評価を行う。",
        "textbook": "最新臨床検査講座「一般検査学」（医歯薬出版）最新臨床検査講座「医動物学」（平山謙二著，医歯薬出版株式会社）",
        "referenceMaterials": "講義中に配布する資料を中心に講義を行う。",
        "courseSchedule": "第1回：尿検査１尿の生成と組成、一般的性状、尿試験紙第2回：尿検査2化学的検査（尿糖、尿蛋白など）第3回：尿検査3化学的検査（アセトン体、胆汁色素、ウロビリン体など）第4回：尿沈渣検査1（沈渣標本作製法、標本の見方（細胞成分））第5回：尿沈渣検査2（標本の見方（結晶、円柱など））第6回：尿自動分析装置、腎機能検査第7回：脳脊髄液検査（生成と組成、一般的性状、化学的検査法、細胞学的検査法）第8回：糞便検査（生成と組成、一般的性状、糞便検査法）第9回：その他の一般検査（喀痰、精液、穿刺液など）第10回：一般検査学まとめ第11回：寄生虫の分類と疾患との関係第12回：各種寄生虫の生態・鑑別と疾患との関係1（線虫類、吸虫類）第13回：各種寄生虫の生態・鑑別と疾患との関係2（条虫類、原虫類）第14回：各種寄生虫の生態・鑑別と疾患との関係3（衛生動物）第15回：寄生虫学まとめ",
        "courseDataUpdatedAt": "2025/01/08"
    },
    "updateAt": "2025/03/21"
}