{
    "lectureCode": "W5221",
    "courseName": "医動物学（含む実習）[2021年以前]",
    "lecturer": [
        "岡崎充宏(医療保健学部臨床検査学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義・実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金3",
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "感染性病原体の中で、寄生虫は宿主と同じ真核生物であり、一部は多細胞動物である点で細菌やウイルスと大きな違いがある。複雑な寄生適応現象や生活史、ヒトの社会行動などが背景に成立する感染症であり、公衆衛生学的にもユニークな位置づけにある。最近の食生活の変化やペットなど動物との接触の濃密化に伴って寄生虫病も多様化し、増加している。この講義ではそのようなヒトの内部および外部寄生虫の病害を教授し、その診断に必要な知識と技術を涵養する。",
        "outcomesMeasuredBy": "1.寄生虫症についての診断法の知識・技術を学び、診断のための正しい方法の選択および適切な診断能力を習得するとともに、動物由来および輸入寄生虫症の知識を習得し、新興・再興感染症など今日の感染症の動向を理解できるようになる。2.外部寄生虫または病原体媒介動物の医学的意義を理解し、診断、防除に関する正しい知識を習得する。3．この講義および実習において実学に基づく専門能力および分析・評価能力を養い、3年次の臨地実習先で十分に活用できることを目標とする．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "教科書に沿った講義にパワーポイントによる写真や図のスライドを加える。実習は検査の方法および顕微鏡による寄生虫標本の観察。",
        "notices": "基礎的な生物学、生化学の知識はすでに習得済みとして講義を進める。",
        "preparatoryStudy": "授業項目について教科書および参考図書で予習してから講義に臨むこと。講義中には板書内容だけでなく必要なメモをノートし、復習に役立ててほしい。実習は講義で得た知識を確認する機会であるから、教科書、参考図書およびノートで十分に予習してから臨むことを期待する。",
        "gradingGuidelines": "授業態度、定期試験（実習試験を含む）および実習スケッチを総合して判定する。その比率は概ね20％、70％、10％とする。",
        "textbook": "最新臨床検査学講座医動物学（平山謙二著，医歯薬出版株式会社）医歯薬出版に沿って講義を行うが、参考図書も購入するか図書館を利用するかで予習・復習することが望ましい。",
        "referenceMaterials": "寄生虫学テキスト（上村清・井関基弘・木村英作・福本宗嗣著）、文光堂、2008年医動物学（吉田幸雄・有薗直樹著）、南山堂、2008年",
        "courseSchedule": "＜講義＞第1回：寄生虫学総論第2回：線虫類総論、線虫類各論Ⅰ（回虫、その他の回虫類）第3回：線虫類各論Ⅱ（幼虫移行症；アニサキス類、顎口虫類、広東住血線虫、旋尾線虫幼虫、犬糸状虫）第4回：線虫類各論Ⅲ（蟯虫、鉤虫類、東洋毛様線虫、糞線虫）第5回：線虫類各論Ⅳ（鞭虫、旋毛虫、糸状虫類、メジナ虫）第6回：吸虫類総論、吸虫類各論Ⅰ（住血吸虫類）第7回：吸虫類各論Ⅱ（肝蛭、肥大吸虫、棘口吸虫、肝吸虫）第8回：吸虫類各論Ⅲ（横川吸虫、異形吸虫類、肺吸虫類）第9回：条虫類総論、条虫類各論Ⅰ（裂頭条虫類）第10回：条虫類各論Ⅱ（無鉤条虫、有鉤条虫、包条虫類）第11回：条虫類各論Ⅲ（小形条虫、縮小条虫、瓜実条虫）第12回：原虫類総論、原虫類各論Ⅰ（赤痢アメーバ、大腸アメーバなど）第13回：原虫類各論Ⅱ（腟トリコモナス、トリパノソーマ類、リーシュマニア類）第14回：原虫類各論Ⅲ（トキソプラズマ、クリプトスポリジウム、マラリア原虫）第15回：衛生動物総論・各論＜実習＞第1回：糞便検査法：直接薄層塗抹、セロファン厚層塗抹、飽和食塩水浮遊、MGL法第2回：虫卵の観察：回虫卵、鞭虫卵、鉤虫卵、肝吸虫卵、横川吸虫卵、肺吸虫卵、住血吸虫卵、無鉤条虫卵、日本海裂頭条虫卵、マンソン裂頭条虫卵、小形条虫卵第3回：血液塗抹法：薄層塗抹・厚層塗抹・染色、標本の観察Ⅰ：ネズミマラリア原虫の薄層・厚層塗抹標本第4回：標本の観察Ⅱ：ランブル鞭毛虫、赤痢アメーバ、熱帯熱マラリア原虫、三日熱マラリア原虫、トキソプラズマ（衛生動物：イエダニ、アカツツガムシ、ケジラミ）第5回：生きた寄生虫の観察：魚（スケトウダラの解剖→寄生虫採集）",
        "courseDataUpdatedAt": "2024/01/21"
    },
    "updateAt": "2024/12/09"
}