{
    "lectureCode": "W5312",
    "courseName": "臨地実習",
    "lecturer": [
        "岡崎充宏(医療保健学部臨床検査学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 15,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "臨地実習では、大学で学んだ接遇や知識が医療の現場でどのように利用されているかを実感し、知識を深める。患者への接し方、検体の受付、検体の流れ、実際の検査の方法、結果の評価と管理、緊急時の対応方法、他の医療従事者とのチーム医療など、学内では学べない実学に基づく専門能力、コミュニケーション能力および分析・評価能力を身につける。",
        "outcomesMeasuredBy": "臨地実習で学んだ実際の医療現場における臨床検査技師の業務内容について説明できる。臨床検査技師として必要な知識や経験を増やすことができる。接遇について的確な状況把握を行い適切に対応できる。自分自身が理解できていない箇所を積極的に学ぶ姿勢や理解できている箇所をアピールすることができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "各臨地実習先の施設において臨床検査部門内を７～８の部所にわけ、１部所を１～２週間間隔で順次移動し、実際の臨床現場での体験実習を行う。週末ごとに1週間の実習内容や自己評価を行う。また、適時、大学側担当教員に実習報告書内容を連絡する。また、適宜、実習に関する各種連絡を行う。",
        "notices": "医療現場に携わる一員として、体調管理に十分に配慮するとともに体調不良時などでは適切な報告や行動ができるようにすること。個人情報の遺漏がないよう厳重に管理すること。実際の患者や患者検体に直接接する機会であることを十分に自覚して、服装や言葉使いに気をつける。また、実習および見学は積極的に行う。",
        "preparatoryStudy": "各種ガイダンスには必ず参加し理解するとともに各日程の確認を行うこと。これまでに復習してきた科目の知識を臨床現場でどのように利用され、活用されているのかを学ぶことが重要であり、十分な予習・復習が大切である。また、臨床現場での貴重な体験をレポートにまとめることも知識の整理に必要である。",
        "gradingGuidelines": "臨地実習施設による総合評価（70％）、実習態度（10％）、週毎の報告書提出（10％）、実習終了後の発表会（10％）で総合的評価する。",
        "textbook": "学内授業で用いた教科書、配布資料",
        "referenceMaterials": "第1回：オリエンテーリング第2回：臨床検査総論臨地実習Ⅰ（検体取扱、尿検査、便検査、胃液検査）第3回：臨床検査総論臨地実習Ⅱ（十二指腸液検査、髄液検査、穿刺液検査、喀痰検査）第4回：病理組織細胞学臨地実習（組織の切り出し、組織の包埋・薄切・染色、細胞診標本作成・観察）第5回：臨床生理検査学臨地実習Ⅰ（循環器系の検査、神経・筋系の検査、呼吸器系の検査）第6回：臨床生理検査学臨地実習Ⅱ（超音波検査、感覚器、消化器系、肝・胆・脾等の検査）第7回：臨床化学検査学臨地実習Ⅰ（検査の基礎技術、検体処理、糖質の検査、無機質の検査）第8回：臨床化学検査学臨地実習Ⅱ（たん白質の検査、脂質の検査、酵素の検査、ホルモンの検査、ビタミンの検査、薬物の検査）第9回：臨床血液検査学臨地実習（採血、血球に関する検査、形態に関する検査、自動血球計数装置を用いた検査、凝固・線溶系の検査）第10回：臨床微生物検査学臨地実習（無菌操作、一般細菌、真菌、嫌気性菌、結核菌等の検査、薬剤感受性検査、感染制御学）第11回：臨床免疫検査学・輸血移植免疫学臨地実習Ⅰ（免疫電気泳動、赤血球凝集反応、細胞性免疫検査、抗核抗体検査、感染症等検査）第12回：臨床免疫検査学・輸血移植免疫学臨地実習Ⅱ（血液型検査、その他の血液型検査、交差適合試験、不規則抗体同定検査）第13回：環境・食品検査学臨地実習Ⅰ（無菌検査、手術室細菌検査、病室環境検査、院内感染対策、栄養指標蛋白検査）第14回：環境・食品検査学臨地実習Ⅱ（急性相反応蛋白検査、ビタミン検査、脂質検査、薬物検査、栄養サポートチーム見学）第15回：実習報告会発表資料作成（実習学生による実習施設紹介、後輩への連絡事項の整理）とPPTを用いた発表および評価",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/22"
    },
    "updateAt": "2024\/09\/12"
}