{
    "lectureCode": "W6111",
    "courseName": "基礎理学療法学実習I",
    "lecturer": [
        "乙戸崇寛(医療保健学部リハビリテーション学科理学療法学専攻)",
        "太箸俊宏(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "金",
        "金2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "Ｍ５０８理学・作業療法実習室"
    ],
    "courceDetails": {
        "courseOverview": "本科目では、理学療法士として基本となる関節機能に関する知識、および骨、骨格筋、神経の触診法を学修し、実学に基づく専門能力を養う。身体各部位の関節の名称、基本運動軸とその特徴について講義を行い、実際に運動を体験しながら関節機能に関する知識を習得する。触診法については実際にデモンストレーションを行い、体表面から骨、骨格筋、および末梢神経を正確に触知する手技を習得する。また、「実学に基づく専門能力」を涵養するため、疾患を想定した演習を行い、患者（対象者）に配慮すべき点についても学修する。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "・基本運動軸と関節の運動を説明できる。・骨の名称と各部位の特徴を説明できる。・体表面から触知できる骨格筋の名称と各部位の特徴を説明できる。・体表面から触知できる骨格筋の起始と停止を説明できる。・体表面から触知できる骨、骨格筋、および末梢神経の位置と輪郭を指で同定できる。",
        "learningOutcomes": "実学に基づく専門能力",
        "teachingMethod": "・講義は教科書に記載されている画像を用いて説明する。また、教科書に記載されている注意事項についてはスライドを用いて重点的に解説を行う。・演習では、まず教員が実際に触診のデモンストレーションを行い、その後学生同士で各部位の触診法を主体的に実施するアクティブラーニングを採用する。授業資料を閲覧するため、ノートPCは必携とする。",
        "notices": "・学修すべき骨および骨格筋に関する知識については予習が必要となる。・演習を行うため、四肢の肌を露出しやすく、また動きやすい服装（Tシャツ・ショートパンツ）で参加すること。・授業の最後に手技の確認テストを行うため、演習については授業内に修得できるよう反復して練習を行うこと。",
        "preparatoryStudy": "・事前に授業資料をMoodleに掲載して、予習の指示を行う。あらかじめ骨の名称と骨格筋の起始、停止を教科書で確認すること(60分程度）。",
        "gradingGuidelines": "・期末試験（筆記）を70点満点、授業中の触診確認テストを30点満点で評価し、合計60点以上で単位を認定する。",
        "textbook": "・骨格筋の形と触察法改訂第2版河上敬介,磯貝香著大峰閣",
        "referenceMaterials": "指定しない",
        "courseSchedule": "第1回：関節の名称と機能、および運動方向について（乙戸）第2回：触診法総論、骨および末梢神経の触診（乙戸・太箸）第3回：頚部、体幹前面の骨と骨格筋の触診1（乙戸）第4回：頚部、体幹前面の骨と骨格筋の触診2（乙戸・太箸）第5回：頚部、体幹後面の骨と骨格筋の触診1（乙戸）第6回：頚部、体幹後面の骨と骨格筋の触診2（乙戸・太箸）第7回：肩部の骨と骨格筋の触診1（太箸）第8回：肩部の骨と骨格筋の触診2（乙戸・太箸）第9回：上腕部の骨と骨格筋の触診1（太箸）第10回：上腕部の骨と骨格筋の触診2（乙戸・太箸）第11回：頚部、体幹、肩部、上腕部の触診まとめ（乙戸）第12回：到達度演習、および理解度チェック（乙戸・太箸）第13回：前腕部前面の骨と骨格筋の触診1（乙戸）第14回：前腕部前面の骨と骨格筋の触診2（乙戸・太箸）第15回：前腕部後面の骨と骨格筋、手根骨の触診1（太箸）第16回：前腕部後面の骨と骨格筋、手根骨の触診2（乙戸・太箸）第17回：大腿部の骨と骨格筋の触診1（乙戸）第18回：大腿部の骨と骨格筋の触診2（乙戸・太箸）第19回：大腿部の骨と骨格筋の触診3（乙戸・太箸）第20回：下腿部の骨と骨格筋、足根骨の触診1（太箸）第21回：下腿部の骨と骨格筋、足根骨の触診2（乙戸・太箸）第22回：下腿部の骨と骨格筋、足根骨の触診3（乙戸・太箸）第23回：前腕部後面、大腿部、下腿部の触診まとめ（乙戸）第24回：到達度演習、および理解度チェック（乙戸・太箸）",
        "courseDataUpdatedAt": "2025/01/06"
    },
    "updateAt": "2025/03/21"
}