{
    "lectureCode": "W61211",
    "courseName": "理学療法臨床実習II（検査測定）",
    "lecturer": [
        "石黒圭応(医療保健学部リハビリテーション学科理学療法学専攻)",
        "斎藤寛樹(医療保健学部リハビリテーション学科理学療法学専攻)",
        "伊藤咲子(医療保健学部リハビリテーション学科理学療法学専攻)",
        "高木健志(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "臨床教育者とともに、理学療法士が実施する検査・測定の一部を実践します。また、検査・測定を安全に実践できるように事前準備、測定の実際、測定後の報告を経験します。この際、対象者の個別性を理解するための情報収集とリスク管理に必要な情報、方法を臨床教育者と共有する習慣を身につける機会とします。この検査・測定実習は、次年度に実施される評価実習に結び付ける教育期間として位置づけられます。この科目は、医療現場において実務経験を有する専門職が、その経験に基づいた実習を行う実学に基づく専門能力を養うための実践的科目である。",
        "outcomesMeasuredBy": "１）臨床教育者と対象者とのコミュニケーションを観察し、専門職として対象者と人間関係を築くことの重要性を感じ、行動に移すことができる。２）対象者の多様な価値観を踏まえ、個々の主訴や希望から個別性を理解することの重要性を認識しながら対象者とコミュニケーションをとることができる。３）理学療法の基本的な検査・測定を事前に準備し、その技術を対象者に対してCEの指導と支援を受けながら安全に実施できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "臨床実習II（検査測定）は、学内でのオリエンテーション、検査・測定の練習会、学外で行われる医療機関（病院、診療所）と介護・福祉施設での実習、学内での報告会を行う。学内での指導は、本学教員により行われる。学外での実習では、実習先に所属する臨床教育者（理学療法士）によってクリニカルクラークシップで行われる。",
        "notices": "臨床実習は、学生の学修意欲に対する実習施設と患者様（利用者様）のご理解とご厚意により成り立っている。学生自身が主体的に行動し学修することが臨床実習の大前提であり、自ら積極的に実習に取り組むこと。また、医療人・社会人に相応しい身だしなみ（清潔感のある頭髪、化粧とする、アクセサリーなどの装飾品は着用しない、爪を短く保つなど）で臨むこと。なお、ほとんどの実習地では、実習中の服装として白衣を指定されるため、準備をしておくこと。",
        "preparatoryStudy": "解剖学（人体構造学）、生理学、運動学（キネシオロジー）といった専門基礎科目を十分に復習しておくこと。また、検査・測定学をはじめ、運動器系・神経系・内部障害系理学療法評価学や、整形外科学、神経内科学、リハビリテーション医学などの専門科目も臨床実習II（検査測定）に直結する科目であるため、復習の上実習に臨むこと。",
        "gradingGuidelines": "実習前評価（課題提出、実技練習、学修態度）20％病院、施設での臨床実習の実施状況（ポートフォリオ）40％実習後評価（課題提出、報告会内容）40％",
        "textbook": "松澤正、理学療法評価学第6版、金原出版、2018田崎義昭、ベッドサイドの神経の診かた改訂18版、南山堂、2016津山直一(翻訳）、新・徒手筋力検査法第10版、協同医書出版、2020",
        "referenceMaterials": "第1回：実習前オリエンテーション（全教員）第2回：実習前実技練習（全教員）第3回：実習前実技練習（全教員）第4回：臨床実習施設における検査測定実習第5回：臨床実習施設における検査測定実習第6回：臨床実習施設における検査測定実習第7回：臨床実習施設における検査測定実習第8回：臨床実習施設における検査測定実習第9回：臨床実習施設における検査測定実習第10回：臨床実習施設における検査測定実習第11回：臨床実習施設における検査測定実習第12回：臨床実習施設における検査測定実習第13回：実習後報告会（１）（全教員）第14回：実習後報告会（２）（全教員）第15回：実習後報告会（３）（全教員）",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/25"
    },
    "updateAt": "2024\/09\/12"
}