{
    "lectureCode": "W61313",
    "courseName": "スポーツ科学理学療法学演習",
    "lecturer": [
        "乙戸崇寛(医療保健学部リハビリテーション学科理学療法学専攻)",
        "吉田真一(医療保健学部リハビリテーション学科理学療法学専攻)",
        "斎藤寛樹(医療保健学部リハビリテーション学科理学療法学専攻)",
        "伊藤咲子(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "金3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "Ｍ６０８治癒室",
        "Ｍ６０９機能訓練室２"
    ],
    "courceDetails": {
        "courseOverview": "スポーツ基本法には、「健康で文化的な生活を営むためにスポーツは不可欠であり、スポーツを楽しみ又はスポーツを支える活動に参画することのできる機会が確保されなければならない」と明記されている。よって、スポーツはアスリートのみならず、すべての国民が安全かつ有意義な活動として享受しなければならない。スポーツ活動における傷害予防や健康増進に対して理学療法士が関わる場面は近年増加しており、この場合は個人に適した種目、具体的な実施方法、時間や頻度等を含めた負荷量について科学的な根拠に基づき設定する知識と指導技術が必要となる。この科目では、各スポーツ傷害の疾病メカニズムと重症度、予防方略、および理学療法の実際について学修し、「論理的思考力」、「問題解決力」、「分析・評価能力」および「実学に基づく専門能力」を育むことを目的とする。本科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "・スポーツ障害に対する理学療法評価について説明できる。・スポーツ障害の発症メカニズムと重症度について説明できる。・スポーツ障害に対する予防方略と理学療法の実際について説明できる。・基本的なテーピングの効果と特徴を説明できる。・実学に基づく専門能力としての基本テーピング手技を実施できる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・ハンドアウト、スライド資料映写、画像・映像を利用して講義し、双方向実技演習を組み合わせるアクティブラーニングを実施する。授業資料を閲覧するため、また知識確認チェックを行うためノートPCは必携とする。",
        "notices": "・運動器理学療法評価の知識と徒手検査手技を習得している必要がある。・触診、徒手検査、治療手技、テーピングの演習を行うため、四肢の肌を露出しやすく、また動きやすい服装（Tシャツ・ショートパンツ）で参加することを指示する場合がある。",
        "preparatoryStudy": "・本授業の参加にあたり、該当する項目に沿った身体各部位の解剖学、運動学、運動器理学療法評価学を復習し、関節の構造と機能、筋の支配神経および起始・停止、骨指標と骨格筋の触診手技、バイオメカニクス、ROMやMMTについて十分理解しておくこと（40分程度）。",
        "gradingGuidelines": "・期末筆記試験（80%）、授業内の知識確認（20%）で評価し、60点以上で単位を認定する。",
        "textbook": "・赤坂清和編集PT・OTビジュアルテキストスポーツ理学療法学第1版羊土社",
        "referenceMaterials": "1)PeterBruknerandKarimKhan（丸山仁司日本語監訳）：臨床スポーツ医学,医学教育映像センター出版,2009年2)RoaldBahr,LarsEngebresten（陶山哲夫,赤坂清和監訳）：スポーツ外傷・障害ハンドブック,医学書院,2015年3)DavidJMagee:OrthopedicPhysicalAssessment,7thEd、Saunders,2020年",
        "courseSchedule": "第1回：スポーツ理学療法総論・コンピテンシー（乙戸）第2回：テーピング1（伊藤・外部講師）第3回：テーピング2（伊藤・外部講師）第4回：スポーツ活動に対する医科学サポート（吉田）第5回：Overheadアスリートの機能障害に対するEBPT（乙戸）第6回：筋挫傷に対する理学療法（斎藤）第7回：成長期のスポーツ外傷・障害/救急処置（伊藤）第8回：テーピング3（伊藤・外部講師）第9回：テーピング4（伊藤・外部講師）第10回：バレーボール競技における障害の特徴（乙戸）第11回：バレーボール競技における障害の対策（乙戸）第12回：MovementinSports（斎藤・外部講師）第13回：スポーツ現場での活動（伊藤・外部講師）第14回：Overheadアスリートへの理学療法実践1（乙戸・外部講師）第15回：Overheadアスリートへの理学療法実践2（乙戸・外部講師）",
        "courseDataUpdatedAt": "2025/01/06"
    },
    "updateAt": "2025/03/21"
}