{
    "lectureCode": "W6143",
    "courseName": "理学療法マネジメント論",
    "lecturer": [
        "乙戸崇寛(医療保健学部リハビリテーション学科理学療法学専攻)",
        "吉田真一(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月3",
        "月4",
        "月5",
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "Ｍ５１２多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "近年、理学療法が展開されるフィールドは多様化し、医療のとどまらず保健、福祉、スポーツ、行政など幅広い領域に拡大し、医療福祉制度の整備と相まって理学療法士の業務がより安全で、効率的に遂行されるための高度なマネジメント能力が求められている。臨床においては対象者の持つリスクを把握し、危機管理すること能力は不可欠である。本科目は、理学療法士に求められる管理・マネジメントを狭義に捉えるのではなく、多様化する理学療法の教育、臨床、研究分野においてより広義的に解釈し、社会的責任を持つ個人として、関連職種間での連携をとり、個々の対象者ニーズに答えることができるようさまざま領域で必要なマネジメント能力を取り上げ、ディスカッションを含めながら理解を深める。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "・理学療法士またはリハビリテーション職種における職場管理の重要性とマネジメントの実際について説明できる。・労務管理とハラスメント対策について概要を説明できる。・病院の監査制度と医療情報管理について概要を説明できる。・チームマネージメントと職員教育について概要を説明できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "授業計画で示す回ごとのテーマについて概要を講義する。また、それを基にしたアクティブラーニング形式で授業を展開する。グループまたは全体でのディスカッションを中心に進め、学生が自らの意見や考えを発表する場を多く設定する。",
        "notices": "医療機関で働くことを前提とした組織・運営に関する実践的授業であるため、自分の考えをまとめ、主体的に表出することが求められる。本授業に臨むためには、事前に掲載した授業資料の予習を行い、自らの意見をまとめておくことを推奨する。",
        "preparatoryStudy": "・事前に提示した講義資料を確認して予習しておくこと。（60分程度）",
        "gradingGuidelines": "・授業内理解度チェック40％、定期試験60％として総合成績を判定する。総合成績が60%以上の者を合格として単位を認定する。",
        "textbook": "指定しない",
        "referenceMaterials": "編集者代表奈良勲著：理学療法管理学,医歯薬出版2022.日本理学療法士協会編集：理学療法白書2021三輪書店2022.石川朗総編集：理学療法管理学,中山書店2020.斎藤秀之他：リハビリテーション管理学,医学書院2020.",
        "courseSchedule": "第1回:「理学療法士またはリハビリテーション職種における職場管理の重要性とマネジメントの実際1」(外部講師）第2回:「理学療法士またはリハビリテーション職種における職場管理の重要性とマネジメントの実際2」(外部講師）第3回:「業務管理と労務管理、コンプライアンスの遵守」(乙戸）第4回:「労務管理とハラスメント」(乙戸）第5回:「ハラスメント対策（演習）」(乙戸）第6回:「理学療法を取り巻く学術・職能活動」(外部講師）第7回:「リハビリテーション部門の管理と経営」(外部講師）第8回:「医療法と関連法規」(吉田）第9回:「病院の監査制度と情報管理」(吉田）第10回:「回復期リハビリテーション病院における理学療法マネジメント」(外部講師）第11回:「チームマネージメントと職員教育制度」(吉田）第12回:「インシデントとアクシデント対策」(吉田）第13回:「社会保障と税金、医療保険制度」(吉田）第14回:「介護保険と福祉制度」(吉田）第15回:「理学療法マネジメント論」まとめ（乙戸・吉田）",
        "courseDataUpdatedAt": "2025/01/06"
    },
    "updateAt": "2025/03/21"
}