{
    "lectureCode": "W62201",
    "courseName": "作業療法原論",
    "lecturer": [
        "澤田辰徳(医療保健学部リハビリテーション学科作業療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "Ｍ６０５手工芸室"
    ],
    "courceDetails": {
        "courseOverview": "作業療法の専門性を改めて見出すために開発された各種作業療法理論、モデル、ツール、参照枠組み、学問について学ぶことで、作業療法の唯一無二の専門性を理解する。この授業ではこれらを通して、実学に基づく専門能力、論理的な思考力、問題解決力を身につける。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "・作業療法の専門性を説明できる・作業科学(OccupationalScience)について説明できる・OTPFについて説明できる・作業と結びつきのカナダモデル(CMOP-E)について説明できる・人間作業モデル（MOHO）について説明できる・作業療法介入プロセスモデル（OTIPM）について説明できる・生活行為向上マネジメント（MTDLP）について説明できる",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "ProblemBasedLearning（問題基盤型学修PBL）により学修する。学生の主体的参加を主とし、初めにグループワーク、その後その内容に関する講義を行う。",
        "notices": "PBLによるグループワークでは積極的参加、または他者を思いやり、グループの議論を促進するように心がける。最終的に授業で作成した資料が自身の一番の教科書になるようにポートフォリオとして仕上げる。",
        "preparatoryStudy": "・PBLでは自分たちが調査したことがダイレクトに授業につながるため、積極的な授業参加を心がける。・毎回の小テストに備え復習をして臨む。・授業前に前回話し合い、調査した内容について理解しておく。・講義に先立ち作業療法概論の授業も復習しておく。・各回のPBLの学修目的に合わせた文献を各自1回につき5本程度まとめる。・宮崎駿監督の「千と千尋の神隠し」を見たことがない学生は事前に視聴しておくと授業の学修が深まる。",
        "gradingGuidelines": "・授業態度０％・小テスト2０％・ポートフォリオ4０％・定期試験3０%これらにより厳正に判断する。",
        "textbook": "齋藤佑樹編：作業で語る事例報告第２版．医学書院，2022．",
        "referenceMaterials": "・吉川ひろみ監訳：続・作業療法の視点作業を通しての健康と公正．大学教育出版・山田孝監訳：人間作業モデル理論と応用改訂第4版．協同医書・吉川ひろみ：COPM・AMPSスターティングガイド．医学書院・齋藤佑樹編：作業で語る事例報告第1版．医学書院，2016．・佐藤剛監訳：作業科学．三輪書店・日本作業療法士協会：事例で学ぶ生活行為向上マネジメント．医歯薬出版",
        "courseSchedule": "第１回：オリエンテーション:作業療法と作業療法理論第２回：作業と結びつきのカナダモデル（講義）第３回：人間作業モデル（講義）第４回：作業療法介入プロセスモデル（講義）第５回：生活行為向上マネジメント（講義）第６回：人間作業モデル（講義）第７回：OTPF（講義）第８回：作業科学（講義）第９回：理論に基づくさまざまな評価1（実技）第10回：理論に基づくさまざまな評価2（実技）第11回：理論に基づくさまざまな評価3（実技）第12回：クライエントを理論で読み解く1（PBL様）第13回：クライエントを理論で読み解く2（PBL様）第14回：クライエントを理論で読み解く3（PBL様）第15回：クライエントを理論で読み解く4（PBL様）",
        "courseDataUpdatedAt": "2024\/01\/29"
    },
    "updateAt": "2024\/09\/12"
}