{
    "lectureCode": "W62301",
    "courseName": "作業療法研究",
    "lecturer": [
        "友利幸之介(医療保健学部リハビリテーション学科作業療法学専攻)",
        "大野勘太(医療保健学部リハビリテーション学科作業療法学専攻)",
        "清家庸佑(医療保健学部リハビリテーション学科作業療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "Ｍ６０５手工芸室"
    ],
    "courceDetails": {
        "courseOverview": "研究には「作る」，「使う」，「伝える」の側面があります。「作る」とは，研究を行って新しい知見を生み出すことです。「使う」とは，研究結果を臨床で活用することで，いわば根拠に基づく医療\/実践（Evidence-basedmedicine\/practice:EBM\/EBP）です。「伝える」とは，研究結果を倫理的かつ正確に発信することです。本講義では，この研究の3つの側面について，座学と演習を通じて修得します。この科目は,研究活動の実務経験のある教員がその経験に基づき,「実学に基づく専門能力」,「論理的な思考力」,「分析・評価能力」,「問題解決力」を高めるための実践的科目です。",
        "outcomesMeasuredBy": "・文献検索および文献の批判的吟味ができる。・リサーチクエスチョン（PICO\/PECO）を理解・作成することができる。・研究デザインについて理解する。・基礎的な統計手法を理解する。・研究倫理ならびに不正行為について理解する。・論文執筆と学会発表における注意事項を理解する。・Evidence-basedmedicineの5ステップについて理解・実践できる。・研究計画の立案を経験する。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義に加えて，論文検索や講読などによる主体的課題学修を組み併せた授業を行います。",
        "notices": "本講義で研究の基礎知識および研究を学修する姿勢を修得し，卒業研究をより充実させてください。学修内容が多いので，適宜予習，復習を行ってください。Googleclassroomにて資料配布など行いますので登録をお願いします。感染予防のため、授業前の体調チェックを徹底していきます。授業中はマスクを着用し，グループディスカッションなど演習時には、必要に応じてゴーグルやパーテーションを使用します。",
        "preparatoryStudy": "Googleclassroomで事前に資料を配布するので事前学修に役立ててください。フリーの統計ソフトHADを使用するので，統計の講義までに自分のパソコンにインストールしておいてください。https:\/\/norimune.net\/had",
        "gradingGuidelines": "期末試験100%",
        "textbook": "友利幸之介他：作業で創るエビデンス．医学書院．2019",
        "referenceMaterials": "第1回：作業療法研究とは・なぜ研究が必要なのか（友利）第2回：Evidence-basedpracticeとは何か（友利）第3回：文献検索データベースの使い方（友利）第4回：文献検索してみる（友利）第5回：文献クリティーク（PICOを抜き出す）（友利）第6回：文献クリティーク（研究デザインとエビデンス）（友利）第7回：研究デザイン（文献研究）（友利）第8回：研究デザイン（臨床研究）（友利）第9回：統計処理（解説）（友利）第10回：統計処理（解説）（友利）第11回：基礎的統計手法（HADを使った演習）（全教員）第12回：基礎的統計手法（HADを使った演習）（全教員）第13回：学会発表と論文発表の注意点（全教員）第14回：研究計画と研究倫理（友利）第15回：まとめ（友利）",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/23"
    },
    "updateAt": "2024\/09\/12"
}