{
    "lectureCode": "W62305",
    "courseName": "精神機能評価学演習",
    "lecturer": [
        "石橋仁美(医療保健学部リハビリテーション学科作業療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "Ｍ６１１多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "精神機能評価学で得た知識を活用し、疾患・障害別のクライエントの状態を把握しながらその評価について習得する。本科目は同時期に開講される精神機能作業療法学とともに受講することで、精神障害作業療法の評価から介入までの一連の流れを理解する。さらに実際に当事者に対して面接を体験することで臨床場面において必要な評価技術を修得する。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。本科目は、実学に基づく専門能力、コミュニケーション能力を養う。",
        "outcomesMeasuredBy": "精神障害作業療法の対象となる代表的な疾患・障害の特性と社会・生活機能への影響を説明できる。精神障害作業療法の対象となる代表的な疾患・障害の評価について説明できる。当事者の疾患・障害を理解した上で、当事者の作業に着目した評価とその結果の解釈ができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "前半は疾患・障害別の作業療法評価について講義と演習を通して理解する。後半はグループワークを行う、第11回〜第12回は、地域在住の精神障害当事者への面接を行うための十分な準備、第13回は当事者への面接、第14回〜第15回は面接結果から解釈できるように学習を深める。",
        "notices": "この授業は演習科目となるため、能動的な学修姿勢が必須である。さらにグループワークでは、他学生との協調性や積極的なコミュニケーションが必要となる。また当事者から実際に協力いただく中で、支援職としての責任のある学習姿勢で取り組むことが必要となる。",
        "preparatoryStudy": "講義前には、教科書をよく読んで予習をしておくこと。また、グループワークではメンバー間で協力し、事前によく相談して調べ面接前には十分な練習を行なっておくこと。",
        "gradingGuidelines": "定期試験（70％）、ポートフォリオ（10％），面接（20％）で総合評価する。",
        "textbook": "標準作業療法学専門分野「作業療法評価学」第4版，岩崎テル子他編医学書院精神障害と作業療法病いを生きる、病いと生きる精神認知系作業療法の理論と実践新版山根寛著三輪書店作業療法学全書第５巻精神障害改定第３版日本作業療法士協会監修協同医書出版社",
        "referenceMaterials": "標準作業療法学専門分野「精神機能作業療法学」，小林夏子編医学書院クリニカル作業療法シリーズ「精神障害領域の作業療法」／石井良和，京極真，長雄眞一郎中央法規出版",
        "courseSchedule": "第1回：オリエンテーション、精神障害作業療法の評価の基礎(石橋)第2回：疾患・障害別評価①-統合失調症1-（石橋）第3回：疾患・障害別評価①-統合失調症2-（石橋）第4回：疾患・障害別評価②-気分障害1-（特別講師）第5回：疾患・障害別評価②-気分障害2-（外部講師）第6回：疾患・障害別評価③-アルコール依存症-（特別講師）第7回：疾患・障害別評価④-神経症性障害-（石橋）第8回：疾患・障害別評価⑤-パーソナリティ障害-（石橋）第9回：疾患・障害別評価⑥-摂食障害-（石橋）第10回：疾患・障害別評価⑦-成人期の発達障害-（特別講師）第11回：当事者への面接・準備①（石橋）第12回：当事者への面接・準備①（石橋）第13回：当事者への面接・演習（石橋）第14回：当事者への面接・振り返り①（石橋）第15回：当事者への面接・振り返り②（石橋）",
        "courseDataUpdatedAt": "2025/01/26"
    },
    "updateAt": "2025/03/21"
}