{
    "lectureCode": "W62306",
    "courseName": "身体機能作業療法学",
    "lecturer": [
        "酒井弘美(医療保健学部リハビリテーション学科作業療法学専攻)",
        "柴橋広智(医療保健学部リハビリテーション学科作業療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火3",
        "火4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "Ｍ５０９レクリエーション室"
    ],
    "courceDetails": {
        "courseOverview": "脳血管障害を中心として各神経疾患に対する作業療法、また各整形外科疾患に対する作業療法について学修する。これらの疾患の障害像を理解し、作業療法の役割を考えながら評価から治療介入の方法について学ぶ。この科目を通して、実学に基づく専門能力、分析・評価能力および問題解決力を養う。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "到達目標は以下のとおりである。1.脳血管障害に対する作業療法の役割を説明できる。2.脳血管障害に対する評価から治療までの作業療法の流れを説明できる。3.脳血管障害に対する作業療法の介入方法を説明できる。4.脳血管障害に対する作業療法の介入手技を実施できる。5.脊髄損傷に対する作業療法の役割を説明できる。6.脊髄損傷に対する評価から治療までの作業療法の流れを説明できる。7.脊髄損傷に対する作業療法の介入方法を説明できる。9.脳血管障害以外の神経疾患に対する作業療法の役割を説明できる。10.脳血管障害以外の神経疾患に対する評価から治療までの作業療法の流れを説明できる。11.脳血管障害以外の神経疾患に対する作業療法の介入方法を説明できる。12.脳血管障害以外の神経疾患神経疾患に対する作業療法の介入手技を実施できる。13.整形疾患に対する作業療法の役割を説明できる。14.整形疾患に対する評価から治療までの作業療法の流れを説明できる。15.整形疾患に対する作業療法の介入方法を説明できる。16.整形疾患に対する作業療法の介入手技を実施できる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "上記の到達目標を達成するよう、講義を中心に身体機能作業療法の理解を深め、各手技の演習、および症例検討等を行う。",
        "notices": "予習・復習はもちろんのこと、授業、グループワークへの積極的な参加を望む。",
        "preparatoryStudy": "機能解剖学、運動学を復習しておくこと。また、整形外科、神経内科での講義内容を復習しておくこと。",
        "gradingGuidelines": "小テスト・レポート（20％）、期末筆記試験（70％）、グループワーク等の参加・発言内容（10％）等で総合的に評価する。",
        "textbook": "ゴールドマスター・テキスト「身体障害作業療法学：第3版」メディカルビュー",
        "referenceMaterials": "作業療法学全書「身体障害」協同医書",
        "courseSchedule": "第1回：脳卒中の障害像（酒井）第2回：脳卒中のリハビリテーション（酒井）第3回：脳卒中の作業療法：急性期（柴橋）第4回：脳卒中の作業療法：回復期（上肢機能回復）（柴橋）第5回：脳卒中の作業療法：回復期（ADL・IADL）（柴橋）第6回：脳卒中の作業療法：維持期（柴橋）第7回：脳卒中の作業療法：まとめ（酒井・柴橋）第8回：脳卒中の作業療法：まとめ2（酒井・柴橋）第9回：パーキンソンの障害像とリハビリテーション（酒井）第10回：パーキンソンの作業療法（酒井）第11回：脊髄小脳変性症の障害像とリハビリテーション（柴橋）第12回：脊髄小脳変性症の作業療法（柴橋）第13回：筋ジストロフィの作業療法（伊藤）第14回：ギランバレー、多発性硬化症の作業療法（酒井）第15回：神経筋側索硬化症の作業療法（酒井）第16回：頸髄損傷の障害像（酒井）第17回：脊髄損傷のリハビリテーション（酒井）第18回：脊髄損傷の作業療法：急性期（酒井）第19回：脊髄損傷の作業療法：回復期（酒井）第20回：脊髄損傷・脊椎疾患の作業療法：回復期・維持期（酒井）第21回：末梢神経損傷の障害像（柴橋）第22回：末梢神経損傷の作業療法（柴橋）第23回：骨折（上肢）（柴橋）第24回：骨折（下枝）（柴橋）第25回：肩関節疾患（柴橋）第26回：手の機能解剖（柴橋）第27回：HandTherapy（柴橋）第28回：HandTherapy（柴橋）第29回：熱傷の作業療法（酒井）第30回：まとめ（酒井）別の条件でシラバスを参照する。",
        "courseDataUpdatedAt": "2024\/01\/24"
    },
    "updateAt": "2024\/09\/12"
}