{
    "lectureCode": "W6244",
    "courseName": "作業療法セミナー",
    "lecturer": [
        "澤田辰徳(医療保健学部リハビリテーション学科作業療法学専攻)",
        "石橋仁美(医療保健学部リハビリテーション学科作業療法学専攻)",
        "友利幸之介(医療保健学部リハビリテーション学科作業療法学専攻)",
        "大野勘太(医療保健学部リハビリテーション学科作業療法学専攻)",
        "柴橋広智(医療保健学部リハビリテーション学科作業療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１８０４作業療法卒研室"
    ],
    "courceDetails": {
        "courseOverview": "4年間で学んだ作業療法に関する学修の集大成として、今まで学修してきた知識を整理し、将来、臨床場面の疑問の問題解決力を培うことを目的として実施する。具体的には、４年間で学んだ基礎医学、臨床医学、作業療法学等の作業療法に関連する科目の総復習を行う。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "到達目標は以下の通りである。1.基礎医学・臨床医学･作業療法専門の国家試験問題について適切に説明ができる。2.各障害の対象者に対する作業療法評価から治療計画を立案し、介入方法等について説明できる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1.基礎医学、臨床医学、作業療法学等に関する小テスト等を実施し、未理解項目を発見し、復習を行う。2.基礎医学、臨床医学、社会学、心理学、作業療法学に関連する教科書、文献等や、指導教員の助言等により、学生個人で、臨床実習での事例の解釈と統合を再実施する。また、その結果から作業療法計画を再立案し、発表する。3.文献を用いた事例検討を通して、基礎医学、臨床医学、作業療法学等の一連の内容の復習を行う。",
        "notices": "予習、復習を行い、毎回の小テストには準備して臨むこと。教員とのディスカッション等には積極的に臨むこと。また、レポート等の提出物の期限等を厳守すること。",
        "preparatoryStudy": "基礎医学、臨床医学におけるこれまでの授業資料を整理し、再確認すること。臨床実習での事例報告レポートと、統合と解釈、治療プログラム立案に必要な学問領域の文献等を用意する。",
        "gradingGuidelines": "筆記試験・国家試験模試(90％）、授業態度（10％）、で総合評的に評価を実施する。",
        "textbook": "特になし",
        "referenceMaterials": "適宜紹介する",
        "courseSchedule": "第1回：オリエンテーション（石橋）第2回：解剖学/生理学（阿部）第3回：整形外科学/運動学（友利）第4回：人間発達学/リハ医学（友利）第5回：作業療法基礎科目（作業療法概論、基礎作業学）（澤田）第6回：作業療法基礎科目（作業分析、評価学）（大野）第7回：身体障害の作業療法とその関連領域（中枢神経系・神経筋疾患の作業療法、神経内科学）（大野）第8回：身体障害の作業療法とその関連領域（骨関節系疾患の作業療法、義肢装具学、整形外科学）（澤田、柴橋）第9回：身体障害の作業療法とその関連領域（内科系、呼吸循環器、代謝系疾患の作業療法、内科学）（柴橋）第10回：老年期障害の作業療法とその関連領域（認知症、高次脳機能障害、画像解析学）（澤田）第11回：精神障害の作業療法とその関連領域（統合失調症の作業療法、精神医学、臨床心理学）（石橋）第12回：精神障害の作業療法とその関連領域（その他精神疾患の作業療法、精神医学、臨床心理学）（石橋）第13回：発達障害の作業療法とその関連領域（脳性麻痺、精神遅滞、発達障害、その他疾患の作業療法、小児科学）（友利）第14回：地域における作業療法（澤田）第15回：その他の作業療法(職業関連、管理学）と全体のまとめ（澤田）",
        "courseDataUpdatedAt": "2025/02/26"
    },
    "updateAt": "2025/03/21"
}