{
    "lectureCode": "W63205",
    "courseName": "言語発達障害学I",
    "lecturer": [
        "池田泰子(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "本科目では、1年次の「言語発達学」で学んだ言語発達に関する知識を基に、言語発達に遅れをもたらす障害に関連する知識を学び、実学に基づく専門能力を身につけます。各障害の原因・特徴、言語・コミュニケーションの特徴・支援についての基本的な考え方を学ぶことで、言語発達障害児に対する効果的な支援を行う視点を養います。この科目は、実務経験を有する専門職がその経験に基づいた講義を行う実践的科目です。",
        "outcomesMeasuredBy": "1.言語発達に遅れをもたらす障害を複数列挙できる2.言語発達に遅れをもたらす代表的な障害の特徴を概説できる3.各障害に対する代表的な支援方法を列挙できる",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・教科書、配布資料、スライドを用いてシラバスに沿って講義を進めます。シラバスの授業計画に変更が生じた場合は、その都度説明します。・講義で得られた情報を基に自身の考えを記述するリアクションペーパーを毎回課します。・講義資料はムードルにアップするとともに、こちらで印刷し、配布します。・ノートPCは必携ではありません。使用する場合は事前にアナウンスします。・第12回は、グループワークを実施する。障害のある子どもをもつ保護者の思いに関する理解を深め、学んだことを支援に活かすことを目的に意見交換を行う。",
        "notices": "※関連科目：（1年前期）言語発達学、（2年前期）言語発達障害学Ⅱ、（2年後期）言語発達障害学Ⅲ、（3年前期）言語発達障害学演習・リアクションペーパーは、提出期限より後に提出されたものは受け取りません。また、授業に欠席した人の提出は認めません。",
        "preparatoryStudy": "・シラバスに示されている授業計画を確認し、教科書の該当部分を読んで予習を行ってください（30分）・授業における学びを振り返り、理解を深めることを目的として、毎授業後にリアクションペーパーの提出を課します（20分）・復習・予習状況を確認するために小テストを実施します。小テストの実施については、授業時にアナウンスします（30分）。",
        "gradingGuidelines": "定期試験：60％、小テスト：25％、プレゼン：5％、毎回のリアクションペーパー：10％リアクションペーパーは次の基準で評価を行います。【A】自分の考えを根拠とともに過不足のない形で明確に記述（5点）【B】自分の考えと根拠との関連が認められるが、一部明確でない形で記述（3点）【C】期日までに未提出（0点）",
        "textbook": "標準言語聴覚障害学言語発達障害学第3版:深浦順一・藤野博・石坂郁代編、医学書院、2021年",
        "referenceMaterials": "言語聴覚士のための言語発達障害学第2版:石田宏代・石坂郁代編、医歯薬出版、2016年",
        "courseSchedule": "第1回：オリエンテーション、発達障害第2回：自閉スペクトラム症①第3回：自閉スペクトラム症②第4回：注意欠如多動症①第5回：注意欠如多動症②第6回：学習障害①第7回：学習障害②第8回：プレゼン①発達障害のある当事者の語り（当事者本）第9回：プレゼン②発達障害のある当事者の語り（当事者本）第10回：知的能力障害第11回：障害のある子どもをもつ保護者の思いを理解する第12回：グループワーク第11回講義の学びを深める第13回：脳性麻痺、重複障害第14回：特異的言語発達障害、その他の障害第15回：障害のある子どもを支援する場乳幼児～就労までまとめ",
        "courseDataUpdatedAt": "2024\/03\/11"
    },
    "updateAt": "2024\/09\/12"
}