{
    "lectureCode": "W63212",
    "courseName": "聴覚障害学II",
    "lecturer": [
        "石津希代子(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３０２０１教室"
    ],
    "courceDetails": {
        "courseOverview": "乳幼児のことばの獲得や発達に対する聴覚の役割や、聴覚障害によって引き起される様々な問題など小児聴覚障害の特徴について学習します。また、小児を対象とする聴覚検査の理論や技法を学び、小児聴覚障害児の評価について理解を深めます。科目を通して、論理的な思考力や分析・評価能力などの能力の向上を目指します。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目です。",
        "outcomesMeasuredBy": "1.聴覚障害が発達に及ぼす影響を説明できる。2．聴覚機能および聴性行動の発達を説明できる。3．小児の聴覚検査の原理・技法を説明できる。4.情報収集の必要項目を挙げることができる。5.発達を考慮した評価方法を挙げることができる。6．領域の行動目標シートに沿って学修内容を振り返り、さらに知識・技術を深めていくための行動目標を挙げることができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本科目は反転授業を組みこんだアクティブラーニング型の授業です。授業内では各回のテーマについてペアワークやディスカッション、グループワークなどを通して学習を深めます。授業活動ではパソコンを利用するため、毎回、持参するようにして下さい。授業は、シラバス・学習支援計画書・Moodleに沿って進めますが、授業進行によって、シラバスおよび学習支援計画書に変更が生じた場合は、授業内で説明後に修正し、Moodleに学習支援計画書の最新版を掲示します。",
        "notices": "※復習科目：聴覚系の構造・機能・病態、聴覚障害学Ⅰ、聴覚障害学演習Ⅱ※関連科目：耳鼻咽喉科学、聴覚障害学演習Ⅱ※授業内容の概略やポイント、参考資料、課題は、Moodleの当該コースに示します。※授業後、Moodleに授業概要および事後学習用の資料を提示します。各自で確認し学習を進めて下さい。特に遅刻・欠席をした場合は、Moodleに沿って授業内容を確認し、自分で学習を進めたうえで、必要に応じて質問・相談にきて下さい。※事前・事後学習では、Moodleに示したキーワードを「説明できる」ように学習を進めて下さい。",
        "preparatoryStudy": "【事前学習：80分程度】※講義終了時に次回の実施内容をアナウンスします。また、Moodleには、毎回、事前学習用の資料や準備物を提示します。※Moodleと学習支援計画書の各回の事前学習欄に掲載してある内容を確認し、学習を進めます。講義動画や資料を確認し、自分の考えをまとめ、分からないところを明確にした上で、授業に参加します。※必ず事前に事前学習をした上で受講して下さい。講義は、事前学習を行ってきていることを前提にして進めます。【事後学習：40分程度】Moodleと学習支援計画書の事後学習に掲載してある内容に取り組み、事前学習と授業で学んだことを、さらに深める学習に取り組むことを勧めます。",
        "gradingGuidelines": "【成績評価】提出物50%（ワークシート、小テスト、ポートフォリオ）定期試験50%【課題に対するフィードバック】提出物やレポートは、事前に評価指標（ルーブリック）を提示します。具体的な評価項目と評価指標はMoodleを参照し、提出して下さい。提出された課題は、事前に示した評価指標を用いて内容を確認し、随時、フィードバックをします。毎回の小テストはMoodle上で実施・フィードバックを行います。",
        "textbook": "日本聴覚医学会編:聴覚検査の実際改訂5版.南山堂,2024城間将江,鈴木恵子,小渕千絵編:標準言語聴覚障害学聴覚障害学第3版.医学書院,2021",
        "referenceMaterials": "医療情報科学研究所:病気がみえるvol.13耳鼻咽喉科．メディックメディア,2020",
        "courseSchedule": "第1回：科目オリエンテーション、小児聴覚障害と発達に及ぼす影響①第2回：小児聴覚障害と発達に及ぼす影響②第3回：小児聴覚障害の原因と特性第4回：聴覚系の成熟と聴覚機能・聴性行動の発達第5回：新生児聴覚スクリーニング第6回：乳幼児聴力検査➀：聴性行動反応聴力検査第7回：乳幼児聴力検査②：視覚強化式聴力検査、条件詮索反応聴力検査第8回：乳幼児聴力検査③：ピープショウテスト、遊戯聴力検査第9回：乳幼児に対する聴覚機能検査(他覚的検査）、選別検査第10回：小児聴覚障害における評価、関連情報の収集第11回：聴覚面の評価第12回：言語面の評価➀第13回：言語面の評価②、発声発語面の評価第14回：認知、社会性、書記言語力等の発達評価第15回：小児聴覚障害の評価と支援、まとめ",
        "courseDataUpdatedAt": "2024\/01\/25"
    },
    "updateAt": "2024\/09\/12"
}