{
    "lectureCode": "W63201",
    "courseName": "失語・高次脳機能障害学I",
    "lecturer": [
        "浦野雅世(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３０２０１教室"
    ],
    "courceDetails": {
        "courseOverview": "失語症は成人のコミュニケーション障害の代表となる高次脳機能障害の一つであり、主には脳卒中（脳梗塞や脳出血）によって生じる言語の障害です。1年次に学んだ神経系の構造・機能・病態や言語聴覚障害学総論の知識を踏まえ、失語症に特異的にみられる基本的な事項を脳の解剖部位とともに学びます。計15回の講義を通して、失語症の歴史、症状、各タイプの特徴、回復過程と治療原則について学修します。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目です。",
        "outcomesMeasuredBy": "①失語症の定義・歴史・原因疾患を理解することができる。②失語症に特異的に見られる症状を説明することができる。③失語症の各タイプの特徴を説明することができる。④失語症の回復過程と治療原則を理解することができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義の進め方は初回オリエンテーションで説明しますが、基本的にはシラバスの内容に沿って進めます。講義教材として、教科書、パワーポイント・配布資料、音声\/動画を使用し、重要な部分は講義時間内に繰り返し説明します。また、講義に関する意見・感想・質問を提出してもらうとともに、講義の理解度を確認するための小テストを実施します。",
        "notices": "関連科目：言語聴覚障害学総論（1年前期）、神経系の構造・機能・病態（1年後期）、精神医学（2年前期）、神経内科学（2年前期）、失語・高次脳機能障害学演習Ⅰ（2年前期）本科目で学んだ内容は、失語・高次脳機能障害学演習Ⅰ（2年前期）の演習として取り扱います。疑問点の解決に向けて、積極的に質問してください。",
        "preparatoryStudy": "【予習】60分次回の講義予定範囲に相応する教科書のページに目を通し、疑問点や不明な部分があれば、教科書にコメントやチェックを入れて講義に臨んでください。【復習】60分講義終了後に内容を振り返り、講義用ノートやデータに要点をまとめて理解を深めてください。また、講義で取り上げる復習問題を解きなおしておいてください。",
        "gradingGuidelines": "定期試験（55％）、小テスト（30％）、リアクションペーパー（15％）",
        "textbook": "藤田郁代,立石雅子,菅野倫子編:標準言語聴覚障害学失語症学（第3版）,医学書院（2021）",
        "referenceMaterials": "・藤田郁代,阿部晶子編:標準言語聴覚障害学.高次脳機能障害学第3版.医学書院（2015）・種村純編:失語症臨床標準テキスト医歯薬出版(2019)・石合純夫:高次脳機能障害学第3版.医歯薬出版（2022）.",
        "courseSchedule": "第1回：オリエンテーション、失語症の定義・歴史、原因疾患第2回：単語レベルの言語情報処理モデル第3回：失語症の症状①聴覚的理解の障害第4回：失語症の症状②発話の障害第5回：失語症の症状③読字の障害第6回：失語症の症状④書字の障害、数・計算の障害第7回：失語症のタイプ分類①ブローカ失語、ウェルニッケ失語第8回：失語症のタイプ分類②伝導失語、失名辞失語第9回：失語症のタイプ分類③超皮質性失語、全失語第10回：失語症のタイプ分類④交叉性失語、皮質下性失語第11回：失語症のタイプ分類⑤純粋型第12回：失語症のタイプ分類⑥原発性進行性失語、小児失語第13回：失語症の回復過程・言語治療の基本原則第14回：言語治療の理論と技法・失語症の言語聴覚療法の全体像第15回：まとめ",
        "courseDataUpdatedAt": "2024\/01\/26"
    },
    "updateAt": "2024\/09\/12"
}