{
    "lectureCode": "W63213",
    "courseName": "聴覚障害学演習II",
    "lecturer": [
        "原田浩美(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "石津希代子(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３０２０１教室"
    ],
    "courceDetails": {
        "courseOverview": "聴覚障害学Ⅱで学修した小児に対する聴覚検査の理論・方法を基にして、乳幼児朝食検査の実施、解釈、および、動画分析、事例データ分析を行い、「論理的な思考力」、「分析・評価能力」を修得します。分析は、個別検討に併せて、グループワークを行い、「コミュニケーション能力」、「問題解決力」を高めていきます。臨床の流れに沿って、履修後に獲得できる能力を明確にし、検査→情報収取→評価→訓練・支援→症例検討へと、ワークを進めていきます。本演習の多くをグループワークにて行うことにより、「コミュニケーション能力」、「問題解決力」を高めていきます。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目です。",
        "outcomesMeasuredBy": "1.聴覚障害乳幼児に対する言語聴覚療法の流れを説明できる。2.正しい評価をするための、情報収集が出来る。3.乳幼児聴力検査の実施と解釈、言語コミュニケーション評価、認知発達検査の結果を解釈できる。4.個別性に配慮した訓練プログラムの立案を根拠を示して考えられる。5.症例報告の形式から対象の全体像を概観し、個別対応に必要な視点を獲得できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本科目では、聴覚障害乳幼児に適切な言語聴覚療法を提供できるようになるために必要な情報収集、結果の解釈、それらに基づいた訓練プログラムの立案をアクティブラーニングのスタイルで進めます。進め方の詳細は、初回の科目ガイダンスで学習支援計画書に沿って説明します。（Moodleにも、学習支援計画書は示します）自律的な調べ、グループディスカッションを中心として進めますので。聴覚障害学Ⅱで作成中の個別ノート、関連科目の教科書および、ノートＰＣは必携です。",
        "notices": "聴覚障害学Ⅰおよび、聴覚障害学演習Ⅰで学修した、聴覚障害の基礎的な知識、技能を基にする。聴覚障害学Ⅱで学修した小児に対する聴覚検査の理論・方法を正しく理解する。",
        "preparatoryStudy": "【予習】毎回の実施内容および、予習内容は、事前に資料を配布しますので、準備学習（60分程度）をしてください。【授業内】毎回、検討課題とともに、必要なワークを示し、演習を行います。【提出】各回、指定の課題、ワークを期日までに提出してください。【復習】提出物は、コメント記入後、個別にフィードバックしますので、復習し、疑問、質問があれば、オフィスアワーに直接、または、Moodleやメールを通じて連絡して下さい。",
        "gradingGuidelines": "【評価方法】定期試験（40%）、演習ワーク課題（60％）【評価基準】定期試験については、授業内で学修したことを中心とした筆記試験を行います。演習ワーク課題については、都度、振り返りを行います。",
        "textbook": "指定しない毎回、必要な演習資料を提示します。",
        "referenceMaterials": "聴覚障害学Ⅰ・聴覚障害学Ⅱの教科書日本聴覚医学会編:聴覚検査の実際改訂5版.南山堂,2024標準言語聴覚障害学聴覚障害学第3版.医学書院,2021",
        "courseSchedule": "第1回：科目ガイダンス（原田・石津）①聴覚の発達と聴性行動②聴性行動観察からわかること③動画からの読み取りと解釈第2回：サウンドレベルメーターによる測定第3回：情報収集（原田）①情報から読み取れること②情報全体からの解釈第4回：情報収集の実際（原田）①調査書から第5回：評価に用いる検査（原田・石津）（健常児の発達との比較）言語、認知、社会性、コミュニケーションの実際第6回：言語評価（原田）質問紙から第7回：単語期の訓練・指導（原田）第8回：単語期の訓練・指導（原田）個別プログラム（読み取りと課題設定）第9回：BOA,VRA,遊戯聴力検査演習第10回：BOA,VRA,遊戯聴力検査演習第11回：コミュニケーションモードと指導法第12回：前言語期の訓練・指導（原田）第13回：前言語期の訓練・指導（原田）個別プログラム（読み取りと課題設定）第14回：多語文期の訓練・指導（原田）第15回：多語文期の訓練・指導（原田）個別プログラム（読み取りと課題設定）",
        "courseDataUpdatedAt": "2024\/01\/26"
    },
    "updateAt": "2024\/09\/12"
}