{
    "lectureCode": "W63303",
    "courseName": "失語・高次脳機能障害学演習III",
    "lecturer": [
        "浦野雅世(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "川上勝也(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１９１１発声発語検査室"
    ],
    "courceDetails": {
        "courseOverview": "失語・高次脳機能障害のリハビリテーションを遂行する上で必要な能力、すなわち失語症のある人との会話の進め方、インテーク面接や評価、問題点の抽出、方針・訓練計画の立案、訓練の実際、報告書の作成までを総合的に学修します。実学に基づく専門能力、分析・評価能力を身につけるとともに、臨床実習への足固めを目標としています。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目です。",
        "outcomesMeasuredBy": "①失語症のある人に適切な援助をしながら会話をすることが出来る。②臨床観察記録を取ることが出来る。③必要な評価バッテリーの選択が出来る。④訓練計画を立案することが出来る。⑤失語症以外の高次脳機能障害の評価計画を立案することが出来る。⑥報告書を作成することが出来る。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業の進め方は初回オリエンテーションで説明します。シラバスに沿って進めますが、進行上変更が生じる場合は連絡します。パワーポイント、配布資料での説明に加え、音声/動画等で具体的な反応例を観察しながら記録や評価の演習を行います。また、個人での評価/検査演習に加え、ペアないしは小グループでの評価/会話演習やプログラムの立案、プレゼンテーションも行います。理解度を確認する目的で、小テストを数回行います。",
        "notices": "＊関連科目：（2年前期）失語・高次脳機能障害学Ⅰ・Ⅱ、（2年後期）失語・高次脳機能障害学演習Ⅰ・Ⅱ、（3年前期）失語・高次脳機能障害学Ⅲ。会話/インテーク面接の練習、臨床記録を取る練習、評価演習、訓練計画立案、プレゼンテーション、報告書作成とたくさんの内容を行います。主体的に参加してください。記録用紙等は毎回回収し、個別にフィードバックします。フィードバックされた後の用紙もよく見直しておいてください。記録/評価演習用のクリップボードとルーズリーフ（またはレポート用紙）を用意してください。",
        "preparatoryStudy": "【予習】60分失語・高次脳機能障害学Ⅲとは双方向性に講義・演習を進めますので、その都度内容を照合してください。また、2年で学修した失語・高次脳機能障害学Ⅰ・Ⅱおよび失語・高次脳機能障害演習Ⅰ・Ⅱの配布資料や教科書に目を通し復習しておいてください。【復習】60分ワークシート、記録用紙は都度コメントを書いて返却します。演習資料とコメント内容を照合し、理解を深めてください。",
        "gradingGuidelines": "定期試験（55％）、小テスト（20％）、提出物（15％）、報告書作成（10％）",
        "textbook": "・藤田郁代,立石雅子,菅野倫子編:標準言語聴覚障害学失語症学（第3版）,医学書院（2021）・藤田郁代,阿部晶子編.標準言語聴覚障害学高次脳機能障害学第3版.医学書院（2021）・深浦順一,植田恵編:標準言語聴覚障害学言語聴覚療法評価・診断学医学書院（2020）",
        "referenceMaterials": "・鹿島晴雄,大東祥孝,種村純編.よくわかる失語症セラピーと認知リハビリテーション.永井出版（2008）.・種村純編著.失語症臨床標準テキスト.医歯薬出版（2019）・石合純夫.高次脳機能障害学第3版.医歯薬出版（2022）",
        "courseSchedule": "第1回：オリエンテーション講義の進め方と目的の説明失語症のある人との会話の進め方（浦野・川上）第2回：臨床観察記録の取り方（浦野・川上）第3回：インテーク/スクリーニング検査の進め方、問題点の抽出（浦野・川上）第4回：包括的言語検査から失語症のタイプ分類を考える①（浦野・川上）第5回：包括的言語検査から失語症のタイプ分類を考える②（浦野・川上）第6回：物品と動作の呼称検査、意味連合検査、音韻機能検査（浦野・川上）第7回：TLPA失語症語彙検査・SALA失語症検査（浦野・川上）第8回：必要な掘り下げ検査を考える①（浦野・川上）第9回：必要な掘り下げ検査を考える②（浦野・川上）第10回：訓練プログラムの立案①（浦野・川上）第11回：教材作成①（浦野・川上）第12回：訓練プログラムの立案②（浦野・川上）第13回：教材作成②（浦野・川上）第14回：言語以外の高次脳機能障害の評価①（浦野・川上）第15回：言語以外の高次脳機能障害の評価②（浦野・川上）",
        "courseDataUpdatedAt": "2025/01/17"
    },
    "updateAt": "2025/03/21"
}