{
    "lectureCode": "U2108",
    "courseName": "数学（線形代数）",
    "lecturer": [
        "須田拓馬(教養学環)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３０２１２教室"
    ],
    "courceDetails": {
        "courseOverview": "線形代数は、初年次の大学生にとっては初めての「大学の数学らしい」数学科目と言えよう。高校までの数学と違い、抽象度が増していると感じるはずである。こうした科目を医療系の学生が学ぶことに疑問を感じるかもしれないが、本授業で扱うベクトルや行列は、科学技術の根幹をなす体系であり、その中には医療技術も含まれる。数学の基本的な知識や概念を習得することは技術者としての基礎を身に付けることと言っても過言ではない。本授業では、線形代数の基本となるベクトルと行列について、基本的な概念を習得し、これらを使った演算を身につける。抽象化された概念として全体像を理解するよりも、具体的にイメージすることができ、計算問題として解けるようになることをより優先的な目標とする。",
        "outcomesMeasuredBy": "1.ベクトルの内積、外積について理解し、関連した演算ができる。2.ベクトルの図形的な意味を理解し、図形をベクトルで表記することができる。3.行列の和、差、スカラー倍、積の計算を自在に行うことができる。4.行基本変形を習得し、連立一次方程式の解法や逆行列の導出を行うことができる。5.行列式の性質を理解し、3次正方行列の行列式の計算および展開ができる。6.線形変換を理解し、点や図形の変換に関する計算ができる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力",
        "teachingMethod": "-板書を主体とし、計算演習を通じて新しい概念を習得する。-毎回の授業の冒頭で、前回の内容について復習する小テストを行う（初回は除く）。10分間程度の解答時間が与えられ、時間内にMoodleに解答を入力する必要がある。小テストの時間中は教科書、ノートなどを参照してはならない。授業開始前にしっかりと復習しておくこと。-小テストの解答、解説は小テスト直後に行うとともに、解答例は後日Moodleにアップロードする。-小テストの得点(10点満点)と平均点、満点者の人数、3点以下の人数を公表する。-授業時間内で演習の時間をとり、実際の計算問題に慣れてもらう。計算演習はペアかグループで行うことが望ましいので、授業開始時にペアやグループを作りやすいように着席すること。-小テストの得点が低い状態が続いた学生は、学修支援センターの利用を促されることがある。",
        "notices": "高校数学IAを前提とし、IIBは前提としない。ただし、数学IIB未履修者や自信のない人は「数学基礎」を必ず履修すること。授業開始前までに授業資料をMoodleにアップロードする。授業時間中には演習問題に取り組む時間がある。ペアやグループでの活動を推奨するので、解答を見せ合ったり、相談しながら解くなど各自で工夫してほしい。授業をやむを得ない事情で欠席する場合は、事情を説明する証明書の写真をメール添付で送るか、授業時間の前後に証明書類を見せること（原本の提出は求めない）。やむを得ない事情と証明書類の一例は以下の通り（これがすべてではない）。-病欠：病院の日付入りの領収書-忌引：告別式の案内やむを得ない事情による欠席が認められれば、小テストは免除扱いとなり、成績評価において不利になることはない。授業中の飲食は推奨しないが、水分補給は禁止しない。授業に関する内容について学生同士で話し合うことは推奨するが、私語は周囲の学生が授業を受ける権利を侵害するので十分に留意すること。居眠りや他の授業の課題を行うといった行為は効率性の観点から推奨しないが、各自の事情を考慮して注意はしない。ただし、スマートフォンでゲームをするといった行為は極めて非生産的であり、見つけ次第止めるよう注意する。電車の遅延による遅刻が見込まれる場合は授業開始前にメールで、科目名、学籍番号、氏名、遅延している路線名を明記の上連絡をすること。場合によっては小テストの開始時刻を遅らせることがある。",
        "preparatoryStudy": "高校数学B「ベクトル」を講義開始までに復習しておくことを強く勧める。高校で未履修の人は、自習しておくことを極めて強く勧める。予習：次週の内容を教科書で予習する(60分)復習：小テストで間違った箇所を解き直したり、授業中の演習時間に終わらなかった問題を解いて理解する(180分)必要に応じて適宜学修支援センターを利用すること。",
        "gradingGuidelines": "各回の小テスト（全14回を予定）の合計と期末試験によって評価する。小テストの合計点を30点満点、期末試験の得点を70点満点として換算し、100点満点で評価する。60点以上を合格の目安とする。ただし、欠席が多い場合は合格基準を満たしてもX評価となる。成績評価の段階で合格基準に満たなかった者は再試験を受ける機会が与えられる。ただし、再試験はいかなる理由があっても追試験は受けられず、その結果によって合否が判定される。",
        "textbook": "LIBRARY工学基礎&高専TEXT「線形代数」、数理工学社",
        "referenceMaterials": "1.「大学新入生のための数学入門増補版」（石村園子）共立出版2.「理工系のための[詳解]線形代数入門」（富田耕史、長郷文和、日比野正樹）学術図書出版社",
        "courseSchedule": "第1回：平面ベクトル（教科書p.1-6）第2回：ベクトルの成分表示、内積（p.7-14）第3回：平面ベクトルの図形への応用（p.15-25）第4回：空間ベクトル（p.26-33,44-45）第5回：ベクトルの外積(参考書2p.150-156)第6回：複素数の和、積、複素平面、極形式（参考書1p.102-105）第7回：行列の和、スカラー倍、積（p.48-55）第8回：行列の積の特殊性、2次正方行列の逆行列（p.55-62）第9回：行列を用いた連立1次方程式の解法（p.62-64）第10回：行列の基本変形による連立1次方程式の解法（p.65-71）第11回：行列の基本変形による逆行列の導出（p.75-81）第12回：行列式の性質と余因子展開（p.82-87）第13回：余因子行列とクラーメルの公式（p.89-92）(p.88ヴァンデルモンド行列式は除く）第14回：線形変換（p.121-126）第15回：合成変換・逆変換（p.128-134）",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/12/09"
}