{
    "lectureCode": "U2109",
    "courseName": "数学（微分積分）",
    "lecturer": [
        "須田拓馬(教養学環)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１０１４教室"
    ],
    "courceDetails": {
        "courseOverview": "皆さんが将来その操作、保守、点検を任される医療機器は、科学の様々な知見を応用して出来上がっている。それらの知見の多くは、微視的あるいは短時間の現象をモデル化・法則化したものを、巨視的あるいは長時間の記述に書き換えることで用いられる。この時に必要な数学的な操作が、微分と積分である。本授業では、2年次後期に学ぶ「数学（応用解析学）」の基礎として、微分と積分を理解し確実に計算できるようになることを目指す。授業期間の間に演習問題を繰り返し解くことで、計算能力を向上させる。",
        "outcomesMeasuredBy": "1.極限値の概念を理解し、片側極限値や無限大の極限値、不定形の極限値が計算できる。2.基本的な関数の微分が求められる。3.関数のマクローリン展開ができる。4.微分を用いて複雑な形の関数の概形が描ける。5.基本的な関数の不定積分ができ、定積分や広義積分を求めることができる。6.置換積分、部分積分などを駆使して有理関数や無理関数の積分を行うことができる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力",
        "teachingMethod": "-板書を主体とし、計算演習を通じて新しい概念を習得するとともに、微分方程式の解法を身につける。-授業開始前までに授業資料をMoodleにアップロードする。授業中に板書する内容の大部分は授業資料に書かれているので、原則として授業中に板書を書き写す必要はない。-毎回の授業の冒頭で、前回の内容について復習する小テストを行う（初回は除く）。10分間程度の解答時間が与えられ、時間内にMoodleに解答を入力する必要がある。小テストの時間中は教科書、ノートなどを参照してはならない。授業開始前にしっかりと復習しておくこと。-小テストの解答、解説は小テスト直後に行うとともに、解答例は後日Moodleにアップロードする。-小テストの得点(10点満点)と平均点、満点者の人数、3点以下の人数を公表する。-授業時間内で演習の時間をとり、実際の計算問題に慣れてもらう。計算演習はペアかグループで行うことが望ましいので、授業開始時にペアやグループを作りやすいように着席すること。-小テストの得点が低い状態が続いた学生は、学修支援センターの利用を促されることがある。-第15回：微分・積分に関する総合演習では、授業で扱った演習問題について解説を希望する問題を投票形式で事前に選んでもらい、票数の多かった問題について詳しく解説を行う。",
        "notices": "高校数学IIB（特に、三角関数、指数・対数関数）を前提とする。未履修者や自信のない人は前期の「数学基礎」を必ず受講すること。授業時間中には演習問題に取り組む時間がある。ペアやグループでの活動を推奨するので、解答を見せ合ったり、相談しながら解くなど各自で工夫してほしい。授業をやむを得ない事情で欠席する場合は、事情を説明する証明書の写真をメール添付で送るか、授業時間の前後に証明書類を見せること（原本の提出は求めない）。やむを得ない事情と証明書類の一例は以下の通り（これがすべてではない）。-病欠：病院の日付入りの領収書-忌引：告別式の案内やむを得ない事情による欠席が認められれば、小テストは免除扱いとなり、成績評価において不利になることはない。授業中の飲食は推奨しないが、水分補給は禁止しない。授業に関する内容について学生同士で話し合うことは推奨するが、私語は周囲の学生が授業を受ける権利を侵害するので十分に留意すること。居眠りや他の授業の課題を行うといった行為は効率性の観点から推奨しないが、各自の事情を考慮して注意はしない。ただし、スマートフォンでゲームをするといった行為は極めて非生産的であり、見つけ次第止めるよう注意する。",
        "preparatoryStudy": "高校数学Iの全内容（「データの分析」を除く）および高校数学II「三角関数」「指数・対数関数」を講義開始までに復習しておくことを強く勧める。高校で未履修の人は、前期開講の「数学基礎」を受講しておかねばならない。予習：次週の内容を教科書で予習する(60分)復習：小テストで間違った箇所を解き直したり、授業中の演習時間に終わらなかった問題を解いて理解する(180分)必要に応じて適宜学修支援センターを利用すること。",
        "gradingGuidelines": "各回の小テスト（全14回を予定）の合計と期末試験によって評価する。小テストの合計点を30点満点、期末試験の得点を70点満点として換算し、100点満点で評価する。60点以上を合格の目安とする。ただし、欠席が多い場合は合格基準を満たしてもX評価となる。成績評価の段階で合格基準に満たなかった者は再試験を受ける機会が与えられる。ただし、再試験はいかなる理由があっても追試験は受けられず、その結果によって合否が判定される。",
        "textbook": "石原繁、浅野重初「理工系入門微分積分」(裳華房)",
        "referenceMaterials": "第1回：関数の極限と連続性(教科書p.8-16)第2回：微分法の基礎(p.18-30)第3回：指数関数、対数関数の定義と基本的な性質(p.32-39)第4回：三角関数の定義と基本的な性質(p.40-49)第5回：逆三角関数、双曲線関数の定義と基本的な性質(p.50-54)第6回：高階導関数の定義と計算(p.55-60)第7回：不定形の極限値の計算(p.62-69)第8回：テイラー展開、マクローリン展開(p.74-79)第9回：関数の値の変化、曲線の概形(p.80-87)第10回：定積分の定義、区分求積法(p.92-100)第11回：初等関数の不定積分、置換積分法(p.102-110)第12回：部分積分法、有理関数の積分(p.111-117)第13回：三角関数の有理式の積分、無理関数の積分(p.118-123)第14回：定積分の計算と応用(p.126-133)第15回：微分・積分に関する総合演習",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/05\/29"
}