{
    "lectureCode": "U2110",
    "courseName": "医学概論[臨工]",
    "lecturer": [
        "中山孝(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "この科目は、医療福祉領域における実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。本授業の目的は以下のとおりである。.医療の社会的役割を多面的に概観して理解するとともに、チーム医療・多職種連携の重要性を理解する。2.1を通して、将来医療人として社会的貢献を行うための基礎となる、勉学への意欲と協調性、向上心を涵養する。この目的を達成するために、医学・医療に関する重要な項目を網羅して講義する。各々の項目は互いに独立しており、授業内容は一回毎に完結するものが多いので、毎回の講義を真剣に受講し、その内容について深く考えて欲しい。またこの授業で扱われる用語、概念は、将来の授業で頻回に取り上げられることになるので、ここでは各々について基本的に理解する必要がある。受講生がこの授業を通じて、医療がおかれている社会的立場を理解し、医療職に対する社会の期待を実感することで、今後の学修意欲のさらなる向上と人格形成に連ねて欲しい。",
        "outcomesMeasuredBy": "本授業の到達目標は以下のとおりである。１）医療・福祉の社会的役割と直面する問題点、そして歴史について包括的に述べることができる。２）異なる医療職の役割について簡潔に述べることができるとともに、チーム医療・多職種連携の意義について、受講者が志す医療専門職の立場とともに述べることができる。３）自分が卒業後に得る国家資格により行うことができる職業活動と社会貢献について、包括的に述べることができる。以上により、医療専門職として、チーム医療と社会のなかで必要な知識、実学に基づく専門能力、国際的な教養の基礎を熟成する。",
        "learningOutcomes": "実学に基づく専門能力",
        "teachingMethod": "授業計画に基づいて講義を実施する。一部は学外の有識者として招聘して専門の講義を行なうので、講師の都合により講義の順序を変更することもあるが、原則として１ヶ月前までにMoodleなどで周知する。講義の順序が変更した際でも、講義内容は１コマ毎にほぼ独立しているので、学修に支障を来たすことはない。",
        "notices": "講義の終わりに質問の時間を設けるので、疑問や意見を学生諸君の前で述べる習慣も身に着けてほしい。",
        "preparatoryStudy": "メディアなどで医療福祉関連の報道に接した際は、積極的にその内容を吟味し、自分自身の考えを持ける習慣を身に着けてほしい。",
        "gradingGuidelines": "成績評価は、レポートによって行なう。レポートの課題と締切については、講義ならびにMoodleで告知するので、提出方法と締切を厳守すること。",
        "textbook": "現代医学概論（第３版）柳澤信夫著医歯薬出版2023定価3200円＋税",
        "referenceMaterials": "医の未来矢崎義雄編岩波新書2011定価８６１円",
        "courseSchedule": "第1回：医療を学ぶにあたって（中山）第2回：国際医療協力（JICA坂元講師）第3回：医学の歴史（日向）第4回：チーム医療における理学療法（理学療法学専攻長）第5回：医療情報とSecurity（美代客員教授）第6回：病院機能の変化と進歩（篠原）第7回：チーム医療における看護（看護学科長）第8回：チーム医療における作業療法（作業療法学専攻長）第9回：チーム医療における臨床検査（臨床検査学科長）第10回：チーム医療における臨床工学（臨床工学科長）第11回：災害医療（篠原）第12回：チーム医療における言語聴覚（言語聴覚学専攻長）第13回：医療安全（篠原）第14回：社会保険と健康保健（中山）第15回：医療職の役割と身分法（中山）",
        "courseDataUpdatedAt": "2024\/03\/06"
    },
    "updateAt": "2024\/05\/29"
}