{
    "lectureCode": "U2206",
    "courseName": "基礎医学実習",
    "lecturer": [
        "下村美文(医療保健学部臨床工学科)",
        "姉帯飛高(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金3",
        "金4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "Ｍ４０５基礎医学実習室",
        "Ｍ４０７生物・化学実習室"
    ],
    "courceDetails": {
        "courseOverview": "人体解剖学および生理学の講義で学修した知識を活用し、実習を行う｡解剖学の実習では、各臓器を肉眼的観察にて理解した後、顕微鏡にて組織を観察し、臓器の形態と機能を学ぶ。生理学の実習では生理学で習得した、正常人体の機能についての基礎知識を応用し、心電図と血圧測定、肺機能検査、パルスオキシメータによる測定、グルコース測定などの実習を行う。解剖生理とも実習を通して身体のしくみを実感することが重要である。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "基礎医学実習では解剖生理学を実感するために行っているため、理解した内容を簡単に説明できるようになることを到達目標としている。実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力、問題解決力の取得を目指す。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "実習テキストおよびPCスライドにて説明後実習を行う。解剖学の実習では人体臓器模型や動物標本、顕微鏡を使用し、臓器の肉眼観察、組織標本観察を行い、正常組織構造および病理組織構造を観察し、スケッチを行う。生理学の実習では血圧測定、心電図測定、肺機能検査、パルスオキシメータを使った測定、グルコース測定などを行う。実験は班単位でグループワークとして行うが、レポートは各自で作成する。実習中はノートPCの使用はしない。",
        "notices": "学修導入の円滑のために人体解剖学、生理学を復習すること。実習は時間設定が限られているため、時間外での履修は原則的に認められない。積極的な参加が必須である。また、グループでの測定や観察もあるため協力的な姿勢が必要である。各自、白衣、名札、実験用のノート、色鉛筆など実習テキストに指示されたものを準備すること。",
        "preparatoryStudy": "配布する実習テキストを熟読し、予習課題に取り組む。本実習は人体解剖学・生理学の講義内容がすでに理解できていることを前提として行われるため、これらの教科の復習ができていることが前提である。実習終了後には復習を行い、レポートを提出すること。指定されている課題はすべて記載すること。",
        "gradingGuidelines": "実験への取り組み態度（10％）、予習課題、レポートや演習課題等の提出物（90％）を総合的に判断する。全ての実験に出席して、レポートおよび演習課題を期限内に必ず提出することが必要条件となる。",
        "textbook": "基礎医学実習テキスト（配布）クリニカルスタディ（2024年5月増刊号）自分でつくる！解剖生理ポイントノートメヂカルフレンド社系統看護学講座人体の構造と機能[1]解剖生理学（医学書院）（1年次の「人体解剖学」で使用した教科書）",
        "referenceMaterials": "第1回:ガイダンス（下村）第2回:生理学1：pH変化と緩衝液の働き、生物の視覚（下村）第3回:生理学2：グルコース測定（下村）第4回:生理学3：血圧測定（下村）第5回:生理学4：肺機能測定（下村）第6回:生理学5：心電図測定（下村）第7回:生理学6:パルスオキシメータを用いた測定（下村）第8回:生理学実習のまとめ（下村）第9回:解剖学1：循環器系（姉帯）第10回:解剖学2：呼吸器系（姉帯）第11回:解剖学3：泌尿器系（姉帯）第12回:解剖学4：骨格系（姉帯）第13回:解剖学5：全身の系統解剖学（姉帯）第14回:人体解剖見学（姉帯・下村）第15回:解剖学実習のまとめ（姉帯）＊人体解剖見学（日程は後期までに確定する）",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/28"
    },
    "updateAt": "2024\/09\/12"
}