{
    "lectureCode": "U2209",
    "courseName": "医用機械工学",
    "lecturer": [
        "苗村潔(医療保健学部臨床工学科)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３０２１１教室"
    ],
    "courceDetails": {
        "courseOverview": "臨床工学技士として身につけておくべき機械工学について述べる。理論の説明だけでなく、実際の機器との関連性についても解説する。この知識をもつことで、医療機器の操作、保守点検を確実におこなえるようになることを目指す。本講義では機械工学の基礎になる４力学（機械力学、材料力学、流体力学、熱力学）について、法則や公式の導出過程に注目して説明する。",
        "outcomesMeasuredBy": "生体機能の理解（人体の共振周波数）や医療機器の設計（材料力学と流体力学を使ったセンサや血液ポンプの設計）に用いられる機械工学の知識について「論理的な思考力」を身につけることを目標にする。また、物体の運動、振動（減衰振動、強制振動と共振）、材料力学の応力ひずみ線図とヤング率、ポアソン比、安全率の考え方、流体力学のパスカルの原理、ベルヌーイの定理、ハーゲンポアズイユの式、熱力学の比熱、第1法則、ボイル・シャルルの法則に関して理解して計算できる「実学に基づく専門能力」「問題解決力」を獲得する。さらに、機械を創造する力を身に着ける。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "教科書に沿って板書して説明する。理解を深めるために、理論とそれに関連する問題を、教科書および講義中の説明と、図書館にある書籍の内容を整理して毎回提出する形で、アクティブラーニングを実施する。ノートパソコンは資料閲覧で必要な場合に使用する。未来の医用機械を自由に創造する課題では、優秀な内容を受講生全員の前で発表してもらう。",
        "notices": "予習、復習を十分によくすること。キーワードについて教科書および図書館で書籍を調べて手書きでまとめること。moodleにレポートで使用するデータ、関連資料を掲載するので、参照すること。",
        "preparatoryStudy": "授業計画に記載のある内容の教科書該当ページを読んでおき、関連問題を事前に予習する形で反転授業を行なう。物理の世界の講義で学んだことは、基本的に重複して説明しないので、よく復習すること。演習課題について予習すること。",
        "gradingGuidelines": "定期試験80点換算、提出課題20点換算で評価し、100点満点中60点以上（ただし提出課題20点満点に対して12点以上）で単位認定とする。",
        "textbook": "臨床工学技士標準テキスト、金原出版基礎物理学、学術図書出版社（「物理の世界」「電磁気学」と同じもの）",
        "referenceMaterials": "機械工学に関する書籍を図書館で各自探して欲しい。",
        "courseSchedule": "第1回:機械の定義と歴史、質点の力学復習第2回:機械力学１（円運動）第3回:機械力学２（単振動、減衰振動、強制振動）第4回:機械力学３（剛体、慣性モーメント）、材料力学１（応力、ひずみ、ヤング率）第5回:材料力学２（引張試験、ポアソン比、曲げと圧力センサ設計）第6回:材料力学３（許容応力、応力集中、安全率、ねじりとローラーポンプ軸設計）第7回:流体力学１（圧力、パスカルの原理）第8回:流体力学２（密度、圧力によるエネルギー、ベルヌーイの定理）第9回:流体力学３（連続の式）第10回:流体力学４（粘性、ニュートン流体）第11回:流体力学５（レイノルズ数）第12回:流体力学６（ハーゲン・ポアゼイユの式、遠心ポンプ）第13回:熱力学１（比熱、熱伝導率、熱の伝わり方）第14回:熱力学２（熱力学的仕事、第1法則、第2法則）第15回:まとめ、未来の医用機械発表会",
        "courseDataUpdatedAt": "2024\/01\/27"
    },
    "updateAt": "2024\/09\/12"
}