{
    "lectureCode": "U2202",
    "courseName": "臨床生化学",
    "lecturer": [
        "下村美文(医療保健学部臨床工学科)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３０２１１教室"
    ],
    "courceDetails": {
        "courseOverview": "生化学は、生体の恒常性の維持に必要な生体構成物質の構造、反応、機能および代謝に関する学問であり、生命や病気の理解に必須である。臨床工学技士として生命維持装置の原理と操作に通暁するにも、本授業の学修がかかせない。生体を構成するタンパク質、糖質、脂質など生体物質の化学構造、主要な酵素・補酵素と反応機構、糖・アミノ酸・脂質等の代謝、核酸と遺伝情報についての基礎知識を学修する。この科目では、国際的な教養を身につけると共に，実学に基づく専門能力を育成することを目標としている。",
        "outcomesMeasuredBy": "生体を構成する物質を知る。遺伝子と遺伝情報を理解する。酵素とその働きを理解する。糖代謝、脂質代謝、アミノ酸代謝とこれらに関する疾病の説明ができる。核酸代謝、ポルフィリン代謝とこれらに関する疾病の説明ができる。ビタミンとその欠乏症を習得する。血液のはたらきについて説明できる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力",
        "teachingMethod": "パワーポイントを用いた講義を主体として行い、随時課題を含める。moodle上の資料を見ながら講義を受講できるように、ノートPCを必携すること。参考資料は毎回、moodle上にアップする。",
        "notices": "高校内容の化学や生物、1年次の「化学の世界」を復習しておくと学修の導入が円滑になる。",
        "preparatoryStudy": "予習：教科書を読んでくること。復習：しっかりと復習すること。授業内容の理解を確認し、必要な用語等は暗記すること。",
        "gradingGuidelines": "成績理解度をチェックするために授業中に行う、授業内容に即した課題（40%）および期末試験の成績（60%）を総合的に判断する。専門科目を学ぶ上で、十分な基礎学力がついたかどうかを評価基準とする。課題評価後、講義内で理解の不足している部分の補足説明を行い、moodle上に模範解答を掲示することでフィードバックを行う。",
        "textbook": "系統看護学講座専門基礎分野生化学第14版医学書院(2019)クリニカルスタディ（2023年11月増刊号）1年生からはじめる国試対策ドリルメヂカルフレンド社",
        "referenceMaterials": "ブルーバックスアメリカ版大学生物学の教科書第１巻、第３巻講談社ヴォート生化学東京化学同人",
        "courseSchedule": "第1回:はじめに人体を構成する元素、細胞の構造第2回:遺伝情報核酸の構造、DNAとRNAの構造、複製、転写、翻訳（タンパク質の合成）第3回:糖代謝（１）糖の消化と吸収、糖代謝の概要、グルコースの分解、グリコーゲン代謝第4回:糖代謝（２）糖新生、ペントースリン酸回路、血糖の調節、糖尿病第5回:脂質代謝（１）脂質の消化と吸収、脂質代謝の概要、脂肪酸の代謝第6回:脂質代謝（２）脂肪酸の生合成、コレステロールの生合成と代謝、動脈硬化、エイコサノイド第7回:タンパク質代謝（１）タンパク質の種類とはたらき、タンパク質の消化と吸収、タンパク質代謝の概要第8回:タンパク質代謝（２）アミノ酸代謝、アミノ酸合成、非必須アミノ酸の合成第9回:到達度演習まとめ①糖代謝、脂質代謝、タンパク質代謝第10回:核酸代謝、ポルフィリン代謝第11回:酵素酵素に関する基礎知識、酵素反応とその阻害第12回:ビタミン（１）脂溶性ビタミン第13回:到達度演習まとめ②第14回:ビタミン（２）水溶性のビタミン、ビタミンと補酵素、ミネラル第15回:血液凝固血液の構成成分とはたらき、血球について、止血と線溶",
        "courseDataUpdatedAt": "2024/01/28"
    },
    "updateAt": "2024/12/09"
}