{
    "lectureCode": "U2403",
    "courseName": "医療情報演習",
    "lecturer": [
        "野田雅司(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "金3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１１１２教室"
    ],
    "courceDetails": {
        "courseOverview": "・医療情報の歴史や最新の医療情報関連知識、部門別、地域医療、遠隔医療システム、医療ビックデータの活用、医療ＡＩなどの関連知識を授業で紹介する。・教育用電子カルテを使い、診療所、病院の外来・入院などの医療情報システムを理解する。・模擬患者の診療記録データを入力、保存などの流れ等を理解する。・医療従事者が知っておくべき情報セキュリティ知識を理解する。・【医療ＤＸ令和ビジョン2030】まであと５年、医療分野のＤＸ化は劇的に進展していく。その時代の流れに乗ることができる医療従事者を育成したい。",
        "outcomesMeasuredBy": "・医療情報の歴史や部門別、地域医療、遠隔医療、医療ＡＩなどの関連知識を理解している。・医療現場で必須となる最新の医療情報システムの仕組みを理解している。・診療記録データの入力、保存などの流れ等を理解している。・医療従事者が知っておくべき情報セキュリティ知識を理解している。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "オンデマンドで実施します。①Moodle3.9に保存してあるPowerPointとWordなどのファイルがあるので、まずはそちらを見てください。②次に動画ファイルがあります。容量が大きいので何回かに分け動画を用意しています。③問題も用意してあります。解答してください。",
        "notices": "毎回授業に出席すること。予習・復習などの履修上の注意に関しては、最初の授業の際に説明する。",
        "preparatoryStudy": "Windowsの操作、文書作成等の情報リテラシーを復習しておくこと。",
        "gradingGuidelines": "■出席の取り方…本講義では概ね毎回問題を用意しています。解答を野田までメールしてください。s06751ab@edu.teu.ac.jpです。■成績のつけ方…概ね毎回問題があります。・問題の成績が50点、小テスト成績が50点、合計で100点満点。■評価…60点以上Ｃ、70点以上Ｂ、80点以上Ａ、90点以上Ｓ。",
        "textbook": "プリント対応等。",
        "referenceMaterials": "野田雅司・伊藤敦子著『三訂医療情報管理』（建帛社）菊池聖一・野口孝之・野田雅司『三訂医事コンピュータ関連知識』（建帛社）",
        "courseSchedule": "第1回:医療情報システムの全体像第2回:医療情報システム関連知識（医事、検査部門、医療画像、オーダリングシステム、電子カルテシステム等）第3回:検査部門システム（検体、細菌、病理、輸血、生体等）第4回:医用画像システム（胸部Ｘ線、胃部Ｘ線、ＣＴ、ＭＲＩ、ＰＥＴ、ＰＡＣＳ、ＲＩＳ、DICOM等）第5回:部門システム（薬剤部調剤支援、物流、NST、クリティカルパス、看護支援、看護勤務、リハビリテーション等）第6回:部門システム（診療情報管理、手術管理、再来受付、人事・給与、財務経理、経営管理等）第7回:医療機関の情報セキュリティ第8回:地域医療システム、遠隔医療システム第9回:医療統計（病院経営）第10回:オンライン資格確認（医療機関）第11回:ＡＩ、ＩｏＴの利用による新システム（基礎知識・検査・診察・手術・薬・介護等）第12回:医療情報システム演習（診療所）第13回:医療情報システム演習（病院外来）第14回:医療情報システム演習（病院入院）第15回:小テスト概要説明",
        "courseDataUpdatedAt": "2025/01/17"
    },
    "updateAt": "2025/03/21"
}