{
    "lectureCode": "W2102",
    "courseName": "医療入門演習",
    "lecturer": [
        "安藤ゆうき(医療保健学部臨床工学科)",
        "上條史記(医療保健学部臨床工学科)",
        "島峰徹也(医療保健学部臨床工学科)",
        "佐藤広隆(医療保健学部臨床工学科)",
        "髙橋優太(医療保健学部臨床工学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火",
        "金"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３０２１１教室",
        "３０２１２教室"
    ],
    "courceDetails": {
        "courseOverview": "臨床工学技士を目指すために医療全般についての理解を深める。また、他業種の理解を深め、チーム医療の概念を把握する。本学の3ポリシーで定める6つの能力のうち「国際的な教養」「実学に基づく専門能力」「コミュニケーション能力」「論理的な思考力」「分析・評価能力」「問題解決力」について重点的に修得を目指す。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "医療全般を客観的に思考できる資質を身に付ける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "学生自ら主体的な学び（アクティブラーニング及びグループワーク）を行う。ノートPCは適宜使用する。",
        "notices": "授業開始前に前回のレポートを提出すること。",
        "preparatoryStudy": "医療従事者になることを意識して本や新聞等を読み、演習内容について自発的に調査すること。",
        "gradingGuidelines": "レポート及び授業の取組姿勢（グループワーク・アクティブラーニング）を中心に評価する。",
        "textbook": "指定しない",
        "referenceMaterials": "指定しない",
        "courseSchedule": "第1回：オリエンテーション・臨床工学講座1（全教員）第2回：臨床工学講座2（全教員）第3回：臨床工学講座3（全教員）第4回：臨床工学講座4（全教員）第5回：医療機器体験講座1（全教員）第6回：医療機器体験講座2（全教員）第7回：接遇マナー講座1（外部講師：安藤・高橋）第8回：接遇マナー講座2（外部講師：島峰）第9回：接遇マナー講座3（外部講師：佐藤）第10回：接遇マナー講座4（外部講師：安藤・高橋）第11回：医療機器体験講座3（全教員）第12回：医療機器体験講座4（全教員）第13回：臨床工学講座5（全教員）第14回：臨床工学講座6（全教員）第15回：臨床工学講座7（全教員）第16回：接遇マナー講座5（外部講師：島峰）第17回：接遇マナー講座6（外部講師：佐藤）第18回：看護学（看護学科教員・安藤・高橋）第19回：理学療法学（理学療法学科教員・佐藤）第20回：作業療法学（作業療法学科教員・上條）第21回：臨床検査学（臨床検査学科教員・島峰）第22回：医療機器体験講座5（全教員）第23回：医療機器体験講座6（全教員）第24回：医療機器体験講座7（全教員）第25回：医療機器体験講座8（全教員）第26回：医療機器体験講座9（全教員）第27回：医療機器体験講座10（全教員）第28回：臨床工学講座8（全教員）第29回：臨床工学講座9（全教員）第30回：まとめ・臨床実習報告会の参加（全教員）",
        "courseDataUpdatedAt": "2024\/01\/18"
    },
    "updateAt": "2024\/09\/12"
}