{
    "lectureCode": "W2208",
    "courseName": "外科系臨床医学I",
    "lecturer": [
        "篠原一彦(医療保健学部臨床工学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１０１２教室"
    ],
    "courceDetails": {
        "courseOverview": "臨床工学技士として必要な外科学の基礎を理解するとともに病院実習のために必要な医療人としての知識と心構えも併せて修めることが本講義の目的である。まず外科系臨床の基礎である侵襲とショック・創傷治癒・消毒滅菌・外科栄養と周術期管理などについて学修する。さらに消化器一般外科・心臓血管外科・呼吸器外科・脳神経外科の疾患と診断治療について学修し、卒業時に必要な基礎知識を修得するとともに、外科学の将来展望についての理解を深める。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "臨床工学技士に必要な、外科総論、外科的疾患の診断と治療、臨床工学業務との関連性を理解することで、医療職・臨床工学技士としての専門能力、論理的思考力、分析評価能力、問題解決力を身に着ける。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "臨床工学技士に必要な臨床外科学に関する基礎知識を、外科手術の映像などとともに講義形式で学修する。",
        "notices": "豊富な動画や画像を供覧するので、出席することはもとより、積極的な講義への参加が必須である。当然のことであるが、遅刻や私語は厳禁である。",
        "preparatoryStudy": "講義概要に基づき指定した外科学に関するテキストで講義内容について予習するとともに、臨床工学技士のテキストなどで使用機材や臨床工学技士業務と外科学との関連事項についても予習すること。",
        "gradingGuidelines": "授業参加態度、開講中に提出する課題ならびに期末に課題の一環として提出する試験を総合的に評価する。",
        "textbook": "臨床医学総論第２版（日本臨床工学技士教育施設協議会編、医歯薬出版、2020、東京）",
        "referenceMaterials": "臨床工学技士標準テキスト（金原出版）ナースのための外科学（中外医学社）標準外科学（医学書院）コメディカルのための外科学総論（医学出版社）",
        "courseSchedule": "第1回:近代外科手術の基礎１：安全な外科手術を可能とした麻酔や無菌法など外科の基礎と歴史を学修する第2回:近代外科手術の基礎２：今日の臨床外科手術で用いる主要機器について臨床外科の立場から学修する第3回:外科学総論１：手術前後の患者評価と管理についての概要を学修する第4回:外科学総論２：外科侵襲学と創傷治癒の基礎と創傷管理について概要を学修する第5回:消化器外科１：消化管の外科的疾患の病態、術式、使用器材、周術期管理の概要について学修する第6回:消化器外科２：肝胆膵の外科的疾患の病態、術式、使用器材、周術期管理の概要について学修する第7回:内視鏡外科学概論：内視鏡外科手術の歴史と適応疾患の拡大、使用器材の進歩について学修する第8回:心臓血管外科１：心臓外科の基礎とASD、VSD等代表的先天性心疾患の概要と術式について学修する第9回:心臓血管外科2：心臓弁膜症・虚血性心疾患の概要と術式について学修する第10回:心臓血管外科3：血管外科の概要と補助人工心臓の概要について学修する第11回:乳腺外科：乳腺外科の概要について学修する第12回:呼吸器外科：肺縦隔領域の代表的外科疾患の概要と術式について学修する第13回:泌尿器外科学：泌尿器外科と透析用シャントの概要について学修する第14回:一般外科・小児外科：小児外科の概要とヘルニア・虫垂炎など一般的外科疾患について学修する第15回:外傷外科概論：臨床工学技士として知っておくべき外傷外科の概要について学修する",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/12/09"
}