{
    "lectureCode": "W2309",
    "courseName": "内科系臨床医学II",
    "lecturer": [
        "川又紀彦(医療保健学部臨床検査学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１０１３教室"
    ],
    "courceDetails": {
        "courseOverview": "臨床工学技士として関与する可能性の高い内科系疾患について2年生で学んだことの内容を深める。2年生での復習や各分野についての課題についての講義である。自ら知らない事がある場合はそれを調べ、その内容を発表する。一度は発表を体験する。この科目は、実務に基づいた講義を行う実践的授業である。",
        "outcomesMeasuredBy": "自分で考えて、問題解決を図り、調べる能力も持つ臨床工学士になるべき基礎力を身につける。人に頼らず自分で調べて理解することを習慣付ける。実学に基づく専門能力、分析・評価能力に加え、論理的な思考力、問題解決力、コミュニケーション能力をつける。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "腎透析、人工呼吸器、輸液、感染症などに関連した内科的内容についての講義を行う。PDFを表示して、それに基づいて授業を行う。授業終了後に資料は配布する。事前に資料は配布しない。",
        "notices": "2年生の時の知識のまとめと復習で理解を深める。受動的に講義を受けるだけでなく、自ら、疑問をもち、調べ、解決するという能動的学修が必要である。配布資料は他人（友人や後輩）に譲渡したり、SNSなどで公開することを禁じる。",
        "preparatoryStudy": "教科書・参考書・医療系のネットのサイトなどの情報を参考に予習をする。生理学、病理学の学修を同時に行い、関連した知識を理解し、準備をする。事前に下記の教科書の各項を読んでおくことを勧める。",
        "gradingGuidelines": "期末テストの成績で判断する。出題範囲・難易度・形式は臨床工学技士国家試験に準じる。偏差値４０以上で合格とする。",
        "textbook": "なるほどなっとく内科学（南山堂）",
        "referenceMaterials": "臨床工学講座臨床医学総論（日本臨床工学技士教育施設協議会編、医歯薬出版）。",
        "courseSchedule": "第1回：総論・症候・バイタルサイン測定機器（体温・血圧・心拍数・呼吸数・Sp02)第2回：呼吸器疾患：呼吸器の解剖と構造、呼吸器系の検査（生理機能検査・画像検査・気管支鏡）呼吸器系の疾患（気管支喘息・肺気腫・慢性閉塞性肺疾患・肺梗塞・ロングフライト症候群・肺炎・肺がん・過換気症候群・睡眠時無呼吸症）、肺癌、酸素療法・人工呼吸器第3回：循環器疾患：心臓・大血管の構造と解剖、検査（心電図・胸部レントゲン・心エコー・心臓カテーテル・心臓CT）主な心・大血管の疾患（心不全・不整脈・虚血性心疾患・心筋疾患・弁膜症・先天性心疾患・大動脈瘤など）、冠動脈インターベンション・ペースメーカー・薬物療法、体外循環第4回：消化管疾患：消化管（食道・胃・小腸・大腸）の解剖と構造、検査（腹部レントゲン・CT・超音波・胃カメラ・大腸カメラ）、消化管の疾患（食道・胃・十二指腸・大腸疾患）、胃癌・大腸癌第5回：肝・胆・膵疾患：肝・胆・膵の構造と解剖、検査（血液検査・腹部エコー・ＣＴ・腹腔鏡・血管造影・肝生検）主な肝・胆・膵の疾患（急性肝炎・慢性肝炎・肝硬変・アルコール性肝障害・脂肪肝・急性/慢性膵炎、胆石症）黄疸、肝臓癌・膵臓癌・胆のう癌・胆のうポリープ第6回：糖尿病・代謝性疾患：糖尿病の症状・診断法・合併症・治療法、高血糖・低血糖、高脂血症、痛風、肥満症/メタボリック・シンドローム第7回：内分泌疾患：ホルモンの種類と機能、ホルモン器官の解剖と構造、検査（血液検査・超音波検査・画像検査など）主な内分泌の疾患（甲状腺機能亢進症（バセドー病）・甲状腺機能低下症（橋本病）副腎疾患（クッシング症候群・アジソン病・褐色細胞腫）など）第8回：腎・泌尿器疾患：腎・泌尿器の構造と解剖、検査（血液検査・尿検査・超音波・CT・レノグラム・生検・膀胱鏡）透析・輸液・酸塩基測定装置、腎・泌尿器系の主な疾患（原発性糸球体腎炎・続発性糸球体腎炎（糖尿病腎症・痛風腎）・腎盂腎炎、腎結石（尿路結石））第9回：脳の血管性疾患：脳と脳血管の構造と解剖、検査（髄液検査・MRI・CT）、脳血管障害疾患（脳卒中/脳梗塞・脳出血・くも膜下出血・慢性硬膜下血種）第10回以降は備考を参照",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/05/29"
}