{
    "lectureCode": "W2310",
    "courseName": "外科系臨床医学II",
    "lecturer": [
        "篠原一彦(医療保健学部臨床工学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１０１３教室"
    ],
    "courceDetails": {
        "courseOverview": "外科系臨床医学Ｉに引き続き臨床工学技士に必要な外科系臨床医学について、癌の集学的治療（Interventionalradiologyや低侵襲治療を含む）・麻酔科学・手術部医学・救命救急医学・集中治療医学等について、ケーススタディとともに学修する。2年後期に履修した外科系臨床医学Ⅰとともに臨床工学技士として必要な外科系臨床医学の知識を修めるとともに、3年後期の病院実習で必要な医療人としてのモチベーションと行動規範にも理解を深める。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "臨床工学技士に必要な、外科系臨床医学Ⅰに引き続き、外科総論、外科的疾患の診断と治療、臨床工学業務との関連性を理解することを目的とすることで、医療職、臨床工学技士としての専門能力、論理的思考力、分析評価能力、問題解決力を身に着ける",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "臨床工学技士に必要な臨床外科学に関する基礎知識を、外科手術の映像などとともに講義形式で学修する。",
        "notices": "豊富な動画や画像を供覧するので、積極的な講義への参加が必須である。当然のことであるが、遅刻や私語は厳禁である。",
        "preparatoryStudy": "講義概要に基づき指定した外科学に関するテキストで講義について予習するとともに、臨床工学技士のテキストなどで使用機材や臨床工学技士業務と外科学との関連事項についても予習すること。",
        "gradingGuidelines": "期末試験、適宜提出する小課題などで総合的に評価する。",
        "textbook": "臨床工学講座臨床医学総論第2版（日本臨床工学技士教育施設協議会編、医歯薬出版、2020、東京）",
        "referenceMaterials": "標準外科学（医学書院）ナースのための外科学、医用治療機器学（篠原編、医歯薬出版、2008東京）臨床工学技士標準テキスト（金原出版）",
        "courseSchedule": "第1回:癌の集学的治療１：癌の縮小手術を可能とした抗がん剤の概要について学修する第2回:癌の集学的治療２：放射線照射などの概要と使用器材について学修する第3回:移植外科学概論：臓器移植の概要と術式、周術期管理、脳死判定等を学修する第4回:病院建築概論：手術部や中央材料部、輸血部などの進歩など病院管理、病院建築の概要を学修する第5回:内分泌外科：甲状腺・副腎など内分泌外科の概要を学修するとともに、ホルモンの復習も行う第6回:産婦人科の概要：代表的な婦人科手術と産科救急の概要について学修する第7回:脳神経外科：代表的な脳外科手術について学修する第8回:眼科の概要：代表的な眼科手術と使用器材について学修する第9回:整形外科：代表的な整形外科手術と使用器材について学修する第10回:皮膚科：代表的な皮膚疾患について学修するとともにアレルギーについて復習する第11回:形成外科：形成外科・美容外科の主要疾患と手術について学修するとともに使用器材についても学修する第12回:麻酔科：麻酔科学の基礎と復習とともにトピックスについて学修する第13回:輸血学概論：輸血の基礎と臨床について学修する第14回:航空医学概論：航空医学の概要、航空患者搬送時の生理学的変化、高気圧酸素療法について学修する第15回:振り返り",
        "courseDataUpdatedAt": "2024\/05\/29"
    },
    "updateAt": "2024\/09\/12"
}