{
    "lectureCode": "11042K1",
    "courseName": "数学概論[ES1]",
    "lecturer": [
        "山本雅義(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水"
    ],
    "targetDepartment": "工学部機械工学科,工学部電気電子工学科,工学部応用化学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ３０２"
    ],
    "courceDetails": {
        "courseOverview": "数学は学問の中でも最も古いものの一つであるが、今なお新たな分野を開拓しては、その裾野を広げ発展し続けている。これは、人間社会の進展とともに絶えず新たな問題が生じ、そこに数学的な問題解決の手法が要求されるからであり、俯瞰的な視点に立てば、理工系、人文社会系における応用上の課題と数学の分野の広がりの間に密接なつながりがあることを見てとることができる。このことを踏まえ、本講義では数学の理学、工学への応用例を紹介することを通して、大学で学ぶべき数学について概説する予定である。本講義では、論理的な思考力と問題解決力を身につけることを主な目標とする。加えて、具体的な応用例に触れることを通して、分析・評価能力も養うこととする。また、数学の理工系分野における基礎的な言語としての役割について認識を深めることにより、コミュニケーション能力の習得も目指す。",
        "outcomesMeasuredBy": "応用上の視点から数学を現象や状態のモデルを記述するためのツールとして捉え、行列や方程式、微分方程式などの概念の有用性について理解を深めることに加えて、数学の簡潔な記述を理解する能力を身につけることを主な目標とする。講義全体を通して言葉の定義をよく理解し、演繹するという作業に意識を向けることで、論理的な思考力、問題解決力、コミュニケーション能力の習得を目指す。また、講義中に提示される応用例や問題を通して分析・評価能力を養う。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義を中心に進める。また、講義の合間に適宜、理解度確認の演習を行う。なお、講義中のノートPC使用については学部、クラスにより対応が異なるので、初回のアナウンスに注意すること。",
        "notices": "多彩なトピックが盛り込まれており、個々の内容はそれだけで通年の講義に値するものであるが、いずれも深く掘り下げることはせず、数学の応用の世界を素養として知ることに主眼をおく。それゆえ、思考する姿勢が暗に求められる。この“考える”姿勢を毎回保ち、講義に臨むこと。",
        "preparatoryStudy": "高校数学（特に数学I，A，II，B）の知識をある程度前提として話を進める。したがって、忘れていると思われる内容については十分な復習をし、いつでも知識が引き出せるよう備えをしておくこと。各回の講義前には予定されているトピックについて，指定参考書や図書館の書籍などを読んで予習しておくこと．講義後は講義中に出された演習問題を解き，さらには講義内容について自力でまとめてみること．講義の内容を他者に説明できるようになることが望ましい．",
        "gradingGuidelines": "期末試験の成績70%、レポート・演習の成績30%の割合で素点を100点満点に換算し、成績評価を行う。60点以上が単位認定の要件となる。提出物や小テスト、学修状況について、講義中に適宜コメントや講評などの形でフィードバックを行う予定である。",
        "textbook": "指定しない。",
        "referenceMaterials": "『数学の森-大学必須数学の鳥瞰図』（岡本和夫・長岡亮介著，東京図書）",
        "courseSchedule": "第1回：ガイダンス：数学の工学への応用に向けて第2回：代数と幾何(1)：複素数，ガウス平面第3回：代数と幾何(2)：群の定義と応用第4回：代数と幾何(3)：ベクトル空間の定義と例第5回：代数と幾何(4)：線形写像の定義と例第6回：代数と幾何(5)：線形写像の応用，図形の変換(1)第7回：代数と幾何(6)：線形写像の応用，図形の変換(2)第8回：前半のまとめ第9回：解析学の基礎と応用(1)：微分，積分の定義第10回：解析学の基礎と応用(2)：関数の多項式近似第11回：解析学の基礎と応用(3)：常微分方程式の基礎第12回：解析学の基礎と応用(4)：常微分方程式の応用第13回：解析学の基礎と応用(5)：フーリエ級数展開第14回：総合演習注：学部・学科の要請によって、上記以外の内容を扱うことがある。",
        "courseDataUpdatedAt": "2024/03/21"
    },
    "updateAt": "2024/08/07"
}