{
    "lectureCode": "K001301",
    "courseName": "サステイナブル工学プロジェクト演習[A]",
    "lecturer": [
        "江頭靖幸(工学部応用化学科)",
        "野田龍介(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "工学部機械工学科,工学部電気電子工学科,工学部応用化学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "研究棟Ａ３０２"
    ],
    "courceDetails": {
        "courseOverview": "サステイナブル工学とは、持続可能な社会（サステイナブル社会）の実現に貢献するために、研究や技術開発において、ライフサイクル思考に基づいてplanet（地球環境との調和）、people（生活の質の向上）、prosperity（経済の活性化）という3つの視点を同時に考慮し、それぞれを望ましい水準に保つとともに、将来に渡って維持・向上する方向での科学的なアプローチを実践する工学である。本授業では、環境影響評価の基本技法であるLCA（LifeCycleAssessment）のサステイナビリティ評価への拡張を前提に、具体的な課題を設定し、PBL形式でサステイナブル工学の実践に向けた製品評価と改善手法について学ぶ。演習では、三学科の学生から構成されるチーム単位で与えられた工業製品を対象として、環境影響の分析評価だけでなく、サステイナビリティの観点から多面的に考察する。検討結果や得られた知見をプレゼンテーションにまとめ、成果発表や討論を行う。製品の環境影響に関する定量的な評価に必要な知識に加え、グループでの改善提案の策定と実現可能性の評価を通してサステイナブル工学の実践能力が身につく。",
        "outcomesMeasuredBy": "本授業科目では以下を到達目標とする。１）ライフサイクル思考に基づき製品の環境負荷について評価できる。２）LCAツールを駆使して対象製品のサステイナビリティを考察できる。３）異なるバックグラウンドのメンバーと協力して製品の課題について検討し、チーム独自の改善案を作成できる。４）発表した改善提案に対する他者の意見を踏まえ、更なる改善策を講じて最終提案としてまとめられる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "授業は三学科合同チームによるオンラインでのグループワークを中心とする。ただし、ノートPCにLCAソフトを実装しての分析作業が必須であるため、授業開始当初はその解説を対面形式で実施する。オンライン授業についてのインストラクションの後、グループ活動をスタートする。対象の工業製品のLCAからサステイナビリティ評価へと議論を展開し考察を深めていく。学生が自発的に学修を進めて、サステイナビリティに関する総合的な知見を獲得し、課題解決力を養成するアクティブラーニング型の授業である。中間発表での教員からのアドバイスを元に、グループ内で議論を重ねて改善提案を検討し、最終発表会（予選･本選の2回）に臨む。",
        "notices": "本実習は「サステイナブル工学基礎」および「サステイナブル工学実習」の履修を前提として構成されている。",
        "preparatoryStudy": "各授業後はグループワークによる検討の進捗状況を整理し、次回までに取り組むべき内容や事前に準備する内容等をチェックして適宜対応する。また、レポート等の課題が与えられた場合は、期限を厳守し必ず提出すること。また次回の演習に役立ちそうな情報を確認しておくこと（合計60分程度）全体の授業開始前に下記参考書の当該部分を一読し、概要を把握しておくこと、また、これまでのサステイナブル工学に関する講義や実習の内容を復習しておくとことは、本授業でのグループワークを充実させるために役立つ。",
        "gradingGuidelines": "ルーブリックを用いた各グループワークにおける貢献度評価（40％）、中間レポート（20％）、最終レポート（40％）にグループメンバーによる相互評価の結果を加味して総合的に評価する。なお、各％は目安である。",
        "textbook": "なし",
        "referenceMaterials": "・環境省「環境白書」および資源エネルギー庁「エネルギー白書」（ともに政府HPより入手可能）",
        "courseSchedule": "・第1回：イントロダクション（ライフサイクル思考、LCAソフトウェアの実装）[対面]・第2回：LCAソフトウェアの習得（ソフトウェアの使用方法の習得、ケーススタディ）[対面]・第3回：工業製品の環境影響評価①（ソフトウェアを用いたLCA評価）[リアルタイムオンライン]・第4回：工業製品の環境影響評価②（対象製品の決定、インベントリ分析）[リアルタイムオンライン]・第5回：工業製品の環境影響評価③（ライフサイクル影響評価、改善提案の策定）[リアルタイムオンライン]・第6回：改善提案（提案内容の検証、LCA結果のまとめ、発表資料作成）[リアルタイムオンライン]・第7回：中間発表（教員や他のグループとの意見交換）[対面]・第8回：方針検討（中間発表のフィードバック、環境効率算出方法の検討）[リアルタイムオンライン]・第9回：工業製品のサステイナビリティ評価①（環境効率算出のための価値の選定）[リアルタイムオンライン]・第10回：工業製品のサステイナビリティ評価②（環境効率指標の算出）[リアルタイムオンライン]・第11回：工業製品のサステイナビリティ評価③（総合評価）[リアルタイムオンライン]・第12回：改善提案（提案内容の検証、評価結果のまとめ、発表資料作成）[リアルタイムオンライン]・第13回：最終発表（予選）[対面]・第14回：最終発表（本選）（最終レポートの作成）[対面]",
        "courseDataUpdatedAt": "2024\/02\/05"
    },
    "updateAt": "2024\/09\/13"
}