{
    "lectureCode": "K500601",
    "courseName": "安全工学",
    "lecturer": [
        "片桐利真(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "工学部機械工学科,工学部電気電子工学科,工学部応用化学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "工学は人を幸せにするための学問である。したがって、その実践には「安全」への最大限の配慮を必要とする。しかし、安全はTPO(Time,Place,Occasion)により大きく異なる。日本の産業と安全を現場から支えてきた「改善提案」の不適切な適用は、1999年に東海村JCOの臨界事故を引き起こした。安全には「情報」や「知識」だけではなく、それを臨機応変に現場に当てはめる「知恵」を必要とする。さらに、これからのサステイナブル社会は国際的視野での安全を求めており、それを支えるために必要な学問分野や教養の裾野は広い。本講義では、安全における倫理学、心理学、法学などの広範な教養・知識の重要性を理解し、安全を推進するための手法（魚の骨図・ヒヤリハット）や技術を学び、工学部生として知っておくべき危険要因とその発見法を習得し、それを元に社会で「安全を指導する」人材に必要な基礎的な能力の獲得を目指す。この講義では講師の企業(日本鉱業株式会社、現ENEOS)での安全実務経験(改善提案の評価委員、ヒヤリハットの評価委員、職場安全巡視担当)を元に、ヒヤリハットの作成をひとつのゴールとして、さらに安全巡視に必要な産業現場に関する安全の基礎知識の獲得をもうひとつのゴールとする実践的な科目である。",
        "outcomesMeasuredBy": "社会・現場での安全指導に必要な技能の獲得を目指す。すなわち、正しく状況を把握する「取材力」(分析評価能力)、安全に関する正しい基礎的な知識に基づく「理解力」(国際的な教養と実学的専門能力と技術)、正しく安全対策を考える「思考力」(論理的思考力)、そして、相手を考慮したうえで自分の考えを正しく伝える「表現力」(コミュニケーション能力)、の4つの能力の習得により、安全に関する「問題解決力」の獲得を目指す。これにより、産業現場で危険の種を見つけ出す安全巡視の能力を獲得し、あるいは自分のヒヤリハット経験を元に報告書を作成し、その作成指導できるようになる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義はpptを利用する。必要に応じてプリント、資料を電子媒体により配布する(moodleにアクセスできるPCなど必須)。また、毎回課題レポートを課し、その回の講義の確認と復習を行う。このレポートは、毎回複数の書籍や資料を読み、それを理解した上で自分の考えをまとめること、あるいは現場でのワークなどを要求する。講義はその課題の提案と理解のために必用な基礎知識を示すものである。半反転講義として、前回レポートの講評を講義中に行う。",
        "notices": "安全の問題や課題には正解はない。この講義で獲得すべきは基礎的な「情報」や「知識」だけではなく、問題に取り組むために必要な「知恵」と「能力」であることを忘れないこと。そのために、学生という立場に甘えない工学のプロフェッショナルとして「矜持」を求める。この講義は労働安全衛生法に規定される「安全衛生教育」と見なされ、その受講状況は法的な意味を持つ。特に出席に関するごまかし(代返行為など)は関係法令に基づく処罰対象なので、絶対に行わないこと。毎回レポートを課す。レポート作成には多数の文献や書籍を読むことを必要とするため、読書の習慣を身につけておくこと。レポートの書き方については「理系の文章技術」(moodleに挙げておく、応用化学科ブログ全13回の連載2015.10.2~2015.12.25)を読み、理解し、実践できるように準備しておくこと。指示された場合は、参考文献を正しい書式で必ず記載すること。",
        "preparatoryStudy": "予習は指定された資料あるいは図書を講義前に読み,理解しておくこと。講義はこの予習を前提とする。受講者数の多い講義なので、想定外のトラブルが予想される。レポートの作成に関する注意や指示は、講義中に行う。レポート作成には集中しても最低２時間を要する。レポートなどの提出物は期限を絶対に守ること、そのコピーを必ず手元にとっておくこと。疑義発生時にはそのレポートコピーを確認に使用する。",
        "gradingGuidelines": "毎回課すレポートによる講義への参加状況(出席状況ではない)により評価する。試験は行わない予定である。引用を必要とする課題レポートにおいて十分な引用が為されていないとき、元文献を特定できない場合、そのレポートは評価の対象外となる。レポートの書き方を講義中に指定する。その書式を守らないレポートは評価の対象外にする。社会通念上許容される理由以外で遅れたレポートは受け取らない。(正当な理由がある場合はそれを証明する資料を必ず添付すること。)",
        "textbook": "片桐利真「研究室では「ご安全に！」」コロナ社(2018)学生便覧他",
        "referenceMaterials": "東京工科大学工学部「工学実験を安全に行うために」東京工科大学東京工科大学「安全の手引き」東京工科大学八王子キャンパス他については別途にリストをmoodle経由で配布する。",
        "courseSchedule": "第1回：安全工学とは,工学倫理第2回：緊急時対応、応急処置第3回：安全の法律第4回：安全の心理第5回：安全対策のたて方第6回：生活の安全→危険要因分析第7回：危険要因分析→ヒヤリハット第8回：化学の安全危険性第9回：化学の安全有害性第10回：電気・電子の安全第11回：機械の安全第12回：情報の安全第13回：廃棄物と排水環境への配慮第14回：災害から身を守るBCP",
        "courseDataUpdatedAt": "2025/02/05"
    },
    "updateAt": "2025/03/21"
}