# ===========================================================================
# 各種パス設定
# ===========================================================================

# ChromeDriverのパスを設定
chromeDriverPath = "/usr/bin/chromedriver"
# 時間割コードを書き出すフォルダ名を設定(相対パス)
timeTableCodeDir = "./timeTableId_Data"
# 講義データ書き出しフォルダ名指定(相対パス)
lectureDataDir = "./lecture_Data"

# データ取得先学部指定 (下記リストより選択)
department = ["﻿BT", "CS", "MS", "ES", "ESE5", "ESE6", "ESE7", "X1", "DS", "HS", "HSH1", "HSH2", "HSH3", "HSH4", "HSH5", "HSH6", "X3", "GF", "GH"]
# ※教養科目の"X1"は必須

# リスト集
"""
"﻿BT": 応用生物学部
"CS" : コンピュータサイエンス学部
"MS" : メディア学部
"ES" : 工学部
"ESE5" : 機械工学科
"ESE6" : 電気電子工学科
"ESE7" : 応用化学科
"X1" : 八王子キャンパス教養科目
"DS" : デザイン学部
"HS" : 医療保健学部
"HSH1" : 看護学科
"HSH2" : 臨床工学科
"HSH3" : 理学療法学科
"HSH4" : 作業療法学科
"HSH5" : 臨床検査学科
"HSH6" : リハビリテーション学科
"X3" : 大学院
"GF" : デザイン研究科
"GH" : 医療科学研究科
"""
