{
    "lectureCode": "R1040",
    "courseName": "経済学[デザイン]",
    "lecturer": [
        "島倉原(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "現実の経済や社会の動き、あるいはそれらに関する様々な議論を理解・分析する枠組みとして、経済学の基本を学びます。ただし、一般的に教育・使用されている「主流派」の経済理論で述べられていることが、すべて正しいわけではありません。むしろ、現実に応用する理論としては、見過ごせない欠陥も少なくないのが実態です。本講義では、そうした欠陥を克服すべく提唱されている「非主流派」の経済理論も解説し、両者の違いを明らかにしながら、現実の様々な経済・社会問題を取り上げていきます。そうすることで、経済学の限界をわきまえながら、バランスよく応用する力を養うことを目指します。",
        "outcomesMeasuredBy": "様々な市場における「価格」がどのように決定されるかについて、経済学の基本的な概念を使って説明できるようになることを目指します。また、経済活動に不可欠な貨幣（お金）がどのような機能を持ち、その発行者である政府が経済社会においてどのような役割を果たしているかについて的確に理解し、経済政策に関する自らの意見を、経済学の基本的な概念を使って述べられるようになることを目指します。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "パワーポイントと配布資料を組み合わせた講義形式で行ないます（ノートPC必携）。",
        "notices": "単なる知識やノウハウの習得にとどまらず、経済理論の対立の背景にある「前提」（人間観や世界観）の違いを理解することで、問題解決のために理論を適切に用いることができる「応用力」が身につきます。本講義では、そうした応用力を養う場として、質疑応答やディスカッションの時間も相応に確保したいと思います。そうした機会を有効に活用するためには、毎回の予習・復習を十分に行うことが求められます。",
        "preparatoryStudy": "予習：下記参考書の該当箇所を読むなどして、次回講義のテーマとなる内容や、その中で用いられているキーワードについて、自分なりに調べておくこと（120分程度。主流派・非主流派双方の文献にあたることが望ましい）。なお、第1回は予習不要です。復習：講義資料や参考書を読み返すこと。特に興味をひかれたテーマについては、講義中に紹介された文献なども使って自分なりに掘り下げてみること（120分程度）。予習・復習の補完として、経済問題について報道・解説した記事や番組などに可能な限り日々接し、疑問点をまとめたり、学習したことを応用して自分なりの解決策を考えたりしてみましょう。そこで生じた疑問点などについて、講義中に質問いただいても結構です。",
        "gradingGuidelines": "期末試験で評価するものとし、60％未満を不可とします。試験のうち20～30％程度は、単に知識を問うのではなく、特定の経済・社会問題について自分なりの解決策を考案するなどの、記述・論述式の設問とする予定です。授業中もしくは授業後のコメントは、内容によっては加点要件となります。積極的に授業に参加しましょう。",
        "textbook": "指定しない",
        "referenceMaterials": "【「主流派」経済学の参考書】①ティモシー・テイラー『スタンフォード大学で一番人気の経済学入門（ミクロ編・マクロ編）』かんき出版、2013年。②髙橋洋一『たった1つの図でわかる！【図解】新・経済学入門』あさ出版、2023年（2016年刊行の旧版でも可）。③N・グレゴリー・マンキュー『マンキュー入門経済学（第3版）』東洋経済新報社、2019年。④早稲田大学商学部ビジネス・エコノミクス研究会『ビジネスのための経済学入門』中央経済社、2015年。【「非主流派」経済学の参考書】⑤中野剛志『奇跡の経済教室（基礎知識編・戦略編）』KKベストセラーズ、2019年。⑥島倉原『MMT講義ノート：貨幣の起源、主権国家の原点とは何か』白水社、2022年。（①②⑤はより入門的、③④⑥はやや専門的な書籍です）",
        "courseSchedule": "第1回：イントロダクション～なぜ経済学を学ぶのか第2回：モノの値段はどのように決まるのか①～需要供給曲線の基本第3回：モノの値段はどのように決まるのか②～需要供給曲線の応用と限界第4回：経済統計を理解しよう～GDP、失業率、賃金etc.第5回：お金について考えよう①～お金（貨幣）の本質に対する2つの見方第6回：お金について考えよう②～銀行預金の仕組みと金融市場の役割第7回：お金について考えよう③～お金の序列と外国為替制度第8回：通貨発行と財政の仕組み①～国家による通貨の創造と破壊第9回：通貨発行と財政の仕組み②～財政破たんは本当に起きるのか第10回：経済変動のメカニズム～景気循環の理論と分類第11回：マクロ経済政策の役割①～金融政策と財政政策第12回：マクロ経済政策の役割②～税制と政府支出の果たす役割第13回：マクロ経済政策の役割③～投資の社会化と産業政策第14回：なぜ日本は長期停滞しているのか第15回：まとめ",
        "courseDataUpdatedAt": "2024\/02\/16"
    },
    "updateAt": "2024\/09\/13"
}