{
    "lectureCode": "R1060",
    "courseName": "法学[デザイン]",
    "lecturer": [
        "川上正隆(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火5"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "・法学の中でも、「法社会学」の観点を中心に法と社会（日常生活）との関わりを学んでいきます。例えば、皆さんに身近な話題として医療関連やデザインあるいは18歳成人に関するテーマを通して、そのテーマと法との関わりについて学んでいきたいと思います。その点では、専門的に個々の法の内容を詳しく解説するのではなく、テーマに即した事案を通して社会あるいは法領域における法の位置付けや役割を総論的に学ぶことで社会構造を理解する、という法社会学により法学を学習していきます。・法を知ることで大切なことは論理学です。そこで、15回の講義を通して「法を知る」：テーマに関する法の構造や役割などの検討を通して国際的な教養を身に付ける「法を考える」：テーマに対して法がどのように使われてどのように機能したのか、裁判や事案を通した検討により論理的な思考を身に付ける。「法を使う」：仮想事案に対して、講義で学んだ知識により期中課題や考課課題を作成することにより論理的思考力を実践します。という三階層の構造を予定して各スキルの知得を求めていきます。",
        "outcomesMeasuredBy": "講義概要で説明した３点のスキルを通して、総合的に実学に基づく専門能力（リーガルマインド／事象への判断・対応力）の取得を目標とします。そしてこれらの能力が法学にとどまらず、社会に貢献する人材の育成に資することを期待します。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "・スライド画面や動画を使って説明しながらの講義形式です。一方的な説明だけでなく、各自で考えて参加できる方法も考えています。・テーマについての専門家を招聘して講義を行う場合もあります（４～５回ほど）。・講義後に期日を指定しての小レポート提出を求める場合があります。",
        "notices": "・注意事項については初回あるいは必要に応じて説明します。・知識として「覚える」のではなく、知恵として「理解する」ように努めて下さい。",
        "preparatoryStudy": "・予習：予め事前資料をMoodleで公開します。事前に読んで下さい・復習：講義後に講義資料をMoodleで公開します。事前資料に追加になっている場合があるので事後にも読んで下さい。・普段の生活の中でも、法との関わりについて意識して過ごすようにして下さい。",
        "gradingGuidelines": "・期末試験あるいは評価レポートの点数（80％）および講義後に提出の小レポート（20％）により評価します。・単位認定の目安は60％以上です。課題に対して自分の考えとして論理的に論じられているかが重要です。・フィードバックは、小レポートは講義内で、期末試験はMoodle上で行います。",
        "textbook": "特にありません。",
        "referenceMaterials": "『はじめまして、法学第2版』（ウェッジ）、『法学を学ぶのはなぜ？』（有斐閣）、『もしも世界に法律がなかったら』（日本実業出版社）その他必要に応じて講義中に指示します。",
        "courseSchedule": "第1回：法学概論（オリエンテーション、法学の全体概要、18歳成人など）第2回：国家の仕組み（日本の統治機構と国民の権利など）第3回：市民参加の法（司法の役割と裁判の意義を裁判員制度を中心に）第4回：私人関係の法（人間関係の中で権利や財産をいかに守るか）第5回：家族関係の法（人の誕生と死を通して家族制度を考える）第6回：起業と法（自分が起業する場合に法がどのように関係するのか）第7回：環境と法（持続可能な社会における法の役割り）第8回：医療と法（医療従事者と患者との関係における法の意義）第9回：医療行為と緊急避難（医療行為に対する違法性阻却事由とは）第10回：デザインと法（他者の権利を守る、自分の権利を守る）第11回：日常生活の法（日常生活における法の関わり）第12回：ICT社会と法（ICT社会における情報の重要性）第13回：グローバル社会と法（グローバル社会の取り決めや外国人問題など）第14回：法の効果と限界（法による保護と救済とその限界について）第15回：現代社会と法／総括（アップデートな話題と全体の総括）",
        "courseDataUpdatedAt": "2024\/02\/02"
    },
    "updateAt": "2024\/08\/07"
}