{
    "lectureCode": "R1140",
    "courseName": "生物の世界[デザイン]",
    "lecturer": [
        "中村秀明(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火4"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１０１４教室"
    ],
    "courceDetails": {
        "courseOverview": "この地球に生命がどのようにして命を宿し，どのようにして現在の様な多様性に満ちた環境を築いていったのか，気にはならないだろうか．そして，ヒトの出現によって，その多様な環境が失われつつあるとともに，人工知能（AI）の出現がヒトの築いた社会に浸透しはじめている．この先，私達の生活や環境はどのように変化していくのだろうか，もし，その様な疑問を抱いたのならば，是非ともこの講義を受講してほしい．約40億年前の生命誕生から現在までの間に，生物は様々な環境に適応して進化し，現在みられるような多様な生物群を構成するようになった．この授業では，生物の世界に関する以下の4トピックスについて，最新の研究成果を交えながら解説する．.生物の進化（生命の起源，多様化）2.生物多様性（生態系，保全）3.生物の設計図（ゲノム解読，ゲノム情報の応用）4.生命工学（遺伝子組換え，ゲノム編集，クローン，iPS細胞）",
        "outcomesMeasuredBy": "講義を受講することによって，生物の世界全体についての「国際的な教養」と科学的で「論理的な思考力」を修得し，ニュースで紹介されるような生物学のトピックスについて自分で説明できるようになることを目標とする．",
        "learningOutcomes": "国際的な教養論理的な思考力",
        "teachingMethod": "本講義は対面式で実施し，定期試験は実施しない．受講方法：1週間前を目安に毎回の講義配布資料（pptx）をmoodle上に提示するので，事前にダウンロードし，予習しておくこと．講義資料をパワーポイント形式にしているのは，各スライドの下にメモ入力欄がある為である．このメモ入力欄は講義中にメモをとるだけではなく、予習と復習の際にも活用してほしい．復習が終わった後で講義課題（受講投稿と確認問題）に取り組むこと．ノートPCは必携である．ノートPCは講義資料のダウンロードや穴埋め，講義の後の確認問題や受講投稿などに使用する．講義資料はパワーポイント.pptxで作られているので、受講の際は予めノートPCにMicrosoftOfficeをインストールしておくこと．また，講義ページはmoodle上にあるが，そのサイトへはGoogleChromeからアクセスすること（MicrosoftEdgeでは正常に機能しないことがある）．",
        "notices": "本講義ではまず，生物に興味を持ってもらうことが重要である．そのため，高校生物を受けてこなかった人も気兼ねなく受講してほしい．第１回の講義は必ず受講すること．講義中は，説明を注意して聴きながら適宜メモを取ること．また，わかり難かった内容や用語などは書き出すなどして，受講投稿のための復習の材料とすることが望ましい．そして，日常生活や新聞，ニュースなどに出てくる「生物学」に関する用語や記事の内容などにも興味を持ち，図書館やインターネットなどで調べるように心がけてほしい．",
        "preparatoryStudy": "本講義では各講義回の受講に際し，予習と復習を十分に行ってほしい（予習60分間・復習180分間程度）．【予習】講義資料を基に予習し，分からない内容は予め各自で調査し，講義に参加する．【復習】各回の講義の後で受講投稿（講義の要点をまとめ，要点については取り上げた理由を説明し，印象に残った点があればそれも書き加える）を行う．尚，受講投稿への取り組みが不十分な場合には投稿回数に含まれないことがある．【復習の確認：小テストと確認問題】任意ではあるが，受講投稿後に復習を兼ねた確認問題をするとよい．次の時間の初めに復習を兼ねた小テストを行うので，授業内容について十分に理解しておくこと．【課題】定期試験がない代わりとして，講義に関わる内容についての課題レポートに取り組む．詳細については，適宜説明する．",
        "gradingGuidelines": "定期試験は実施しない．成績は受講投稿，確認問題，レポート課題の結果で評価する．その評価の割合は，小テスト：受講投稿：レポート課題：確認問題=５：２：２：１とする．尚，受講投稿とレポート課題への取り組みは単位認定の重要な要件とする（単位取得のための必須要件）．尚，受講投稿を忘れた場合にはその分だけ減点される．受講投稿を５回以上忘れた場合には原則として単位認定の要件を満たさないものとする．毎回の受講投稿にあるアンケートの回答結果についてはmoodle上でフィードバックするので，自身の回答と照らし合わせて次の講義の参考にするとよい．",
        "textbook": "指定しない",
        "referenceMaterials": "「やさしいバイオテクノロジーカラー版」（サイエンス・アイ新書），芦田嘉之著，SBクリエイティブ，2011年（ISBN:978-4797363937）などの他，moodle講義ページ内で別途指示する．",
        "courseSchedule": "第1回：ガイダンス第2回：イントロダクション：生物の世界第3回：生物の進化１：生命の起源と進化の歴史I第4回：生物の進化２：生命の起源と進化の歴史II第5回：生物の進化３：生物のかたちとDNA第6回：生物の進化４：進化の総合説第7回：生物の進化５：人類の進化第8回：生物多様性１：生態系の成り立ち第9回：生物多様性２：生物多様性とは第10回：生物多様性３：環境変動と生物多様性第11回：生物の設計図１：生命の設計図「ゲノム」第12回：生物の設計図２：ゲノム情報の応用第13回：生命工学１：遺伝子工学と生命倫理第14回：生命工学２：細胞工学と生命倫理第15回：生命工学３：iPS細胞と近未来の医療",
        "courseDataUpdatedAt": "2024/01/30"
    },
    "updateAt": "2024/12/09"
}