{
    "lectureCode": "R1170",
    "courseName": "化学の世界[デザイン]",
    "lecturer": [
        "中村秀明(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１０１４教室"
    ],
    "courceDetails": {
        "courseOverview": "「化学の世界」は，ふとしたきっかけから，「化学」の面白さやその重要性に気づき，興味を持って頂くために設けられた講義である．とは言え，高校の内容には留めていない．本講義では，新たな視点で学び直した化学のエッセンスを通じて，宇宙や自然，環境，生活に関わる“なるほど”といった“気付き”を多く体験できるよう工夫を凝らしたつもりである．通常の「化学」では，物体の運動を扱う物理学と，生命現象を扱う生物学の間に位置し，原子や化合物の特徴をはじめ，それらの相互作用などを扱う．一方，「化学の世界」では「化学」で扱う範囲に加え，素粒子や電磁波についても扱う．これにより宇宙をはじめとする自然界の成り立ちやその全体像，環境，生活など，通常の化学の講義では扱いにくい題材を講義に広く取り入れることができた．こうして「化学の世界」では，自然科学系一般教養科目の一つとして，自然科学に関わる学際的な教養の多くを，これらの講義内容を通して幅広く学修できる内容にしてある．本講義の構成を示す．.基礎（化学の基本エッセンス）：第1回～第6回2.応用A（自然界の成り立ち）：第7回～第12回3.応用B（各論：環境と生活）：第13回～第15回",
        "outcomesMeasuredBy": "本講義の序盤で学修した化学のエッセンスは中盤や終盤の内容と深く関連付けられており，理解を促す礎となる他，異なる視点から繰り返し取り上げられているので知識として修得され易くなっている．本講義を化学と向き合う良い機会とし，化学をベースに修得した自然科学に関わる学際的で「国際的な教養」と「論理的な思考力」が環境・生活・健康に活かせることを本講義の到達目標とする．",
        "learningOutcomes": "国際的な教養論理的な思考力",
        "teachingMethod": "本講義は対面式で実施し，定期試験は実施しない．受講方法：1週間前を目安に毎回の講義配布資料（pptx）をmoodle上に提示するので，事前にダウンロードし，予習しておくこと．講義資料をパワーポイント形式にしているのは，各スライドの下にメモ入力欄がある為である．このメモ入力欄は講義中にメモをとるだけではなく、予習と復習の際にも活用してほしい．復習が終わった後で講義課題（受講投稿と小テスト）に取り組むこと．ノートPCは必携である．ノートPCは講義資料のダウンロードや穴埋め，講義の後の小テストや受講投稿などに使用する．講義資料はパワーポイント.pptxで作られているので、受講の際は予めノートPCにMicrosoftOfficeをインストールしておくこと．また，講義ページはmoodle上にあるが，そのサイトへはGoogleChromeからアクセスすること（MicrosoftEdgeでは正常に機能しないことがある）．",
        "notices": "本講義は化学への興味さえあれば，得手・不得手に関わらず，十分に理解できるはずなので，気兼ねなく受講してほしい．前期開講の「生物の世界」を受講しておくと，化学と生物の両方の理解を深めることができるので，余裕のある人は両方の受講をお勧めする．第１回の講義には必ず出席すること．受講中は私語を慎み，説明を注意して聴きながら適宜メモを取ること．また，わかり難かった内容や用語などはメモを取り，質問や復習の材料とすることが望ましい．そして，日常生活や新聞，ニュースなどに出てくる「化学」に関する用語や記事の内容などにも興味を持ち，図書館やインターネットなどで調べるように心がけること．",
        "preparatoryStudy": "本講義では予習と復習を十分に行うこと（各120分間程度）．【予習】次回の内容について講義資料を基に予習し，分からない内容は予め各自で調査し，講義に参加する．【復習】毎回の講義の後で受講投稿（講義の内容とその要点をまとめ，要点については取り上げた理由を説明し，印象に残った点があればそれも書き加える）を行う．尚，受講投稿への取り組みが不十分な場合には投稿回数に含まれないことがある．【復習の確認小テスト】各講義に関連した内容の小テストを行う．【レポート課題】講義に関わる内容について取り組む．詳細については，適宜説明する．",
        "gradingGuidelines": "定期試験は実施しない．成績は受講投稿と小テスト，レポート課題の結果で評価する．その割合は，小テストの得点：受講投稿の内容：レポート課題の得点：=５：３：２とする．尚，受講投稿とレポート課題への取り組みは単位認定の重要な要件とする（単位取得のための必須要件の一つ）．尚，受講投稿を忘れた場合にはその分だけ減点される．受講投稿を５回以上忘れた場合には原則として単位認定の要件を満たさないものとする．毎回の受講投稿にあるアンケートの回答結果についてはmoodle上でフィードバックするので，自身の回答と照らし合わせて次の講義の参考にするとよい．",
        "textbook": "指定しない",
        "referenceMaterials": "「化学ぎらいをなくす本―化学再入門」（ブルーバックス），米山正信著，講談社，2006年（ISBN:978-4062575348），「高校最重要事項100%図解化学基礎」，高校理科教育研究会(著,編集)，増進堂・受験研究社，2013年（ISBN:978-4424412038）",
        "courseSchedule": "第1回：目的と概要，序論（単位と量的関係）第2回：物質と原子，周期表（物質の分類と三態／元素記号・元素と原子の違い・原子と核の構造／周期表）第3回：化学結合と分子・高分子（化学結合の種類・重合反応と高分子構造・化学構造模型）第4回：化学反応が起こる仕組み（活性化エネルギーと熱力学：エンタルピー・エントロピー）第5回：発光現象と光１（発光現象：熱放射・ルミネッセンス・フォトクロミズム）第6回：発光現象と光２（光：三原色・混色・補色・構造色）第7回：宇宙の一生と元素（元素誕生の場：宇宙初期・恒星・超新星爆発／元素の終焉：宇宙を満たす三要素）第8回：太陽系の成り立ち（宇宙と太陽系の元素組成：核反応・元素の魔法数・オッドハーキンスの法則）第9回：地球の成り立ち（地殻・海・大気・陸・土壌の形成と元素組成）第10回：地球上で起きた化学進化（化学進化説と生命の誕生：ミラーの実験・原始スープ・自己組織化）第11回：生態系の成り立ち（生命の進化と物質循環の変遷：脱水縮合反応・異化と同化・ATP・嫌気と好気）第12回：化石の形成と化石資源（化石：化石化作用／化石資源：石炭・石油・天然ガスの形成）第13回：環境問題と化学（栄養塩と最小養分率：生態系物質循環の不均衡が招く水質汚濁と地球温暖化）第14回：食と化学（塩分と浸透圧・三大栄養素と栄養バランス・摂取カロリーと健康寿命）第15回：健康と化学（活性酸素と抗酸化作用：イオンとラジカルの違い・酸化還元反応）",
        "courseDataUpdatedAt": "2024\/01\/29"
    },
    "updateAt": "2024\/08\/07"
}