{
    "lectureCode": "R1240",
    "courseName": "キャリアデザインI[デザイン]",
    "lecturer": [
        "野条美貴(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "「キャリアデザインⅠ」は、前期の「フレッシャーズゼミ」等で身につけた大学の学びに必要となる基礎学力を社会の中でどう活かし、みなさん一人ひとりが自分らしい人生を生きていくためにはどうしたらいいのかを考える授業です。自分と社会との関係を考察することで、論理的な思考能力、分析・評価能力や問題解決力を養います。生き方や働き方、大学生活の過ごし方をグループワークを通して他者と関わりながら、コミュニケーション能力を身につけ、これからのキャリアを自分で考え、行動できるきっかけをつくることを学びます。",
        "outcomesMeasuredBy": "・社会人になるためのマナー（挨拶・時間管理・課題の提出期限厳守など）を身につけ、積極的に人の話を聴き他者と関わり、コミュニケーション能力を高める。・自己理解や社会理解を深めることで、分析・評価能力を身につける。・社会で求められている力である論理的な思考力や問題解決力を養う。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "AGミーティングが2回実施され、授業ごとのテーマに対してのレクチャーとグループワークを基本として、学生自らの主体的な学び（アクティブラーニング）を促します。学生同士のディスカッションや、グループ内発表を行うことで、傾聴力と相手に分かりやすく伝える力を磨きます。授業の進行に合わせてリアクションペーパーの提出があります。ノートPCについては、使用する場合はあらかじめアナウンスします。授業について、詳細はMoodleで確認してください。",
        "notices": "社会人基礎としての科目ですので、受講のマナーを守り、特に遅刻をしないようにしてください。授業でのテーマに即して準備学習を行ってください。毎回、必ずMoodleを確認するようにしてください。",
        "preparatoryStudy": "普段から新聞、ニュースサイト、雑誌、書籍などで情報を収集すること。授業ごとのテーマに対して、積極的に準備して臨むこと。また、授業後には、授業の内容を振り返り次回の予習も含めて準備学習を行うこと。",
        "gradingGuidelines": "期末テストは行わず、以下の内容と割合をふまえ総合評価を行います。(1)授業に臨む姿勢（40%）(2)インタビューレポートとキャリアデザインシートの提出による２つのレポート提出及び授業での提出物（60%）なお、単位認定要件は60点以上とします。",
        "textbook": "なし。必要に応じて資料を配付します。授業資料は、適宜、Moodleにも掲載します。",
        "referenceMaterials": "必要に応じて資料を配付します。",
        "courseSchedule": "第1回：オリエンテーション（授業の目的と進め方）第2回：コミュニケーションとマナー第3回：AGミーティング（各AG担当教員による前期の単位修得状況、後期の履修計画の確認）第4回：働くとは何か第5回：社会を知る①（ワークルール）第6回：将来のキャリアを考える（卒業後に目指せる仕事：キャリアセンター課長）第7回：社会を知る②（社会人インタビュー）/課題①インタビューレポートの提出第8回：自分を知る①（ストレスコーピング）第9回：自分を知る②（キャリアストーリーインタビュー）第10回：目標を立てる（キャリアデザインシート作成）第11回：多様な働き方と人生100年時代について考える／キャリアデザインシートの提出第12回：AGミーティング第13回：仕事を知る①（職業・仕事理解）第14回：仕事を知る②（職業・仕事理解）第15回：まとめ（授業の振り返りと今後に向けて）",
        "courseDataUpdatedAt": "2024/04/24"
    },
    "updateAt": "2024/12/09"
}