{
    "lectureCode": "R2010",
    "courseName": "宗教学[デザイン]",
    "lecturer": [
        "志田雅宏(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "現代世界では、特定の宗教への信仰を持っている人々も、そうでない人々も、日常生活のさまざまな場面で宗教的なものとかかわっています。日本社会でも宗教は身近なものとして感じられる一方で、何か怪しいものとしてみなされ、自分には関係のないものとして遠ざけられてしまうこともあります。ただ、宗教が自分にとって、あるいは社会にとってどのような関係を持つものであるにせよ、現代では宗教を「学ぶ」ことが重要です。現代の宗教を歴史的な観点から知るためにも、宗教にかかわるさまざまな問題を発見するためにも、学びというアプローチが必要とされるからです。この授業には「一神教世界とわたしたち」という副題がついています。一神教とはユダヤ教、キリスト教、イスラームという三つの宗教のことです。一神教世界の長い歴史と豊かな文化は、現代社会を生きるためのさまざまな示唆を与えてくれるはずです。また、宗教についての考え方を知るために、宗教学における理論や概念についても紹介します。この授業では、世界の宗教と宗教学を学ぶことによって、国際的な教養を身につけながら、異文化を理解することの意義をひとりひとりが発見することをめざしていきます。",
        "outcomesMeasuredBy": "・宗教学の基本的な考え方を説明できる。・三つの一神教の概要と歴史を説明できる。・宗教学の理論や概念をもちいて、宗教にかかわる現代的なテーマについて、自分の意見を表現できる。・宗教についての学びをふまえて、宗教を教えることについての具体的なアイデアを提示できる。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "授業は講義形式でおこないます。・講義資料を授業日の前日までにMoodleにアップするので、少し予習をしておいてください。講義資料は授業内でもプリント配布します。・講義を受け、質問などがあれば随時おこなってください。質問はメールでも受け付けます。・講義で使用したスライドは、講義終了後にMoodleにアップします。復習等に役立ててください。・リアクションペーパーや小テストが課された場合には、期日までに回答してください。",
        "notices": "・履修条件としての予備知識は求めません。・授業全体の構成や評価方法についての説明を初回におこないます。・講義中、講義資料やスライドを見ながら説明を聞くだけでは、知識はなかなか定着しません。かならずノートを取ることを心がけてください。・Web出席システムを使います。毎回の授業時に出席登録をおこなって下さい。・やむをえず授業を欠席した回については、講義資料等をMoodleから入手し、補完的に自習を進めてください。",
        "preparatoryStudy": "【予習】・Moodleに事前にアップされた講義資料を読んでおく。・予習時間90分×15回【復習】・講義資料やスライド資料で復習をおこなう。・授業後の課題（リアクションペーパーや小テスト）がある場合には、それに取り組む。・復習時間：90分×15回【さらなる学習について】・また、宗教学やユダヤ教・キリスト教・イスラームの文献を授業内で紹介しますので、積極的に読みましょう。また、信頼できるウェブサイトも紹介していきます。",
        "gradingGuidelines": "以下の2項目により評価します。・リアクションペーパーおよび小テスト：30%・定期試験：70％【フィードバックについて】・小テストについては、実施後に正解と解説、および講評を公開します。・リアクションペーパーについては、翌週にいくつかの優れた回答を授業内で紹介し、コメントを述べます。・定期試験については、可能であれば講評を公開します。",
        "textbook": "指定しません。",
        "referenceMaterials": "・小原克博『一神教とは何か』（平凡社新書、2018年）・市川裕『ユダヤ人とユダヤ教』（岩波新書、2019年）・松本宣郎・高柳俊一・廣岡正久編著『キリスト教の歴史』（全3巻、山川出版社、2009、2013年）・菊地達也編著『図説イスラム教の歴史』（河出書房新社、2017年）",
        "courseSchedule": "第1回：宗教学とはなにか宗教学という学問の基礎について学ぶ第2回：一神教とはなにか一神教という概念について学ぶ第3回：ユダヤ教①聖書時代のユダヤ教の誕生からラビ・ユダヤ教の成立までを学ぶ第4回：ユダヤ教②中世から現代まで続くユダヤ教のさまざまな文化を学ぶ第5回：キリスト教①キリスト教の誕生から中世における西方キリスト教世界の完成までを学ぶ第6回：キリスト教②近現代におけるキリスト教の「世界宗教」としての展開を学ぶ第7回：イスラーム①イスラームの成立およびイスラームの基本的な考え方について学ぶ第8回：イスラーム②現代イスラーム世界の多様化と、その中で生じてきた問題について学ぶ第9回：教典宗教学の教典論を学び、三つの一神教の教典を実際に読む第10回：共同体一神教世界のさまざまな共同体、および食事の問題について学ぶ第11回：聖地宗教学における「聖地」の概念と、一神教世界のさまざまな聖地について学ぶ第12回：回心宗教的な回心体験の事例と理論、および現代の宗教復興について学ぶ第13回：暴力宗教と暴力というテーマについて、中世と現代の事例を学ぶ第14回：共存諸宗教の共存を実現するための取り組みについて、歴史・生活・教育の事例から学ぶ第15回：まとめ宗教的寛容についての古典的作品を読み、その意義について学ぶ",
        "courseDataUpdatedAt": "2024/02/02"
    },
    "updateAt": "2024/12/09"
}