{
    "lectureCode": "R2040",
    "courseName": "倫理学[デザイン]",
    "lecturer": [
        "岡野浩(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３０２１２教室"
    ],
    "courceDetails": {
        "courseOverview": "「私達は他人の幸福に関与すべきか？また、そうであるとすれば、どこまでが義務となり得るのか？・・・こうした問いは、隣人に対するささやかな好意や気遣い、と言った極身近な問題から、私達が属する共同体の持つ社会制度、法秩序のあるべき姿、また地球規模での環境政策や生命倫理、そして世代間倫理に至るまで様々な問題へと広がりを見せることになります。そこで本講義では共同社会における「権利」と「義務」の在り方を一つの着眼点としながら、「正義」や「美徳」あるいは「愛」と言った伝統的な価値概念について代表的倫理学説のいくつかを取り上げ検討を加えることで、事柄と冷静に向き合う論理的な思考力を養い、多様な事象、思想についての分析・評価能力を身につけて頂ければと考えています。また、この講義では、倫理学の根本問題、すなわち、私たち人間存在にとって＜正しさ＞や＜善＞がどのような意味を持つものであるかについても考えてゆきたいと思います。",
        "outcomesMeasuredBy": "この授業では、倫理学の歴史において重要な位置を占める幾つかの倫理学説（功利主義や社会契約論、あるいは現代の正義論や共同体論等）を取り上げ、検討を加え、「正義」や「美徳」、「慈愛」と言った伝統的な価値概念の持つ意味について考えます。こうした考察を通じて、共同社会における「権利」と「義務」の在り方、さらには、そうした道徳的価値、規範等の＜根源＞にも眼差しを向けることで、現代社会における多岐にわたる倫理的問題に対して、冷静に向き合い、責任ある態度決定を行ってゆくための基本的な見識の涵養を目指します。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "授業は、講義形式で実施いたします。毎回授業前日には文書資料をMoodle上にUPしますので、各自ダウンロード、プリントアウトした上で授業に臨んでください。重要なトピックや問題については、適宜実施する課題やリアクションペーパーを通じて、受講者にも意見を求めながら進めてゆきます。また、Moodle上に寄せられた受講者の感想や質問を授業時に適宜紹介し、共有する形でのアクティブラーニング形式も採用しています。受講に際しては特に専門的な知識は必要としませんが、日頃から私たちの暮らすこの社会の様々な価値的・倫理的問題について注意を向け、＜開かれた心で＞改めて考えてみる習慣を身に付けて頂きたいと考えています。そのためにも、授業で紹介する様々な問題を常に＜自らに引き受けて考える＞緊張感をもって授業に参加してください。",
        "notices": "授業全体の概要、授業方法、成績評価等について説明をしますので、第一回目の授業は必ず受講してください。",
        "preparatoryStudy": "授業時に配布するレジュメ、資料等には必ず目を通し、難解な用語等があれば、辞書やネット等を利用してその意味を調べておき、授業の基本的な方向や要点について、あらかじめ確認しておくように心がけてください。また、毎回Moodle授業ページ上には、授業資料とともに前回授業に対して寄せられた受講者全員の＜感想、及び質問＞等が匿名でUPされるので、共に同じ授業に参加している仲間が、どのような点に興味を抱き、またどのような感想・疑問を持ったかについても目を向けるようにして下さい。（予習ー120分程）、また、受講後には、当日中に、授業の振りのリアクションシートとしてMoodle上の＜感想、及び質問＞を提出し、授業時のメモ等の整理も行い、不明なところ等があれば、各自で調べておくようにして下さい。（復習ー120分程）",
        "gradingGuidelines": "授業時のリアクションペーパー、小課題等⇒20％（Moodleの機能を利用）と学期末試験⇒80％を総合して評価します。提出されたリアクションペーパーや小課題に対するフィードバックは適宜講義内に行ってゆきます。また、質問は大いに歓迎します。意欲的な意見、質問等は高く評価したいと思います。",
        "textbook": "テキストは使用せず、授業時に配布するレジュメ等がその代わりになります。",
        "referenceMaterials": "参考図書等については、授業時に適宜紹介します。",
        "courseSchedule": "第1回：導入（問題の所在と広がり）一つの着眼点・・・自由な社会の共通理解としての「他者危害の原則」、その意味するものとは。第2回：＜社会正義の実現＞と＜個人の自由＞をめぐる問題①J.ロールズの『正義論』第3回：＜社会正義の実現＞と＜個人の自由＞をめぐる問題②J.ロールズの批判者達その１、財の再配分は、個人の財産権の侵害である・・・リバタリアニズム第4回：＜社会正義の実現＞と＜個人の自由＞をめぐる問題③J.ロールズの批判者達その２、我々は既に＜美徳なき時代＞に生きている。・・・コミュニタリアニズム第5回：経験主義的道徳論1＜社会契約論＞という考え方①T.ホッブスとJ.ロック第6回：＜社会契約論＞という考え方②J.J.ルソー第7回：契約論的発想の源流古代ギリシャ①プラトン『国家』にみられる議論第8回：古代ギリシャ②アリストテレス『二コマコス倫理学』における＜正義＞と＜愛＞第9回：経験主義的道徳論Ⅱ＜功利主義＞という考え方①J.ベンサム第10回：＜功利主義＞という考え方②J.S.ミル第11回：理性主義的道徳論I.カント①その哲学の全体像と道徳哲学の基本的な考え方第12回：②二つの義務の区分（「完全義務」と「不完全義務」）とその歴史的展開第13回：③二つの義務の関係から見る「正義」と「愛」の関係第14回：＜なぜ、善くあらねばならないのか？＞・・・残された根本的問題第15回：道徳的である、とはどういうことか。西田幾多郎『善の研究』における＜活動説＞という考え方",
        "courseDataUpdatedAt": "2024/02/05"
    },
    "updateAt": "2024/08/07"
}