{
    "lectureCode": "R2060",
    "courseName": "統計学[デザイン]",
    "lecturer": [
        "須田拓馬(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "金3"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１０１４教室"
    ],
    "courceDetails": {
        "courseOverview": "製品のデザインを変更したら売り上げは上昇したと言えるのか？ある症状の患者30人に精密検査をして10名が病気だったとき、この症状を持つ患者全体の何割が病気と言えるか？このような疑問に統計学は答えてくれる。統計学は、ビジネスや医療、教育、行政などあらゆる分野における様々なデータを分析するのに役立つ。本講義では、統計学の基礎を、基本的な数学の知識だけを使って学ぶ。統計学は記述統計と推測統計という2つの部分からなっている。記述統計とは得られたデータからその特徴を抜き出す手法のことで、本授業では度数分布表やヒストグラムといった図表を用いた理解および平均値や分散、相関係数といった統計量について学ぶ。推測統計とは、全体を把握しきれない大きなデータを小さなデータから推測したり、将来起こる事象を推測したりする手法のことである。本授業では確率や正規分布といった統計学における独自の概念について理解し、母集団の推定や検定といった実践的な統計的手法を身に付ける。",
        "outcomesMeasuredBy": "1.分散や相関係数といった記述統計の統計量について理解し、与えられたデータについて計算できるようになる。2.確率や正規分布の概念を理解し、標準正規分布表のような数表を用いてデータの分析ができるようになる。3.推測統計学の考え方を理解し、推定や検定に関する統計量を用いて、データを評価できるようになる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "-この授業は、統計学の内容を難解な数式を使わずに学ぶような授業となっている。-毎回の授業の冒頭で、前回の内容について復習する小テストを行う（初回は除く）。10分間程度の解答時間が与えられ、時間内にMoodleに解答を入力する必要がある。そのため、ノートPCは毎回必携である。小テストの時間中は教科書、ノートなどを参照してはならない。授業開始前にしっかりと復習しておくこと。-小テストの解答、解説は小テスト直後に行うとともに、解答例は後日Moodleにアップロードすることでフィードバックを与える。-小テストの得点(10点満点)と平均点、満点者の人数、3点以下の人数を公表する。-授業時間内で演習の時間をとり、実際の計算問題に慣れてもらう。計算演習はペアかグループで行うことが望ましいので、授業開始時にペアやグループを作りやすいように着席すること。-小テストの得点が低い状態が続いた学生は、学修支援センターの利用を促されることがある。-期末試験の対策問題として総合演習問題をMoodleにアップロードするので第15回までに各自で取り組むこと。-第15回：まとめと総合演習では、総合演習問題について解説を希望する問題を投票形式で事前に選んでもらい、票数の多かった問題について詳しく解説を行う。",
        "notices": "統計学は数学の一分野であるが、計算問題では加減乗除とルートの計算および一次不等式を理解していれば解答できる。しかし、その背景には確率の考え方や微分積分の知識も含まれているので、数学の基礎学力(特に確率、微分・積分など)があるとなおよい。そのため、1年生対象の「数学基礎」の授業を履修していることが望ましい。数学に特に不安を感じる学生は、統計学に必要な部分だけでも、高校数学の教科書などで授業前に復習しておくこと。授業についていくのが難しいと感じたら、学修支援センターを利用するなどして早めに問題解決しておくこと。授業開始前までに授業資料をMoodleにアップロードする。授業時間中には演習問題に取り組む時間がある。ペアやグループでの活動を推奨するので、解答を見せ合ったり、相談しながら解くなど各自で工夫してほしい。授業をやむを得ない事情で欠席する場合は、事情を説明する証明書の写真をメール添付で送るか、授業時間の前後に証明書類を見せること（原本の提出は求めない）。やむを得ない事情と証明書類の一例は以下の通り（これがすべてではない）。-病欠：病院の日付入りの領収書-忌引：告別式の案内やむを得ない事情による欠席が認められれば、小テストは免除扱いとなり、成績評価において不利になることはない。授業中の飲食は推奨しないが、水分補給は禁止しない。授業に関する内容について学生同士で話し合うことは推奨するが、私語は周囲の学生が授業を受ける権利を侵害するので十分に留意すること。居眠りや他の授業の課題を行うといった行為は効率性の観点から推奨しないが、各自の事情を考慮して注意はしない。ただし、スマートフォンでゲームをするといった行為は極めて非生産的であり、見つけ次第止めるよう注意する。",
        "preparatoryStudy": "予習：次週の内容を教科書で予習する(60分)復習：小テストで間違った箇所を解き直したり、授業中の演習時間に終わらなかった問題を解いて理解する(180分)必要に応じて適宜学修支援センターを利用すること。",
        "gradingGuidelines": "各回の小テスト（全14回を予定）の合計と期末試験によって評価する。小テストの合計点を30点満点、期末試験の得点を70点満点として換算し、100点満点で評価する。60点以上を合格の目安とする。ただし、欠席が多い場合は合格基準を満たしてもX評価となる。成績評価の段階で合格基準に満たなかった者は再試験を受ける機会が与えられる。ただし、再試験はいかなる理由があっても追試験は受けられず、その結果によって合否が判定される。",
        "textbook": "景山三平（監修）、大田靖、宿久洋（編修）「事例でわかる統計シリーズ・教養のための統計入門」（実教出版）",
        "referenceMaterials": "三野大來「看護師のための統計学」(共立出版)小寺平治「はじめての統計15講」（講談社）",
        "courseSchedule": "第1回：データと統計学第2回：データの代表値と視覚化第3回：相関と相関係数第4回：確率(1)確率、余事象、加法定理第5回：確率(2)条件付き確率、乗法定理、事象の独立第6回：確率(3)ベイズの定理第7回：確率変数と確率分布、確率密度関数第8回：確率変数の期待値と分散、標準化第9回：ベルヌーイ試行と二項分布第10回：母集団と標本（標本平均、大数の法則と中心極限定理）第11回：統計的推測序章（点推定、第一種の過誤、第二種の過誤）第12回：区間推定（母分散既知）第13回：仮説検定（母分散既知）第14回：回帰分析（回帰直線、最小二乗法、決定係数）第15回：まとめと総合演習",
        "courseDataUpdatedAt": "2025/01/23"
    },
    "updateAt": "2025/03/21"
}