{
    "lectureCode": "R2080",
    "courseName": "キャリアデザインII［デザイン］",
    "lecturer": [
        "野条美貴(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水1"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "本授業は、１年次の「フレッシャーズゼミ」「キャリアデザインⅠ」等で身につけた大学の学びに必要となる基礎学力を、実社会で働く際に応用できるようにすることを目的としています。デザイン学部の学生として身につけておきたい社会人基礎と就職対策のための実践的な講義、演習を取り入れながら、きたるべき将来の自分をイメージしてゆく授業です。また、発展的にこれから続くキャリアデザインⅢ・Ⅳ・Ⅴにて取り組む進路・就職対策、準備に向けた授業と言えます。授業ごとのテーマにレクチャーとグループワークを基本として、学生自らの主体的な学び（アクティブラーニング）を促します。",
        "outcomesMeasuredBy": "(1)社会で働くことを意識して自分自身が今後何を身につけなければいけないのか方向性を見つける。(2)社会人基礎力となる論理的な思考能力、コミュニケーション能力、分析・評価能力、問題解決力、及び発表する力を身につける。(3)社会人になるためのマナー（挨拶、時間管理、提出物の期限厳守など）を身につける。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業ごとのテーマに対してのレクチャーとグループワークを基本として、学生自らの主体的な学び（アクティブラーニング）を促します。授業の最後に、毎回、リアクションペーパーの提出があります。詳細は、毎回Moodleに掲載します。",
        "notices": "社会人基礎としての科目であるので、受講のマナーを守り、特に遅刻をしないようにしてください。宿題は、次回授業の他学生とのグループディスカッションに直接関わる内容になるため、必ず行ってください。授業の詳細については、毎回事前にMoodleで確認してください。",
        "preparatoryStudy": "普段から新聞、ニュースサイト、雑誌、書籍などで情報を取得したり、学生同士で話し合う機会を意識して持つように心がけてください。その上で、授業ごとのテーマに対して、積極的に準備して臨み、授業後には授業の内容を振り返り、次回の予習も含めて準備学修を行ってください。",
        "gradingGuidelines": "期末テストは行わず、以下の内容と割合をふまえ、総合評価を行います。(1)授業の態度（各授業終了時に提出するリアクションペーパーの内容、受講態度）（50%）(2)理解度を確認するためのレポート課題2つ(50%)なお、単位認定要件は60点以上とします。最終授業で全体に対するフィードバックを行います。",
        "textbook": "・「ステップアップ問題集」サポートシステム・「会社四季報業界地図2024年度版」東洋経済新報社（教科書販売期間に2冊購入してください）その他の授業資料は、適宜、Moodleにも掲載します。",
        "referenceMaterials": "必要に応じて授業時にプリントを配布します。",
        "courseSchedule": "第１回：オリエンテーション(野条）第２回：文章表現Ⅰ（外部講師）第３回：文章表現Ⅱ（外部講師）第４回：自己分析Ⅰ（野条）第５回：企業での働き方とデザインの可能性を考える（外部講師）第６回：自己分析Ⅱ（野条）第７回：業界・企業研究Ⅰ業界を知る（外部講師）第８回：業界・企業研究Ⅱ企業を知る（外部講師）第９回：業界・企業研究Ⅲ職種を知る（外部講師）第1０回：業界・企業研究Ⅳまとめ（課題①レポート）（外部講師）第11回：就職活動を知るⅠ就職活動の流れ（篠山講師）第12回：就職活動を知るⅡ筆記試験の種類と攻略法（外部講師）第13回：就職活動を知るⅢWEBテストの種類と傾向（外部講師）第14回：大学生活設計レポートを作成する（課題②レポート）（篠山講師）第15回：まとめ（野条）",
        "courseDataUpdatedAt": "2024/03/10"
    },
    "updateAt": "2024/12/09"
}