{
    "lectureCode": "S1010",
    "courseName": "デザイン概説I",
    "lecturer": [
        "酒百宏一(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "この授業では、デザイン学部４年間の学びのオリエンテーションとして、また１年次後期にある系配属のための重要科目として位置づける。今日デザインを取り巻く状況やデザインと社会の関わりにおいて、その役割やあり方が見直されている。生活に身近なものから地球環境に至るまで幅広く拡張され、またそれと同時に〇〇デザインというカテゴリーも様々生み出されている。これからデザインを学ぶ学生の皆さんに、この講義を通してこれまでのデザインに対する認識をフラットにし、デザインとは何かということをしっかりと理解し、１年次終わりの系配属、２年次にあるコース配属に役立てる。前期の「デザイン概説Ⅰ」では、デザインの諸相を知り、その実際について教員がデザインの事例などを通して講義する。",
        "outcomesMeasuredBy": "授業回ごとにテーマは変わるが、いずれもデザインというところでは共通している。また自分は知っていると思い込んだり興味で判断せずに、常に新しいデザインの知見を得るために主体的に臨むこと。デザインに対する国際的な教養、実学に基づく専門能力、論理的な思考力、分析・評価能力、問題解決力の向上を目標とする。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "デザイン学部の専任教員が交代で行うオムニバス授業である。各回の講義はいずれも教員の専門と深く関連している。授業は画像や映像等を駆使した講義形式を基本とする。毎回の授業資料等はMoodleにて事前に掲載し、その授業内容に関するフィードバックを授業内で課し、Moodleにて回答を提出することで理解度を確認する。そのためクリティカルな視点で思考し、考察することが望ましい。",
        "notices": "今後の系配属やコース配属にも関わってくる重要科目である。",
        "preparatoryStudy": "講義を受ける前に必ず教員の所属や授業テーマについて予備調査をしておくと理解が深まるので、Moodleの授業ページを確認すること。各授業回で回答するミニッツペーパーは今後の振り返りや記録として各自で保存しておくこと。",
        "gradingGuidelines": "授業の中で理解度、意見を確認するためのミニッツペーパー提出による評価［60%］、最終レポートによる評価［40%］、ミニッツペーパーに対する教員からのフィードバックは個々に行わないが、今後の参考にする。最終回には全15回のテーマから１テーマを取り上げたまとめレポートを課して科目の評価をする。",
        "textbook": "必要に応じてMoodleに資料を添付するので、各自ダウンロードしておくこと。",
        "referenceMaterials": "必要に応じてMoodleに資料を添付するので、各自ダウンロードしておくこと。",
        "courseSchedule": "第1回：デザインの学びの先にあるもの／総論（酒百宏一）第2回：視覚デザイン①「視覚デザインの社会的な役割」（伊藤丙雄）第3回：視覚デザイン②「グラフィックデザインの可能性」（小田敬子）第4回：視覚デザイン③「伝達の方法の移り変わりとその関わり方」（舟山貴士）第5回：視覚デザイン④「WebデザインとUIUX」（田邉雄一）第6回：情報デザイン①「デジタル技術が拡張する情報デザイン」（伊藤英高）第7回：情報デザイン②「情報デザインで示す複眼的視点」（井藤雄一）第8回：工業デザイン①「プロダクトデザインのカタチ」（堀川卓哉）第9回：工業デザイン②「商品企画の実際とその先」（田崎咲絵）第10回：工業デザイン③「愛されているデザインから学ぶこと」（高澤恭子）第11回：空間デザイン①「人の暮らしと空間デザイン」（小山祐輔）第12回：空間デザイン②「空間デザインに必要な視野」（宮元三恵）第13回：空間デザイン③「他分野融合で拡大する空間演出」（田村吾郎）第14回：コース共通「言葉から考えるデザイン」（暮沢剛巳）第15回：まとめと最終レポート課題の評価基準と説明（酒百宏一）",
        "courseDataUpdatedAt": "2024/03/10"
    },
    "updateAt": "2024/12/09"
}