{
    "lectureCode": "S1030",
    "courseName": "色彩概論",
    "lecturer": [
        "早瀬交宣(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "色彩の基本知識と様々なデザイン領域における応用例を学ぶ。まず色彩認知の物理的な仕組み・色の混色理論・色彩体系など基礎的な色の成り立ちを学び、のちに様々な色彩調和理論とそれらのもたらす視覚的効果、心理的効果を多くのデザイン実例を通して学修する。また演習形式も取り入れ、実践的に色彩の活用について学んでいく。",
        "outcomesMeasuredBy": "色彩の基礎知識を身につけ、各人がデザイン制作に生かせる色彩観といった「実学に基づく専門能力」の修得を到達目標とする。また色彩感覚の向上だけではなく、デザインにおける色彩使用に必要不可欠な色彩効果に関する「論理的な思考力」「分析・評価能力」も養っていく。同時に、古今東西のデザインにおける色彩活用の事例を示すことで副次的にグラフィック、映像、インテリアやプロダクトなど様々なジャンルのデザインへの「国際的な教養」を深めることをも目的としている。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "基本的には多くの画像資料を提示しながら講義形式で進行するが、ノートPCを使用したノートテイクや手作業による配色演習、屋外での配色採集、ショートレポートなどの課題制作・提出も行う。さらに、講義内容に基づき論理的な思考力や発想力を養うエクササイズを、授業内ワークあるいは宿題として課す。毎回、ノートはPC必携となる。",
        "notices": "日常的に身のまわりの色彩を注意深く観察したり、デザイン、芸術の展覧会を観覧するなど、色彩を観る目を養うこと。可能な限り（カタログ等に印刷された）二次的な資料ではなく、実物に触れること。また、授業内で不明な点はそのままにしておかないこと。",
        "preparatoryStudy": "授業の終わりに次回の授業内容について触れ、次回までに調べておく事柄を指示する。当該授業についてレポートの提出を求める場合もある。授業に関する連絡事項は基本的にGoogleClassroomに事前に掲示しておくので、欠かさず確認しておくこと（連絡方法は変更の可能性あり）。",
        "gradingGuidelines": "受講態度、提出物等の授業への取り組みに対する評価【60％】、最終レポートの提出【40％】、で評価し、60点以上を単位認定要件とする。",
        "textbook": "必要に応じて資料データ、あるいはプリントを配布する。",
        "referenceMaterials": "色彩楽のすすめ(尾登誠一)その他は必要に応じて授業時に指示。",
        "courseSchedule": "第1回：ガイダンス、色の基本1—色いろいろ第2回：色の基本2—原色と混色第3回：色の基本3—色彩の三属性第4回：表色1—色彩体系第5回：表色2—PCCSトーン第6回：色彩調和1—色彩調和理論や様々な色彩対比1第7回：色彩調和2—色彩調和理論や様々な色彩対比2第8回：配色演習1第9回：色彩の作用と効果1—視覚効果とその応用第10回：色彩の作用と効果2—色彩とイメージ第11回：衣食住と色彩第12回：配色演習2第13回：日本の色—日本における色彩の認識と色名の成り立ち第14回：デジタルカラー—CMYK・RGB、印刷・映像の中の色彩第15回：まとめ—色彩の様々な効果や役割を再検証する",
        "courseDataUpdatedAt": "2024/03/10"
    },
    "updateAt": "2024/08/07"
}