{
    "lectureCode": "S2030",
    "courseName": "プレゼンテーションの基礎",
    "lecturer": [
        "小田敬子(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１０１４教室"
    ],
    "courceDetails": {
        "courseOverview": "デザイナーの役割においては、実務である企画・制作・提案を「いかに伝えるか」というプレゼンテーションの力が重要になってきます。プレゼンテーションはその案件や状況においてそれぞれに目的を伴います。プレゼンテーションは伝える側と聞く側の双方の情報のやり取りの場であり、伝え方のみならず、相手の反応や要望を汲み取るために聞く力や察知する力などが必要となるため、コミュニケーション力を鍛えていくことが重要です。この授業では話す・魅せるといった伝達力と、論理的な思考力で伝えるべき内容を構成したプレゼンテーション資料を作成し、プレゼンテーションに備えるための実践的な実力を身につけます。インターンシップや就職活動でプレゼン力が発揮できるよう、ポートフォリオの作成をはじめとした学生が必要とする力を初歩から身につけていきます。",
        "outcomesMeasuredBy": "学生に必要なプレゼンテーション力として、以下の三つの状況に対応できるようになるための研究と習得を目標とします。①授業内において、自身の企画・制作・提案のプレゼンテーション②卒業研究など、長期案件における段階的なプレゼンテーションの構築③インターンシップや就職活動に必要となる自己PR力とポートフォリオについて",
        "learningOutcomes": "コミュニケーション能力論理的な思考力",
        "teachingMethod": "プレゼンテーションの基礎科目として、実践に向けたプロセスをパワーポイント等を用いて初歩から解説します。エクササイズとして各学修項目に対応したワークや資料作成を実施します。授業内にデータ作成を行うため、ノートＰＣ必携です。学生が登壇するプレゼンテーションを実施し、学生自らの主体的な学び(アクティブラーニング)を促します。",
        "notices": "本講義は座学であり、基本はプレゼンテーションにあたっての説明が主ですが、プレゼンテーションテクニックを実践的に学ぶ上で、各自授業時に使用するテキストや画像の用意を事前に行う指示が出ます。Moodle上に詳細を記しますので、Moodleは毎回の授業に備えてしっかりと目を通してください。学生生活において制作物の数が多くなっていくと、プレゼン資料作成のためのデータストックはPCの容量を圧迫する状況となる場合があります。大切なデータの破損を防ぎ、PCの性能を活かせるように外付けハードディスクなどの準備をして、安全かつ効率的なPC環境の維持を心がけてください。",
        "preparatoryStudy": "[予習]履修している他の授業の制作物やスケッチなど、作品は画像やPDFデータ等に保存し、コンセプトなどのテキストはワードにまとめるなど、こまめにアーカイブの整理をしましょう。[復習]授業で紹介されたり、必要と指摘を受けたデザインの専門用語とその使い方を覚えていき、語彙力を増やしましょう。",
        "gradingGuidelines": "プレゼンテーションの完成度（40％）ポートフォリオの取り組み度（40％）グループワークとコミュニケーション力（20％）",
        "textbook": "指定しない",
        "referenceMaterials": "蒲田校大学図書館「なぜあなたの発表は伝わらないのか（490.7）」「SMARTなプレゼンでいこう（490.7）」",
        "courseSchedule": "第1回：オリエンテーション第2回：グループごとにプレゼンテーション第3回：自己PRボードレイアウト基礎第4回：自己PRボードポートレート第5回：企画書とプレゼンテーション第6回：長期プロジェクトのプレゼンテーションの構築第7回：ポートフォリオのコンテンツ第8回：ポートフォリオの画像とレイアウト第9回：ポートフォリオの基本レイアウト第10回：ポートフォリオの展開第11回：プレゼンテーション①フィードバック第12回：プレゼンテーション②フィードバック第13回：プレゼンテーション③フィードバック第14回：プレゼンテーション④フィードバック第15回：まとめおよび理解度チェック",
        "courseDataUpdatedAt": "2024/03/10"
    },
    "updateAt": "2024/08/07"
}