{
    "lectureCode": "S2050",
    "courseName": "感性演習II（伝える）[クラス共通]",
    "lecturer": [
        "早瀬交宣(デザイン学部デザイン学科)",
        "田邉雄一(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3",
        "月4",
        "月5",
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "デザイン学部デザイン学科視覚デザイン専攻",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "３１３０１デザイン演習室１",
        "３１３１５デザイン演習室４"
    ],
    "courceDetails": {
        "courseOverview": "「感性演習Ⅰ（伝える）」から続いて、授業を展開する。視覚表現の基礎要素である、色、形、構成、質感の４要素のうち、構成について理解し、諸要素を総合的に組み合わせたデザインの応用課題にも取り組む。デザインの意図を設定し、どのように視覚的にその意図を伝えるのか考察する。引き続き、「手を動かして考える」ことを重視する。特にデザイン課題では、発想力や創造力を養うために、ラフスケッチをする習慣を身につけてほしい。この授業は視覚伝達デザイン、視覚情報デザインの両コースに共通する視覚デザインの基礎として位置付けている。２年次後期に開講される各コースの「専門演習I」に向けて、「感性演習Ⅰ（伝える）」と「感性演習Ⅱ（伝える）」の全課題に取り組み、到達目標を達成してほしい。",
        "outcomesMeasuredBy": "(1)視覚表現の基礎要素である、色、形、構成、質感の４要素のうち、構成について理解する。(2)リサーチと分析を行い、課題を通じてデザインの分野でどのように使われるのか考察する。（分析・評価能力を養う）(3)ラフスケッチをする習慣を身につける。（4）実践的なPCでの作業から使用する紙の検討・印刷までを身につけ、実学に基づく専門能力を養う。(5)自分の制作物の内省し、改善案を見出せるようになる。（問題解決力を身につける）(6)講評会での発表、グループ講評において他者の制作物を的確に分析し伝え合うなど、コミュニケーション能力を養う。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "実際に手を動かした制作が中心になるので、1年次で使用した画材や道具類を用意しておくこと。リサーチとして、学外でのフィールドワークを行う。制作過程において個別に作品ついてのフィードバックを行う。必要に応じて検討会を行う場合もある。インターネットでの情報検索やMoodleを使用するためノートPCは必携とする。デザイン課題ではPCでのデータ制作作業・各自使用する紙の検討・印刷・カットまでデザインする上で必要となる流れを行う。",
        "notices": "課題は授業時間で作品制作を行うが、制作にかかる時間は個々の表現したい内容やスキルによるので、時間外での制作も考慮しておく。",
        "preparatoryStudy": "授業で制作が進められるように、課題内容に応じて事前に情報収集をすること。デザイン課題で印刷に使用する紙は各自竹尾にて購入し準備する（授業内で指示する）。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①発想段階【20%】（調査内容、コンセプト、G：ディスカッションの参加）②制作段階【20%】（試作等の表現に至る過程、計画的な作業進行、G：作業の参加）③結果段階【40%】（提出期限、作業密度、相手への意識）④プレゼンテーション段階【20%】（わかりやすさ、伝え方、G：発表の参加）※Gはグループワーク",
        "textbook": "必要に応じて資料を配布する。",
        "referenceMaterials": "参考作品や参考資料を紹介する。",
        "courseSchedule": "第1回：Composition（1）：課題説明\/制作（全教員）第2回：Composition（2）：制作（全教員）第3回：Composition（3）：制作（全教員）第4回：発表会（全教員）第5回：デザイン課題1（1）:課題説明\/制作（全教員）第6回：デザイン課題1（2）:制作（全教員）第7回：デザイン課題1（3）:制作（全教員）第8回：デザイン課題1（4）:制作（全教員）第9回：発表会（全教員）第10回：デザイン課題2（1）:課題説明\/制作（全教員）第11回：デザイン課題2（2）:制作（全教員）第12回：デザイン課題2（3）:制作（全教員）第13回：デザイン課題2（4）:制作（全教員）第14回：発表・講評会（全教員）第15回：課題のまとめ（全教員）＊授業の進行は状況をみて調整する可能性がある。",
        "courseDataUpdatedAt": "2024\/03\/10"
    },
    "updateAt": "2024\/08\/07"
}