{
    "lectureCode": "S2060",
    "courseName": "感性演習I（関係づける）[クラス共通]",
    "lecturer": [
        "田崎咲絵(デザイン学部デザイン学科)",
        "御幸朋寿(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3",
        "月4",
        "月5",
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "デザイン学部デザイン学科工業デザイン専攻",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "３１３１１デザイン演習室２",
        "３１３１３デザイン演習室３"
    ],
    "courceDetails": {
        "courseOverview": "デザインは単体で成立するものではなく、使う人、場や環境、時間、季節、歴史など、周りを取り巻く様々な事象や状況との関係のもと初めて成立する。デザインするということは、ものともの、ものと人、ものと空間、ものと環境、ものとことなどを適切に「関係づける」行為であるともいえる。この授業では、対象をどう分析し、問題を発見し、新たな提案に繋げるのかという視点からデザインに不可欠な「関係性」を理解し、デザインに関わる上で必要とされるリサーチ力、発想力、思考力、表現力の基礎を養う。",
        "outcomesMeasuredBy": "作品制作を中心にした演習課題を通じて、デザインの仕事に必要とされる論理的な思考力・分析評価能力・問題解決力を養いながら、縮尺やシミュレーションに対する理解を深めつつ、作品を完成させる力を身につける。また、グループワークでは、責任感と協調性の向上、コミュニケーション能力の獲得にも努める。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "課題ごとに設定されたテーマに沿い、作品制作を中心にすすめる。課題に対して様々な観点からの考察を行いながら、デザインに関わる者に必要とされる視点や表現を学ぶ。個人制作だけではなく、グループワークにも取り組みつつ、ものごとの関わりを多角的に学修する。作品完成時に行う発表会の他、課題進行中には随時検討会を行う。なお、授業資料の閲覧や作品制作のためにノートPCを必携とする。",
        "notices": "作品制作が中心となる演習科目であるため、各自が主体性と目的意識をもち、制作に取り組む姿勢が要求される。また個人としての制作はもちろん、グループワークも重視するため、協調性をもって積極的に授業に参加することが求められる。",
        "preparatoryStudy": "授業中に実際に手を動かし制作ができるよう、作品の構想・アイディアスケッチ・調査・素材集めなどの予習を行うこと。また授業後は、授業内容に即して出題する課題に取り組み、内容について各自理解を深めること。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準に対応した詳細については学生ポータルを参照すること。①発想段階【20%】（調査内容、コンセプト、G：ディスカッションの参加）②制作段階【20%】（試作等の表現に至る過程、計画的な作業進行、G：作業の参加）③結果段階【40%】（提出期限、作業密度、相手への意識）④プレゼンテーション段階【20%】（わかりやすさ、伝え方、G：発表の参加）※Gはグループワーク",
        "textbook": "指定しない。",
        "referenceMaterials": "演習内で参考作品や参考資料を紹介する。",
        "courseSchedule": "第1回：関係をみつける＿フィールドワーク１（全教員）第2回：関係をみつける＿フィールドワーク2（全教員）第3回：関係をみつける＿個人制作1（全教員）第4回：関係をみつける＿個人制作2（全教員）第5回：関係をみつける＿個人制作3（全教員）第6回：関係をみつける＿プレゼンテーション制作（全教員）第7回：関係をみつける＿発表（全教員）第8回：人・時・場＿リサーチ１（全教員）第9回：人・時・場＿リサーチ2（全教員）第10回：人・時・場＿グループ制作1（全教員）第11回：人・時・場＿グループ制作2（全教員）第12回：人・時・場＿グループ制作3（全教員）第13回：人・時・場＿グループ制作4（全教員）第14回：人・時・場＿グループ制作5（全教員）第15回：人・時・場＿発表（全教員）",
        "courseDataUpdatedAt": "2024\/03\/10"
    },
    "updateAt": "2024\/08\/07"
}