{
    "lectureCode": "S2081",
    "courseName": "スキル演習（撮影・画像加工）［木曜Aクラス］",
    "lecturer": [
        "原田和大(兼任講師)",
        "石山慎治(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "デザイン学部デザイン学科視覚デザイン専攻",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１１１４デザインクリエーションルーム１",
        "３１４０２撮影スタジオ",
        "３１４１３専門演習室２"
    ],
    "courceDetails": {
        "courseOverview": "（画像加工)ビットマップ画像を扱う上での、基本的な管理方法、他メディアへの展開の際の注意事項を踏まえた上で、AdobePhotoshopを用いて画像の合成、変形、修正、補正などの基本スキルおよび表現の幅を広げる応用方法を学ぶ。習得したスキルを元に問題解決に向けたアプローチの方法を課題を通して学んでいく。また、他者への伝達を軸に考えることで、より実践的な学習を目指す。撮影パートとの連携することで、自身で撮影したものを加工していくステップを学ぶ。総合課題は、主題に沿って画像を撮影、制作提案する実学的な内容となり、各自プレゼンテーションの形式で発表する。（撮影）デザイン制作をする上で、写真素材を取り扱うための考え方や光の方向性、カメラマンの撮影の意図やそのやり取りに必要な基礎知識を学ぶ。実際にカメラで撮影を行うことにより、商品撮影、人物撮影、写真素材の撮影の知識の習得を目指す。各回、座学で基礎知識、カメラを使っての実習という２部構成で進めていく。デザインラフを元に実際に写真素材を撮影し撮影意図を発表するなど、デザインの中の写真の役割についての考えを深める。",
        "outcomesMeasuredBy": "(画像加工)・Photoshopで扱うビットマップデータの性質について理解し、適切な管理方法を身につけ、イメージやアイデアを表現するための画像作成・編集方法を修得する。・グループワークを通して、コミュニケーション能力を養い、問題点や改善点を考えることで、多角的に対応できる柔軟な分析・評価能力と問題解決力を身につける。・自身で撮影したものを加工して表現に落とし込む一連の手順を学修する。（撮影）・カメラの知識や光の特徴を学び、扱えるようにする。・将来カメラマンと仕事をする際に、自分の意図を伝えられるようにライティングの基礎知識を学び、実学に基づく専門能力を修得する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "(画像加工)加工表現についての例題を交えながら、AdobePhotoshopを用いた操作方法や各種機能について理解を深める。また、授業内で行う演習課題を通し、実際に制作をすることで内容の理解度を確かめながらスキルの習得を目指す。（撮影）スライドによる説明と実際に一眼レフカメラを用いて、機材の扱い、ライティングなどについて学ぶ。",
        "notices": "本科目の撮影は写真撮影をする際の基礎を学ぶものであり、動画撮影の基礎内容とは異なる。同曜日に2クラスの授業を行うためクラスによっては下記、授業計画の画像加工パートと撮影パートの順序が入れ替わる。",
        "preparatoryStudy": "予習：（画像加工）翌週の授業内容に合わせて、見直しておくべき基礎機能を指示する。週によっては、課題のための画像素材の準備を指示する場合がある。（撮影）翌週の授業内容に合わせて、撮影する小物などを準備する場合がある復習：（画像加工）自ら画像素材を用意して、配布資料で操作手順を確認しながら、授業で学んだスキルを復習すること。（撮影）授業で学んだ撮影方法を実際に撮影してもらう",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学内サイトを参照。①制作段階【60%】（授業理解、丁寧な作業、期限内提出、出席率）②結果段階【30%】（課題理解、スキル・知識の理解、独自の発想、十分な作業量、提出期限、完成度）③プレゼンテーション段階【10%】（作品意図、的確な説明）",
        "textbook": "画像加工：毎回の授業時に資料と練習課題用の画像素材を配布する。撮影：資料の必要な回は事前配布する。",
        "referenceMaterials": "必要に応じて授業時に紹介する。",
        "courseSchedule": "第1回：［画像加工］作品画像のレタッチ方法1（原田／木曜日、石動／金曜日）第2回：［撮影］カメラの使い方（石山／木曜日、吉永／金曜日）第3回：［画像加工］作品画像のレタッチ方法2（原田／木曜日、石動／金曜日）第4回：［撮影］露出の３要素を使った撮影（石山／木曜日、吉永／金曜日）第5回：［画像加工］作品画像のレタッチ方法3（原田／木曜日、石動／金曜日）第6回：［撮影］一眼レフとスマホの違い（石山／木曜日、吉永／金曜日）第7回：［合同］〈1限目〉撮影、課題〈2限目〉合成（両教員）第8回：［画像加工］画像加工によるイメージ制作1（原田／木曜日、石動／金曜日）第9回：［撮影］光の特徴・ストロボ使い方（石山／木曜日、吉永／金曜日）第10回：［画像加工］画像加工によるイメージ制作2（原田／木曜日、石動／金曜日）第11回：［撮影］光の向きと質（石山／木曜日、吉永／金曜日）第12回：［合同］制作期間（両教員）第13回：［合同］制作期間（両教員）第14回：［合同］総合課題（両教員）第15回：［合同］総合課題（両教員）",
        "courseDataUpdatedAt": "2024\/03\/08"
    },
    "updateAt": "2024\/09\/13"
}