{
    "lectureCode": "S2090",
    "courseName": "スキル演習（基礎製図）",
    "lecturer": [
        "御幸朋寿(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "デザイン学部デザイン学科工業デザイン専攻",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１１１５デザインクリエーションルーム２",
        "３１１１６デザインクリエーションルーム３"
    ],
    "courceDetails": {
        "courseOverview": "この演習では、工業系製図と空間系製図における基礎を修得する。製図は語学のようなひとつのコミュニケーション手段である。実学に基づく正しい図法で図形を描画できるようになれば、世界中のクリエータ（図面使用者）に頭の中のイメージを確実かつ容易に伝えることが可能となる。現代はCADや３DCGの時代であるが、それらを学ぶ上でまずは自らの手で線を描いて表現し、3次元的イメージを論理的思考で２次元（平面）に落とし込むスキルを高めることが必要である。工業系製図と空間系製図の両方を修得する。",
        "outcomesMeasuredBy": "手書き（鉛筆／シャープペンシル）で均一な線や図形を正しく描画できるようになる。論理的な思考力を向上し、立体物や空間イメージを正しく描画できるようになる。自分でイメージしたオリジナルのデザインを作図することができるようになる。第三者が作図した図面を見て（検図）、イメージが理解できるようになり図面を用いてのコミュニケーション能力を修得する。3次元的な思考ができるようになり、実学に基づく専門能力を身につけることを目標とする。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "授業の冒頭に演習課題を進める上での理論的な講義を行う。その後、基礎的な作図スキルを高めるための課題が出され、実際に作図をする。",
        "notices": "毎回の授業にノートPCと三角定規（１組）・直定規（30cm以上）・コンパス・鉛筆・消しゴム・カッターを必ず持参すること。※忘れると授業中やることがなくなるので注意！！授業時に配布するプリントと描画した図面をファイリングすること。授業開始時に作図方法を説明するので遅刻は厳禁とする。全課題を所定の期日までに遅延なく提出すること。",
        "preparatoryStudy": "授業ごとに積み重ねて学修するので、わからない部分は復習を重ねること。止むを得ず欠席した場合は、翌週の授業に向けて前週分の到達点まで作業を終わらせておくこと。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①制作段階【60%】（授業理解、丁寧な作業、期限内提出、集中度）②結果段階【30%】（課題理解、スキル・知識の理解、独自の発想、十分な作業量、提出期限、完成度）③プレゼンテーション段階【10%】（作品意図、的確な説明）",
        "textbook": "特になし、授業内で適宜プリントを配布する。",
        "referenceMaterials": "「図面の描き方がやさしくわかる本」西村仁著〔日本能率協会マネジメントセンター社〕「デザイン製図ハンドブック」小山清男著〔ダビッド社〕「製図の基礎」中本繁実編〔パワー社〕「デザイン表示の図法と作図」定松修三・定松潤子著〔オーム社〕「図形ドリル」上田篤著〔学芸出版社〕",
        "courseSchedule": "第1回：オリエンテーション第2回：立体把握能力向上ドリル1第3回：立体把握能力向上ドリル2第4回：立体把握能力向上ドリル3第5回：立体把握能力向上ドリル4第6回：アイソメトリック図法1第7回：アイソメトリック図法2第8回：スケッチパース1第9回：スケッチパース2第10回：立体物の計測と図化1第11回：立体物の計測と図化2第12回：立体物の計測と図化3第13回：３Dモデリング基礎1第14回：３Dモデリング基礎2第15回：まとめ",
        "courseDataUpdatedAt": "2024/03/10"
    },
    "updateAt": "2024/12/09"
}