{
    "lectureCode": "S2100",
    "courseName": "専門スキル演習（エディトリアルデザイン）",
    "lecturer": [
        "舟山貴士(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "デザイン学部デザイン学科視覚デザイン専攻",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１１１４デザインクリエーションルーム１"
    ],
    "courceDetails": {
        "courseOverview": "「エディトリアルデザイン」とは、グラフィックデザインの中でも本や雑誌、パンフレットなどのレイアウトを指します。単に素材を紙面に配置していくだけでなく、内容を汲み取り編集を行いながら、効果的に情報を伝えることが目標となります。この専門スキル演習では受講生ひとり一人が印刷媒体の業務を受注した設定により、各制作条件に応じたワークフローを参考にしながら、グラフィックデザインの基本と高度な表現のためのテクニックを段階的に身につけます。伝達するべき目的に適したパンフレット冊子制作と、ポートフォリオ制作の演習を通じて、単にエディトリアルデザイナーとしての対応力を養うばかりでなく、様々なソースを整理し伝えるための読解力と、問題点を視覚的に解決する総合的なスキルの向上を図ります。デザイン事務所勤務から独立して制作を行った実務経験を基に行う実践的科目です。履修をする際は、授業のMoodleページを必ず確認すること。",
        "outcomesMeasuredBy": "実学に基づく専門能力：実際に流通するようなメディアの制作に取り組み、読み手の意識を汲みながらレイアウトに反映できるようになること。コミュニケーション能力：制作した課題に対してプレゼンテーションを行い、制作意図をまとめて伝えることができるようになること。分析・評価能力：既存のメディアの分析を行い、コンテンツについてどのような扱いをするのか適切に判断できるようになること。問題解決力：メディアの制作を通して、そもそもどのようなことを伝える必要があるのか編集などの作業も行いながら、レイアウトだけでなく総合的にプロジェクトを進められるようになること。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "課題は、企画／編集／制作／校正／進行管理の5つの役割で、与えられた課題を高度に具現化するプロセスを学びます。課題により、グループワークを行います。また、課題の進捗に応じて都合で制作会議やデザインプレゼンを実施、客観的な視点に表現の最適化を判断する機会を持ちます。学内での授業ではノートPCでの作業を前提とします。",
        "notices": "2年次後期と3年次前期に開講される「専門スキル演習：エディトリアルデザイン」はほぼ同内容となります。",
        "preparatoryStudy": "導入で必須となるAdobeIllustrator、Photoshop、InDesignなどのアプリケーションソフトのインストールをしておいてください。また、全般的に社会に存在する印刷物、グラフィックデザインに興味を持つ眼、解析する心を養うようにしてください。スキルアップの自覚は丁寧な予習・復習に比例します。また、授業時間内で理解に達しないアプリケーションソフトの使用方法やデータの約束事を振り返る習慣を身につけてください。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とします（各段階での評価項目は下記のとおり）。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①制作段階【45%】（理解度、作業の丁寧さ、提出期限）②結果段階【45%】（スキル・知識の理解度、独自性、スキル・知識の応用力、作業量、提出期限、完成度）③プレゼンテーション段階【10%】（作品意図、的確な説明）",
        "textbook": "授業内容、進行に合わせて適宜配付します。",
        "referenceMaterials": "授業内容、進行に合わせて事前に指示します。",
        "courseSchedule": "第01回：文字組みの基礎1分析、組版第02回：文字組みの基礎2文字組みの様々な要素、スペーシングのスタディ第03回：文字組みの基礎3InDesignの基本操作第04回：スタディ1見開きの紙面構成・1紙面構成の基本、ラフスケッチ第05回：スタディ2見開きの紙面構成・2ページの流れについて第06回：スタディ3見開きの紙面構成・3レイアウトのブラッシュアップ第07回：総合課題1ペーパーメディアの作成・1第08回：総合課題1ペーパーメディアの作成・2第09回：総合課題1ペーパーメディアの作成・3第10回：総合課題1ペーパーメディアの作成・4第11回：総合課題1プレゼンテーション・1第12回：総合課題2ポートフォリオ作成・1第13回：総合課題2ポートフォリオ作成・2第14回：総合課題2ポートフォリオ作成・3第15回：総合課題2プレゼンテーション2",
        "courseDataUpdatedAt": "2024/03/10"
    },
    "updateAt": "2024/08/07"
}