{
    "lectureCode": "S2120",
    "courseName": "専門スキル演習（ユーザインタフェース）",
    "lecturer": [
        "加藤一葉(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "デザイン学部デザイン学科視覚デザイン専攻",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１４１５専門演習室３"
    ],
    "courceDetails": {
        "courseOverview": "現在の日常生活で切っても切れないスマートフォン。これらスマホアプリのユーザインタフェース(UI)デザインについて考え、実学に基づく専門能力を養いながらUIのデザインを学ぶ。プログラミングは行わず、グラフィカルなスマホアプリのデザインができるように、AdobeIllustrator、Photoshop、Figmaの基本操作を習得し、アイコン制作から、プロトタイピングツールを使用してプロトタイプの設計、デザインを行う。分かりやすく、操作しやすいUIデザインを目標に、ユーザの認知や行動の分析・評価能力を養い、問題解決方法を学び、ユーザインタフェースデザインの基礎的な知識とスキルを身につける。また、作品発表を通してコミュニケーション能力も身につける。この授業は視覚情報デザインコース専門演習の授業の内容と連携している。使用ソフトウェア:AdobePhotoshopAdobeIllustratorFigmahttps://www.figma.com/",
        "outcomesMeasuredBy": "それぞれの課題を通してスキルの到達目標は下記のとおりである。①AdobeIllustrator、AdobePhotoshop、Figmaの描画など基本操作と様々な形式へデータの書き出し②UXとUIデザインの基本知識（ペルソナ手法を用いてユーザの認知や行動を分析、ユーザビリティの評価）③UIソフトの基本操作とプロトタイプ設計・デザイン（問題解決された直感的で操作しやすいUIデザインの提案）④プレゼンテーション用のデータの整理",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "ノートPC必携デザイン制作が中心となる。１限目にソフトウェアの操作方法を説明し、２限目にその操作方法を覚えるように個々の課題を行い授業は進行する。",
        "notices": "科目の内容上、「視覚情報デザインコース専門演習」「情報デザイン論」とあわせて履修することが望ましい。時間外の作業が必要なため、AdobeIllustrator、AdobePhotoshopを更新していること。Figmahttps://www.figma.com/をインストールしておくこと。",
        "preparatoryStudy": "授業前は事前に配布している課題概要を読み理解し、素材の制作や取材、発表準備等の事前準備を行う。授業後は個人のスキルに合わせ、習得できなかったスキルを復習しマスターすること。また、授業中に終わらなかった課題制作を行い、何ができて何ができなかったのか自分で振り返り、どのようにすれば改善できるのか考え、制作過程のリフレクションを行うこと。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①制作段階【45%】（授業理解、丁寧な作業、期限内提出、集中度）②結果段階【45%】（課題理解、スキル・知識の理解、独自の発想、スキル・知識の応用、十分な作業量、提出期限、完成度）③プレゼンテーション段階【10%】（作品意図、的確な説明））",
        "textbook": "必要に応じて授業時にプリントを配布する。",
        "referenceMaterials": "はじめてのUIデザイン改訂版初心者からちゃんとしたプロになるFigma基礎入門",
        "courseSchedule": "第1回：ガイダンス、illustratorの使い方第2回：課題①「アイコンのデザイン」第3回：課題①修正可能なデータの作成、デジタル素材の書き出し方法第4回：課題②Figmaの使い方、「スマホアプリのUIデザイン」コンセプト決める第5回：課題②ワイヤーフレーム、ペーパープロトタイプの作成第6回：課題②パーツ（コンポーネント）、素材の制作第7回：課題②作品プレゼンテーション第8回：課題②作品修正・提出第9回：課題③「UXを意識したアプリデザイン」コンセプト決める第10回：課題③ペルソナ調査、要求整理を行う第11回：課題③UIフロー図、ユーザインタフェース設計・デザイン第12回：課題③パーツ（コンポーネント）、素材の制作第13回：課題③画面遷移図の作成第14回：課題③作品プレゼンテーション第15回：総括、最終作品提出",
        "courseDataUpdatedAt": "2024/03/10"
    },
    "updateAt": "2024/12/09"
}