{
    "lectureCode": "S2160",
    "courseName": "情報デザイン論",
    "lecturer": [
        "加藤一葉(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "ネットワークの普及により日常生活におけるオンライン化が進み、スマートフォン等を介して情報活動に膨大な時間が費やされている。情報デザインとは、これら人々の情報活動の経験全体をデザイン領域として捉え、大量の情報をいかにして整理し、わかりやすく人に伝えるのかということを扱う領域の総称である。本講義では、情報デザインの歴史、情報モラル、情報デザインのコアであるデザインリサーチのユーザ調査方法などの解説とともに、具体的な身の回りの情報活動の事例から問題発見の手法、問題解決へのプロセスについて、実学に基づく専門能力を養い実践していく。また、「視覚情報デザインコース専門演習」の内容と連携しており、演習で必要となるデザインリサーチの手法を学ぶ。",
        "outcomesMeasuredBy": "・デザインリサーチの習得を目標に、フォトエッセイ、フォトダイアリー、ペルソナ手法、ヒアリング調査等実践していく。・調査内容をディスカッションし、対象者を客観的に捉えるためのリフレクションを行いコミュニケーション能力と同時にメタ認知能力も養う。・最終課題はデザインイシューの絞り込み、ペルソナ(架空の人物像)の外在化、具体的なデザインプランをレポートとしてまとめる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "調査内容をまとめるためノートPCを使用する。調査のため写真を撮影するスマートフォンまたはデジタルカメラ、その写真を出力するためのプリンターを持っていることが望ましい。調査課題では調査概要を事前に説明し調査を授業外で行い、授業ではその振り返りやディスカッションを行う反転授業形式で行う。",
        "notices": "持参するものはその都度指示する。授業のリフレクションなど課題に取り組んでもらうことがある。また、科目の内容上、専門スキル演習「ユーザインタフェース」または「Webコンテンツデザイン」とあわせて履修することが望ましい。",
        "preparatoryStudy": "授業前は事前に配布する各ユーザ調査の課題概要を読み理解し、写真撮影など調査の準備を行う。授業後、授業のリフレクションを行う。そして、ユーザ調査ごとに配布したワークシートを作成する。",
        "gradingGuidelines": "ユーザ調査ごとにワークシートを作成し、調査後提出してもらい、専門能力としての調査手法の習得の到達度を評価する【40%】。そして最終課題のテーマに基づいた企画提案レポートから、考察力、問題解決力、発想力、提案力を評価する【45%】。授業中に行う小課題や課題のリフレクションなどの評価【15%】を加えて総合的に評価する。60点以上を単位認定要件とする。",
        "textbook": "随時資料を配布する。",
        "referenceMaterials": "「誰のためのデザイン？増補・改訂版-認知科学者のデザイン原論」、ドナルド・A.ノーマン、2015、新曜社「情報デザインの教室」、情報デザインフォーラム、2010、丸善出版「UXデザインの教科書」、安藤昌也、2016、丸善出版",
        "courseSchedule": "第1回：ガイダンス情報デザインとは何か第2回：情報デザインの歴史第3回：ユーザインタフェースの事例第4回：情報モラル-著作権１第5回：情報モラル-著作権２第6回：デザインリサーチとは何か第7回：デザインリサーチ(ユーザー調査1フォトエッセイ)第8回：デザインリサーチ(ユーザー調査2フォトダイアリー)第9回：デザインリサーチ(ユーザー調査3ペルソナ手法)第10回：デザインリサーチ(ユーザー調査3ペルソナ手法)第11回：デザインリサーチ(ユーザー調査4ユーザーインタビュー)第12回：デザインリサーチ(ユーザー調査4ユーザーインタビュー)第13回：デザインリサーチ(ユーザー調査5ジャーニーマップ)第14回：デザインリサーチ(ユーザー調査5ジャーニーマップ)第15回：総括最終レポート提出特別講師による講義で授業内容がさしかわる場合がある。",
        "courseDataUpdatedAt": "2024\/03\/10"
    },
    "updateAt": "2024\/09\/13"
}