{
    "lectureCode": "S2170",
    "courseName": "広告論",
    "lecturer": [
        "葛原俊秀(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１００３教室"
    ],
    "courceDetails": {
        "courseOverview": "私たちの周りに広告は溢れています。広告は、商品・サービス・ブランドと、私たち消費者を繋ぐ尊い架け橋であり、マーケティングの中においても重要な役割を担っています。本授業では、広告媒体、広告計画、広告表現、広告効果というトピックを取り扱いますが、それらの知識や手法をただ学ぶだけでなく、それらの学びを通して、広告の受け手を理解し、広告の受け手の心を探り、広告の受け手の心を動かすという広告の本質的な役割と価値の理解を深めていただきます。更に、広告という枠に留まらず、デザイン分野全般に通ずる、人の心を探求するという人間中心のデザインアプローチを思考し、学ぶことを目指します。なお、本授業は、広告デザイン会社を経営し、さまざまな会社の広告やブランディングのプロジェクトに携わってきた実務経験を有する教員による講義形式の実践的科目です。",
        "outcomesMeasuredBy": "◉多様な広告事例や広告の知識と手法の学びから、広告の価値と可能性を知覚する。◉商品・サービス・ブランドとターゲットの架け橋という広告の役割の学びを通して、ターゲットとのコミュニケーション能力を養う。◉商品・サービス・ブランドの価値やターゲットのインサイトを分析・評価し（分析・評価能力）、広告コミュニケーションによって問題解決力を養う。◉インサイトの学びを通して、広告のみならずデザイン分野全般に関しての実学に基づく専門能力を養う。◉多様な広告媒体の特性や人の心を動かす広告計画の仕組みの理解を通して、論理的な思考力を養う。◉授業毎の小レポートに取り組むことで、授業内容の理解を深め、短時間で即興的に柔軟にアイデアを発想し、言語化する力を養う。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "◉本授業は、画像と動画を使用した講義形式で行う。◉授業毎に、授業内容を踏まえた小レポートを出題する。小レポートは、次回授業時に優れた回答を紹介するアクティブラーニング形式を取り入れる。◉本授業のまとめとして最終レポートを出題する。",
        "notices": "◉Moodleを授業運営プラットフォームとして使用するので、Moodleの確認を適宜行うこと。◉授業の回ごとにテーマが変わるため、毎回の出席を基本とする。",
        "preparatoryStudy": "◉予習：広告は、私たちの日常に溢れています。これまで何気なく接してきたそれらの広告に、改めて意識を向け、それらの存在価値と目的を思い巡らせてください。◉復習：最終レポートでは、全15回の授業の理解が必須となります。授業では、ノートを積極的にとり、適宜見直すようにしてください。",
        "gradingGuidelines": "◉授業毎の小レポートの評価。【50%】◉最終レポートの評価。【50%】◉単位認定要件は60点以上。",
        "textbook": "必要に応じて資料を配布します。",
        "referenceMaterials": "",
        "courseSchedule": "第1回：広告とは？〜広告の定義と役割〜第2回：媒体から見る広告①／テレビ第3回：媒体から見る広告②／ラジオ第4回：媒体から見る広告③／新聞第5回：媒体から見る広告④／雑誌第6回：媒体から見る広告⑤／プロモーションメディア第7回：媒体から見る広告⑥／デジタルサイネージ第8回：媒体から見る広告⑦／インターネットメディア第9回：広告計画〜人の心を動かす広告と消費者インサイト〜第10回：クロスメディア戦略・O2O第11回：ブランドコミュニケーション第12回：広告対談第13回：広告表現〜広告のコピーについて〜第14回：広告表現〜広告のデザイン〜第15回：広告効果／最終レポートの説明",
        "courseDataUpdatedAt": "2024/03/10"
    },
    "updateAt": "2024/12/09"
}