{
    "lectureCode": "S2230",
    "courseName": "視覚・情報デザイン演習",
    "lecturer": [
        "早瀬交宣(デザイン学部デザイン学科)",
        "田邉雄一(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月3",
        "月4",
        "月5",
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 6,
    "classroom": [
        "３１３０１デザイン演習室１",
        "３１３１５デザイン演習室４"
    ],
    "courceDetails": {
        "courseOverview": "この授業は、視覚を通じてさまざまな情報を的確に伝える表現力を育むことを目的とする。1年次に学んだ「色」「形」「構成」「質感」といった視覚表現の基本要素をさらに深く理解し、それらを総合的に扱うためのプラクティスを行う。並行して、リサーチや分析をもとにデザインの意図を明確に設定し、PCと手作業を併用した実制作を重ねる。これらを通じて、デザインワークに必要な総合力を養う。視覚デザイン・情報デザイン両コースに共通する、ものごとの捉え方や考え方を身につけることで、2年次後期の「専門演習Ⅰ」へとつながる位置づけの授業となっている。",
        "outcomesMeasuredBy": "(1)視覚表現の基礎要素である、質感、色、形、構成の４要素を理解し、応用することができる。(2)リサーチと分析を行い、さまざまな要素や考え方がデザインの分野でどのように使われるのか考察する。（分析・評価能力を養う）(3)自分の制作物を内省し、改善案を見出せるようになる。（問題解決力）(4)講評会での発表、グループ講評において他者の制作物を的確に分析し伝え合うなど、コミュニケーション能力を養う。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "リサーチや分析をもとに、手作業やPCを活用した制作を行う。必要に応じて検討会を実施し、作品に対する具体的なフィードバックを行う。",
        "notices": "・授業開始１週間前にMoodleを公開する。初回授業の教室や準備物を記載するため、授業開始の数日前には必ず確認すること。・課題は授業時間内に制作するが、個々の表現内容やスキルによって時間外での制作が必要になる場合がある。・手作業による制作も行うため、1年次に使用した画材や道具を準備しておくこと。・表現に合った素材等は各自で用意・購入すること。・資料配布や制作に使用するため、ノートPCは必携とする。・学外でのフィールドワーク時は、移動に公共交通機関を利用する。",
        "preparatoryStudy": "・授業で制作が進められるように、課題内容に応じて事前に情報収集をすること。・実社会に存在する優れたデザイン作品にたくさん触れること。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①発想段階【20%】（調査内容、コンセプト、G：ディスカッションの参加）②制作段階【20%】（試作等の表現に至る過程、計画的な作業進行、G：作業の参加）③結果段階【40%】（提出期限、作業密度、相手への意識）④プレゼンテーション段階【20%】（わかりやすさ、伝え方、G：発表の参加）※Gはグループワーク",
        "textbook": "必要に応じて演習内で資料を配布する。",
        "referenceMaterials": "演習内で参考作品や参考資料を紹介する。",
        "courseSchedule": "第1回：ガイダンス/導入課題（全教員）第2回：第1課題リサーチ（全教員）第3回：第1課題リサーチ（全教員）第4回：第1課題リサーチ分析/まとめ・企画（全教員）第5回：第1課題：制作（全教員）第6回：第1課題：制作（全教員）第7回：第1課題：制作（全教員）第8回：第1課題：制作（全教員）第9回：発表会・展覧会（全教員）第10回：第1課題：ブラッシュアップ（全教員）第11回：第2課題ガイダンス／リサーチ（全教員）第12回：第2課題リサーチ（全教員）第13回：第2課題リサーチ分析/まとめ・企画（全教員）第14回：第2課題：制作（全教員）第15回：第2課題：制作（全教員）第16回：第2課題：制作（全教員）第17回：第2課題：制作（全教員）第18回：発表会・展覧会（全教員）第19回：第2課題：ブラッシュアップ（全教員）第20回：第3課題ガイダンス／リサーチ（全教員）第21回：第3課題リサーチ（全教員）第22回：第3課題リサーチ分析/まとめ・企画（全教員）第23回：第3課題：制作（全教員）第24回：第3課題：制作（全教員）第25回：第3課題：中間発表（全教員）第26回：第3課題：制作（全教員）第27回：第3課題：制作（全教員）第28回：発表会1（全教員）第29回：発表会2/ブラッシュアップ（全教員）第30回：展覧会（全教員）/全作品のまとめ＊授業の進行は状況をみて調整する可能性がある。",
        "courseDataUpdatedAt": "2025/01/19"
    },
    "updateAt": "2025/03/21"
}