{
    "lectureCode": "S2251",
    "courseName": "視覚伝達デザインコース専門演習I［3Q］",
    "lecturer": [
        "末房志野(デザイン学部デザイン学科)",
        "舟山貴士(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月3",
        "月4",
        "月5",
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "デザイン学部デザイン学科視覚デザイン専攻",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "３１３０１デザイン演習室１"
    ],
    "courceDetails": {
        "courseOverview": "この授業では、視覚伝達デザインの領域の核である、形の無いイメージをビジュアル化、シンボル化する、その基礎的な手法を理解し、デザインの提案に昇華することに取り組む。視覚的な表現の語彙を増やし、伝わる表現にするための法則を体得し、自ら意図をもって判断して、デザインの提案として完成できるようになる力を身につける。出題する課題としては、VIの設計を含めたロゴデザインと、ポスターなどへの展開に取り組む。課題に取り組む前段階として、リサーチとエクササイズを行う。リサーチは、ロゴデザインの目的を理解し、エクササイズは制作上の技術を体得するために行う。",
        "outcomesMeasuredBy": "一連のデザインプロセスを体験することで、実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力、問題解決力の修得を目指す。1.フィールドワークや先行事例の収集といったリサーチから、分析、考察し、言語でまとめること。2.視覚的な表現における基礎的な法則やテクニックを修得すること。3.多数のラフスケッチを描き、手を動かしながらアイディア、形、コンセプトを作り上げること。4.コンセプトを立てられるようになること。デザインのキーワードを作れるようになること。5.そのデザインを構成する諸要素（文字、色、形、構成など）について、意図を持って自ら選択できるようになること。6.デザインの意図を説明する際に用いる言葉、言葉使いを用いて、表現（プレゼンテーション）できるようになること。7.「作る自分」と「見る自分」の２つの視点を持って制作を進められるようになること。8.大型出力におけるデータの作り方（画像の解像度、文字のアウトライン化、トリムマーク、画像のリンク配置）を修得すること。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "リサーチの一つとして、学外でフィールドワークを行う。社会にある視覚的なコミュニケーションの事例を収集し、分析することで、どのような仕組みや手法があるのか考察する。その成果をもとにして、各自デザインの提案に取り組む。授業では、自身の提案を公表するアウトプットを取り入れ、主体的な学びを促す。また、グループワークと個人制作を組み合わせて授業を進める。毎回の授業では、ノートPCが必要となる。また、制作物を実物大で検証するため、データを出力するプリンターを使う。",
        "notices": "授業開始前の最初の指示はMoodleに記す（授業初日の１週間前に開示するので、授業前に必ず確認すること）。制作はAdobeIllustrator、Photoshopを使用する。特に、llustratorのパスによる描画のスキルは必ず習得しておくこと。学外でフィールドワークを行う場合は、移動に公共交通機関を使い、文化施設利用時は入場料が発生するが、この分野の学修上必須のため事前に準備してほしい。視覚デザイン専攻の学生を２グループに分け、「視覚伝達デザインコース専門演習I」と「視覚情報デザインコース専門演習I」を交互に受講する。",
        "preparatoryStudy": "予習：出題された課題と授業スケジュールに沿って、授業時間外に自主的に調査や試作制作、プレゼンテーションの準備を行うこと。復習：授業中の制作過程やプレゼンテーション時に気づいたことを適時メモやスケッチをとり、自身の提案を振り返り、改善案を考えること。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①発想〜立案段階【20%】（調査・アイデア・考えの伝達）②制作段階【20%】（試作と検討、集中度）③結果段階【50%】（提出期限、独自な視点で社会的な価値ある提案、完成度）②プレゼンテーション段階【10%】（コンセプトや制作意図が明確か）授業内のプレゼンテーションでは、その都度発表内容に対してフィードバックを行う。",
        "textbook": "授業時間内で、適時資料を配布する。",
        "referenceMaterials": "授業時間内で、適時資料を配布する。",
        "courseSchedule": "第1回：オリエンテーション・リサーチ１先行事例の収集・分析（全教員）第2回：リサーチ2:デザイン先行事例の収集・分析（フィールドワーク）（全教員）第3回：リサーチ3（フィールドワーク）（全教員）第4回：エクササイズ1（全教員）第5回：エクササイズ2・企画のアウトプット（全教員）第6回：課題1（ロゴデザイン）の出題：ロゴタイプのデザイン（全教員）第7回：課題1（ロゴデザイン）の制作（全教員）第8回：課題2（VI計画）の出題（全教員）第9回：課題3（ポスター）の出題（全教員）第10回：制作（全教員）第11回：課題4（ショッパー）の出題（全教員）第12回：制作、大型出力（全教員）第13回：制作、大型出力（全教員）第14回：プレゼンテーション（全教員）第15回：まとめ（全教員）",
        "courseDataUpdatedAt": "2024\/03\/10"
    },
    "updateAt": "2024\/09\/13"
}