{
    "lectureCode": "S2262",
    "courseName": "情報デザイン専門演習I[4Q／後期後半]",
    "lecturer": [
        "早瀬交宣(デザイン学部デザイン学科)",
        "中島健太(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "月3",
        "月4",
        "月5",
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "３１３１５デザイン演習室４"
    ],
    "courceDetails": {
        "courseOverview": "この授業では、わたしたちに身近な「食」をテーマに取り上げ、それらがどのような社会・経済・思想・文化的なモノやコトとどう関係しているのか、またそこにはどのような問題があるのか、あるいは起こり得るのか、などについて情報を編集し、考察し、組み立て、様々な手法で視覚化する。第1課題、第2課題ともにインフォグラフィックスをアウトプットとするが、平面のみならず「動くグラフィックデザイン」としての動画表現も学びながら「何をどのように伝えるべきか」、発想とリサーチを重ねて成果物を制作する。以上を通して、情報デザインの基礎を理解し、その表現力を身につける。",
        "outcomesMeasuredBy": "(1)ビジュアル化すべきテーマを発見しリサーチができる。(2)オリジナリティのある表現としてアウトプットする。(3)グループワークでは「チーム力」「実現力」「コミュニケーション能力」を、個人制作では各々が「発想力」「提案力」を身につける。(4)総合的に実学に基づく専門能力、論理的な思考力、分析・評価能力、問題解決力の修得を目指す。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "第1課題は3〜5人を1チームとし、各々の役割分担の下で実制作にあたるグループワーク形式、第2課題は個人制作とする。それぞれの課題において、企画・取材・制作・発表を中心としたアクティブラーニングの授業を行い、グループまたは個人の提案を公表するプレゼンテーションを実施し、主体的な学びを促す。課題制作にはノートPCは必携であり、また制作内容に合わせて屋外、映像スタジオなどでビデオカメラ、サウンドレコーダーなどの機材を使用することもある。授業時間外および学外での制作作業も必要となることがある。",
        "notices": "視覚・情報デザイン系の学生を2グループに分け、「情報デザイン専門演習I」と「視覚デザイン専門演習I」を交互に受講する。",
        "preparatoryStudy": "予習について：授業の終わりに次回の授業内容について触れ、授業までに事前に調べておく事柄や制作をしておくことを予習として課す。復習について：授業内容に即した形で「演習課題」の授業外での制作を課す。",
        "gradingGuidelines": "プレゼンテーションを必須とする。課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①発想～立案段階【20%】（調査・アイデア、考えの伝達）②制作段階【20%】（試作と検討、集中度〈G：役割を果たし積極的な参加〉）③結果段階【50%】（提出期限、独自な視点で社会的な価値ある提案、完成度）④プレゼンテーション段階【10%】（コンセプトや制作意図が明確か）",
        "textbook": "授業内容に合わせて資料を配布する。",
        "referenceMaterials": "国際的なデザインの教養を高めるため、グローバルなデザイン作品、資料を紹介するほか、必要に応じて追加資料を配布する。",
        "courseSchedule": "第1回：授業ガイダンス／課題説明（全教員）第2回：インフォグラフィックス1：企画案作成（全教員）第3回：インフォグラフィックス2：企画案発表/役割分担、制作（全教員）第4回：インフォグラフィックス3：制作・中間発表（全教員）第5回：インフォグラフィックス4：制作（全教員）第6回：インフォグラフィックス5：制作（全教員）第7回：インフォグラフィックス6：制作（全教員）第8回：インフォグラフィックス7：中間発表（全教員）第9回：インフォモーション1：課題説明、インフォモーション基礎（全教員）第10回：インフォモーション2：制作・絵コンテ作成（全教員）第11回：インフォモーション3：制作・編集（全教員）第12回：インフォモーション4：制作・編集・中間発表（全教員）第13回：インフォモーション5：制作・編集（全教員）第14回：インフォモーション6：制作・編集（全教員）第15回：発表会（全教員）",
        "courseDataUpdatedAt": "2025/03/16"
    },
    "updateAt": "2025/03/21"
}