{
    "lectureCode": "S2271",
    "courseName": "空間演出デザインコース専門演習I［3Q］",
    "lecturer": [
        "宮元三恵(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月3",
        "月4",
        "月5",
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "デザイン学部デザイン学科工業デザイン専攻",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "３１３１１デザイン演習室２"
    ],
    "courceDetails": {
        "courseOverview": "「空間演出デザインコース専門演習I」では、「人・もの・場」という空間デザインに関わる要素を考察しながら、人が集う空間の提案をおこないます。前半は各自の身近な生活空間のリサーチをもとにした課題を通じ、空間デザインに必要な基礎的な要素を学びます。後半は、都市をモチーフとしたより実践的な課題に取り組みます。フィールドワークを通じて都市における様々な関係性の調査・分析を行い、そこで得られた内容に基づいて、様々な人が集う空間の提案を行います。調査、分析、発想、思考、制作、提案といったプロセスを繰り返すことで、空間デザインをアウトプットする流れを体系的に学び、実学に基づく専門能力としての空間デザインへの理解を深める場とします。",
        "outcomesMeasuredBy": "空間デザインに関わる一連のデザインプロセスを経験することで、実践的なデザイン能力（問題解決力、分析・評価能力、論理的な思考力、発想力、コミュニケーション能力、実学に基づく専門能力、表現力、プレゼンテーション能力など）の修得を目標とします。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "個人によるデザインワークとグループによるデザインワークを通じ、調査、分析、発想、思考、制作、提案までの空間デザインに関わる一連のデザインプロセスを体験します。PBL（Project-BasedLearning=課題解決型学修）を取り入れた実践的な演習内容となります。グループワークの取り組み、作品完成時の学生間の相互評価、学生と教員が一体となって実施する検討会などを行い、学生自らの主体的な学び（アクティブラーニング）を促しながら、空間デザインについて多角的に学修します。",
        "notices": "工業デザイン専攻の学生を2グループに分け、後期中に「空間演出デザインコース専門演習I」と「工業ものづくりデザインコース専門演習I」を交互に受講します。演習の制作作業では、動きやすい服装や汚れてもいい服装を準備してください。不注意による怪我などが発生しないように心がけてください。特殊な道具、工具は授業内で用意しますが、基本的な道具は、各自、状態が良いものを必ず用意してください。また、授業資料の閲覧や作品制作のためノートPCを必携してください。",
        "preparatoryStudy": "予習：授業の終わりに次回テーマに触れ、事前に行うべき課題を指示します。復習：授業中のレクチャー内容や演習過程でのスケッチや制作物を記録し、授業の最後に提出するポートフォリオのために各自必ず保存、整理してください。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準に対応した詳細については学生ポータルを参照してください。①発想〜立案段階【20%】（調査、アイデア、考えの伝達）②制作段階【20%】（試作と検討)③結果段階【50%】（提出期限、独自な視点でデザインされているか、完成度）④プレゼンテーション・ポートフォリオ【10%】（コンセプトや制作意図が明確に伝わっているか）",
        "textbook": "指定しません。",
        "referenceMaterials": "授業時に適宜指示します。",
        "courseSchedule": "第1回：オリエンテーション・課題説明第2回：個人ワーク１フィールドワーク第3回：個人ワーク２アイディア第4回：個人ワーク３デザイン制作第5回：個人ワーク４デザイン制作第6回：発表第7回：課題説明・フィールドワーク第8回：グループワーク１ブレインストーミング第9回：グループワーク２アイディアの分析と整理第10回：グループワーク３デザイン制作第11回：グループワーク４デザイン制作第12回：グループワーク５デザイン制作第13回：グループワーク６デザイン制作第14回：発表第15回：まとめポートフォリオ制作",
        "courseDataUpdatedAt": "2024/03/10"
    },
    "updateAt": "2024/08/07"
}