{
    "lectureCode": "S2281",
    "courseName": "工業ものづくりデザインコース専門演習I［3Q］",
    "lecturer": [
        "酒井正(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月3",
        "月4",
        "月5",
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "デザイン学部デザイン学科工業デザイン専攻",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "３１３１３デザイン演習室３"
    ],
    "courceDetails": {
        "courseOverview": "「工業ものづくりデザインコース専門演習I」では、身体スケールとプロダクトデザインとの関係を考察しながら、椅子のデザイン提案を行います。まず普段あたり前の行為として行っている「座る」とは何かを生活空間の中から対象を見つけ、リサーチを行い、情報を共有することで考えてみます。その後、個人ワークでミニチュアモデルの制作を行い、次にグループワークで原寸モデルの椅子のプロトタイプを制作することで、形状と素材と構造の関係性を確認することや、実際にテストを繰り返す作業プロセスを体験し、プロダクトデザインにおける「問題提起」と「解決策の創出・提案」を体験的に学び、実学に基づく専門能力としてのデザイン活動の理解を深める場とします。",
        "outcomesMeasuredBy": "一連のデザインプロセスを経験することで、より実践的なデザイン能力（問題解決力、分析・評価能力、論理的な思考力、発想力、コミュニケーション能力、実学に基づく専門能力、プレゼンテーション能力など）の修得を目標とします。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "個人によるデザインワークでは、「座る」をテーマにしたリサーチを行います。その次に想定する決められた大きさの素材から創作する椅子のデザインをミニチュアモデルで制作します。さらにグループワークで実寸大の椅子の発案、テスト、制作まで一連のデザインプロセスを体験します。PBL（Project-BasedLearning=課題解決型学修）を取り入れることで、実践的な演習内容とします。各学生が登壇してプレゼンテーションを行い、学生自らの主体的な学び（アクティブラーニング）を促します。",
        "notices": "工業デザイン専攻の学生を2グループに分け、「空間演出デザインコース専門演習I」と「工業ものづくりデザインコース専門演習I」を交互に受講します。演習の制作作業では、動きやすい服装や汚れてもいい服装を準備してください。不注意による怪我などが発生しないように心がけてください。特殊な道具、工具はこちらで用意しますが、基本的な道具に関しては、各自が状態が良いもの使いやすいものを必ず用意してください。",
        "preparatoryStudy": "予習：授業の終わりに次回テーマに触れ、事前に行うべき課題を指示する。復習：授業中のレクチャー内容や演習過程でのスケッチや制作物を記録し、提出物として課題となっているポートフォリオのために保存、整理をしておくようにしてください。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①発想〜立案段階【20%】（調査、アイデア、考えの伝達）②制作段階【20%】（試作と検討)③結果段階【50%】（提出期限、独自な視点でデザインされているか、完成度）④プレゼンテーション・ポートフォリオ【10%】（コンセプトや制作意図が明確に伝わっているか）",
        "textbook": "指定しません。",
        "referenceMaterials": "一脚の椅子・その背景建築資料研究社流れがわかる！デンマーク家具のデザイン史誠文堂新光社デザイナーズ・チェア・コレクションズ鹿島出版会",
        "courseSchedule": "第1回：課題説明プロダクトと人・スケール「座る」ことのリサーチ①（身近にある椅子を計測・調査する）第2回：「座る」ことのリサーチ②発表第3回：個人制作ミニチュアモデル計画①−１第4回：個人制作ミニチュアモデル計画①−２第5回：個人制作ミニチュアモデル計画②−１第6回：個人制作ミニチュアモデル計画②−２第7回：個人制作ミニチュアモデル計画②−３発表第8回：グループワークコンセプト立案発表第9回：グループワーク椅子のデザイン・プロトタイプ制作①−１第10回：グループワーク椅子のデザイン・プロトタイプ制作①−2第11回：グループワーク椅子のデザイン・プロトタイプ制作①−3第12回：グループワーク椅子のデザイン・プロトタイプ制作①−4第13回：グループワーク椅子のデザイン・プロトタイプ制作①−5発表第14回：発表プレゼンテーション第15回：まとめポートフォリオ制作",
        "courseDataUpdatedAt": "2024\/03\/10"
    },
    "updateAt": "2024\/08\/07"
}