{
    "lectureCode": "S3010",
    "courseName": "知的財産論",
    "lecturer": [
        "暮沢剛巳(デザイン学部デザイン学科)",
        "藤沼光太(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火5"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "「知的財産論」と聞くと、なんだか小難しくて自分と縁のない世界の話のように感じられるかもしれないが、決してそんなことはない。知的財産権とは、一言でいうと、人の“知的”な活動によってつくられた成果に認められる権利のことをいい、日々デザインについて学修している学生諸君とも切っても切れない関係にある。苦労して作った自分の作品を盗用から守るにはどうすればいいか、逆に不用意に人の作品を使ってしまい、盗用とみなされて痛い目に合わないためにはどうすればいいか、そのための基本的なルールを学ぶのがこの授業の目的である。この授業では、著作権法、意匠法、商標法など、デザインに関わる法律の基本的な知識や考え方を、実際に問題となった事例やそれについての判例を通して解説する。知的財産権に加え、あらゆるデザイン関係者・クリエイターにとって必須のツールとなった「契約」についても、基本を理解し、実際に使えるよう紹介する。",
        "outcomesMeasuredBy": "知的財産についての基礎的な知識は、デザイナーにとって必須の国際的な教養であり、また実学に基づく専門能力である。この授業では、その修得を通じて論理的な思考力、分析・評価能力と問題解決力の向上を目指していく。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力分析・評価能力問題解決力",
        "teachingMethod": "・授業は講義形式で行う。適宜必要な資料を用意する。・前半を暮沢、後半を藤沼が担当するほか、途中に１回特別講義を開講する。・対面形式を基本とするが、状況次第では遠隔形式となる場合もある。・一方通行の講義にならないように、随時質問を受け付ける。Moodleも積極的に活用する予定である。",
        "notices": "・毎回出欠確認を行う。・レポートでは資料に記載していない内容についても問うことがあるので、ノートを作成すること。・最近は、知的財産権についてのニュースが新聞やテレビで報道されることが多い。タイムリーなニュースがあった場合には授業でも取り上げることがあるので、各自関心をもってニュースに接すること。・この科目を履修するにあたり、事前もしくは同時に他の科目を履修する必要はない。",
        "preparatoryStudy": "・知的財産権についての関心を深めておくことが、この授業を受講するにあたって最良の予習となる。そのために、知的財産権についてのニュースに接することや参考資料を読んでおくことを推奨する。",
        "gradingGuidelines": "成績評価は①授業への取り組みと②学期末レポートの2つの要素をもとに行う。①が6割、②が4割の予定。②以外にも各回の授業で小課題を課すことがあるが、その評価も①に含まれる。",
        "textbook": "なし。必要な資料は適宜Moodleに掲載するので、各自ダウンロードすること。",
        "referenceMaterials": "福井健策『改訂版著作権とは何か～文化と創造のゆくえ』集英社新書大串肇他6名『著作権トラブル解決のバイブル!クリエイターのための権利の本』ボーンデジタルその他適宜授業中に指示する。",
        "courseSchedule": "第1回：ガイダンス授業の進め方、知的財産とは何か(暮沢)第2回：著作権１著作権とは？創作的表現とは？（暮沢）第3回：著作権２著作物の適正な利用について(暮沢)第4回：著作権３著作権侵害についてセーフとアウトの線引き（暮沢）第5回：著作権４変わりゆく著作権画像生成AIと著作権(暮沢)第6回：契約１契約について考える(暮沢)第7回：契約２ライセンス契約を結んでみよう（暮沢）第8回：特別講義福井健策弁護士第9回：意匠法１：意匠とは？特許情報プラットフォームでの意匠の検索方法等(藤沼)第10回：意匠法２：意匠権の権利範囲はどのようにして確認するのか？意匠の公報の見方等(藤沼)第11回：不正競争防止法１：不正競争とは？デザインにかかわる不正競争行為の説明等(藤沼)第12回：不正競争防止法２：具体的事例に基づくワークショップ(藤沼)第13回：商標：商標とは？ブランディングをする際に気を付けるべきこと等(藤沼)第14回：意匠法・不正競争防止法・商標法：具体的事例に基づくワークショップ(藤沼）第15回：まとめ：レポート課題について（暮沢）",
        "courseDataUpdatedAt": "2024\/03\/10"
    },
    "updateAt": "2024\/09\/13"
}