{
    "lectureCode": "S3030",
    "courseName": "マネジメント",
    "lecturer": [
        "未定(所属なし)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "マネジメントは管理とも経営とも訳す事ができますが、一言で（やわらかく）説明すれば、「なにかを上手くやるように仕向けること」、更に言い換えれば「問題に対応するための行動」です。問題は常に私達の眼の前に現れるので、マネジメントを学ぶことは、企業以外・マネージャー以外にも役立つヒントを学ぶことにつながるのです。本講義では、経営者の行動・マネージャーの視点・問題解決者の思考法に幅広く触れるために、多くのトピックに触れますが、全ての理論や用語について正確に記憶する必要はありません。知識の量より、見る力・感じる力・考える力のほうが重要なのです。経営者を目指して学んできた学生についても、自分の知識にこだわらず、様々な説を受け入れ、味わい、そのうえで、取捨選択をしたり、興味を持ったトピックの研究に取り組むことを期待します。",
        "outcomesMeasuredBy": "様々な思考法に触れることにより「論理的な思考力」を身につけるとともに、事例も参考にすることで生きた「問題解決力」を高める。また多くのトピックに触れることで、物事を見るときの切り口を増やすことで、「分析・評価能力」を向上させる。また、人（教育やモチベーション）、メッセージ（種類・交流）などについて検討して「コミュニケーション能力」を高める。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "経営学と思考法・顧客の立場・人を考える・現代的な話題の4区分のなかで、様々なトピックを取り上げて検討します。ノートPCが必要な際には、前日までにお知らせします。",
        "notices": "①本講義は、みなさんにとって専門外の内容を扱います。わからないことがあって当然なので、あいまいな点は積極的に質問してください。一人の質問がクラス全体の学びを深めます。②講義中は事前配布の講義資料ではなく、教室のスクリーンに投影するスライドを見るようにしてください。予習復習のために、講義資料を前日までにMoodleで公開します。このファイルは投影されるスライドと構成が異なっていることがあります。そのため講義中に見るとかえってわかりにくくなる場合があります。",
        "preparatoryStudy": "前日までにMoodleで公開される講義資料に目を通しておいてください(20分程度)。その他の予習の指示を出された場合も従ってください。",
        "gradingGuidelines": "15回の講義中、4回課題を出します。それぞれの課題について、期限や記入項目などの形式評価6割、内容の加算評価4割の評価を行い、moodleなどを通じてフィードバックを行います。さらに、講義期間中の質問の様子や受講態度などで、評価全体の1割程度の加減点を行います。",
        "textbook": "amazonの電子書籍を予定しています。第1回の講義でお知らせします。",
        "referenceMaterials": "",
        "courseSchedule": "第1回：オリエンテーション第2回：経営学とは第3回：経営学の範囲・思考法第4回：経営の観点からの風景第5回：デザイン思考第6回：顧客視点のマーケティング第7回：利害関係者を考える第8回：4大資源とデザイン第9回：人第10回：メッセージ・コミュニケーション第11回：コンプライアンス第12回：SDGsとデザイン第13回：デジタルトランスフォーメーション第14回：イノベーションとカイゼン第15回：問いをデザインする",
        "courseDataUpdatedAt": "2025/01/31"
    },
    "updateAt": "2025/03/21"
}