{
    "lectureCode": "S3040",
    "courseName": "経営・経済論",
    "lecturer": [
        "辻井康一(兼任講師)",
        "赤津慎二(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３０２１２教室"
    ],
    "courceDetails": {
        "courseOverview": "この授業では、現代の生活に欠かせないスマートフォンやWEBサービスを題材に、どのような事業目的や価値提供を生み出すために作られたかを検証することから経済と経営の基礎を学びます。ユーザーを中心に据えた革新的なWEBサービスの事例を通して、新しい価値創造の方法を探り、さらにビジネスデザインにおける共創や人間行動の理解がいかに重要かを学び、これらのスキルをビジネスに応用する方法を探ります。後半のセクションでは、受講者がチームを組み、自らのビジネスデザインを企画し、ビジネスプランを作成して発表します。この実践的な活動を通じて、ビジネス環境で直接役立つ知識を深め、近い将来に実際の社会人としてのキャリアにおいても活用できる知識と能力を養います。",
        "outcomesMeasuredBy": "人にフォーカスを当てた経済と経営の基礎理論の修得および、おもにWEBサービスの価値提供を前提としたビジネスアイデアの創出方法の体得をめざす。【実学に基づく専門能力】また、チームを組んでのビジネスアイデア検討とその発表を実施することによるビジネスデザイン実践への活用を目標とします。【コミュニケーション能力・問題解決力】",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力問題解決力",
        "teachingMethod": "授業前半は、サービスビジネスを提供する企業事例を紹介・議論を通じて経済・経営理論を学修し、学んだ理論を活用したビジネスプランとユーザーに提供するWEBサービスの価値提案の基礎づくりを行います。授業後半では、チームをつくり、各チームでのビジネスプランを検討・議論を行い、前半に学んだ理論に関する理解を深めつつ、ビジネスプランのプレゼンテーション発表会を実施します。本授業はビジネス立ち上げに従事した実務経験を持つ2名の講師が担当し、それぞれの知識や経験に基づいた授業を行います。",
        "notices": "講義外でのチームまたは個人による活動(ビジネスプレゼン発表準備）が必要となる場合がある。",
        "preparatoryStudy": "あなたが良く利用するWEBサービス（オンラインゲームや、物販サイトなど何でも構わない）のうち１つ選び、それがなぜ人気があるのか、事業者はどうやって利益を得ているかについて疑問を持ち、考察しておくこと。",
        "gradingGuidelines": "授業への取り組み（３０％）授業ミニレポート（３０％）チームでのビジネス発表資料作成（２０％）最終レポート（２０％）",
        "textbook": "資料はMoodleにて配布する",
        "referenceMaterials": "「SHIFT：イノベーションの作法」濱口秀司（ダイヤモンド社）2019年「リーン・スタートアップ」、エリック・リース(日経BPマーケティング）2012年「ゼロからつくるビジネスモデル」井上達彦(東洋経済新報社）2019年「世界失敗製品図鑑」荒木博行(日経BPマーケティング)2021年「ビジネス・クリエーション！」、ビル・オーレット（ダイヤモンド社）2014年「デザイン思考が世界を変える」、ティム・ブラウン(ハヤカワ・ノンフィクション文庫)2014年",
        "courseSchedule": "第1回:イントロダクション・ビジネスクリエーション（辻井康一）第2回:デジタルトランスフォーメーション・ビジネスの成功・失敗例（辻井康一）第3回:ビジネスアイデア創出・バリュープロポジションの定義（辻井康一）第4回:ユーザー課題の検証（辻井康一）第5回:ペルソナの設定・ビジネスアイデア検討（辻井康一）第6回:マーケット・リサーチ（赤津慎二）第7回:サービスの検証と仮設計（赤津慎二）第8回:ビジネスモデル設計（赤津慎二）第9回:プロトタイプ作成（赤津慎二）第10回:マーケティング戦略・ビジネスモデル発表準備1（赤津慎二）第11回:財務諸表の活用・ビジネスモデル発表準備2（赤津慎二）第12回:ユーザーヒアリング・ビジネスモデル準備3（赤津慎二）第13回:ビジネスモデル発表1（辻井康一）第14回:ビジネスモデル発表2（辻井康一）第15回:発表フィードバックとまとめ（辻井康一）",
        "courseDataUpdatedAt": "2024\/09\/05"
    },
    "updateAt": "2024\/09\/13"
}