{
    "lectureCode": "S3060",
    "courseName": "専門スキル演習(Webコンテンツデザイン)",
    "lecturer": [
        "宮内晟(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月",
        "月2"
    ],
    "targetDepartment": "デザイン学部デザイン学科視覚デザイン専攻",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１１１４デザインクリエーションルーム１"
    ],
    "courceDetails": {
        "courseOverview": "ウェブデザインは、紙面上のデザインや映像デザインとは異なった表現軸を幾つか持っています。たとえばスクロール・クリック・ホバー・複数ページ・伸縮する画面サイズなどです。これらの特性を理解した上でウェブデザインを行い、実際に制作(コーディング)し、「実学に基づく専門能力」を身に付けます。授業内では、様々なウェブサイトの観察を通して共通点を抽象化することで「分析・評価能力」を身に付けます。抽象化した型を組み合わせて自在にデザインを行うことで「問題解決力」を身に付けます。発表を通して自身の考えを伝え、他者の発表を聞き、意見を交換することで「コミュニケーション能力」を身に付けます。ウェブサイト制作のデザイン段階ではワイヤーフレーム設計とプロトタイピングを行い、コーディング段階ではコードエディターを用いてHTMLとCSSを記述します。",
        "outcomesMeasuredBy": "・ウェブ制作関連のツール\/用語\/概念に慣れ親しむ・ウェブ制作者に求められるデザイナー\/エンジニアとしての視点を得る・自力でウェブサイトの設計から公開まで行えるスキルを身に付ける",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "ノートPC必携。対面授業の形式で、プロトタイピングツール（Figma）や教育用コーディングツール（ScrybeCode）を用いて講師と学生のコンテンツをリアルタイムに共有しながら授業を進める。課題制作や適宜プレゼンテーションを行う。その際、授業時間外での作業も必要となる。毎回の授業では、知識の定着を図るために応用的な演習問題を解く。",
        "notices": "ウェブデザインに限らず、自分の得意分野・興味のある分野を持っていること。その分野とウェブデザインをどう関連付けられるか考えながら学ぶことで、スキルを深く身に着けることができる。タイピングや英語の不得意があっても問題無いが、得意である方が課題は速く制作することができる。",
        "preparatoryStudy": "・その週または翌週のテーマに沿った課題を行う（110分程度）・演習内容の振り返りを行う（10分程度）",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①制作段階【45%】（理解度、作業の丁寧さ、提出期限）②結果段階【45%】（スキル・知識の理解度、独自性、スキル・知識の応用力、作業量、提出期限、完成度）③プレゼンテーション段階【10%】（作品意図、的確な説明）",
        "textbook": "指定しない。授業毎に資料配布および参考サイトの周知をする。",
        "referenceMaterials": "『1冊ですべて身につくHTML\u0026CSSとWebデザイン入門講座』ウェブ制作の基礎知識が完結かつ網羅的に書かれている。『ノンデザイナーズ・デザインブック第4版』ウェブに限らず、視覚デザイン領域の基本原則を学べる。『リーダブルコード』エンジニアを目指す方向けのコーディングに関するテクニック集。",
        "courseSchedule": "第01回：ガイダンス第02回：ウェブ制作の基礎第03回：【ウェブ表現】タイポグラフィ第04回：【ウェブ表現】レイアウト第05回：【ウェブ表現】絶対位置第06回：【中間課題】ウェブサイト制作第07回：【中間課題】ウェブサイト制作第08回：【中間課題】プレゼンテーションと講評第09回：ウェブ制作の発展第10回：プロトタイピング第11回：【ウェブ表現】複数ページ第12回：【ウェブ表現】トランジション第13回：【最終課題】ウェブサイト制作第14回：【最終課題】ウェブサイト制作第15回：【最終課題】プレゼンテーションと講評",
        "courseDataUpdatedAt": "2024\/03\/10"
    },
    "updateAt": "2024\/08\/07"
}