{
    "lectureCode": "S3110",
    "courseName": "専門スキル演習(ビジュアルコミュニケーション)",
    "lecturer": [
        "山本哲次(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月",
        "月2"
    ],
    "targetDepartment": "デザイン学部デザイン学科視覚デザイン専攻",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１１１４デザインクリエーションルーム１"
    ],
    "courceDetails": {
        "courseOverview": "私たちの生活の中でデザインはもはや欠くことの出来ない大きな存在となっています。特にビジュアルデザインが果たすべき役割として受け手へのコミュニケーション力が重要と言われます。しかしITやSNSの発達が人間の受信可能な量を遥かに超える膨大な情報を溢れさせています。結果として目的を達せられない情報が受け手へ届くことなく喪失、あるいは浮遊しています。膨大な情報の中から人々は自分が必要とし、かつ感覚的に共感する情報を見分け、手に入れます。グラフィックデザイナーは情報発信者から依頼を受け、この膨大な情報の中で届けたい相手へ確実に届けるべく、受け手が感覚的に共感し、目を留めてくれるよう、プロフェッショナルな表現を使って情報を輝く存在に仕上げねばなりません。グラフィックデザイナーが行う届けたい相手の目に留まるプロフェッショナルな表現とは？本授業はグラフィックデザイナーの仕事を学びつつ、受け手の目に留まるデザイン表現を探求します。",
        "outcomesMeasuredBy": "①分析・評価能力：現在、活躍するグラフィックデザイナーの仕事を観察し、彼らが受け手の目に留まる為に何を考え、どのような表現を行なっているか分析します。②実学に基づく専門能力：多くのデザイナーの仕事を観察する中で得た表現技術と、講義を受ける中で習得した知識を参考にした上で、自らのオリジナリティを生かしながら、受け手の目に留まるデザイン表現制作の可能性を探ります。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "グラフィックデザイナーの仕事をデザイン年鑑などを参考に、じっくり観察します。講義を受講することで、グラフィックデザイナーの思考、及び表現スキルなどを学びます。課題を進める中で、自らのオリジナルな表現を探り、作品制作を体験します。課題制作は主にAdobeIllustrator、Photoshopを使用して制作。試作を制作する際に、プリンターで実物大の出力をして検証します。",
        "notices": "ノートPC必携となります。授業姿勢・授業理解度・作品の提出を重視します。",
        "preparatoryStudy": "[予習]各自興味を持ったデザイン本の閲覧。[復習]自分の作品の分析評価を行うこと。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①制作段階【45%】（授業理解、丁寧な作業、期限内提出、集中度）②結果段階【45%】（課題理解、スキル・知識の理解、独自の発想、スキル・知識の応用、十分な作業量、提出期限、完成度）③プレゼンテーション段階【10%】（作品意図、的確な説明）",
        "textbook": "指定しない",
        "referenceMaterials": "蒲田校大学図書館○GRAPHICDESIGNINJAPAN/727Ni○日本タイポグラフィー年鑑/727Ni",
        "courseSchedule": "第1回：9月16日ガイダンス・課題説明第2回：9月23日第一課題（ポスター）講義01・調査第3回：9月30日第一課題講義02・制作第4回：10月7日第一課題講義03・制作第5回：10月14日第一課題講義04・ブラッシュアップ第6回：10月21日第一課題講評第7回：10月28日第二課題講義05・調査第8回：11月11日第二課題（ビジュアルデザイン作品数点）講義06・制作第9回：11月18日グループディスカッション第10回：11月25日第二課題制作第11回：12月2日第二課題制作第12回：12月9日第二課題ブラッシュアップ第13回：12月16日第二課題講義07・ブラッシュアップ第14回：12月23日第二課題プレゼンテーション第15回：1月6日第二課題講評・総評",
        "courseDataUpdatedAt": "2024/03/12"
    },
    "updateAt": "2024/12/09"
}