{
    "lectureCode": "S3120",
    "courseName": "専門スキル演習(パッケージデザイン)",
    "lecturer": [
        "木村愛(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火",
        "火2"
    ],
    "targetDepartment": "デザイン学部デザイン学科視覚デザイン専攻",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１１１４デザインクリエーションルーム１"
    ],
    "courceDetails": {
        "courseOverview": "パッケージとは商品を梱包、保護する機能以外に、販売を促進する重要なツールとして、なくてはならない存在です。市場においてのパッケージデザインの価値をリサーチし、「手にとりたくなるデザインとは何か」「人にあげたくなるデザインとは何か」をそれぞれ考察し、ブランディングや商品企画への展開を考えていきます。その考察を元に自分がブランディングした新しいパッケージデザインを生み出すことを最終目標とします。自身でコンセプトを立て、パッケージのグラフィックデザインからブランドのロゴ、モックアップの作成まで実践的にまた段階ごとに取り組むことで、実学に基づく専門能力、コミュニケーション能力、分析・評価能力、問題解決力の修得を目指します。",
        "outcomesMeasuredBy": "・フィールドワークを行い、先行事例の収集、分析、考察したことから、提案に結びつけ、企画を立案することができるようになる。・自身の企画を適切にデザインに反映し、価値のある結果としてまとめられる力を修得する。・自身の制作過程で、自分で客観的に評価し、改善する力を養う。・あらゆるデザインや美術に触れ、自分のデザインに反映できる能力を修得する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "・制作は実制作とし、大学の演習室において対面で行う。・情報収集の一環として、また、制作にノートPCを用いる。・段階を踏んでデザイン仕上げていくため、こまめにラフチェックを行う。・主体的な学びを促すために、自身の提案をアウトプットする機会を設ける。・基本的に個人制作であるが、互いの提案や制作に対してフィードバックをおこなう機会を設ける。",
        "notices": "・授業のプラットフォーム（MoodleまたはGoogleClassroom）から課題に取り組んでもらうことがある。・制作はAdobeIllustratorとAdobePhotoshop等を使用する。課題は実物での制作とする。・最終的なモックアップを作成する際の画材や道具等（用紙や両面テープ、カッター、絵具など）は各自必ず準備する。・大学での制作環境を使用できない場合も考えられるので、プリンターを持っていることが望ましい。外部出力サービスの利用も考えられる。また、大学の設備には無い機械や技術を用いる場合は、自身で準備する必要がある。",
        "preparatoryStudy": "予習：出題された課題と授業スケジュールに沿って、授業時間外に自主的に調査や試作制作、プレゼンテーションの準備を行うこと。復習：授業中の制作過程やプレゼンテーション時に気づいたことを適時メモやスケッチをとり、自身の提案を振り返り、改善案を考えること。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①制作段階【45%】(授業理解、丁寧な作業、期限内提出、集中度)②結果段階【45%】(課題理解、スキル・知識の理解、独自の発想、スキル・知識の応用、十分な作業量、提出期限、完成度)③プレゼンテーション段階【10%】(作品意図、的確な説明)授業内のプレゼンテーションでは、その都度発表内容に対してフィードバックを行う",
        "textbook": "必要な資料等は随時配布する",
        "referenceMaterials": "第1回：ガイダンス第2回：課題1：市場調査（百貨店や専門店などへパッケージのリサーチ）第3回：課題1：レポート提出課題2の説明第4回：課題2：ラフスケッチ/ラフチェック第6回：課題2：ラフスケッチ/ラフチェック第7回：課題2：ラフスケッチ/ラフチェック第8回：課題2：プレゼンテーション（ブランドロゴ、パッケージ提出）、講評第9回：課題3：課題3の説明本課題制作（モックアップ）※9回目以降もラフチェックは行う第10回：課題3：本課題制作第11回：課題3：本課題制作第12回：課題3：本課題制作第13回：課題3：本課題制作、作品の撮影第14回：課題3：本課題制作、作品の撮影第15回：課題3提出、プレゼンテーション（全てのモックアップ提出）、講評",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024/03/12"
    },
    "updateAt": "2024/08/07"
}