{
    "lectureCode": "S3150",
    "courseName": "専門スキル演習(空間系プレゼンテーション)",
    "lecturer": [
        "田村吾郎(デザイン学部デザイン学科)",
        "中田衣都香(兼任講師)",
        "伊藤努(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月",
        "月2"
    ],
    "targetDepartment": "デザイン学部デザイン学科工業デザイン専攻",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１１１６デザインクリエーションルーム３"
    ],
    "courceDetails": {
        "courseOverview": "空間デザインのプロセスにおいて、ステークホルダー（利害関係者）との意思疎通はもちろんのこと、プレゼンテーションの場におけるコミュニケーション精度は重要な事柄といえます。このコミュニケーション精度の向上においては3DCGの活用が主流かつ合理的な方法であるといえます。また、空間設計や空間構成における具体的な検討フェーズにおいても極めて有用であるため、本授業では前半に３DCGソフトの基本的なスキルの習得を行い、後半では発展的なイメージ（画像・動画）制作の手法を学び、最終課題では各自デザインの提案を行います。これら一連の課題に取り組むことで、「プレゼンテーション」に関する理解を深め、スキルの向上を目指します。",
        "outcomesMeasuredBy": "プレゼンテーションの前提となるステークホルダーの整理といった「分析・評価能力」、コンセプト、アイデア、デザインの訴求ポイントの明確化といった「問題解決力」や「コミュニケーション能力」を鍛え、それらを体系的に学ぶことで、「実学に基づく専門能力」の修得とともに、プレゼンテーションそのものの理解を深めることを目標とします。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "前半では、講義形式によるプレゼンテーションの実例の紹介を通じて理解を深め、同時に3DCGソフト「Shade3D」の慣熟、機能の理解、基本的な3Dモデリング、テクスチャリング、ライティング、レンダリングの手法を学びます。後半では、ポリゴンメッシュや動画レンダリングなど、高度で実践的なスキル習得を目指し、最終課題では実在する空間を対象としたデザイン提案を行います。これらPBL（Project-BasedLearning=課題解決型学修）を取り入れることで、実践的な演習内容とします。授業内ではノートPCを使用する予定です。",
        "notices": "関連授業として、「スキル演習(基礎製図)」「専門スキル演習(空間系CAD)」、「空間デザイン論」を履修していることが望ましいです。",
        "preparatoryStudy": "前回授業までに習得した技術を復習しておくことが必要。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位 定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①制作段階【45%】(授業理解、丁寧な作業、期限内提出、集中度)②結果段階【45%】(課題理解、スキル・知識の理解、独自の発想、スキル・知識の応用、十分な作業量、提出期限、完成度)③プレゼンテーション段階【10%】(作品意図、的確な説明)",
        "textbook": "指定しません。",
        "referenceMaterials": "授業時に適宜指示します。",
        "courseSchedule": "第1回：オリエンテーション授業説明、ソフトインストール、講義（中田）第2回：基礎スキル演習1：掃引体・素材・テクスチャリング（中田）第3回：基礎スキル演習2：回転体・ライティング（中田）第4回：基礎スキル演習3：ブール演算・テンプレ（中田）第5回：課題１−１：什器3個をモデリング・レンダリング（中田）第6回：課題１ー２：什器3個をモデリング・レンダリング（伊藤）第7回：発表（中田）第8回：応用スキル１：ポリゴン・ライティング、高度なレンダリング（伊藤）第9回：応用スキル２：カメラ・動画レンダリング（伊藤）第10回：課題２−１：「実在する空間を対象にデザインの提案」構想、デザイン（中田）第11回：課題２−２：「実在する空間を対象にデザインの提案」CG制作（伊藤）第12回：課題２−３：「実在する空間を対象にデザインの提案」CG制作（伊藤）第13回：課題２−４：「実在する空間を対象にデザインの提案」プレゼン資料制作（伊藤）第14回：発表（中田、伊藤）第15回：ブラッシュアップ作業、最終成果物提出（中田）",
        "courseDataUpdatedAt": "2024\/03\/12"
    },
    "updateAt": "2024\/09\/13"
}