{
    "lectureCode": "S3160",
    "courseName": "専門スキル演習(工業系プレゼンテーション)",
    "lecturer": [
        "相野谷威雄(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月",
        "月2"
    ],
    "targetDepartment": "デザイン学部デザイン学科工業デザイン専攻",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１５１１卒業研究室１"
    ],
    "courceDetails": {
        "courseOverview": "工業デザインにおけるインターンシップや企業実習を考慮した授業として展開する。一般的にデザイナーの採用に関わるインターンシップや企業実習では、デザイナーとしての総合力を課題としてまとめ、プレゼンテーションする能力が要求されます。本演習では、そのような能力修得のための実学的な課題と制作を行います。スケッチやドローイングなどの技術習得、デジタルによるレンダリングやCAD制作、プレゼンテーションとしてまとめるためのグラフィックデザインやコミュニケーションデザインなど包括的な能力修得を目指します。",
        "outcomesMeasuredBy": "自らの制作物プレゼンテーションを自信をもって発表できることを目標とします。また「実学に基づく専門能力」「コミュニケーション能力」「論理的な思考力」「分析・評価能力」の修得を目指します。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "授業はハイブリッド形式で行います。moodleを授業プラットフォームとして使用し、classroomも活用して行います。授業内容に応じサンプルなどの提示を行うため、授業毎に最適と思われる方法で授業を実施します。そのためmoodleの確認を必ず行うこと。",
        "notices": "工業デザインに興味と関心を持つことが履修条件である。また演習課題やフィードバックについては意識的に取り組むことを要求する。AdobeIllustratorやPhotoshopなどを用いて授業を行うためノートPCの持参が必要。",
        "preparatoryStudy": "予習：事前に自分が過去作品の整理をしておくこと。スケッチ課題等を指示する。復習：授業内で指示した制作を進めること。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①制作段階【45%】(授業理解、丁寧な作業、期限内提出、集中度)②結果段階【45%】(課題理解、スキル・知識の理解、独自の発想、スキル・知識の応用、十分な作業量、提出期限、完成度)③プレゼンテーション段階【10%】(作品意図、的確な説明)",
        "textbook": "授業時に適宜指示する。",
        "referenceMaterials": "授業時に適宜指示する。",
        "courseSchedule": "第1回：ガイダンス「工業系プレゼンテーションの目的と目標について」第2回：コミュニケーションデザインを考える：目標設定第3回：そのためのツール制作コンセプト：PDCA・先行事例第4回：ツール制作１：コンセプトとスケッチの見せ方第5回：ツール制作２：スケッチのまとめかた第6回：ツール制作３：デジタルスケッチ１第7回：ツール制作４：デジタルスケッチ２第8回：ツール制作５：デジタルスケッチ３第9回：プレゼンテーションボードの作り方１：画像加工等第10回：プレゼンテーションボードの作り方２：編集デザイン第11回：ファイリング：プレゼンテーションとフィードバック第12回：コミュニケーションデザイン１：メール、ES、自己紹介第13回：コミュニケーションデザイン２：コンセプト・ビジョンの見せ方第14回：コミュニケーションデザイン３：話し方、まとめ方、伝え方第15回：最終プレゼンテーション",
        "courseDataUpdatedAt": "2024\/03\/12"
    },
    "updateAt": "2024\/09\/13"
}