{
    "lectureCode": "S3170",
    "courseName": "アニメーション論",
    "lecturer": [
        "中島健太(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１０１４教室"
    ],
    "courceDetails": {
        "courseOverview": "本科目は商業アニメーションやCM、舞台等の映像コンテンツ制作に携わった実務経験を活かし、アニメーションが社会で果たす役割や多様な表現手法について講じる実践的科目である。アニメーションが社会の中で担う役割は時代の変遷とともに多様化している。現在では、娯楽・教育・プロパガンダ・広告・舞台空間演出・インフォモーションなど、様々な目的でアニメーションが制作され、社会の中で独自の役割を担っている。本講義では、アニメーションの歴史を概観するとともに、優れたアニメーションが持つ固有の表現手法が鑑賞者の心を変化させる仕組みを分析・評価する。履修者は、実学に基づく専門能力を培うため、アニメーション特有の技法や制作過程を理解し、卒業研究のテーマ選びや制作にて実践的に応用できる学修を心がけて欲しい。",
        "outcomesMeasuredBy": "1.アニメーションの古典から現在までの変遷を俯瞰的に捉えつつ、社会で担う役割を理解し、課題制作を通じて（実学に基づく専門能力）を身につける。2.作品の主題とメッセージを読み解き、（分析・評価能力）を身につける。また、鑑賞者の感情を変化させるストーリー構成や表現手法を理解する。３.デザイン領域において応用可能なエッセンスを（論理的な思考力）により導き出す。講義・課題を通じて以下の３つの設問に対して自分なりの解答を出すこと。1.アニメーションとは何か？（拡張するアニメーションの定義）2.アニメーションの魅力とは何か？（根源的なアニメーションの特質）3.アニメーションと社会の新しい接点とは何か？（デザインとしてのアニメーションの可能性）",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "本講義はノートPC必携授業である。各授業のテーマに即した参考事例を画像や映像で紹介し、講義と演習課題を織り交ぜながら授業を行う。各回授業の最後に講義内容の理解度を確認するための「グラフィックレポート」を出題する。また、第10回、第15回は反転授業を予定しており、事前にmoodleにて指示された課題を完了し受講すること。",
        "notices": "1.予習・復習を十分に行い、反転授業の実習課題、最終グラフィックレポートの提出期限を厳守すること。2.各回で実施する「グラフィックレポート」で受講姿勢を評価するため、受講回は必ず提出すること。3.第2回までにグラフィックレポートの制作に必要となるadobephotoshopをインストールしておくこと。また、持参できるペンタブレットあるいは液晶タブレットを用意することが望ましい。上記を用意できない場合の受講については初回授業のガイダンスにて周知予定。4.授業内で上映する映像および画像の撮影や録音を一切禁止する。",
        "preparatoryStudy": "予習：反転授業用の教材を事前に学修し、課題を期日までに制作する。（反転授業2回分で420分程度）復習：各回授業の最後に講義内容の理解度を確認するための「グラフィックレポート」を出題する。(50分程度)",
        "gradingGuidelines": "成績評価の対象となる課題は以下の3点1.グラフィックレポート※１x15回分【50％】2.実習課題アニメーション技法1/デジタルフリップブック【30％】（反転学修）3.最終グラフィックレポート【20％】（反転学修）以下のa～cへの答えをグラフィックレポートとしてA1サイズ※2にまとめるa.アニメーションとは何か？（拡張するアニメーションの定義）b.アニメーションの魅力とは何か？（根源的なアニメーションの特質）c.アニメーションと社会の新しい接点とは何か？（デザインとしてのアニメーションの可能性）上記の割合で評価し、60点以上を単位認定条件とする。なお、期限内に上記の3課題を全て提出することが単位認定の最低条件となる。※1_グラフィックレポート／簡単なイラスト・図・文章で講義内容をまとめたもの※2_A1サイズ594mm×841mm（pdfデータ提出）",
        "textbook": "必要に応じて授業時にプリント配布。",
        "referenceMaterials": "「アニメーターズ・サバイバルキット増補」リチャード・ウィリアムズ（著）出版社:グラフィック社;増補版(2011/2/10)「TheIllusionofLife」フランク･トーマス(著)出版社:徳間書店(2002/4/23)「アニメーションの事典」著者名：横田正夫（編集）／小出正志（編集）／池田宏（編集）出版社名：朝倉書店(2012/07/05)",
        "courseSchedule": "第1回:教員紹介、授業概要第2回:グラフィックレポート／adobephotoshopとペンタブレットを用いたデジタルペイント第3回:アニメーションの語源・定義・ワークフロー第4回:コマ撮りの根源的魅力とマテリアルの意味変換効果第5回:キャラクターデザインとアニメート／課題説明アニメーション技法1（実習課題adobephotoshopで作るデジタルフリップブック）第6回:絵コンテ・演出が引きだす鑑賞者の感情第7回:アニメーション美術の担う役割第8回:アニメーション史概観／世界の映像玩具～映画発展と「動きのリアリズム」第9回:古典技法とデジタルアニメーション第10回:反転授業）課題発表1／アニメーション技法1miroによる評価と分析第11回:アニメーションの現在（特別講師丹治匠）第12回:インフォグラフィックとインフォモーション／課題説明最終グラフィックレポート第13回:世界の名作から学ぶアニメーションの表現手法1第14回:世界の名作から学ぶアニメーションの表現手法2第15回:（反転授業）課題発表2／最終グラフィックレポートmiroによる評価と分析",
        "courseDataUpdatedAt": "2024/03/13"
    },
    "updateAt": "2024/08/07"
}