{
    "lectureCode": "S3180",
    "courseName": "サウンドデザイン論",
    "lecturer": [
        "松村誠一郎(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "火4"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "本授業においては、サウンドデザイン、すなわち「音のデザイン」について講義する。サウンドデザインは現在の私達の生活に浸透している様々なデジタルメディア（音楽、映画、TV、ゲーム、スマートフォン、インスタレーション等）で活用されている。目に見えないメディアであるサウンドは、コンテンツや作品全体や「空気感」など心理面に一定の作用を及ぼす役割がある。本講義ではデジタルテクノロジーを用いた音響や音楽、現代音楽、映画やゲームの効果音、電子音楽、インスタレーション等のサウンドデザインの事例を俯瞰しながら、デジタルメディア分野においてサウンドの果たす機能について学ぶ。講義に加えて、効果音制作を音楽制作の実践演習を行なう。その体験を通してサウンドデザインの具体的なプロセス、使用ツール、テクノロジーの基礎知識についても理解を深めて、「実学に基づく専門能力」「論理的な思考力」「問題解決力」の獲得を目指す。本講義はゲーム制作企業におけるサウンドデザイン業務の実務経験を有した教員が行う実践的科目である。",
        "outcomesMeasuredBy": "・普段接している音楽とは異なる分野の音楽や音響表現への理解を深める。・デジタルテクノロジーを用いて実践的に音楽制作の試作を行う。・デジタル/アナログの違いと特性について理解する。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "基本的には配布資料とスライドを使った座学講義形式だが、複数回の実践演習もある。毎授業での小課題の提出に加えて、中間・期末課題を課す。実践演習では各自のノートPCとヘッドフォンを必携すること。実践演習の回については事前の授業内で指示をする。",
        "notices": "・音楽制作経験の有無については問わない・Webアクセス、インターネット検索、タッチタイピング等、基本的なコンピュータの操作に慣れていることを前提とする。・実践演習の回はノートPCとヘッドフォン（イヤホン）を持参し、学内無線LANに接続して作業を行う。事前に学内無線LANへの接続の確認、本学の電子メールアカウント（edu.teu.ac.jp）へのログイン、そのeduアカウントのGoogleドライブの利用ができるようにしておくこと。本授業で使用するソフトウェアはMac/Windowsのどちらも可である。・実践演習では以下のソフトウェアを使用する。-Audacityhttps://www.audacityteam.org/-Renoise（デモ版）https://www.renoise.com/・本授業では持参した各自のノートPCの好不調、OSの操作については関知しない。各自がノートPCのセットアップを事前に実施し、管理しておくこと。OSはあまり古いものはソフトウェアの動作に不具合が出ることがあるので、できるだけ最新版に近づけておく。",
        "preparatoryStudy": "・予習授業資料を見直し、実践して確認する。特に実践授業で使用するAudacity、PureDataはその授業に前までにインストールし、起動、音の出力を確認しておくこと。授業資料の入手先は初回授業でリンク先を提示する。（目途：30分程度）・復習授業内容に関連する小課題を自宅で実践する。不明の用語はインターネット検索、参考文献などを参照して自主的に学修すること。（目途：30分程度）",
        "gradingGuidelines": "受講態度等の授業への取り組みに対する評価【50%】、授業の課題【50%】の割合で総合的に評価する。単位認定要件は60点以上とする。",
        "textbook": "松村誠一郎著,Renoiseではじめるミュージックトラッカー入門,工学社,2020年.松村誠一郎他著,メディアテクノロジーシリーズ8サウンド・デザイン,コロナ社,2024年.",
        "referenceMaterials": "授業内で適宜指示する。",
        "courseSchedule": "第1回：ガイダンス第2回：現代の音楽1第3回：現代の音楽2第4回：効果音制作とツール第5回：効果音1第6回：効果音2第7回：中間発表第8回：電子音楽とツール第9回：電子音楽制作の実践1第10回：電子音楽制作の実践2第11回：電子音楽制作の実践3第12回：電子音楽制作の実践4第13回：電子音楽制作の実践5第14回：期末発表第15回：まとめ",
        "courseDataUpdatedAt": "2025/01/19"
    },
    "updateAt": "2025/03/21"
}