{
    "lectureCode": "S3190",
    "courseName": "デザインストラテジー",
    "lecturer": [
        "田村吾郎(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月4"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "本授業では、デザインの企画から実装までのフローを「社会やコミュニティ、組織が抱える問題またはポテンシャルを発見し、その要素や構造を明確にする」という第1フェーズ、「発見された問題やポテンシャルに対してどのような価値をもったゴール（目標）を設定するか」という第2フェーズ、「目標に向かってどのようなデザインを設計するか」という第3フェーズ、「実装するにあたりどのような利害や障壁が存在するかを明確化し、ステークホルダーの全体益を導き出す」という第4フェーズに分け、これらを模擬することで、デザインにおける戦略性を体系的かつ実践的に学ぶ場とします。",
        "outcomesMeasuredBy": "空間という抽象的な概念、領域において、デザインを行うことの意味や、その手法について学場とします。対象となる空間の規模が大きくなればなるほど、ステークホルダー（利害関係者）の数は増え、価値観や行動基準は複雑になります。これら複雑なデザイン対象をどのように分析し、価値を定義するのかと道筋を明確にイメージし、実現のための戦略策定の思考を身につけることを目標とします。国際的な教養、実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力、問題解決力を養います。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業前半では、講義形式による実例の紹介を行い、回ごとに設定したテーマに対してレポートを課し、考察を深めます。中盤以降の演習を取り入れたフェーズにおいては、「問題やポテンシャルの発見」「価値とゴールの設定」、「デザイン設計」、「ステークホルダーの全体益の実現」というテーマごとに課題をこなし、これらの行程を通じてデザインワークのフローを体系的に学びます。これらPBL（Project-BasedLearning=課題解決型学修）を取り入れることで、実践的な授業内容とします。授業内ではノートPCを使用する予定です。",
        "notices": "関連授業として、「スキル演習(基礎製図))」、「空間デザイン論」を履修していることが望ましいです。",
        "preparatoryStudy": "前回授業までに習得した技術を復習しておくことが必要。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①発想〜立案段階【20%】（調査、アイデア、考えの伝達）②制作段階【20%】（試作と検討、集中度〈G：役割を果たし積極的な参加〉）③結果段階【50%】（提出期限、独自な視点で社会的な価値ある提案、完成度）④プレゼンテーション段階【10%】（コンセプトや制作意図が明確か）",
        "textbook": "指定しません。",
        "referenceMaterials": "授業時に適宜指示します。",
        "courseSchedule": "第1回：オリエンテーション授業説明第2回：講義1：デザインストラテジーとは1第3回：講義2：デザインストラテジーとは2第4回：講義3：実例紹介1第5回：講義4：実例紹介2第6回：演習フェーズ1「問題やポテンシャルの発見」第7回：演習フェーズ1「問題やポテンシャルの発見」まとめ、発表第8回：演習フェーズ2「価値とゴールの設定」第9回：演習フェーズ2「価値とゴールの設定」まとめ、発表第10回：演習フェーズ3「デザイン設計」第11回：演習フェーズ3「デザイン設計」まとめ、発表第12回：演習フェーズ4「ステークホルダーの全体益の実現」第13回：演習フェーズ4「ステークホルダーの全体益の実現」まとめ、発表第14回：プレゼンテーション第15回：ブラッシュアップ作業、最終成果物提出",
        "courseDataUpdatedAt": "2024/03/12"
    },
    "updateAt": "2024/08/07"
}