{
    "lectureCode": "S3190",
    "courseName": "デザインストラテジー",
    "lecturer": [
        "田村吾郎(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月4"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "本授業では、空間に関するプランニング、プロデュース、ディレクション、デザインなどに関わってきた実務経験をもとに、【フェーズ1】問題とポテンシャルの発見、【フェーズ２】ソリューション（目標やゴール）の設定、【フェーズ３】ステークホルダーや利害の整理、【フェーズ4】実行プロセスとデザインアイデアの策定、というデザインにおける戦略性を体系的に学ぶ場を提供します。A：講義とレポート（次回授業の冒頭でレポートをもとにした思考探索を実施）、B：ワークショップ（グループ）という、２種の形式によって構成されるアクティブラーニングをベースとした実践的科目です。",
        "outcomesMeasuredBy": "空間という抽象的な概念、領域において、デザインを行うことの意味や、その手法について学場とします。対象となる空間の規模が大きくなればなるほど、ステークホルダー（利害関係者）の数は増え、価値観や行動基準は複雑になります。これら複雑なデザイン対象をどのように分析し、価値を定義するのかと道筋を明確にイメージし、実現のための戦略策定の思考を身につけることを目標とします。国際的な教養、実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力、問題解決力を養います。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義形式による実例の紹介に加え、回ごとに設定したテーマに対してレポートを課し、考察を深めます。また、レポートは次回授業の冒頭で発表（抜粋）を行うとともに、思考探索を行います。グループでのワークショップでは具体的なデザインアイデアの提案を行い、これらの行程を通じてデザインワークのフローを体系的に学びます。これらPBL（Project-BasedLearning=課題解決型学修）を取り入れることで、実践的な授業内容とします。ノートPC必携ではありませんが、レポートでの情報収集などに使用して構いません。",
        "notices": "関連授業として、「スキル演習(基礎製図)」、「空間デザイン論」を履修していることが望ましいです。",
        "preparatoryStudy": "前回授業までに習得した技術を復習しておくことが必要。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①発想〜立案段階【20%】（調査、アイデア、考えの伝達）②制作段階【20%】（試作と検討、集中度〈G：役割を果たし積極的な参加〉）③結果段階【50%】（提出期限、独自な視点で社会的な価値ある提案、完成度）④プレゼンテーション段階【10%】（コンセプトや制作意図が明確か）",
        "textbook": "指定しません。",
        "referenceMaterials": "授業時に適宜指示します。",
        "courseSchedule": "第1回：オリエンテーション授業説明＋レポート第2回：講義1：デザインストラテジーの現実的な意味＋レポート第3回：講義2：デザインストラテジーの現実的な意味＋レポート第4回：講義3：実例紹介1＋レポート第5回：講義4：実例紹介2＋レポート第6回：講義5：実例紹介3＋レポート第7回：講義6：実例紹介4＋レポート第8回：フィールドワーク＋まとめレポート第9回：フィールドワークまとめ発表第10回：講義7：実例紹介5＋レポート第11回：講義8：実例紹介6＋レポート第12回：演習フェーズ1「デザイン提案／問題発見〜アイデア」第13回：演習フェーズ2「デザイン提案／まとめ」第14回：演習フェーズ3「デザイン提案／プレゼンテーション」第15回：ブラッシュアップ作業、最終成果物提出",
        "courseDataUpdatedAt": "2025/01/17"
    },
    "updateAt": "2025/03/21"
}