{
    "lectureCode": "S3200",
    "courseName": "人間工学",
    "lecturer": [
        "小山祐輔(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "人間工学は、人間中心のデザインやモノづくりのために、必要不可欠な学問であり、国際的な教養である。普段なにげなく見たり使ったりしているモノのデザインについて、人間工学の理論や原理・手法がどのように反映されているのかを理解し、実学に基づく専門能力として、自らのデザイン活動に役立ててもらうことが、この授業の目的である。人間工学の理論や原理は感覚的には理解していることが多いが、体系的な理解を深めることによって、より分析・評価能力、問題解決力を養い、デザインに応用することができる。全体の流れとして、前半の講義では人間工学における基礎的な知識と人間の感覚・知覚の特性及び身体的特性等について解説する。後半の講義では身の回りの様々なデザインを対象として、人間工学におけるデザインの手法や考え方を説明する。",
        "outcomesMeasuredBy": "自らがデザインを行う際に人間工学の要素を取り入れられるよう、知識・手法・考え方等を身につける。人間の様々な特性に合わせて、表現・説明する課題に取り組み、コミュニケーション能力を向上させる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "配布資料とスライドをもとに画像・映像等を駆使した講義形式を基本とする。Moodle上の設問回答やデザイン課題に対して、教員がユニークな回答を紹介するアクティブラーニング形式で授業を実施する。",
        "notices": "授業内容によっては事前に準備する道具を指示することがあるので、忘れ物のないよう注意すること。",
        "preparatoryStudy": "毎授業後、配布した資料等を再度読み直して、取り上げられた内容の具体例・応用例を普段の生活の中から発見しておくこと。",
        "gradingGuidelines": "授業時に課す各課題【40%】、最終課題【40％】、授業への取り組み姿勢の評価【20％】により総合的に評価します。単位認定要件は60点以上。学修内容の定着を目的に、授業内で課題のフィードバックを行います。",
        "textbook": "配布資料",
        "referenceMaterials": "「人間工学の基礎」石光俊介・佐藤秀紀（養賢堂）「新装インテリアの人間工学」小原二郎監（ガイアブックス）「生物から見た世界」ユクスキュル／クリサート著（岩波文庫）「新版アフォーダンス」佐々木正人著（岩波書店）「誰のためのデザイン？増補・改訂版」D.A.ノーマン著（新曜社）「視覚ワールドの知覚」ジェームズ.J.ギブソン著（新曜社）「融けるデザイン」渡邊恵太著（BNN新社）「SpeculativeDesign」AnthonyDunne＆FionaRaby著（BNN新社）「SPECULATIONS」川崎和也監（BNN新社）などその他参考書は授業中に紹介する。",
        "courseSchedule": "第1回：授業概要説明第2回：人間の身体1第3回：人間の身体2第4回：人間の身体3第5回：人間の感覚・知覚1第6回：人間の感覚・知覚2第7回：人間の感覚・知覚3第8回：人間の感覚・知覚4第9回：人間の感覚・知覚5第10回：フィールドワーク第11回：バリアフリーデザイン第12回：ユニバーサルデザイン第13回：インターフェイスデザイン第14回：デザインリサーチ第15回：これからの人間工学とデザイン",
        "courseDataUpdatedAt": "2024/03/12"
    },
    "updateAt": "2024/12/09"
}