{
    "lectureCode": "S3210",
    "courseName": "商品企画論",
    "lecturer": [
        "田崎咲絵(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "商品企画とは何のために必要なのか。消費者のニーズを捉えて課題を解決するだけでなく、企業が創造したい社会のビジョンを具現化するための手段ともいえます。企業でのインハウスデザイナーや、フリーランスとして様々な企業と関わった実務経験をもとに、商品企画の意義や流れ、デザインや経営、プロモーションなど多岐に渡る関係性を学ぶ実践的科目です。消費のための商品企画とは異なり、未来を思索しユーザーと企業のあるべき姿を想定した、デザイナー提案型の商品企画としてのアプローチで講義を進めていきます。授業は「商品企画の知識」「商品企画のための発想・考察」「体験価値設計とビジネスモデル」「ブランディング、販売戦略」という４つのパートで構成され、座学で得た知識をもとに思考を重ね、各自で新しい商品やサービスについての企画書をまとめていきます。",
        "outcomesMeasuredBy": "デザイン学部のディプロマポリシーにある、「チーム力」「集中力」「提案力」「実現力」「取材力」「発想力」の６つの力を、商品企画に応用した内容でそれぞれの力を養います。様々な事例の研究、思考法やフレームワークによる分析手法を学び、商品企画の基礎を身につけます。また、学びにより広い視野や深い考察力を獲得し、未来社会に必要な商品やサービスを企画する実践的な能力の修得を目指します。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力問題解決力",
        "teachingMethod": "授業はスライド資料を使った講義形式で行います。講義内容に合わせた演習課題により、知識だけでなく実践的な理解を深めます。持ち物や使用ツールは以下を参考に準備してください。・moodleを授業プラットフォームとして使用し、課題や授業資料を配信します。・グループワークや発表ではmiroを使用します。・課題はAdobeIllustratorでフォーマットを提供します。・課題に取り組むためにノートPCを毎回持参してください。",
        "notices": "工業デザインにおける商品企画を講義の対象とします。個人的な制作物のための商品企画ではないことに注意してください。",
        "preparatoryStudy": "ニュースや興味のある分野のトレンドなど、インターネットや店舗、文献、雑誌や新聞などのメディアを用いて情報収集をし、幅広く社会の流れを把握してください。授業への準備学修についてはmoodleを活用し、適宜指示します。",
        "gradingGuidelines": "授業への取り組み姿勢への評価【20%】、授業内レポートおよび課題【50%】、期末課題（企画書）【30%】の割合で総合的に評価します。単位認定要件は60点以上です。評価基準は以下の通りとし、レポートや課題により評価します。「チーム力」：企業の価値・リソース・ステークホルダー・歴史・ビジョンなどを理解しまとめる力「発想力」：広い視野で新たな価値を見出し広く展開する力「取材力」：マーケティングリサーチなどによる分析から本質を見極める力「集中力」：多岐に渡る内容を粘り強く理解し実践する力「提案力」：アイデアを立案し、他者を納得させるプレゼンテーション力「実現力」：アイデアを具体的にビジュアル表現できる力",
        "textbook": "指定はありません。講義内容に即した資料を使用します。",
        "referenceMaterials": "指定はありません。必要に応じて講義内容に即した参考書を紹介します。",
        "courseSchedule": "第1回：ガイダンス授業概要と目的第2回：商品企画について第3回：フレームワークと商品企画第4回：デザイナーによる商品企画の意味①：デザイン思考第5回：デザイナーによる商品企画の意味②：SDGsとESG第6回：アイデア発想法と商品企画第7回：グループでのブレインストーミング第8回：特別講義/デザイナーと商品企画（外部講師）第9回：事例分析技術革新とライフスタイルと商品企画第10回：サービス・ドミナント・ロジックと商品企画第11回：アイデアの具現化と検証第12回：ブランドと商品企画：ブランド価値とブランディング第13回：インターネットと商品企画：カスタマージャーニー、クラウドファウンディング第14回：販売戦略/商品企画書の作成第15回：グループ発表：企画の共有",
        "courseDataUpdatedAt": "2024/03/12"
    },
    "updateAt": "2024/08/07"
}