{
    "lectureCode": "S3220",
    "courseName": "視覚伝達デザインコース専門演習II",
    "lecturer": [
        "葛原俊秀(デザイン学部デザイン学科)",
        "小田敬子(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3",
        "木4",
        "木5",
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "デザイン学部デザイン学科視覚デザイン専攻",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "6",
    "classroom": [
        "３１４１３専門演習室２"
    ],
    "courceDetails": {
        "courseOverview": "第１課題では、個人制作として本を制作します。本の構成とデザイン、製本を通じて、本のモノとしての価値の理解を深め、視覚伝達デザインにおける表現力の修得を目指します。同時に、「ヒト・モノ」という観点から伝えたいメッセージを言語化し、プレゼンテーションを実施します。また、第２課題では、個人制作としてパターングラフィックスを制作します。事例を収集し、紙や生地などの多様な素材に触れると共に、制作したパターングラフィックスを生活の中のアイテムとして展開し、柔軟な表現力の修得を目指します。同時に、「ヒト・モノ」という観点からコンセプトを立案し、プレゼンテーションを実施します。授業全体を通して「実学主義に基づく専門能力」と「問題解決力」を養います。なお、本授業は、視覚デザイン分野の専門的な実務経験を有する複数の教員が、その経験を十分に活かして教育する実践的科目です。",
        "outcomesMeasuredBy": "◉視覚伝達デザイン分野における実学に基づく専門能力を養う。◉本とパターングラフィックスのモノとしての価値を体験的に理解する。◉「ヒト・モノ」の観点からコンセプトを立案し、実制作を通して自分の視点を活かした表現力を養う。◉プレゼンテーションをするコミュニケーション力を養う。◉企画・制作・ブラッシュアップ・プレゼンテーションに至るデザインのプロセスを修得する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本授業は、視覚伝達デザイン分野における「ヒト・モノ」の関係性を探求する実践的な演習授業です。体験的にモノに触れると共に実制作を通して、自らの主体的な学びを促します。",
        "notices": "◉授業運営プラットフォームとしてMoodleを使用します。◉授業全般においてノートPCを必携とします。◉教室は、課題内容に合わせて視覚伝達デザインコース専門演習室、グラフィックスタジオ、デザインクリエーションルームを使用します。◉課題は実制作となり、材料費及び外部への発注費は基本的に自費とします。",
        "preparatoryStudy": "◉予習：授業スケジュールに沿って授業時間外に自主的に調査や試作制作、プレゼンテーションの準備を行うこと。◉予習：視覚デザイン表現に必要なアプリケーションソフトのオペレーションを適宜振り返ること。◉復習：制作相談やプレゼンテーションなどを含め自身の提案を客観的に振り返り、常にブラッシュアップを試みること。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①発想〜立案段階【20%】（調査・アイデア／考えの伝達）②制作段階【20%】（試作と検討／集中度）③結果段階【50%】（提出期限／独自な視点で社会的な価値ある提案／完成度）④プレゼンテーション段階【10%】（論理的な思考／コミュニケーション）",
        "textbook": "授業時に資料を配布する。",
        "referenceMaterials": "必要に応じて授業内で提示する。",
        "courseSchedule": "第1回：＜第１課題＞オリエンテーション（全教員）第2回：製本ワークショップ（全教員）第3回：本のエクササイズ（全教員）第4回：企画立案／特別講義（全教員）第5回：企画立案／戦略的教育プログラム（全教員）第6回：中間プレゼンテーション（全教員）第7回：コンテンツ制作①（全教員）第8回：コンテンツ制作②（全教員）第9回：コンテンツ制作③（全教員）第10回：コンテンツ制作④（全教員）第11回：印刷①（全教員）第12回：印刷②（全教員）第13回：製本①（全教員）第14回：製本②（全教員）第15回：最終プレゼンテーション（全教員）第16回：＜第２課題＞オリエンテーション（全教員）第17回：パターングラフィックスのエクササイズ（全教員）第18回：企画立案（全教員）第19回：パターングラフィックス制作①（全教員）第20回：パターングラフィックス制作②（全教員）第21回：パターングラフィックス制作③（全教員）第22回：中間プレゼンテーション（全教員）第23回：アイテム制作①（全教員）第24回：アイテム制作②（全教員）第25回：アイテム制作③（全教員）第26回：アイテム制作④（全教員）第27回：アイテム制作⑤（全教員）第28回：プレゼンテーション制作①（全教員）第29回：プレゼンテーション制作②（全教員）第30回：最終プレゼンテーション（全教員）",
        "courseDataUpdatedAt": "2024\/03\/12"
    },
    "updateAt": "2024\/08\/07"
}