{
    "lectureCode": "S3230",
    "courseName": "視覚情報デザインコース専門演習II",
    "lecturer": [
        "伊藤英高(デザイン学部デザイン学科)",
        "中島健太(デザイン学部デザイン学科)",
        "井藤雄一(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3",
        "木4",
        "木5",
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "デザイン学部デザイン学科視覚デザイン専攻",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "6",
    "classroom": [
        "３１４１５専門演習室３"
    ],
    "courceDetails": {
        "courseOverview": "本科目では、身の回りの様々な情報を可視化するのみならず、映像、音響、インタラクションなどのマルチモーダルなメディアとデジタルテクノロジーを用いて「体験化」するUXデザインを学びます。第1課題は、「専門演習I」でのリサーチとアウトプットの手法をベースとし、「時間のデザイン」をテーマとした映像を個人制作として行い、各々が「発想力」「提案力」を身につけます。第2課題は、第1課題のテーマ・素材を活用してインタラクティブコンテンツを制作します。実制作はグループで行い、共同制作を通して「実学に基づく専門能力」「コミュニケーション能力」「論理的な思考力」「分析・評価能力」「問題解決力」を養います。なお、本授業は、視覚デザイン分野の専門的な実務経験を有する複数の教員が、その経験を十分に活かして教育する実践的科目です。",
        "outcomesMeasuredBy": "・客観性をもった情報の分析・評価能力と、それらを「体験化」する論理的な思考力を養う。・情報デザイン分野における専門的な知識・技術を養う。・プレゼンテーションやグループワークを通して幅広いコミュニケーション能力を養う。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "「時間のデザイン」をテーマとして、生活・社会の「時間」を「瞬間・速度・履歴・推移」など様々な視点で観察・リサーチを重点的に行なった上で、視覚化・体験化へのプロセスを進めます。また、ディスカッション、発表などではグループワークを行います。制作内容に合わせてスタジオ、屋外などでカメラ、サウンドレコーダー、パソコンなどの機材を使用します。観察・リサーチ・制作を中心としたアクティブラーニングで授業を行う、実践的な演習内容となっています。また、授業時間外および学外での制作作業も必要となるので、しっかり課題に取り組んでください。毎回の授業においてノートPCが必携となります。",
        "notices": "・GoogleClassroomを中心に使用しますが、授業開始前にMoodleにて指示を記載します。・また関連授業として開講される情報デザイン系講義科目と、専門スキル演習科目を履修していることが望ましいでしょう。",
        "preparatoryStudy": "予習について：授業の終わりに次回の授業内容について触れ、授業までに事前に調べておく事柄や制作をしておくことを予習として課します。復習について：授業内容に即した形で「演習課題」の授業外での制作を課します。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①発想～立案段階【20%】（調査・アイデア、考えの伝達）②制作段階【20%】（試作と検討、集中度〈グループワーク：役割を果たし積極的な参加〉）③結果段階【50%】（提出期限、独自な視点で社会的な価値ある提案、完成度）④プレゼンテーション段階【10%】（コンセプトや制作意図が明確か）",
        "textbook": "授業内容に合わせて資料を配布します。",
        "referenceMaterials": "多様なデザインや情報メディアに関する教養を高めるため、質の高い作品や資料を提示します。授業内容に合わせて資料を配布します。",
        "courseSchedule": "第1回：第1課題ガイダンス／リサーチ1（全教員）第2回：第1課題リサーチ1発表・ディスカッション（全教員）第3回：第1課題撮影レクチャー／動画制作チュートリアル（全教員）第4回：特別講義第5回：戦略的教育プログラム特別講義第6回：第1課題リサーチ2(学内／学外)・企画制作（全教員）第7回：第1課題リサーチ2(学内／学外)・企画制作（全教員）第8回：第1課題企画発表・ディスカッション・映像制作（全教員）第9回：第1課題映像制作（全教員）第10回：第1課題映像制作（全教員）第11回：第1課題映像制作／中間発表（全教員）第12回：第1課題映像制作（全教員）第13回：第1課題映像制作（全教員）第14回：第1課題発表（全教員）第15回：第1課題ブラッシュアップ（全教員）第16回：第2課題ガイダンス（全教員）第17回：第2課題インタラクティブコンテンツ制作に向けてのレクチャー（全教員）第18回：第2課題インタラクティブコンテンツ制作エクササイズ（全教員）第19回：第2課題グループワーク・リサーチ（グループワーク）（全教員）第20回：第2課題リサーチ・企画書作成（全教員）第21回：第2課題企画発表（全教員）第22回：第2課題制作（グループワーク）（全教員）第23回：第2課題制作（グループワーク）（全教員）第24回：第2課題制作（グループワーク）（全教員）第25回：第2課題中間発表（全教員）第26回：第2課題制作（グループワーク）（全教員）第27回：第2課題制作（グループワーク）（全教員）第28回：第2課題制作（グループワーク）（全教員）第29回：第2課題最終発表（全教員）第30回：第2課題フィードバックを踏まえてブラッシュアップ（グループワーク）（全教員）",
        "courseDataUpdatedAt": "2024/03/12"
    },
    "updateAt": "2024/08/07"
}