{
    "lectureCode": "S3240",
    "courseName": "空間演出デザインコース専門演習II",
    "lecturer": [
        "宮元三恵(デザイン学部デザイン学科)",
        "田村吾郎(デザイン学部デザイン学科)",
        "小山祐輔(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3",
        "木4",
        "木5",
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "デザイン学部デザイン学科工業デザイン専攻",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "6",
    "classroom": [
        "３１４１１専門演習室１"
    ],
    "courceDetails": {
        "courseOverview": "「空間演出デザインコース専門演習Ⅱ」では、「専門演習Ⅰ」で学んだ空間に関する概念やデザインスキルを発展させ、より実践的かつ社会的なテーマに取り組みます。現代社会全体が有する諸問題や地球環境をいま一度見つめ直すと共に、あるべき未来の姿を想像し、デザインによって実現するという大きなフレームワークの課題を通のなかで、事例調査と分析・考察、スケッチ、スケールモデル制作などのデザインプロセスを経て、プランの策定を行います。前期の「コース専門演習Ⅱ」では特に、手書きスケッチ、模型といった「手作業によるアウトプット」の精度やレベルを上げるために繰り返し訓練を行います。本科目は空間デザインの分野において専門的な実務経験を有する複数の教員が、その経験を十分に活かして教育する実践的科目です。",
        "outcomesMeasuredBy": "手書きによるスケッチ、模型を繰り返し制作することで、表現力をコミュニケーション精度を高めることを第一の目標とし、アウトプットする一連のフローの中で、デザインアイデアにつながる「新たな気付き」や「思考の整理・構築」を行えるようにすることを第二の目標と定め、「実学に基づく専門能力」「コミュニケーション能力」「論理的な思考力」「分析・評価能力」「問題解決力」を養います。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "演習前半ではフィールドワークやデザイン事例の調査、まとめを行い、手書きによるスケッチや模型制作を繰り返し行います。ここではアイデアやデザイン、造形的なオリジナリティはさほど重視せず、短時間でしっかりと完成まで持っていくという経験を何度も行うということをに重点を置きます。授業後半ではグループワークを取り入れ、空間に対する分析や、デザイン的な分析を行い、空間デザインに対する見地を高めます。その後、個人で空間アイデアを導き出し、前半で身につけたスケッチ、模型作りの能力を活かし、アウトプットを行います。これらPBL（Project-BasedLearning=課題解決型学修）を取り入れることで、実践的な演習内容とします。授業内ではノートPCを使用する予定です。",
        "notices": "関連授業として、「スキル演習(基礎製図)」、「空間デザイン論」を履修していることが望ましいです。",
        "preparatoryStudy": "予習：次回の授業内容の指示に沿って授業時間相当の学外での調査や試作などを行ってください。復習：グラフィックソフト、3DCGソフト、CADソフト、プロジェクションマッピング制御ソフトなどのアプリケーションの基本操作に関して授業時間相当の復習を要します。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①発想〜立案段階【20%】（調査、アイデア、考えの伝達）②制作段階【20%】（試作と検討、集中度〈G：役割を果たし積極的な参加〉）③結果段階【50%】（提出期限、独自な視点で社会的な価値ある提案、完成度）④プレゼンテーション段階【10%】（コンセプトや制作意図が明確か）",
        "textbook": "指定しません。",
        "referenceMaterials": "授業時に適宜指示します。",
        "courseSchedule": "第1週：オリエンテーション演習の目的や学修方法の説明、「課題1」説明、フィールドワーク（全教員）第2週：「課題1」空間フィールドワーク・リサーチ、まとめ、発表（全教員）第3週：アウトプット1手書きスケッチ模写（全教員）第4週：アウトプット2手書きスケッチ模写（全教員）第5週：アウトプット3手書きスケッチ（全教員）第6週：アウトプット4手書きスケッチ（全教員）第7週：アウトプット5手書きスケッチ（全教員）第8週：「課題1」発表会、「課題２」説明、フィールドワーク（全教員）第9週：「課題2」空間フィールドワーク・リサーチ、まとめ、発表（全教員）第10週：アウトプット1模型制作（全教員）第11週：アウトプット2模型制作（全教員）第12週：アウトプット3模型制作（全教員）第13週：アウトプット4模型制作（全教員）第14週：「課題2」発表会、まとめ（全教員）第15週：記録・ファイル制作（全教員）第16週：「課題3」演習の目的や学修方法の説明（全教員）第17週：フィールドワーク・リサーチ（全教員）第18週：フィールドワーク・リサーチ内容発表（全教員）第19週：チーム制作／リサーチ結果の共有・ブレインストーミング（全教員）第20週：チーム制作／問題点の整理、制作テーマの定義（全教員）第21週：チーム制作中間発表会（全教員）第22週：チーム制作／テーマの再検討（全教員）第23週：チーム制作／発表会（各チームのプレゼンテーション）（全教員）第24週：個人制作（全教員）第25週：個人制作／中間発表会（全教員）第26週：個人制作／テーマの再検討（全教員）第27週：個人制作（全教員）第28週：個人制作（全教員）第29週：個人制作発表（全教員）第30週：記録・ファイル制作、演習のまとめ（全教員）",
        "courseDataUpdatedAt": "2024\/03\/12"
    },
    "updateAt": "2024\/08\/07"
}