{
    "lectureCode": "S3260",
    "courseName": "視覚伝達デザインコース専門演習III",
    "lecturer": [
        "小田敬子(デザイン学部デザイン学科)",
        "葛原俊秀(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木3",
        "木4",
        "木5",
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "デザイン学部デザイン学科視覚デザイン専攻",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 6,
    "classroom": [
        "３１４１３専門演習室２"
    ],
    "courceDetails": {
        "courseOverview": "本授業では、専門演習Ⅰ・Ⅱで身につけたグラフィックデザインの専門知識、デザイン制作のプロセスを応用し、展開した、クリエーションとブランドデザインに取り組みます。課題では、社会についての観察・調査を行い、問題提起とソリューションの企画立案、そしてプレゼンテーションを行い、人々の生活を意識したビジュアルコミュニケーションの提案を行います。また、社会に貢献するブランドを検討し、ブランドビジョンの策定、そして、紙・映像・アプリ・Webなどのメディアを使ったコミュニケーション表現に取り組みます。また、3つの基準（①柔軟な発想や独自性による創造性、②他者や社会、時代の情勢を捉えた社会性、③感性を魅了する造形的なクォリティを実現する審美性）による視点を重視し、ビジュアルで理念を可視化させコミュニケーションすることができるようになることを目指します。なお、本授業は、視覚デザイン分野の専門的な実務経験を有する複数の教員が、その経験を十分に活かして教育する実践的科目です。また、授業全体を通して「実学に基づく専門能力」と「問題解決力」を養います。",
        "outcomesMeasuredBy": "◉視覚伝達デザイン分野における実学に基づく専門能力を養う。◉情報や状況を客観的に分析・評価し（分析・評価能力）、複雑な社会や人に対する洞察力と、ヒト・モノ・コトの関係から企画立案する論理的な思考力、問題解決力を養う。◉プレゼンテーションやグループワークを通して、柔軟なコミュニケーション能力を養う。◉企画・制作・ブラッシュアップ・プレゼンテーションに至るデザインのプロセスを修得する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本授業は、課題解決型学修を取り入れた実践的な演習授業です。グループにおけるディスカッションやブレインストーミング、企画や作品のプレゼンテーションを通して、学生自らの主体的な学びを促します。",
        "notices": "◉授業運営プラットフォームとしてMoodleを使用します。◉授業全般においてノートPCを必携とします。◉教室は、課題内容に合わせて視覚デザイン研究室管理の演習室、PC演習室、グラフィックスタジオを使用します。",
        "preparatoryStudy": "◉予習：授業スケジュールに沿って授業時間外に自主的に調査や試作制作、プレゼンテーションの準備を行うこと。◉予習：視覚デザイン表現に必要なアプリケーションソフトのオペレーションを適宜振り返ること。◉予習：環境や技術革新、あるいは様々な社会動向や社会の問題など、社会全般に対して常に関心を持ち、情報収集し、思考する姿勢を日頃から心掛けること。◉復習：制作相談やプレゼンテーションなどを含め自身の提案を客観的に振り返り、常にブラッシュアップを試みること。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学内サイトを参照。①発想〜立案段階【20%】（調査・アイデア、考えの伝達）②制作段階【20%】（試作と検討、集中度〈G：役割を果たし積極的な参加〉）③結果段階【50%】（提出期限、独自な視点で社会的な価値ある提案、完成度）④プレゼンテーション段階【10%】（コンセプトや制作意図が明確か）",
        "textbook": "授業時に資料を配布する。",
        "referenceMaterials": "必要に応じて授業内で提示する。",
        "courseSchedule": "第1回：第１課題オリエンテーション（全教員）第2回：リサーチ①（全教員）第3回：リサーチ②（全教員）第4回：リサーチ③（全教員）第5回：プレゼンテーション（リサーチ）（全教員）第6回：企画立案①（全教員）第7回：企画立案②（全教員）第8回：企画立案③（全教員）第9回：プレゼンテーション（企画）（全教員）第10回：企画立案④（全教員）第11回：企画立案⑤（全教員）第12回：最終プレゼンテーション（全教員）第13回：第２課題オリエンテーション（全教員）第14回：リサーチ（全教員）第15回：企画とデザイン制作（全教員）第16回：プレゼンテーション（ブランドビジョン）（1/2）（全教員）第17回：プレゼンテーション（ブランドビジョン）（2/2）（全教員）第18回：ブランド表現①（全教員）第19回：ブランド表現②（全教員）第20回：ブランド表現③第21回：プレゼンテーション（ブランド表現）（1/2）（全教員）第22回：プレゼンテーション（ブランド表現）（2/2）（全教員）第23回：ブランド表現④（全教員）第24回：ブランド表現⑤（全教員）第25回：中間プレゼンテーション（1/2）（全教員）第26回：中間プレゼンテーション（2/2）（全教員）第27回：プレゼンテーション制作①（全教員）第28回：プレゼンテーション制作②（全教員）第29回：最終プレゼンテーション（1/2）（全教員）第30回：最終プレゼンテーション（2/2）（全教員）",
        "courseDataUpdatedAt": "2024/03/13"
    },
    "updateAt": "2024/12/09"
}