{
    "lectureCode": "S3270",
    "courseName": "視覚情報デザインコース専門演習III",
    "lecturer": [
        "伊藤英高(デザイン学部デザイン学科)",
        "井藤雄一(デザイン学部デザイン学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木3",
        "木4",
        "木5",
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "デザイン学部デザイン学科視覚デザイン専攻",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 6,
    "classroom": [
        "３１４１５専門演習室３"
    ],
    "courceDetails": {
        "courseOverview": "本科目は、社会・環境における問題発見・提議・解決(ソリューション)の一連の流れを情報のデザインによって提示する手法について学びます。第1課題は、グループワークを通して社会問題を発見し、それを体験・提議するための「学びのツール」の企画立案、アナログの手法を活用したプロトタイプ作成を行います。第2課題は、第1課題を踏まえた上で、社会や環境問題の提議をより効果的にビジュアル化する方法を検討、個人制作として映像、アプリ、Webなどの様々なメディアを使った「コトのデザイン」としての企画やコンテンツ制作を行います。授業全体を通して「実学に基づく専門能力」と「問題解決力」を養います。なお、本授業は、視覚デザイン分野の専門的な実務経験を有する複数の教員が、その経験を十分に活かして教育する実践的科目です。",
        "outcomesMeasuredBy": "・客観性のある、情報の分析・評価能力と、それらを「体験化」する論理的な思考力を養う。・情報デザイン分野における専門的な知識・技術を養い、実学に基づく専門能力、問題解決力を修得する。・プレゼンテーションやグループワークを通して幅広いコミュニケーション能力を養う。・最終結果だけでなく、そのプロセスの記録・言語化へ意識を向けることを学ぶ。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "社会、環境における問題発見・提議・解決を目的とした「学びのツール」をテーマに、リサーチを重点的に行なった上で、企画・コンテンツ制作を行います。また、ディスカッション、発表などではグループワークを行います。制作内容に合わせてスタジオ、屋外などでカメラ、サウンドレコーダー、パソコンなどの機材を使用します。観察・リサーチ・制作を中心としたアクティブラーニングで授業を行う、実践的な演習内容となっています。また、授業時間外および学外での制作作業も必要となるので、しっかり課題に取り組んでください。毎回の授業においてノートPCが必携となります。",
        "notices": "・GoogleClassroomを中心に使用しますが、授業開始前にMoodleにて指示を記載します。・また関連授業として開講される情報デザイン系講義科目と、専門スキル演習科目を履修していることが望ましいでしょう。",
        "preparatoryStudy": "予習について：授業の終わりに次回の授業内容について触れ、授業までに事前に調べておく事柄や制作をしておくことを予習として課します。復習について：授業内容に即した形で「演習課題」の授業外での制作を課します。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①発想～立案段階【20%】（調査・アイデア、考えの伝達）②制作段階【20%】（試作と検討、集中度〈グループワーク：役割を果たし積極的な参加〉）③結果段階【50%】（提出期限、独自な視点で社会的な価値ある提案、完成度）④プレゼンテーション段階【10%】（コンセプトや制作意図が明確か）",
        "textbook": "授業内容に合わせて資料を配布します。",
        "referenceMaterials": "多様なデザインや情報メディアに関する教養を高めるため、質の高い作品や資料を提示します。授業内容に合わせて資料を配布します。",
        "courseSchedule": "第1回：第1課題ガイダンス（全教員）第2回：第1課題アナログゲームについてワークショップ・ディスカッション（グループワーク）（全教員）第3回：第1課題社会・環境の問題についてワークショップ（グループワーク）（全教員）第4回：第1課題社会・環境の問題について：発表（全教員）第5回：第1課題オリジナルアナログゲームの企画（全教員）第6回：第1課題オリジナルアナログゲームの企画発表（全教員）第7回：第1課題試作制作検証・改良（全教員）第8回：第1課題試作制作検証・改良（全教員）第9回：第1課題プロトタイプ制作・マニュアル制作（全教員）第10回：第1課題プロトタイプ制作・マニュアル制作（全教員）第11回：第1課題プロトタイプ制作・マニュアル制作（全教員）第12回：第1課題プロトタイプ制作・マニュアル制作＋PR動画制作（全教員）第13回：第1課題プロトタイプ制作・マニュアル制作＋PR動画制作（全教員）第14回：第1課題最終プレゼンテーション（全教員）第15回：第1課題フィードバックを踏まえてブラッシュアップ（全教員）第16回：第2課題ガイダンス（全教員）第17回：第2課題社会・環境の問題とコンテンツデザインについてディスカッション（グループワーク）（全教員）第18回：第2課題社会・環境問題についてリサーチ（全教員）第19回：第2課題コンテンツ企画案制作（全教員）第20回：第2課題コンテンツ企画案発表（全教員）第21回：第2課題コンテンツ制作（全教員）第22回：第2課題コンテンツ制作（全教員）第23回：第2課題コンテンツ制作（全教員）第24回：第2課題中間発表（全教員）第25回：第2課題コンテンツ制作（全教員）第26回：第2課題検証・改良1（グループワーク）（全教員）第27回：第2課題検証・改良2（グループワーク）（全教員）第28回：第2課題コンテンツ制作（全教員）第29回：第2課題最終発表（全教員）第30回：第2課題ブラッシュアップ・ポートフォリオ制作（全教員）",
        "courseDataUpdatedAt": "2024\/03\/12"
    },
    "updateAt": "2024\/09\/13"
}