{
    "lectureCode": "S4010",
    "courseName": "デザイン卒業研究I",
    "lecturer": [
        "各教員"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "デザイン学部デザイン学科",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": "4.0",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "「デザイン卒業研究I」では、これまで各コースで学修してきたことを活かして、社会との接点から自ら「問い」を探し、研究テーマを見つける。調査を重ね、社会がより良い状況に結びつく提案を、各専門のデザインの分野におけるアウトプットを用いて試作を制作する。授業は、指導教員によるゼミナール式で行われ、調査、先行事例の分析、試作の制作などの過程を通して、自身が明らかにする課題を明確にする。後期「デザイン卒業研究Ⅱ」に向けての重要な調査段階となる。個人による研究とし、その途中経過や成果は、各コースで中期と期末に設定された発表会でプレゼンテーションを行う。",
        "outcomesMeasuredBy": "各デザインの領域において研究テーマを見つけ調査を重ね、各専門のデザインの分野におけるアウトプットを用いて試作を制作することによって、実学に基づく専門能力を修得する。また、指導教員と相談しながら自ら課題を解決するプロセスによって、問題解決力、論理的な思考力、国際的な教養を身につける。研究計画の発表により、分析・評価能力を高め、その過程においてコミュニケーション能力を身につける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "各指導教員の専門性を生かした教授を行う。授業は指導教員によるゼミナール式で実施され、指導教員や同じ研究テーマを選択した学生等とのディスカッションやフィードバックを得ながら、調査、先行事例の分析、試作の制作を行う。具体的な進め方は、各コースのそれぞれの指導教員の方針に従う。",
        "notices": "最低でも週6時間を研究・制作の時間として確保すること。指導教員により定められたミーティングを欠席する場合は、必ず事前に連絡をすること。",
        "preparatoryStudy": "各コースの指導教員の指示に従うこと。",
        "gradingGuidelines": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。①発想～立案段階【20%】（調査、アイデア、考えの伝達）②制作段階【20%】（試作と検討、集中度〈G：役割を果たし積極的な参加〉）③結果段階【50%】（提出期限、独自な視点で社会的な価値ある提案、完成度）④プレゼンテーション段階【10%】（コンセプトや制作意図が明確か）",
        "textbook": "指導教員の指示による。",
        "referenceMaterials": "指導教員の指示による。",
        "courseSchedule": "第1回：オリエンテーション第2回：研究テーマの検討と調査1第3回：研究テーマの検討と調査2第4回：研究テーマの検討と調査3第5回：研究テーマの検討と調査4第6回：研究テーマの検討と調査5第7回：中間発表会第8回：研究テーマの検討と調査6第9回：研究テーマの検討と調査7第10回：研究テーマの検討と調査8第11回：研究テーマの検討と調査9第12回：研究テーマの検討と調査10第13回：期末発表会第14回：期末発表会第15回：卒業研究Iの総括／卒業研究IIに向けた検討",
        "courseDataUpdatedAt": "2024\/03\/13"
    },
    "updateAt": "2024\/09\/13"
}