{
    "lectureCode": "11040K7",
    "courseName": "情報リテラシー[化][2023年以前入学者]",
    "lecturer": [
        "上野聡(工学部応用化学科)",
        "藤田隆史(工学部応用化学科)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "インターネットなどの情報通信技術(ICT)は常に進歩しており、ソフトウェアとしても便利な機能が次々と開発されている。このような現状を踏まえ、応用化学科の学生として必要な情報検索とその信憑性の判断、実験データの整理、論文の作成、学会発表の準備など、「調べて、まとめて、発表する」ために必要なICTスキルについて学ぶ。具体的には、情報社会における注意点、化学情報の検索や閲覧、表現、引用の仕方について紹介する。この授業では、情報通信技術によって、たくさんの情報から自ら必要な情報を取捨選択し活用する能力が身に付く。また、電子メールの利用法、Wordを使用した報告書の作成、Excelを使用したデータの分析、ChemDrawを使用した化学構造式の描画、Powerpointを使用した研究・調査結果の発表に関する知識が身に付く。また、プログラミングは、コンピュータを有効活用するために重要な技能である。例えば、化学の研究において膨大な測定データの統計処理や解析を行うことは少なくないが、その際にプログラミングを活用することができれば、それらの処理を自動化できるため、研究の効率を飛躍的に上げることができる。さらに発展的には、プログラミングと化学の専門的な知識と組み合わせることで、コンピュータ上での模擬実験（シミュレーション）を行うことも可能である。このため、プログラミングを習得することは、機械系の分野に限らず、化学系の分野においても意義が深い。本講義では、MicrosoftOfficeのExcelに含まれているVisualBasicを題材として、プログラミングに関する基礎的な考え方を習得することを目標とする。",
        "outcomesMeasuredBy": "インターネットなどの情報通信技術を利用し、自分の必要とする情報を安全に取得できる（実学に基づく専門能力）。無線LANに接続し、学生ポータルやWebブラウザ、ウイルス対策ソフト、電子メールを使用できる（実学に基づく専門能力）。自分の目的化合物の物性や合成方法を検索できる。参考にした文献を正しく引用できる。また、これらで得た情報を正しく分析・評価できる（論理的な思考力、分析・評価能力）。Word、Excel、Powerpointなどの機能を理解し、報告書の作成、データ分析（分析・評価能力）、研究結果の発表（コミュニケーション能力）を行うことができる。ChemDrawを用いて化学構造式を描画でき、それをWordやPowerpointに貼付け、効果的なレポートやスライドを作成できる。プログラムの概念・基本的なルール・文法をVisualBasicを通じて、理解・習得する。基本的なプログラムを自力で作成できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "授業は、主にプロジェクターを用いた講義形式で行う。必要に応じて、板書や各自のノートPCを用いて理解を深める。講義では、学習する内容の説明と各自のパソコンによる実施および解説を行う。理解の確認のために課題を解き、ファイルを提出する。必要に応じて、学生は自身が作成したプログラムの設計を教員に説明することで、理解度の確認を行う。MicrosoftOfficeExcelのVisualBasicを用いるため、ノートパソコンは必携である。",
        "notices": "授業には毎回ノートPCを持参する必要がある。積極的に自身で考え手を動かすことがPCスキルの上達に繋がる。疑問点は遠慮なく質問すること。わからない点を放置しておくと、その後の内容が理解できなくなる恐れがある。",
        "preparatoryStudy": "大学指定のノートPCまたはそれと同等のノートPCを準備する。また、毎回の講義内容を充分に復習すること。予習として、講義の事前に公開する講義資料に目を通す。講義資料中に記載されているプログラム例を入力・実行し、動作を自分なりに確認する。",
        "gradingGuidelines": "予習課題（14%）理解度チェック（14%）期末試験（72%）",
        "textbook": "指定しない",
        "referenceMaterials": "生命科学・医療系のための情報リテラシー第3版情報検索からレポート、研究発表まで（丸善出版、飯島史朗・石川さと子著）、Excel環境におけるVisualBasicプログラミング（第３版）加藤潔著（共立出版）",
        "courseSchedule": "第1回:ガイダンス、無線LAN接続、電子メール、学生ポータル、教務システム、PCの基本操作、Webブラウザの使用、WindowsUpdate、ウイルス対策ソフト、ソフトウェアの種類と機能、オンライン会議ツール（上野）第2回:タイピング、VPN接続、PDFファイルの閲覧（上野）第3回:報告書の作成（Wordの使い方、Googleドキュメント）：基本操作、表の作成、写真などの挿入、予稿集の作成（上野）第4回:研究・調査結果の発表（Powerpointの使い方、Googleスライド）：発表スライド・発表原稿の作成（上野）第5回:レポートを用いた発表会（上野）第6回:スライドを用いた発表会（上野）第7回:化学構造式の描画（ChemDrawDirectの使い方）：基本操作、化学式の入力、化学反応式の描画、化合物の情報の利用（上野）第8回：Excelの基本操作（藤田）第9回：変数と四則演算（藤田）第10回：条件判断-If文、Selectによる分岐構造の作成（藤田）第11回：繰り返し構文-For文、Do文、多重ループ（１）（藤田）第12回：繰り返し構文-For文、Do文、多重ループ（２）（藤田）第13回：モンテカルロシミュレーション、数値積分、ニュートン法など（藤田）第14回：まとめと理解度チェック（藤田）",
        "courseDataUpdatedAt": "2024\/03\/27"
    },
    "updateAt": "2024\/09\/13"
}