{
    "lectureCode": "11079K77",
    "courseName": "フレッシャーズゼミ[5]",
    "lecturer": [
        "原賢二(工学部応用化学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "大学における４年間の学修のみならず、大学生活全般に必要となる環境への適応や仲間づくり、さらに社会人として求められる能力を養うことを目的とする。そこで、履修や学習に関する情報を共有し、また、日本語スキルアップカリキュラムやグループワークを通じて、工学部および応用化学科における教育・研究の全体像を把握することで、大学での学びに対するモチベーションを高め、個人またはグループとして活動する能力を身につける。この授業によって、自分自身の行動をマネージメントする能力が身につき、４年間の大学生活を円滑に進めるための知識・スキルを獲得できる。",
        "outcomesMeasuredBy": "本授業科目では以下を到達目標とする。1)グループワークやポスター制作等を通じて、自律的に学習計画・行動計画を立てられると同時に、他の学生と協力して活動できるようになる。2)分かり易く効果的なプレゼンテーション資料の作成が行え、かつプレゼンテーションを行うことができるようになる。3)工学部および応用化学科における教育・研究の全体像を把握することができ、4年間に渡る学科教育に対するモチベーションが高まる。4)安全講習会やハラスメント講習会により社会人にふさわしい行動ができるようになる。さらに、問題解決力を測る外部テスト(GPSAcademic)の受験とフィードバックにより、各自の問題解決力の状況を確認し、それを伸ばすことができる。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "各クラスを応用化学科教員１名が担当し、小人数のゼミ形式で授業を行う。オンライン型（オンデマンド型／リアルタイム型／ハイブリッド型）で実施する授業回がある。オンライン型での授業回については、前週までにMoodleページ等で連絡をする。これに加えて、学部全体で、また他学科と連携して行うグループワークにも取り組む。ポスター製作等にノートPCが必要となるので、クラス担当の教員の指示に従い、持参すること。グループで作成したポスターを用いて、３学科合同ポスター発表会でプレゼンテーションを行う。",
        "notices": "到達目標を達成するためには、学生自身の主体的な取り組みと他の学生との連携が必須です。今求められている行動を自分自身で考え、実際に行動に移すように心がけてください。",
        "preparatoryStudy": "各回の内容により、各教員から指示される事項について事前に調査しまとめておく。また、グループワーク等で決定した事柄に基づいて、次回までに行うべきことを各自で認識・把握して、準備すること。",
        "gradingGuidelines": "グループワーク等への参加・貢献度(60%)とポスター発表・その他の課題(40%)から総合的に評価する。",
        "textbook": "特に教科書はありません。",
        "referenceMaterials": "特に参考書はありませんが、必要に応じて補助資料を配付します。",
        "courseSchedule": "第1回：自己紹介,履修計画,FS概要・ポスター制作説明第2回：履修計画、調査＋ポスター制作(1)第3回：教育・研究調査，ポスター制作(2)第4回：教育・研究調査，ポスター制作(3)第5回：問題解決力確認テスト（GPSアカデミック）第6回：教育・研究調査，ポスター制作(4)第7回：調査・実験・ポスター制作(5)、要旨作成、わかり易い文章作成法第8回：ハラスメント・安全教育第9回：調査・実験・ポスター制作(6)、要旨作成第10回：調査・実験・ポスター制作(7)、ポスタープレビュー第11回：大学の理念と歴史の理解、学習基礎力テストフィードバック第12回：調査・実験・ポスター制作(8)、ポスタープレビュー第13回：合同ポスター発表会第14回：合同ポスター発表会フィードバック、夏休みの計画、自由討論",
        "courseDataUpdatedAt": "2024\/02\/09"
    },
    "updateAt": "2024\/09\/13"
}