{
    "lectureCode": "K0004101",
    "courseName": "社会連携演習II[化][機再履]",
    "lecturer": [
        "須磨岡淳(工学部応用化学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "工学部機械工学科,工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "講義実験棟２０１",
        "講義実験棟２０２"
    ],
    "courceDetails": {
        "courseOverview": "本授業では、それぞれの学生が適切なコーオプ実習先を決定することを目指す。具体的には、コーオプ実習（以下「実習」）に向けた社会人としての心構えやビジネスマナーを学び、報連相（報告、連絡、相談）を基本とする企業組織におけるコミュニケーション能力を向上させる。また、実際の実習先企業候補等を研究して具体的な就業内容をイメージし、実習中の目標設定を行なう。これらを踏まえて、最終段階では実習先向けの履歴書の作成等を行こない実習先を決定する。また、実習先が決定した後は、必要がある場合、当該企業向けの専門知識の習得やスキルアップのための専門研修を行う場合もある。",
        "outcomesMeasuredBy": "本授業科目では、本学の「6つのラーニングアウトカムズ」のうち・実学に基づく専門能力・コミュニケーション能力・分析・評価能力の３つの能力の修得をめざし、より具体的には以下を到達目標とする。①自己の強み、弱み等を分析する。②実習の目標を設定する③ビジネスマナー（挨拶、報連相、応対）の基本を修得する。④ビジネススキル（コンプライアンス、段取り力、コミュニケーション力、リスク分析力）の基本を修得する。⑤実習の実行計画を作成する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力分析・評価能力",
        "teachingMethod": "講義により自己分析や企業研究の手法、ビジネスマナー、ビジネススキル（コンプライアンス、段取り力、コミュニケーション力、リスク分析力、目標設定、実習計画作成）について学ぶとともに、本授業中に実習先をマッチングするために必要なエントリーシートをカウンセラーによる面談等を行いつつ、それぞれが完成させる。実習先の決定後は、実習先企業の研究を行い、コーオプ実習に向けての事前準備に万全を期すこととする。",
        "notices": "授業中渡される各種ツール（書類）は自分で適切にファイルし、毎回忘れないで授業に持ってくること。これを忘れると授業の進行上、致命的な支障が生じることがあるので、忘れないよう十分注意すること。提出物が成績評価のベースとなるので提出を忘れないよう十分注意すること。",
        "preparatoryStudy": "今後のコーオプ実習に必要な様々なスキルをしっかりと習得する必要がある。演習に望むにあたって、配布された各種ツールの該当箇所を事前に確認しておくこと。(60分程度)復習として、演習の成果物を見直してブラッシュアップするとともに、演習で与えられた課題に取り組むこと。(60分程度)",
        "gradingGuidelines": "提出される以下のレポートの提出状況と内容及び授業の状況を評価し、非常に優れている場合はS、優れている場合はA、A未満であるがCの水準を超える場合はB、合格水準に達し且つB未満の場合をCとする。自己分析及びコーオプ実習目標設定、コーオプ実習のためのエントリーシート、企業研究シートの提出物、講義において必要に応じて課すレポート",
        "textbook": "特になし。",
        "referenceMaterials": "",
        "courseSchedule": "第１回：オリエンテーション第２回：マナー講座とコミュニケーション第３回：自己分析と目標設定第４回：自己分析と目標設定第５回：自己分析と目標設定第６回：自己分析と目標設定第７回：マナー講座とコミュニケーション第８回：コンプライアンスとリスク管理第９回：段取り力第10回：段取り力と実行計画第11回：実行計画講座第12回：実行計画講座第13回：サステイナブルについて第14回：実習先企業研究但し、2～14回目のコマについては都合により多少前後することがある。",
        "courseDataUpdatedAt": "2025/01/07"
    },
    "updateAt": "2025/03/21"
}