{
    "lectureCode": "K000906",
    "courseName": "地域連携課題[2Q][化]",
    "lecturer": [
        "森本樹(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3",
        "月4",
        "月5",
        "水"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "講義実験棟２０１",
        "講義実験棟２０２"
    ],
    "courceDetails": {
        "courseOverview": "地域連携課題では、地域社会と学生との交流の重要性に鑑み、学生が地域の関係者と連携しながら地域・社会的な課題等に取り組む。具体的には、学生が自ら主体的に地域から課題を選定するが、その調査・分析等はグループ（5名前後）に分かれて異なる視点や手法で行い、それらの結果を比較検討することによってさらに課題への理解を深める。その成果は発表会などを通じて共有し、相互に評価することで切磋琢磨する。",
        "outcomesMeasuredBy": "将来の就業に向けて、コーオプ演習Ⅰで培った能力をさらに実戦的なレベルに高めること①課題の発見・設定力：（改善への）気付きへの感度を上げる。②課題の分析力：課題に対してその分析の切り口（視点）を見つける。③課題に対する考察力：分析の結果から一定の方向性、結論を見出す。④上記一連の結果のとりまとめ力：考察した内容を説明のために分かりやすく整理する。⑤プレゼン力：取りまとめた内容を伝える力を養う。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "グループワークを中心に演習を進める。地域自治体の担当者等を講師に招いて地域が抱える各種の課題を学んだ後、各自で関心事項について提出し合い、それらについて意見交換し、グループで取り組めそうな課題に収束させて課題設定を行う。次に、グループ内で役割分担を決めてフィールドワークによって必要な調査・分析を進める。その過程で必要なそれぞれの調査・分析の進捗状況の確認や必要な情報・データの共有は各自が適宜PCを活用して行う。従って、授業においては各自が必要な情報やデータを全て共有しているとの前提でグループ討議を効率的に行い、設定した課題に対して理路整然とした一定の方向性又は結論を出す。最終的には、その討議結果を適切に整理してまとめ、分かりやすいプレゼンテーション資料として仕上げることとする。また、各自のグループワークへの貢献度を評価するため、原則毎回、①授業日毎の課題又は目標、②グループワークの具体的内容、③その結果又は成果、及び④各自の貢献内容等をリポートとして課すこととする。本授業の中心はグループワークであるため、グループメンバー間で必要な情報・データなどの共有が容易に行える必要があり、ノートPCは必携とする。",
        "notices": "本授業はフィールドワークによる現場感覚を重視しており、積極的に地域と関わろうとする姿勢が非常に重要である。また、本授業の目的は課題の気付き・解決能力の向上であるので、課題の設定おいては、必ずしも正解があるわけではない、また現時点では結論のわからない課題を設定することで構わないし、むしろその方が好ましい。その意味で、安易な方向（結論が見え透いているなど）に走り、真に興味のない課題設定は行なわないこと。※新型コロナウィルス感染拡大の状況により、実施形態（フィールドワーク、インタビューなど対面で行う必要のある取り組み等）が変更になる場合があります。",
        "preparatoryStudy": "地元八王子市の『八王子市まち・ひと・しごと創生総合戦略』には地域の課題や目標が詳細に記述されているので、ホームページなどで事前に十分に熟読しておくこと。授業前に次回のグループワークの内容を確認し、個人として行う作業内容も予習しておく。また授業後には、グループおよび個人の作業内容・進捗を整理し、次回の作業を効率化できるように、問題・課題も把握しておく。",
        "gradingGuidelines": "成績評価は基本的に①プレゼンテーションの質（50%）及び②授業日毎に課されるリポートで確認された各自の貢献度（50%）により行う。①プレゼンテーションの質については、プレゼンテーションの内容の質により以下の基準（S,A,B,C）で成績評価を行う。S:結論に至る全体の論理性、調査・分析内容、表現力の全てにおいて特に優秀であるA：B＋表現力においても優れていると認められる。B：C+調査・分析において評価に値する独自の視点、緻密さ、労力などが認められる。C：プレゼン内容が、設定した課題に対して理路整然と一定の方向性や結論が示されている。②各自の貢献度については、毎回課されるリポートで確認された各自の貢献度により以下の基準で成績評価を行う。S：全授業を通じて結果又は成果に対して、常に本質的かつ優れた貢献を行ったと認められる。A：同じく、常に本質的な貢献を行い、かつ時々優れた貢献も行ったと認められる。B：同じく、常に本質的な貢献を行ったと認められる。C：常に何らかの貢献を行ったと認められる。",
        "textbook": "特になし",
        "referenceMaterials": "書籍ではないが，下記Web，各種データベースが参考となる・八王子市広報関連八王子ビジョン2022概要「八王子市まち・ひと・しごと創成総合戦略」http://www.city.hachioji.tokyo.jp/shisei/001/001/001/001/p007376.html市統計http://www.city.hachioji.tokyo.jp/shisei/002/006/aq0087/p005942.html・東京都総務局統計http://www.toukei.metro.tokyo.jp/homepage/bunya.htm・政府統計データベースe-stathttps://www.e-stat.go.jp/SG1/estat/eStatTopPortal.do",
        "courseSchedule": "第1回：導入ガイダンス，ブレーンストーミング・KJ法の復習，各種資料検索法第2回：課題設定へのアプローチ①八王子市の特徴調査第3回：課題設定へのアプローチ②八王子市が直面している問題調査，外部有識者による講演第4回：課題設定へのアプローチ③八王子市が直面している問題調査第5回：課題決定，アプローチ技法①グループ別課題へのアプローチ詳細検討①第6回：アプローチ技法②グループ別課題へのアプローチ詳細検討②第7回：文献調査又はフィールド調査、有識者インタビュー①第8回：文献調査又はフィールド調査、有識者インタビュー②第9回：文献調査又はフィールド調査、有識者インタビュー③第10回：プレ発表第11回：文献調査又はフィールド調査、有識者インタビュー④，プレゼンテーション準備①第12回：プレゼンテーション準備②第13回：成果発表会第14回：成果取りまとめ：提案書作成①全ての回を通じて、森本が担当する。",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/09/13"
}