{
    "lectureCode": "K70041",
    "courseName": "サステイナブル化学概論",
    "lecturer": [
        "須磨岡淳(工学部応用化学科)",
        "山下俊(工学部応用化学科)",
        "江頭靖幸(工学部応用化学科)",
        "西尾和之(工学部応用化学科)",
        "森本樹(工学部応用化学科)",
        "上野聡(工学部応用化学科)",
        "原賢二(工学部応用化学科)",
        "片桐利真(工学部応用化学科)",
        "入谷康平(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ２０２"
    ],
    "courceDetails": {
        "courseOverview": "これからの社会において、環境や社会と調和しながら工学的な価値を創造するサステイナブル工学が重要になる。その中においてサステイナブル化学は、様々なデバイスを生み出す鍵となる材料を生み出すという点で重要な役割を担っている。本科目では、有機化学、無機化学、物理化学をはじめとした様々な角度から、サステイナブル社会の実現に貢献する化学（サステイナブル化学）について理解を深めるとともに、最先端の化学研究の実情について学ぶことができる。",
        "outcomesMeasuredBy": "本科目を履修することで、サステイナブル化学とは何かを説明することができる。また、これからの社会におけるサステイナブル化学の重要性を説明することができる。",
        "learningOutcomes": "実学に基づく専門能力",
        "teachingMethod": "応用化学科の各教員が専門分野に関連したテーマを題材として、オムニバス形式で講義する。講義は、板書とプロジェクターを併用し、講義毎に理解度チェックの実施や課題の提出を行う。",
        "notices": "各教員が自らの専門分野と関連するサステイナブル化学の研究例をオムニバス形式で解説するため、テーマによってはかなり専門的な内容となる場合があります。講義でよく理解できないところは、担当教員に積極的に質問するなどして、理解を深めて下さい。ノートPC必携。",
        "preparatoryStudy": "新聞・テレビニュース・インターネットなどを通じて、日頃から環境問題・エネルギー問題をはじめとした時事問題に関心を持っておくこと。また、予習として、担当する教員の研究内容について、ホームページなどで事前に調べてから講義に望むこと。復習として、講義で出された課題に対してレポートを作成すること。",
        "gradingGuidelines": "講義毎に課す理解度チェック（20％）およびレポート課題（80％）により評価する。課題に対するフィードバックは、必要に応じてMoodleを通じて行う。",
        "textbook": "指定しない。",
        "referenceMaterials": "各教員による講義の際に紹介する。",
        "courseSchedule": "第1回：ガイダンス（須磨岡担当）第2回：生物化学とサステイナブル化学との関係（須磨岡担当）第3回：有機合成化学とサステイナブル化学の関連（上野・須磨岡両教員担当）第4回：金属表面化学とサステイナブル化学との関連（西尾・須磨岡両教員担当）第5回：有機分子設計学とサステイナブル化学との関連（片桐・須磨岡両教員担当）第6回：化学工学とサステイナブル化学との関連（江頭・須磨岡両教員担当）第7回：触媒化学とサステイナブル化学との関連（原・須磨岡両教員担当）第8回：光機能錯体化学とサステイナブル化学との関連（森本・須磨岡両教員担当）第9回：高分子・光機能材料学とサステイナブル化学との関連（山下・須磨岡両教員担当）第10回：ナノ化学とサステイナブル化学との関連（藤田・須磨岡両教員担当）第11回：超分子化学とサステイナブル化学との関係（入谷・須磨岡両教員担当）第12回：公的プロジェクトにおける化学研究（外部講師・須磨岡担当）第13回：企業での化学研究（外部講師・須磨岡担当）第14回：大学や大学院での研究活動（サステイナブル工学研究会とリンクして実施する）",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/08/07"
}