{
    "lectureCode": "K70111",
    "courseName": "工学基礎実験I(C)[2023年以前入学者]",
    "lecturer": [
        "須磨岡淳(工学部応用化学科)",
        "藤田隆史(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金3",
        "金4"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "本実験科目は、後期に開講される工学基礎実験Ⅱから卒研課題Ⅱに至る一連の実験の基礎となるものである。実験に対する心構えや安全対策とともに、化学実験を行う際に必須である基礎知識・基礎技術を修得することを目的としている。この科目を通じて、実験を進めるための心得・態度を身につけ、基本的な化学器具や分析装置の取扱いを体得することができる。また、実験レポートを作成することにより、結果のまとめ方・データの解析方法を学修することができる。さらに、レポート発表会を開催し、発表や討論を行う技術を身につけることができる。",
        "outcomesMeasuredBy": "実験に望むための基礎的な知識を学び、基本的な化学実験操作ができるようになる。また、グループで取り組む実験を通じて、コミュニケーションを取ることの重要さを学ぶことができる。さらに、得られた結果を論理的に分析・評価し、実験レポートを作成することができるようになる。具体的には、以下のことができるようになる。・実験を安全に進めるための心得・態度を身につけることができる。・基本的な化学実験器具を使用することができる。・使用する分析装置の測定原理を理解し、装置を使用できる。・実験指示書に従い自ら実験計画を立案し（グループ実験においてはグループで協力して実験計画を立案し）、実験を進めることができる。・実験操作、得られたデータ・結果を記録することができる。・定められた形式でのレポートを作成することができる。・実験内容や得られた結果を第三者に説明することができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "数回に分けて実験に関する講義を行う。講義では、それぞれの実験内容の基礎を解説する。実験は、各自または数人のグループで行うが、レポートは各自それぞれで作成し、期限内に提出する。記述が不充分なレポートは返却するので、改訂後、再度提出する必要がある。また、レポートの内容に関して、講義の回の際に解説するとともに、学生が登壇する発表会を実施し、学生自らの主体的な学び（アクティブラーニング）を促す。さらに、数回に一度、実験内容やレポートに関わる理解度チェックを実施する。ノートPC必携。",
        "notices": "安全に実験を行い、技術を確実に習得するために、充分な予習と実験ノートへの準備を行った上で実験に臨むこと。実験室では、保護メガネ・白衣を着用すること。実験中は、行った操作、得られた結果、観察したこと、考えたことを正確かつ明解に実験ノートに記録する。実験後の発表資料およびレポートの作成では、より優れた報告になるように常に心がける。",
        "preparatoryStudy": "事前にテキストの該当する部分を熟読し、関連事項について必ず予習しておく必要がある。また、予習の結果に基づいて、実験ノートに実験の流れをフローチャート形式でまとめておくこと。実験を始める前に、予習ノートのチェックを行う。予習状況が十分でないと判断されたものは、実験に参加できない。また、実験終了後は速やかにレポートを作成し、決められた期日に提出すること。",
        "gradingGuidelines": "成績評価は、実験レポートおよび理解度チェック80%、予習ノートや実験への取り組みなど20%として、総合的に判断する。評価の詳細については、ガイダンス時に説明する。内容に不備があるレポートについては、再提出が必要である。レポート等に関するフィードバックは、レポート解説やレポート修正の時間に行う（授業計画参照）。",
        "textbook": "学科で作成した基礎工学実験Ⅰのテキストを用いる。",
        "referenceMaterials": "各実験テーマごとに、テキストに記載してあるので参照すること。",
        "courseSchedule": "第1回：ガイダンス（実験上の注意、成績評価の方法、実験ノート・レポートの書き方）、第2回および第3回（実験1～実験2）の説明第2回：基礎技術ガラス体積計および電子天秤の使い方と測定値の取扱い（実験1）第3回：ガラス細工ガラスの特性の理解と基礎的なガラス細工技術（実験2）第4回：実験1～2の内容に関する発表会・解説および理解度チェックと第5回～第6回（実験3～実験4）に関する講義、レポート（実験1～2）の修正第5回：ペーパークロマトグラフィー金属イオンの分析と反応（実験3）第6回：アボガドロ定数とモル質量水面上に形成した単分子膜の面積から（実験4）第7回：実験3～4に関する発表会・解説および理解度チェックとレポート（実験1～４）の修正第8回：第9回～12回（実験5～実験8）に関する講義とレポート（実験1～４）の修正第9回：反応熱の測定中和熱の測定と実験結果に対する反応スケールの影響の理解（実験5）第10回：中和滴定容量分析の基本操作と概念の理解（実験6）第11回：凝固点降下による分子量測定ラスト法による分子量測定の原理の理解（実験7）第12回：緩衝溶液緩衝溶液の調製と緩衝作用の理解（実験8）第13回：実験5～8に関する発表会・解説および理解度チェック、レポート（実験5～実験8）の修正第14回：レポート（実験5～実験8）の修正（すべての回を通じて、須磨岡・藤田が担当する）",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/09/13"
}