{
    "lectureCode": "K701401",
    "courseName": "有機化学II[2023年以前入学者]",
    "lecturer": [
        "須磨岡淳(工学部応用化学科)",
        "片桐利真(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "サステイナブル工学において、サステイナブル化学は、材料やそれを用いたデバイスを生み出すという重要な役割を担っている。材料の中には有機化合物で構成されている物も多く、現在も様々な有機化合物の開発が行なわれている。有機化合物は炭素を骨格とする分子であり、有機化学ではそれらの有機化合物の構造の特徴、合成方法、反応性を学ぶ。有機化学Iに引き続き有機化学IIを学修することで、基本的な有機化合物の構造と反応性を暗記ではなく、理解する知識・能力が身につく。本講義では講師の企業（日本鉱業株式会社，現JXTGホールディングス）での防衛特許作成のための実務経験を元に有機化学を講義する実践的科目である。防衛特許の作成は網羅的・体系的でなければならない。そのためには、場当たり的な反応に関する個別の情報や記憶に頼る有機化学ではなく、有機化合物や反応を博物学的に分類する高次の原理や思想の理解を必要とする。本講義では、有機化学の基本原理を基礎的かつ体系的に解説し、それを個々の有機化学反応や事象例と対応させることにより、有機化学分野を俯瞰するだけではなく、その成り立ちの理解に至る。これは、単に有機化学分野だけではなく、博物学的（各論）分野で、個々の技術をどのようにとらえれば、網羅・体系化できるかの哲学（philosophy）である。すなわち、実践的な有機化学を通して、企業での高いレベルの研究に必要な科学技術哲学の獲得を目指す。",
        "outcomesMeasuredBy": "本科目（および有機化学I）を修得することで、基本的な有機化合物の構造と反応性を学んで以下のことができるようになる【実学に基づく専門能力・論理的な思考力・有機化学の基礎力と化学的思考力】。・芳香族性が説明でき、芳香族求電子置換反応や芳香族求核反応が説明できる。・アルコールとフェノールの合成や反応を説明できる。・エーテルとエポキシド、チオールとスルフィドの合成と反応を説明できる。・アルデヒドとケトンの付加反応について説明ができる。・カルボン酸とニトリルの性質にして説明ができる。・求核アシル置換反応について説明ができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "授業は黒板とプロジェクターを併用し、基本的に教科書に沿って進め（教科書とMoodleの資料を用いて予習を十分に行い授業に臨むこと）、必要に応じて理解度チェックを行なう。各講義では、質問に対する回答や理解度チェックの問題の解説なども実施する。また、Moodle上の資料を用いた解説やMoodle上での簡単なクイズを行うことがあるので、ノートPCは必携とする。",
        "notices": "化学基礎、化学基礎演習、有機化学Iを履修し、内容を理解しておくことが望ましい。",
        "preparatoryStudy": "予習として、教科書の該当部分およびMoodle上の資料をあらかじめよく読み、理解できなかった部分についてはメール等の指定された方法で質問すること。復習として、教科書の指定した問題（復習課題）や配布された復習課題を解き、指定された期日までに提出する。",
        "gradingGuidelines": "理解度チェックおよび復習課題（40%）、期末試験（有機化学IIの全範囲、60%）から、総合的に成績を評価する。期末試験のフィードバックについては、Moodleを通じて行なう。",
        "textbook": "マクマリー有機化学（中）第９版東京化学同人",
        "referenceMaterials": "OrganicChemistry9thEditionJohnE.McMurry「有機化学（第2版）」奥山格（丸善）「ソロモンの新有機化学第11版」T.W.GrahamSolomons,CraigB.Fryhle（廣川書店）「ボルハルト・ショアー現代有機化学第8版」K.P.C.Vollhardt（化学同人）",
        "courseSchedule": "第１回：ベンゼンの化学（ベンゼンと芳香族性、その反応性：芳香族求電子置換反応、置換基効果、ハメット則）（片桐）第２回：ベンゼンの化学（承前、置換基効果、反応の位置選択性）（片桐）第３回：ベンゼンの化学（承前、芳香族求核置換、芳香族の酸化・還元）（片桐）第４回：アルコールとフェノール（片桐）第５回：エーテル（片桐）第６回：エポキシド、チオールとスルフィド（片桐）第７回：まとめと中間チェック（片桐）第8回：カルボニル基の性質とカルボニル化合物の一般的な反応（須磨岡）第9回：アルデヒドとケトン：求核付加反応（1）（須磨岡）第10回：アルデヒドとケトン：求核付加反応（2）（須磨岡）第11回：カルボン酸とニトリル（1）（須磨岡）第12回：カルボン酸とニトリル（2）（須磨岡）第13回：カルボン酸誘導体：求核アシル置換反応（1）（須磨岡）第14回：カルボン酸誘導体：求核アシル置換反応（2）（須磨岡）",
        "courseDataUpdatedAt": "2024/03/27"
    },
    "updateAt": "2024/08/07"
}