{
    "lectureCode": "K701201",
    "courseName": "工学基礎実験II(C)[2023年以前入学者]",
    "lecturer": [
        "原賢二(工学部応用化学科)",
        "江頭靖幸(工学部応用化学科)",
        "橋本徹(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金3",
        "金4"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "工学基礎実験Ⅰに引き続き、専門的な化学実験を行うために必要な基礎的実験技術を習得する。実験ガイダンス、実験講義、工学基礎実験の発展的テーマの遂行に必要な基礎技術の講習を行う。具体的な実験テーマとして、蒸留、初歩的な有機合成・高分子合成、滴定による飲料水の分析、吸光光度分析と反応速度解析、無機イオン・有機化合物の系統分析、英語で表示される分子モデリングソフトを活用した実習を行う。これらの毎回の実験結果をレポートにまとめる能力が身につく。また、レポート検討会を行い、教員からの講評と学生相互の発表･討論を実施することにより、実験結果に基づいた発表や議論を行う能力が身につく。さらに、英語による化学実験の表現に関する知識が身につく。",
        "outcomesMeasuredBy": "本科目を修得することで、専門的な化学実験に必要な基礎的な知識や実験技術を習得し、実学に基づいた基礎的な化学実験を遂行できるようになる【問題解決力】。また、実験結果をまとめる能力や実験に関する発表・議論を行う能力や英語による化学実験の表現に関する知識を身につける【コミュニケーション能力、論理的な思考力、分析・評価能力、国際的な教養】。具体的には、以下のことができるようになる。１）基礎的な化学実験の遂行に必要な操作を実施できる。２）実験結果が意味することや関連することについて考察することができる。３）実験結果をレポートにまとめることができる。４）実験結果に基づいた発表、議論を行えるようになる。５）化学実験に関する英語による表現を理解できるようになる。",
        "learningOutcomes": "国際的な教養コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "実験は全体をグループに分け、異なるテーマの実験をローテーションしながら全てのテーマを行う。各グループはさらに2-4人の班に分かれ、班単位で実験(グループワーク)を行う。毎回の実験結果をレポートにまとめて提出する。また、学期中にレポート検討会を2回行い、教員からの講評、学生相互の討論を通じて、実験内容の理解を深め、実験結果のまとめ、優れたレポートの作成などの参考にする。これにより、学生自らの主体的な学び(アクティブラーニング)を促す。ノートPCを一部の実験テーマに使用する。",
        "notices": "安全に実験を行い、技術を確実に習得するために、充分な予習と実験ノートへの準備を行った上で実験に臨むこと。実験中は、行った操作、得られた結果、観察したこと、考えたことを正確かつ明解に実験ノートに記録する。実験後には、実験内容に関するレポートを作成する。優れた報告になるように常に心がける。",
        "preparatoryStudy": "実験テキストに記載された内容を予め充分に確認し、実験ノートに実験の流れをフローチャート形式で事前にまとめておく。各操作の意味や注意すべき点を予め充分に把握しておく。実験後には、実験内容に関するレポートを作成して提出する。",
        "gradingGuidelines": "成績評価は、実験レポート70%、予習ノート、実験への取り組み、実験後の発表・ディスカッションへの取り組みなどを30%として、総合的に判断する。なお、実験レポートの評価はMoodle等で公開するルーブリックに基づいて行い、２回行うレポート検討会で教員からの講評としてフィードバックを行う。",
        "textbook": "実験テキストを別途配布する。",
        "referenceMaterials": "図書館所蔵の化学実験に関する書籍・参考書（電子図書の『化学書資料館』を含む）",
        "courseSchedule": "第1回:実験ガイダンス、実験講義（全教員）全体の実験に共通する実験ノートの記載法の教授や安全教育、第2～6回の実験に関する講義を行う第2回:蒸留（全教員）基礎的な分離技術の一例として蒸留の分離性能を評価する第3回:エステル合成（全教員）香りの異なる種々のエステル化合物を合成する第4回:分子モデリング（全教員）各自のPC上で分子モデリングソフトを利用することにより、様々な化学現象や物性を視覚的に理解する第5回:高分子合成（全教員）高分子（ポリマー）の合成を行う第6回:無機イオンの系統分析（全教員）無機イオンの混合物を分離して分析する技術を習得する第7回:実験講義（全教員）第8～9,11～13回の実験に関する講義を行う第8回:飲料水の硬度測定（全教員）指示薬を用いたキレート滴定により種々の飲料水の硬度を測定する第9回:吸光光度分析と反応速度(1)（全教員）吸光光度分析法により反応速度に関する実験データを取得する第10回:レポート検討会(1)（全教員）第2回～6回の実験レポートについて教員からの講評、学生の発表･討論を行う（全教員）第11回:吸光光度分析と反応速度(2)（全教員）取得した実験データに基づいて反応速度解析を行う第12回:有機化合物の系統分離・分析(1)（全教員）未知の有機化合物の混合物を系統的に分離する技術を習得する第13回:有機化合物の系統分離・分析(2)（全教員）分離した有機化合物を各種分析データに基づいて同定する技術を習得する第14回:レポート検討会(2)（全教員）第8～9,11～13回の実験レポートについて教員からの講評、学生の発表･討論を行う（全教員）",
        "courseDataUpdatedAt": "2024/01/10"
    },
    "updateAt": "2024/08/07"
}