{
    "lectureCode": "K701901",
    "courseName": "高分子化学",
    "lecturer": [
        "山下俊(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "高分子は、金属、セラミックスと並ぶ3大材料の一つで身の回りで多く用いられているなじみ深いものであるが、通常の分子（＝低分子）とは全く異なった物性や反応性を示す。本講義では、高分子性に由来する高分子の特徴を理解することを目的に、高分子の合成、物性、および機能の3つの視点から高分子化学の基礎を学び、高分子の基本的な物性、合成法、応用についての知識と応用力が身に付く。",
        "outcomesMeasuredBy": "高分子の物性を理解し、定量的な計算や論理的な法則の誘導ができるようになる【論理的な思考力】。高分子の構造やそれに基づく機能が分かるようになる【分析・評価能力】。高分子の合成、機能、材料設計が分かるようになる【実学に基づく専門能力】。具体的には以下の能力を身に着ける。1)高分子合成：ラジカル重合、アニオン重合、カチオン重合のメカニズムと化学反応の特徴を説明でき、その反応速度論、分子量が計算できる。2)高分子物性：高分子の慣性半径、有効結合長、粘弾性などの高分子物性と、高分子溶液、高分子固体の緩和、力学物性を説明でき、鎖の広がり、緩和、相溶性の計算ができる。3)高分子機能：感光性樹脂、吸水性樹脂、圧電性樹脂、導電性樹脂、透明樹脂、耐熱性樹脂などの高分子を用いた種々の機能材料の構造と機能の相関およびその合成法を説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "授業はパワーポイントを用い、対面で行う。講義資料およびクイズはmoodleにアップロードしてある。講義に関するクイズを行うことにより、講義の理解度を確認する。講義内容に関連したレポートを提出する。発展学習などの内容に応じて、適宜、オンデマンド講義を行うことがある。インタラクティブな作業のためノートＰＣを持参してください。講義内容を聞いて、要点を冊子体あるいは電子媒体のノートにメモを取るようにしてください。",
        "notices": "講義中に不明な点は講義時間内に質問して解決すると確実な理解を得る助けとなる。",
        "preparatoryStudy": "参考書の各回の講義に該当する箇所にあらかじめ目を通し、内容を把握した上で講義に出席すること。講義終了後、ノートを読み返し、復習課題を解く。また、講義内容に関連したレポートが課された場合には、レポートを作成する。理解度確認のクイズやレポートを期日までに提出する。",
        "gradingGuidelines": "理解度チェック（８０％）、レポート（２０%）各授業の際のクイズおよび総合復習において理解度チェックを行う。",
        "textbook": "西敏夫、讃井浩平、東千秋、高田十志和著「高分子化学」（裳華房）ISBN978-4-7853-3227-3",
        "referenceMaterials": "東信行、松本章一、西野孝著「高分子科学」（講談社）ISBN978-4-06-156810-5",
        "courseSchedule": "第1回：高分の化学構造：構造の多様性、高分子の構造、分子量、状態の多様性を学ぶ。高分子の応用について全体を俯瞰する。第2回：高分子合成のための有機化学反応：合成反応の基礎を再確認する。第3回：逐次反応：縮合重合・重付加：縮合反応・重付加の例を学ぶ。第4回：逐次反応の速度論：逐次反応の速度と得られる樹脂の物性を学ぶ第5回：連鎖重合：ラジカル重合の機構、速度論を学ぶ第6回：ラジカル共重合：ラジカル共重合におけるAlfrey&Priceの式を理解し、共重合体の特性を学ぶ。第7回：総合復習：重合反応のまとめと理解度チェック、内容の再確認を行う。第8回：イオン重合：イオン重合の機構とモノマーと開始剤の条件を学ぶ。第9回：高分子反応：高分子の反応による官能基化等の反応例、架橋反応の理論を学ぶ。第10回：高分子物性：一本鎖高分子のコンフォーメーションの多様性、慣性半径、スケーリング則を学ぶ。第11回：高分子物性２：高分子の運動性と緩和挙動を学ぶ。第12回：高分子機能材料：機能性高分子、自己修復性高分子、感光性高分子、などの高分子の応用例を学ぶ。第13回：高分子機能材料２：高分子の耐熱性、力学物性、バイオ高分子の構造と応用例を学ぶ。第14回：総合復習：高分子化学全体の理解度チェックを行い、全体の総復習を行う。",
        "courseDataUpdatedAt": "2024/02/05"
    },
    "updateAt": "2024/08/07"
}