{
    "lectureCode": "K702401",
    "courseName": "電気化学",
    "lecturer": [
        "西尾和之(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金4"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "電気化学は，電子の移動に基づく化学反応(酸化還元反応)を高度に制御するための学問である．電気化学は，電池に代表される様に電気エネルギーと化学エネルギー間のエネルギー変換を扱うことから，サステイナブル社会の実現に向けて不可欠の学問となっている．授業期間の前半では，高校の化学から物理化学へのスムーズな移行を含めて，電気化学の基礎を学ぶ．後半では，エネルギーデバイスをはじめとする実用例を含めて，具体的な電気化学反応について学ぶ．これらの学習を通して，酸化還元反応を電子の移動反応として理解する論理的な思考力，分析・評価能力が身につく．具体的には，電解液の物性，ギブズの自由エネルギー・エントロピー・エンタルピーと電極電位の関係，イオンの活量と電極電位の関係，各種電池の原理と特性を理解する論理的な思考力，分析・評価能力が身につく．講義担当者は，企業の研究開発部門に所属していた時に電気化学的な金属の表面処理に関する研究を行っており，その実務経験に基づいた電気化学の理論や技術を修得する実践的科目である．",
        "outcomesMeasuredBy": "電気化学の基礎を理解し，電気化学反応を電子の移動反応として考えることができる【実学に基づく専門能力，論理的な思考力，分析・評価能力】．具体的には，以下のことができる様になる．(1)電解液の導電率，活量，輸率を理解し，溶液中でのイオンの物性を分析・評価することができる．(2)電極電位と電極電位が変化する条件を理解し，酸化還元反応の自発性を論理的に考えることができる．(3)各種化学電池の原理，構成，特性の違いを理解することができる．",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "前回の授業の復習の後，講義内容を数項目に分けて[講義－演習－解説]の流れを基本として進める．電解液の物性と標準状態での電気化学(前半)，実際の状態での電気化学と電池等への実用例(後半)を，演習を取り入れながら学習していく．毎回の授業でノートPCは必携である．",
        "notices": "物理化学Ⅰ，物理化学Ⅱの単位を取得した上で履修する事が好ましい．",
        "preparatoryStudy": "高校の化学基礎および化学で学んだ電気分解，電池などの内容を復習し理解しておくこと．事前にmoodleに講義内容を掲示するので，予習しておくこと．毎回実施する演習では，疑問点を残さない様にする．復習時には演習問題を解き直し，知識の蓄積に努めること．各講義の演習や試験に対するフィードバックは，その都度moodleを通して行う．",
        "gradingGuidelines": "前半の到達度チェック(40%)，期末試験(40%)，演習(20%)で評価する.",
        "textbook": "指定しない．moodleに掲示する資料に従って講義を進める．",
        "referenceMaterials": "アトキンス物理化学(上)，(下)（東京化学同人）電気化学（丸善出版，渡辺正，金村聖志，益田秀樹，渡辺正義著）電池がわかる電気化学入門(オーム社，渡辺正，片山靖著)電子移動の化学（朝倉書店，渡辺正，中林誠一郎著）電気化学基礎と応用（東京化学同人，大坂武男，岡島武善，松本太，北村房男訳）",
        "courseSchedule": "第1回：電気化学とは，電気化学に関する身近な例第2回：電子伝導とイオン伝導，導電率第3回：イオンの輸率第4回：イオンの輸率の測定方法第5回：イオン化傾向と標準電極電位第6回：ギブズの自由エネルギーと電極電位の関係第7回：標準電極電位と起電力，溶解度との関係第8回：前半の講義のまとめと学習到達度の確認第9回：電極電位・起電力と活量の関係：ネルンストの式第10回：ネルンスト式にもとづく電池の起電力第11回：電極反応の速度と過電圧第12回：様々な電池の発電(充電)の原理と構成第13回：電池以外のエネルギーデバイス(キャパシタ)，電気化学センサ第14回：電気化学反応に基づく表面処理",
        "courseDataUpdatedAt": "2024/02/06"
    },
    "updateAt": "2024/08/07"
}