{
    "lectureCode": "K702601",
    "courseName": "量子化学",
    "lecturer": [
        "片桐利真(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "量子化学は、分子の世界・ナノの世界の現象を支配する量子力学をふまえて、分子内における電子のふるまいとその意味の理解を目指す。その目的で、(1)原子・分子の電子状態の記述、(2)化学現象への適用特に光を探針とした分子の理解、を意識して講義を行う。これまでの化学科目と同様に、量子化学では分子をエネルギーという尺度を用いて定量的に記述する。講義の内容としては、量子論がいかに組み立てられたか、から始める。そして、有機化学１の最後に習った共役系の電子の振る舞いや、線形代数で習ったヒュッケル分子軌道法から、分子軌道法とその計算の基礎を学ぶ。また、分子の種々の振る舞いと機器分析（分光学）との関わりについて講義をすすめる。本講義は教員の企業における医薬品開発・分子設計の実務経験に基づき、それに必用な量子化学のアイテムを取り上げ、講義する。実践的な科目である。そのため、量子力学や量子化学の美しい世界よりも、その使い方や意義に重点を置く。教科書と相補的であり、教科書での独修とあわせて量子化学の世界を俯瞰する。",
        "outcomesMeasuredBy": "基礎的な量子化学的な言葉を学ぶ。特に「波」ということばの理解を目指す。それを元に電子の振る舞いとその意味を正しく理解し、使えるようにする（【実学に基づく専門能力】）。また、エネルギーという尺度の持つ意味を理解し分子構造や分子の挙動との関係を理解する（【論理的な思考力】）。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "【授業形態：講義／演習】講義は板書およびpptによりすすめる。必要に応じてプリント、資料を配布する。また、講義時にミニッツペーパーを課し、その回の講義内容の理解の確認と復習を行う。最終レポートを課す。ノ-トPC必携、関数電卓必携です。",
        "notices": "１年の化学基礎、有機化学１、線形代数(C)の講義を履修しその内容を理解しておくこと。教科書による毎回の予習復習は必須である。",
        "preparatoryStudy": "復習として、演習問題とレポートを課す。これにより自分の理解できていない部分を明らかにし、補うこと。必要ならオフィスアワーに教員を尋ねること。あるいは学習支援センターを利用すること。講義開始前に、高校の『ベクトル』の概念を復讐しておくこと。また、MSエクセルの使用法について慣れておくこと。",
        "gradingGuidelines": "毎回課す課題やミニッツペーパーによる講義への参加状況（教室への出席状況ではない）と理解状況を６割、アチーブメント（理解度チェック）とレポート課題で４割、さらに必要に応じてノートチェックにより総合的に成績評価する。またミニッツペーパーなどの提出物については、その次回の講義にて講評を行い、個々には評価とコメントを記載して返却する。",
        "textbook": "教科書に応答する講義アイテム(pdf)はmoodleで配付する。",
        "referenceMaterials": "アトキンス「物理化学（上）」「物理化学（下）」、東京化学同人講義時にmoodleでリストを配布する。",
        "courseSchedule": "第1回:量子論の誕生、第2回:波動関数と軌道の形第3回:結合エネルギーの意味第4回:電気陰性度第5回:永年方程式第6回:計算化学第7回:ヒュッケル分子軌道法とESR（電子スピン共鳴分光）第8回:中間チェック第9回:分子間相互作用第10回:光と分子の相互作用第11回:NMR（核磁気共鳴分光）第12回:IR（赤外吸収スペクトル）第13回:Ｘ線とその利用第14回:量子化学で見る材料機能",
        "courseDataUpdatedAt": "2024/02/05"
    },
    "updateAt": "2024/09/13"
}