{
    "lectureCode": "K702901",
    "courseName": "有機合成化学",
    "lecturer": [
        "上野聡(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ２０１"
    ],
    "courceDetails": {
        "courseOverview": "本講義では、これまでに有機化学Iおよび有機化学II、生物化学、有機化学演習で学習した有機化学の基本的な知識を活かして、実用的な有機合成反応を系統的に理解し、複雑な分子を合成するための反応設計の考え方や合成戦略、スペクトル解析、反応分析法を学ぶ。赤外分光法や質量分析、核磁気共鳴法により複雑な化合物や混合物の構造決定を学ぶ。同じ分子でも様々な経路で合成することが可能であり、有機化合物の合成手法について学ぶことで、有機分子の合成戦略について考えるための知識が身につく。",
        "outcomesMeasuredBy": "様々な情報源を駆使して、簡単な有機分子から複雑な有機分子、これまでに誰も合成したことのない有機分子の合成方法を考案できる（実学に基づく専門能力）。逆合成の基本的な考え方を理解し、より良い合成経路を論理的に選択できる（論理的な思考力、分析・評価能力）。考案した合成経路について合成手法を調査して、必要な薬品の入手方法や反応手順、単離方法、分析方法を系統的に理解し、それらの要点を抑えた発表をできる（実学に基づく専門能力）。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業ではプロジェクターと板書を併用する。また、グループワークによる調査やグループ発表も行う。調査のため、ノートPC必携。",
        "notices": "事前に有機化学Iと有機化学II、生物化学、有機化学演習を履修しておくことが望ましい。",
        "preparatoryStudy": "毎回事前に配布する練習問題とその解答を参考にして、それらの解き方を勉強しておく。理解度チェックの解答を参考に理解度を各自で確認し、教科書の類題を解いて復習すること。",
        "gradingGuidelines": "発表・質疑（20%）グループワーク・レポート（30%）理解度チェック・期末試験（50%）",
        "textbook": "マクマリー有機化学（上）（中）（下）第9版（東京化学同人、JOHNMcMURRY著）",
        "referenceMaterials": "・化学新シリーズ有機合成化学（裳華房、太田博道、鈴木啓介共著）・逆合成のノウハウ有機合成の戦略（化学同人、C.L.ウィリス、M.ウィリス著、富岡清訳）・最新有機合成法（化学同人、G.S.ツヴァイフェル、M.H.ナンツ著、檜山爲次郎訳）",
        "courseSchedule": "第1回：スペクトルの基礎第2回：単純な脂肪族化合物の構造解析第3回：単純な芳香族化合物の構造解析第4回：スペクトルデータの推測第5回：混合物の構造解析第6回：内部標準法を用いた1HNMRによる含有量の見積り第7回：まとめ、理解度チェック第8回：逆合成解析の基礎第9回：単純な有機分子の逆合成解析：反応経路の立案、文献調査の方法第10回：複雑な分子の逆合成解析：反応経路の立案、実験手順の調査、分析方法の検討第11回：複雑な分子の逆合成解析：原料の入手経路の調査、精製方法の調査、反応収率の予測第12回：発表第13回：未知化合物の逆合成解析：反応経路の立案、実験手順の調査、分析方法の検討第14回：未知化合物の逆合成解析：原料の入手経路の調査、精製方法の調査、反応収率の予測",
        "courseDataUpdatedAt": "2024\/03\/27"
    },
    "updateAt": "2024\/09\/09"
}