{
    "lectureCode": "K702501",
    "courseName": "界面化学",
    "lecturer": [
        "西尾和之(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "界面化学は，物質の表面，異なる物質間の界面で生じる化学的･物理的な現象に関する学問である．特に，固体と液体，固体と気体の界面は化学反応が進行する場としてきわめて重要であり，界面の現象の理解が触媒化学，電気化学をはじめとする他の学問の深い理解へとつながる．授業期間の前半では，界面化学の基礎として固体と液体，特に固体表面と固体と液体の界面の現象について，日常で見られる毛管現象を含めて理論的に学んでいく．授業期間の後半では，吸着現象，固体表面での原子の操作，界面活性剤，コロイドとエマルション，固体の表面改質，接着特性など，界面の具体的な利用例を詳しく学ぶと共に，表面物性の評価方法，測定方法を学ぶ．これらの学習を通して，異なる物質が接する界面に関する論理的な思考力，分析・評価能力が身につく．具体的には，固体の物性と液体の物性の両面から界面の物性を理解する能力，それらの物性の評価・測定方法を理解し，それらの方法で得られた結果を解析する能力が身につく．講義担当者は，企業の研究開発部門に所属していた時に固体表面の親水性・疎水性(親油性)制御に関する研究を行っており，その実務経験に基づいた表面の制御技術や評価手法を修得する実践的科目である．",
        "outcomesMeasuredBy": "表面および界面に関する様々な化学的・物理的な現象を理解し，これらを駆使して実際の界面の状態を推測することができる【実学に基づく専門能力，論理的な思考力，分析・評価能力】．具体的には，以下のことができる様になる．(1)固体表面および固体-液体，固体-気体界面の化学的・物理的性質を理解し，日常で見られる現象も論理的に説明することができる．(2)表面改質の種類と手法を理解し，接着および剥離界面などの設計をすることができる．(3)固体表面の評価・測定方法を理解し，求める物性に応じて手法を決定することができる．",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "前回の授業の復習の後，講義内容を数項目に分けて[講義－演習－解説]の流れを基本として進める．界面化学の基礎となる物理化学と日常で見られる現象との関連(前半)，固体表面で原子1個を操作するための必要条件，界面活性剤，コロイド・エマルション，固体の表面改質と接着剤，表面分析・評価方法(後半)を、演習を取り入れながら学習していく．毎回の授業でノートPCは必携である．",
        "notices": "物理化学Ⅰ，物理化学Ⅱの単位を修得した上で履修する事が望ましい．",
        "preparatoryStudy": "事前にmoodleに講義内容を掲示するので，予習しておくこと．毎回実施する演習では，疑問点を残さない様にする．復習時には演習問題を解き直し，知識の蓄積に努めること．各講義の演習や試験に対するフィードバックは，その都度moodleを通して行う．以下の参考書に記載の「界面化学」を購入して予習・復習に役立てる事が好ましい．",
        "gradingGuidelines": "前半の到達度チェック(40%)，期末試験(40%)，演習(20%)で評価する.",
        "textbook": "指定しない．moodleに掲示する資料に従って講義を進める．",
        "referenceMaterials": "界面化学（丸善，近澤正敏，田嶋和夫著）アトキンス物理化学(上)，(下)（東京化学同人）接着の基礎と理論，(三刀基郷，日刊工業新聞）",
        "courseSchedule": "第1回：表面化学とは，表面化学に関する身近な例第2回：液体・固体の表面第3回：表面張力，表面自由エネルギー第4回：表面自由エネルギーと表面・界面張力の測定方法第5回：固体表面の濡れと接触角第6回：表面の制御と親水性，疎水性第7回：毛管現象とヤングラブラス式，水の接着力第8回：前半の講義のまとめと学習到達度の確認第9回：物理吸着と吸着現象第10回：化学吸着，単分子膜，Langmuir-Brodgett膜第11回：原子の任意操作第12回：原子1個の操作に必要な技術：STM，界面活性剤の基本第13回：界面活性剤とエマルション第14回：表面改質と接着",
        "courseDataUpdatedAt": "2024/02/05"
    },
    "updateAt": "2024/08/07"
}