{
    "lectureCode": "K702001",
    "courseName": "化学工学",
    "lecturer": [
        "江頭靖幸(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "化学工学は化学物質を生産する装置（化学プラント、化学プロセス）の設計を目的として発展した工学であるが、その方法論は現在では化学反応を含むいろいろな現象の理解と制御のために用いられている。この授業では主に化学プラントの設計に適用される化学工学の考え方を習得することを目指す。化学工学の基礎として、化学反応や物質移動、相分離を伴うシステムを対象として、適切な境界を設定した上で物質収支、エネルギー収支を把握する手法を身につける。また、化学プラントに用いられる各種装置や反応器を実例として、目的に応じてシステムを改善･改革してゆく手法を習得する。",
        "outcomesMeasuredBy": "本科目を修得することで、化学工学を基盤にした実学に基づく専門能力と化学工学的考察に基づく問題解決力を身につけることを目指す。具体的には、以下のことができるようになる。【論理的な思考力、実学に基づく専門能力】(1)化学反応や物質移動、相分離を伴うシステムを対象として、物質収支、エネルギー収支を理解し、数式として記述できる。(2)物質、エネルギーの移動現象を理解し、数式で表現できる。(3)化学プラントで使用されている各種反応器の特徴を反応速度、移動現象、エネルギーの観点から説明できる。(4)化学プラントで使用されている分離技術について、その原理と設計手法を説明できる。(5)現代の化学プラントの設計思想と化学工学の役割を説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "授業では教員による講義とその内容に対する理解度チェック、また、授業内容によっては理解を深めるためのＰＣを利用した計算を含んだ演習を行う。したがってノートＰＣは必携である。",
        "notices": "授業に際して教科書は必須である。授業を漫然と聴講するのではなく、どの様な問題が存在し、その問題をどの様に解決しているか、を意識しながら聴講すること。必ず復習すること。",
        "preparatoryStudy": "授業の前提として化学の基礎、数学の知識が必要である。具体的には、化学式から化学反応の原料と生成物の量的関係を理解し、発熱量(吸熱量）が計算できるようになっていること。微積分の概念を理解しておくこと。また、授業の前には教科書の該当部分に目を通し、理解できる部分とできない部分をはっきりさせておくこと。授業終了後に確認し、まだ理解できない点があれば問題点を整理したうえで質問にくること。",
        "gradingGuidelines": "各回に行う理解度チェック（30%）および数回の講義ごとに行う演習（20%）ならびに期末試験の成績（50%）により評価する。(授業中に理解度チェック、演習のフィードバックを行うが、moodle経由でも問い合わせを受け付ける。）",
        "textbook": "上ノ山周相原雅彦岡野泰則馬越大佐藤智司著「新版化学工学の基礎」朝倉書店(2016)",
        "referenceMaterials": "化学工学会編「改訂七版化学工学便覧」丸善（2011）小宮山宏著「反応工学―反応装置から地球まで(CREATIVECHEMICALENGINEERINGCOURSE)」培風館(1995)橋本健治編「ケミカルエンジニアリング―夢を実現する工学(CREATIVECHEMICALENGINEERINGCOURSE)」培風館(1995)",
        "courseSchedule": "第1回:概論（化学工学とは化学プラント設計のための工学である）第2回:物質収支（化学装置に入る量と出る量の関係）第3回:物質収支とエネルギー収支（収支の一般論）第4回:エネルギー収支（熱収支を中心に）第5回:流動現象の基礎（流れに必要なエネルギーを求めるために）第6回:流体の輸送（化学プラントの物質輸送システムを設計する）第7回:伝熱の基礎と伝導伝熱（熱の伝わり方とその取り扱い）第8回:対流伝熱と輻射伝熱（その他の伝熱形態）第9回:熱交換器の設計（熱エネルギーを無駄なく使う）第10回:分離の一般論と蒸留（気液平衡を利用した分離プロセス）第11回:蒸留･ガス吸収と膜分離（平衡と速度）第12回:化学平衡と反応速度（反応器を設計するために必要な反応の情報）第13回:反応器（化学反応を制御する装置）第14回:化学プラントの設計",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}