{
    "lectureCode": "K702701",
    "courseName": "光化学",
    "lecturer": [
        "山下俊(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ３０４"
    ],
    "courceDetails": {
        "courseOverview": "光を用いた化学反応によって極微構造の構築や光エネルギー変換、分子機械、光情報処理などの最先端の技術が実現されている。その基礎となる光物理過程、光化学反応およびその応用を学ぶ。",
        "outcomesMeasuredBy": "１）光物理過程やその動的挙動を説明でき、物理化学的考察により反応機構の解明ができる。【実学に基づく専門能力】【分析・評価能力】【論理的な思考力】。２）さまざまな機能材料の設計の際に利用できる光化学反応を提案できる。また、求められる光反応を実現する分子を設計できる。【実学の基づく専門能力】【分析・評価能力】【問題解決力】。３）先端科学で用いられている光化学反応を説明でき、その応用例を述べられる。【実学の基づく専門能力】【分析・評価能力】【問題解決力】。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "光化学の重要な基礎をテキストに基づいて黒板およびプロジェクターを用いて説明する。各授業において、理解度チェックおよび解説をおこなう。発展学習のため状況に応じてオンデマンド講義、講演会などを行うことがある。インタラクティブな作業のためノートＰＣを持参してください。講義内容を聞いて、要点を冊子体あるいは電子媒体のノートにメモを取るようにしてください。",
        "notices": "疑問に思うことは講義時間内に質問して解決すること。講義で興味を持った内容についてさらに深く調べまとめると理解が深まる。",
        "preparatoryStudy": "受講者は、各回の講義内容に関して事前に予習を行い十分に理解を深めておくこと。受講後、自分のノートにまとめた各回の学習内容の要点を確認し、moodleのクイズや課題を解いて、理解度をチェックしてください。",
        "gradingGuidelines": "理解度チェック８０％、レポート２０％各回の授業のクイズおよび総合復習において理解度チェックを行う。",
        "textbook": "長村利彦・川井秀記著「光化学」講談社ISBN978-4-06-156803-7",
        "referenceMaterials": "NJTurro,ModernMolecularPhotochemistryofOrganicMolecules(UniversityScienceBooks)",
        "courseSchedule": "第1回：光化学と先端機能材料：様々な光機能材料の応用例を概観する。第2回：光の波動性と粒子性：光の種類と特性を学ぶ第3回分子の電子構造：量子力学による分子の成り立ちから分子軌道を学ぶ第4回光と分子の相互作用：光の吸収および電子遷移を支配する要因を学ぶ第5回光物理過程：電子励起状態分子の光物理過程を学ぶ第6回光物理過程のダイナミクス：励起状態分子の速度論を学ぶ第7回総合復習：光化学の基礎から光物理過程の定量化：量子収率、速度定数の求め方を確認する。第８回エネルギー移動：励起状態分子のエネルギー移動の種類と特徴を学ぶ第９回エネルギー移動２：エネルギー移動に伴う速度論を学ぶ第１０回光化学反応：光化学反応とその速度論を学ぶ。第１１回ウッドワードホフマン則：協奏反応を支配する要因を学ぶ第１２回光機能材料種々の光機能材料、フォトクロミック反応、感光反応などの先端光機能材料の例を学ぶ第１３回光化学実験：光源の選択、光量測定、過渡分光法などの実験を学ぶ第１４回総合復習：講義全体を振りかえり光化学に関する総合的理解を深め、理解度チェックを行う。",
        "courseDataUpdatedAt": "2025/01/06"
    },
    "updateAt": "2025/03/21"
}