{
    "lectureCode": "K703201",
    "courseName": "サステイナブル応用化学[2023年以前入学者]",
    "lecturer": [
        "入谷康平(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義棟Ｄ３０１"
    ],
    "courceDetails": {
        "courseOverview": "サステイナブル社会を実現するために、より優れた機能をもつ材料の開発や、より省エネルギー・低廃棄物で材料を生産するプロセスの開発がなされている。本講義のねらいは、サステイナブル工学を実現するための化学の役割をプロセス、システムおよびデバイス構築の観点から整理し、サステイナブル応用化学の鍵となる様々な先端技術を学ぶことである。授業では、構造材料、エレクトロニクス、農業、食品、医療などの様々な分野におけるものつくりを支える化学技術とプロセスの歴史を振り返りながら、優れた機能をもつ材料を産み出すためのグリーンケミカルプロセスについて考察する。化学の理論や知識を活かし、サステイナブル社会に役立つ新しい材料・システムを開発などの実例を調査し、化学の果たす役割について学ぶ。この授業を通じて、サステイナブル工学を実践するための化学の知識と技術を総合的に活用し、サステイナブル材料の特性を分析・評価する能力が身に付く。",
        "outcomesMeasuredBy": "本科目を修得することで、環境・エネルギーの観点から物質・材料を知り、サステイナブル工学の基盤となる化学プロセスを説明できるようになる。具体的には、以下のことができるようになる。１．先端材料の評価方法を概説できる。２．様々な分野に必要な化学技術を概説できる。３．カーボンフリーエネルギーについて説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "黒板とプロジェクターを用いた講義形式で行う。原則として、各回の終わりには理解度チェックを行う。MoodleへのアクセスやOdysseyの使用のためにノートPCを使用するため、ノートPCは必携とする。",
        "notices": "分からないことをそのままにせず、積極的に質問をすることが、理解を深めるために重要である。何が分からないのかを、自分なりに考えるようにして欲しい。",
        "preparatoryStudy": "Moodle資料に沿って予習し、指示された自習問題を予め解いておくこと。また、演習問題を中心に十分な復習を行うこと。疑問点はオフィスアワーや次回の授業時に積極的に質問して、疑問を後に残さないように心掛けること。",
        "gradingGuidelines": "各回に行う理解度チェック、数回の講義ごとに行う演習および最終レポートの成績により評価する。（レポート50%、演習20%、理解度チェック30%として、総合的に判断する。）理解度チェックや演習、レポートのフィードバックは各講義時間中またはMoodle上で行う。",
        "textbook": "各回に配布する講義資料に沿って授業を進める。",
        "referenceMaterials": "特に指定しない。ただし、本学図書館所蔵の著書などを紹介することがある。",
        "courseSchedule": "第1回：概論；現代が抱える物質・材料・環境・エネルギーの問題第2回：構造化学（１）；化学結合と分子間相互作用第3回：構造化学（２）；分子の構造と応用化学第4回：化学と構造材料（１）；無機材料、炭素材料第5回：化学と構造材料（２）；プラスチック第6回：化学とエレクトロニクス（１）；発光材料、電子輸送第7回：化学とエレクトロニクス（２）；基板の加工技術第8回：まとめと総合復習（１）第9回：化学と農業、食品；植物の生育環境と材料第10回：化学と医療；医療に必要な化学技術第11回：カーボンフリーエネルギー(1)；自然エネルギーの利用第12回：カーボンフリーエネルギー(２)；水素エネルギーの利用、燃料電池第13回：グリーン化学合成；マイクロ波・超音波利用プロセス第14回：まとめと総合復習（２）",
        "courseDataUpdatedAt": "2024\/02\/29"
    },
    "updateAt": "2024\/09\/13"
}