{
    "lectureCode": "K703101",
    "courseName": "無機工業化学",
    "lecturer": [
        "森本樹(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ２０２"
    ],
    "courceDetails": {
        "courseOverview": "我々の生活に役立つ無機化合物や金属錯体・有機金属化合物の製法・役割・性質・反応を扱う。１年次に無機化学で学んだ原子・イオン・分子などが示す様々な性質を利用した遷移金属触媒や無機材料などを例にして、無機化合物や金属錯体が現代社会にいかに役立っているかを学ぶ。またそれを理解するための発展的な無機化学も学習する。この講義によって、工業的に生産される無機化合物の機能を説明し、また触媒や先端材料等の性能を理解するための無機化学の知識を身につけることができる。",
        "outcomesMeasuredBy": "各種無機化合物の製法・性質とその工業化学的な役割を知る。また、遷移金属元素や典型元素のそれぞれを特徴づける軌道の形とエネルギーに基づいて、それらの元素からなる金属錯体・有機金属化合物や無機固体等の構造・性質・反応性を理解する。これらを通じて、金属錯体・有機金属化合物・無機固体等からなる先端材料や触媒等の性能を理解し、説明できるようになる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業は主としてプロジェクターを使用する。講義は基本的に毎回配布するまとめ・演習プリントにそって進め、また、必要に応じて補助資料等を配布する。さらに、小テストを毎回行い、要点の確認と復習を行う。ノートPCを使用する場合は事前にアナウンスする。",
        "notices": "無機化合物・遷移金属錯体・有機金属化合物や固体材料等の理解に欠かせない多くの内容を扱う科目であるので、予習・復習が必須である。また、毎回の講義内容をその場でよく理解するように努めること。",
        "preparatoryStudy": "１年後期・無機化学で学んだ内容を復習しておくと、講義の理解に大いに役立つ。また、予習においては、毎回配布するまとめ・演習プリントの内容を確認し、演習問題を解き、次回の講義内容を把握しておくこと。復習では、講義で扱った内容や問題を自分で考え、解き直し、その内容が定着するように努め、またノートに要点をまとめること。",
        "gradingGuidelines": "毎回の小テスト（30%）と期末試験（70％）から総合的に評価する。小テスト、期末試験のフィードバックは各授業時間内に、または、moodle上で行う。",
        "textbook": "特になし（必要に応じて補助資料を配布する）",
        "referenceMaterials": "ハウスクロフト無機化学（下）（東京化学同人）新しい工業化学環境との調和をめざして（化学同人）無機工業化学第４版（東京化学同人）基礎無機化学第３版（東京化学同人、荻野博・飛田博実・岡崎雅明著）基礎無機化学（東京化学同人、下井守著）ハートウィグ有機遷移金属化学(上)(下)（東京化学同人）ウエスト固体化学基礎と応用（講談社）",
        "courseSchedule": "第1回：イントロダクション-無機化学の基礎の復習第2回：無機製造化学工業-無機酸、ソーダ・塩素、水素・アンモニア第3回：遷移金属とそのイオンの電子配置第4回：d軌道と軌道間相互作用第5回：遷移金属錯体の構造(1)第6回：結晶場理論第7回：遷移金属錯体の性質(1)-色と電子スペクトル第8回：遷移金属錯体の性質(2)-磁性第9回：遷移金属錯体の構造(2)第10回：配位子場理論と配位子の電子的効果第11回：有機金属化合物の安定性と反応性第12回：有機金属化合物に見られる特徴的な配位子第13回：触媒反応(1)-基本的な反応第14回：触媒反応(2)-遷移金属触媒を用いる反応",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}