{
    "lectureCode": "K703001",
    "courseName": "工業物理化学",
    "lecturer": [
        "藤田隆史(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ２０１"
    ],
    "courceDetails": {
        "courseOverview": "現代生活では、有機・無機・高分子化学製品、半導体製品や金属製品は何れも欠くことができないものである。これらを構成する化学材料、半導体材料や金属材料の物性・特性を理解するためには、物理化学的考察が基盤となる。さらに工業技術の進展には、物理化学が重要な役割を担っている。本講義では、物質の電気的、磁気的、光学的な特性を理解するために、これまで学修してきた物理化学関連科目を基にして、様々な材料や工業製品の特性解明の基本となる統計熱力学や固体の電子論の基礎を修得することをねらいとする。応用例として半導体や超伝導体の伝導性、固体電解質の特性、強磁性・反磁性の特徴、発光現象・蛍光特性、表面物性などに関して、その原理や機構および材料の特徴を学ぶ。また、種々の材料やプロセス技術の実例を学び、さらに、サステイナブルデバイスの構築および製造プロセスについて調査する。この講義を通して、サステイナブル社会の基盤となる工業技術や工業製品について物理化学的見地から論理的に説明・解釈し分析・評価する知識や能力が身につく。",
        "outcomesMeasuredBy": "本科目を修得することで、物理化学を基盤にした材料の分析・評価、数物的考察に基づいた解釈を進める力が身につく【実学に基づく専門能力、論理的な思考力、分析・評価能力】。具体的には、以下のことができるようになる。１．固体の電気的性質を説明できる。２．光の吸収、光伝導、光起電力について説明でき、光機能材料について類別できる。３．磁性体の挙動および磁性材料について類別できる。４．電子材料の化学的プロセスを説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "黒板とプロジェクターを用いた講義形式で行う。原則として、各回の終わりには理解度チェックのための演習を行う。MoodleへのアクセスのためにノートPCを使用する。Moodle上の設問への回答におけるユニークな回答の紹介および討論や学生が登壇するミニ発表会による学生自らの主体的な学びを促す（アクティブラーニング）。",
        "notices": "具体的な現象や歴史的背景と共に説明を進める。参考書を提示するので、自分にとって理解しやすい書籍を選び、補助教材として活用すること。また、分からないことをそのままにせず、積極的に質問をすることが、理解を深めるために重要である。何が分からないのかを、自分なりに考えるようにして欲しい。",
        "preparatoryStudy": "Moodle資料に沿って予習し、また、演習問題を中心に十分な復習を行うこと。Moodle資料および教科書の指定部分を自宅で読み、映像資料をあらかじめ視聴したうえで授業に臨むこと（授業の一部は予習用映像資料の振り返りや討論を中心に行う反転授業）。疑問点はオフィスアワーや次回の授業時に積極的に質問して、疑問を後に残さないように心掛けること。",
        "gradingGuidelines": "各回に行う演習と授業への取り組みおよび数回の講義ごとに行う理解度チェックならびに期末試験の成績により評価する。（期末試験40%、理解度チェック30%、演習30%として、総合的に判断する。）理解度チェックや定期試験のフィードバックは各講義時間中またはMoodle上で行う。また、授業最終回で全体に対するフィードバックを行う。",
        "textbook": "P.Atkins・J.dePaula著、中野他訳、「アトキンス物理化学（上および下）第10版」、東京化学同人、および、各回に配布する講義資料に沿って授業を進める。",
        "referenceMaterials": "AnthonyR.West著「SolidStateChemistryanditsApplications，Secondedition」（Wiley）ISBN978-4-06-154390-4",
        "courseSchedule": "第1回：概論：工業技術における物理化学第2回：固体の構造：結晶構造第3回：固体の反応(1)：核成長と相転移第4回：固体の反応(2)：拡散現象と工学的応用第5回：固体の化学結合：電子物性第6回：固体の電気的性質(1)：半導体材料第7回：固体の電気的性質(2)：超伝導材料；中間まとめと理解度チェック第8回：プロセス技術(1)：欠陥制御、化学的加工、イオン伝導性材料第9回：固体の光学的性質(1)：光の吸収、屈折、反射第10回：固体の光学的性質(2)：光伝導、光起電力と太陽電池第11回：プロセス技術(2)：単結晶と薄膜、化合物半導体材料第12回：固体の磁気的性質：磁化率と透磁率、磁性体の種類と応用第13回：プロセス技術(3)：フェライト材料；中間まとめと理解度チェック第14回：統計熱力学：工業技術を支える基礎、総括",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/08/07"
}