{
    "lectureCode": "K703501",
    "courseName": "サステイナブルエネルギー化学",
    "lecturer": [
        "西尾和之(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月4"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ２０１"
    ],
    "courceDetails": {
        "courseOverview": "サステイナブル社会を実現する上で，我々が利用できるエネルギー，特に再生可能エネルギーを効率良く生み出し，更に，そのエネルギーを効率良く貯蔵する技術の開発が非常に重要かつ緊急の課題となっている．本講義では，太陽電池，二次電池，キャパシタなどエネルギー変換・貯蔵に関連したサステイナブル化学の技術と，高効率エネルギー変換を実現するための材料について化学的側面から学び，その機能発現のメカニズム，物理化学的側面および応用例を学ぶ．この授業では，持続的な社会を実現するためのエネルギー供給と貯蔵に関する知識と的確な判断能力が身につく．授業期間の前半では，太陽エネルギーの電力変換に関して基礎から最新の技術を学ぶ．後半では，電気エネルギーの貯蔵方法に関して基礎から最先端の技術までを学ぶ．これらの学習を通して，エネルギーの変換効率の向上に関する論理的な思考力，分析・評価能力が身につく．具体的には，太陽電池のエネルギー変換効率，二次電池の充放電効率とサイクル特性，キャパシタのサイクル特性を理解する論理的な思考力，分析・評価能力が身につく．",
        "outcomesMeasuredBy": "物理化学および電気化学の知識に基づき，様々な電気エネルギーの獲得方法・貯蔵方法を考えることができる【論理的な思考力，問題解決力】．具体的には，太陽電池の光－電気エネルギー変換メカニズム，電池の電気エネルギー－化学エネルギー変換メカニズムを理解し，それぞれの特性を分析・評価することができる．",
        "learningOutcomes": "論理的な思考力問題解決力",
        "teachingMethod": "前回の授業の復習の後，講義内容を数項目に分けて[講義－演習－解説]の流れを基本として進める．重要な発見・発明に関しては，原著論文(英文)を読解して自力で理解するための課題を取り入れて学習していく．これらの課題は必ず提出すること．毎回の授業でノートPCは必携である．",
        "notices": "物理化学Ⅰ，物理化学Ⅱ，電気化学の単位を取得した上で履修する事が望ましい．",
        "preparatoryStudy": "事前に講義内容と講義資料・関連資料を伝えるので，必ず予習しておくこと．また，授業の内容について疑問点を残さない様に復習する．",
        "gradingGuidelines": "設定した課題の提出内容(80%)，演習(20%)で評価する.",
        "textbook": "指定しない．講義資料は事前にmoodleに掲示する．",
        "referenceMaterials": "電気化学概論（丸善出版，松田好晴，岩倉千秋著）電気化学（丸善出版，渡辺正，金村聖志，益田秀樹，渡辺正義著）電子移動の化学（朝倉書店，渡辺正，中林誠一郎著）資源・エネルギー工学要論（東京化学同人，世良力著）",
        "courseSchedule": "第1回：ガイダンス，現在のエネルギー問題第2回：エネルギー利用の現状と貯蔵方法第3回：エネルギー利用の現状第4回：太陽電池(無機系，有機系)第5回：酸化チタンの光触媒特性の基本第6回：酸化チタンの光触媒特性第7回：色素増感太陽電池の初報論文第8回：色素増感太陽電池の特性第9回：ペロブスカイト太陽電池第10回：化学電池，リチウムイオン二次電池第11回：リチウムイオン二次電池の先端研究第12回：リチウムイオン二次電子の先端研究第13回：コンデンサの基本と電解コンデンサの特性第14回：電気二重層キャパシタの構成と機能",
        "courseDataUpdatedAt": "2024\/02\/06"
    },
    "updateAt": "2024\/09\/13"
}