{
    "lectureCode": "K703901",
    "courseName": "応用化学実験I",
    "lecturer": [
        "山下俊(工学部応用化学科)",
        "西尾和之(工学部応用化学科)",
        "入谷康平(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "化学者として新しい優れた材料を開発するためには、精密な物性評価と解析の能力が必須である。本実験では、物理化学測定の基本技術を身につけるために、反応速度、分光測定、熱測定、力学物性測定、電気化学測定、表面張力、蒸気圧、結晶構造解析などのテーマの実験をおこなう。本実験により、化学者として必須の物理化学実験の技術と実践力が身に付く。",
        "outcomesMeasuredBy": "第一に､物理化学に関する基礎的な測定を安全かつ正確に遂行することができる。第二に､測定結果を適切にノートに記録し、その結果を正しく解析することができる。第三に､実験の目的・実験方法・結果および考察を科学的な形式に即したレポートにまとめ､第三者に正確に報告できる。これらの物理化学実験の基本能力を身に着ける。【実学に基づく専門能力】【コミュニケーション力】【論理的な思考力】【分析・評価能力】【問題解決力】。具体的には（１）化学者として必須の実験遂行力、すなわち、実験結果を正しくノートに記録し、データを解析し結果をまとめ結論を出すことができる。（２）実験結果を、科学的な体裁に即したレポートにまとめ、第三者に正確に説明できるようになる。（３）反応速度の測定法と解析法を理解する。（４）光の測定法と解析法を理解する。（５）励起状態の測定法と解析法を理解する。（６）熱物性の測定法と解析法を理解する。（７）力学特性の測定法と解析法を理解する。（８）水系電池の起電力の測定法と解析法を理解する。（９）表面張力の測定法と解析法を理解する。（１０）蒸気圧の測定法と解析法を理解する。（１１）固体無機材料合成と結晶構造解析法を理解する。（１２）粘度の測定法と解析法を理解する。（１３）表面吸着量の測定法と解析法を理解する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義の初回に実験のガイダンスと安全教育を行う。実験は3名程度のグループワークとし、各テーマの実験をローテーションしながら実施する。下の「授業計画」に記載した実験テーマの順番は一例である。実験開始前に担当者が予習ノートをチェックする。予習していない場合(予習ノートを参照しての実験が不可能な場合)は､予習ノートを完成させるまで実験を開始することができない。実験終了後、実験結果を記載したノートを担当者に提出し､適正と判断されたら実験を終了する。期限内に実験の目的、手順、結果および考察をレポートにまとめて提出する。レポート作成には、書籍、科学論文などを調べ、客観的な事実に基づいて考察を行う。全ての実験の終了後､習熟度を確認するための理解度チェックを行う。データ処理等のためノートＰＣを持参してください。",
        "notices": "事前にテキストを熟読し､実験の内容を十分に理解しておくこと。テキストにしたがって実験計画をたて、実験のフローチャートを作成し、実験手順や試薬の量などを予習ノートに記入しておく。十分に予習していない場合は当日の実験ができないか､開始が遅くなることに十分留意すること。器具の洗浄や整理を含めて､時間内に実験を終了すること。レポートの提出に際しては、指定された期限を厳守することが必須である。ただし、必要事項が記されていないなど質に問題のあるレポートは受理されず再レポートとなるので注意すること。",
        "preparatoryStudy": "事前にテキストを熟読し､実験の内容を十分に理解する。テキストにしたがって実験計画をたて、実験のフローチャートを作成し、実験手順や試薬の量などを予習ノートに記入しておく。実験終了後、実験結果を記載したノートを提出しチェックを受け実験を終了する。予習ノートおよび実験報告はそれぞれ実験前、実験後にチェックされ、授業への取り組みに加点／減点される。レポートの作成および復習は実験ノートを元に進めるため、ノードに正確に記録することが重要である。8テーマの実験を複数に区切り，区切りの間にデータの解析・まとめと議論の時間を設ける。",
        "gradingGuidelines": "授業への取り組み40%、レポート30％、理解度チェック30％。予習ノートおよび実験報告はそれぞれ実験前、実験後にチェックされ、授業への取り組みに加点／減点される。全ての実験テーマの出席とレポートの受理が、単位修得の必要条件である。",
        "textbook": "「応用化学実験Ⅰ」テキストを配布する。",
        "referenceMaterials": "化学書資料館（https://www.chem-reference.com/）化学便覧、実験化学講座（日本化学会編）",
        "courseSchedule": "第1回：ガイダンス・安全教育第2回：実験テーマの説明第3回：実験テーマ１：力学測定・熱分析第4回：実験テーマ２：分光測定第5回：実験テーマ３：電気化学測定第6回：実験テーマ４：反応速度第7回：データの解析・まとめと議論第8回：実験テーマの説明第9回：実験テーマ５：表面張力測定第10回：実験テーマ６：蒸気圧第11回：実験テーマ７：吸着平衡第12回：実験テーマ８：構造解析第13回：データの解析・まとめと議論第14回：理解度チェック",
        "courseDataUpdatedAt": "2024/02/05"
    },
    "updateAt": "2024/08/07"
}