{
    "lectureCode": "K704001",
    "courseName": "応用化学実験II",
    "lecturer": [
        "上野聡(工学部応用化学科)",
        "森本樹(工学部応用化学科)",
        "片桐利真(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木3",
        "木4",
        "木5"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "片柳研究所Ｅ２０２"
    ],
    "courceDetails": {
        "courseOverview": "有機合成の基本技術を身につけるため、ヒドロキシ基のアシル化、クロスカップリング反応、ヒドリド還元、ポルフィリンの合成を行う。まず、全体のガイダンスを行い実験上の注意事項や基本事項を学ぶ。受講者は配布されたプリントに従って十分な予習をして実験説明に臨む。実験終了後、指導教員の指導を受け結果を確認し、それを毎回レポートにまとめて提出する。さらに、レポートの添削、講評により正しいレポートの作成法を学び、実験内容を理解する。",
        "outcomesMeasuredBy": "基本的な有機化学反応について自ら理解して実験操作を行うことができる（分析・評価能力）。反応の種類に応じて、実験装置や実験操作の違いを理解する（論理的な思考力）。有機化合物の精製法について正しく操作できる（実学に基づく専門能力）。有機化学反応の結果を自らまとめ考察できる（コミュニケーション能力）。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "実験は、以下に記したテーマを各人または三人一組で実施する。各実験では事前の説明講義を行う。各実験終了ごとにレポートをまとめ、提出する。レポートの添削結果を説明する。また、習熟度を確認するための期末試験を実施する。なお、受講生は2つのグループに分け、各グループは火曜日と木曜日にそれぞれの教員が実施する指定の実験を入れ替えて実施する。",
        "notices": "白衣、実験メガネを着用すること。安全に留意すること。有機化学Iおよび有機化学IIの講義内容を復習しておくこと。",
        "preparatoryStudy": "予習として、実験テキストに記載された内容、特に各操作の意味を予め十分に確認し、実験ノートに実験の流れをフローチャート形式で事前にまとめておく。特に安全に関わる試薬の物性や安全上注意すべき点をMSDSにより調べておくこと。復習として、実験実施日のうちにノートの不足部分を完成させ、レポートを作成すること。",
        "gradingGuidelines": "実験の取組み・ディスカッション（20%）実験ノート（5%）レポート（50%）期末試験（25%）",
        "textbook": "講義ページ等で実験テキストを配布",
        "referenceMaterials": "基礎有機化学実験第3版ーその操作と心得（丸善株式会社、畑一夫・渡辺健一著）研究室で役立つ有機実験のナビゲーター第2版（丸善出版、上村明男訳）",
        "courseSchedule": "第1回：実験ガイダンス・講義（片桐・森本・上野）第2回：アセチルサリチル酸の合成①：反応計画（予習）・反応の実施・再結晶（片桐）第3回：アセチルサリチル酸の合成②：吸引ろ過、精製（片桐）第4回：アセチルサリチル酸の合成③：融点測定による化合物の同定（片桐）第5回：ポルフィリンの合成①：シリンジの基本的な取り扱い（森本）第6回：ポルフィリンの合成②：シリカゲルカラムクロマトグラフィーによる精製（森本）第7回：ポルフィリンの合成③：色素のUV測定と解釈（森本）第8回：クロスカップリング反応①：不活性ガス下取り扱い・GC収率（上野）第9回：クロスカップリング反応②：エバポレーター・再結晶（上野）第10回：クロスカップリング反応③：芳香環領域のNMR解析・GC収率と単離収率の比較・解釈（上野）第11回：ケトンの還元①：小スケール反応・TLC分析（上野）第12回：ケトンの還元②：カラムクロマトグラフィー・GCMS（上野）第13回：ケトンの還元③：脂肪族領域のNMR解析・考察（上野）第14回：まとめ（片桐・森本・上野）",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/08/07"
}