{
    "lectureCode": "K704205",
    "courseName": "創成課題[5]",
    "lecturer": [
        "西尾和之(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月5",
        "金2"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ１０２"
    ],
    "courceDetails": {
        "courseOverview": "4年生ではこれまでの講義や演習、学んだ知識をもとに大学における勉学の集大成として卒業課題を実施する。卒業課題では各自が与えられた研究テーマを遂行するために、問題分析、課題抽出、解法の提案を行う。創成課題では、卒業課題に着手する準備段階として、研究者としての倫理や安全に研究を行うための注意事項を学び、卒業課題の研究テーマを遂行するために必要な文献調査や動向調査などの情報収集を行う。また課題遂行に必要な基礎技術の習得や予備実験を行い、研究技術を学ぶ。具体的なテーマは研究室単位のクラスにおいて提示される。本課題により卒業研究を遂行するために必須の知識と技術が身につく。分野ごとの研究に加え、業界・企業研究、自己分析を通じて社会人基礎力を醸成する。",
        "outcomesMeasuredBy": "研究室における研究活動に必要となる専門知識やスキルを身に付ける。また、研究者・技術者に必要とされる基礎力・思考力・コミュニケーション能力を養う。本科目を修得することで、与えられたテーマをもとに、知恵とアイデアを出して問題を分析し、課題を抽出し、自分自身の解を見出すことができるようになる。企業研究と自己分析を行うことで、自分に適した職種や企業の選択ができるようになる。また、グループワークを通じて他者との相互理解に基づく的確なコミュニケーションが図れるようになる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ゼミや実験を研究室で行い、また、それに関わる資料や報告書を作成・報告することで、研究活動に求められる基本的な能力を実践的に養う。週2回以上実施するゼミの1回は研究室全体でのリサーチセミナー・雑誌会、1回は輪講を行う。",
        "notices": "本授業は、週2コマ開講される（月曜5限・金曜2限、予備日：水曜4限）。単位取得には、ゼミや実験に毎回出席・参加し、所定の課題に取り組むことが必須である。応用化学に関する総合学習であり、討論や発表を重視した科目である。出席するだけでなく積極的に参加する姿勢が求められる。授業計画に授業進行のガイドラインを示すが、具体的な実施計画・内容は担当教員毎に異なる。",
        "preparatoryStudy": "授業内での討論や発表のために、授業時間外での学修活動が必要である。",
        "gradingGuidelines": "日頃の課題への取り組みや研究室ごとに実施される発表会での発表を総合的に評価する。課題への取り組みが不良である場合は、大幅に減点される、もしくは、単位取得ができない。",
        "textbook": "担当教員毎に指示される。",
        "referenceMaterials": "担当教員毎に指示される。",
        "courseSchedule": "第1回：オリエンテーション：研究室のルール、研究室における安全第2回：研究テーマの解説・調査第3回～8回：研究計画の立案、実験技法の習得、文献調査、調査論文の発表、業界・企業調査第9回：テーマ討論(1)－中間の進捗報告会および個別指導第10回～13回：調査研究、論文講読、検証実験、研究成果物作成、業界・企業研究第14回：テーマ討論(2)－進捗報告会および個別指導",
        "courseDataUpdatedAt": "2024\/01\/17"
    },
    "updateAt": "2024\/09\/13"
}