{
    "lectureCode": "K704501",
    "courseName": "有機工業化学",
    "lecturer": [
        "原賢二(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "本講義では、我々の生活に欠かせない物質が実際にどのように工業的に製造されているか、様々な実例を学ぶ。具体的には、有機材料を主として、化学繊維やプラスチック、油脂、洗剤、ファインケミカルズなどの各種工業製品の材料や製造方法、反応機構、化学プロセスおよびそれらの応用例などについて学ぶ。これらの各実用例においては、物質やエネルギーのコストが最適化されており、サステイナブル化学との関連についても学ぶことができる。この講義を通して、有機工業化学に関する多様な知識とサステイナブル化学との関連についての知識が身につく。",
        "outcomesMeasuredBy": "１）石油や天然ガスから我々の生活に欠かせない物質がどのように製造されているかを説明できる。２）油脂、染料・顔料・塗料、界面活性剤の構造や製造方法、用途について説明できる。３）代表的な医薬と農薬について、その構造、作用、合成法について説明できる。４）有機工業化学と環境との関係について説明できる。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力問題解決力",
        "teachingMethod": "黒板とプロジェクターを用いた講義形式で行う。ノートPC持参。原則として、授業中あるいは終了前に理解度チェックのための小テストをMoodle上で行う。このMoodle上の回答を教員がその場で集計・評価・公開してフィードバックすることにより、各学生が自身の理解度や学習の取り組みについて客観的に判断し、主体的に学ぶこと（アクティブラーニング）を促すとともに学修内容の定着を行う。また、有機化合物の合成に関する化学反応の機構を理解するための提出物や、必要に応じて、復習のための宿題を課する。",
        "notices": "わからない用語や表現をそのままにせず、積極的に質問をすることが、理解を深めるために重要である。",
        "preparatoryStudy": "教科書の各回の該当部分をあらかじめしっかり読んで授業に参加する。各回の理解度チェックの内容を中心に復習を行い、疑問点を後に残さないように心がけること。",
        "gradingGuidelines": "各回に行う理解度チェック、提出物、宿題ならびに期末試験の成績により評価する。（期末試験50%、理解度チェック・提出物・宿題50%として、総合的に判断する。）",
        "textbook": "井上祥平著、「有機工業化学」、裳華房",
        "referenceMaterials": "松田治和、野村正勝他著、「有機工業化学」第２版、丸善園田昇、亀岡弘編、「有機工業化学」第２版、化学同人亀岡弘、井上誠一編、「有機工業化学－そのエッセンス－」、裳華房",
        "courseSchedule": "第1回：有機工業化学の概論導入、炭素資源第2回：石油石油製品、接触改質、接触分解、水素製造、水素化分解第3回：ナフサの分解、エチレンを原料とする合成(1)第4回：エチレンを原料とする合成(2)第5回：プロピレン、その他脂肪族炭化水素からの合成第6回：天然ガス芳香族炭化水素・天然ガスからの合成第7回：石炭とその化学コークス、コールタール、石炭のガス化・液化第8回：到達度チェックと復習第9回：油脂とその化学油脂の構造、油脂の加工第10回：有機化学製品、染料・顔料・塗料性質・機能、構造と合成第11回：界面活性剤と洗剤界面活性剤の性質・製造法・用途第12回：香料と化粧品香料の種類・用途・製造法、化粧品の種類・用途第13回：医薬と農薬医薬と農薬、医薬・農薬の構造・作用・合成第14回：到達度チェックと復習",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}