{
    "lectureCode": "K705101",
    "courseName": "線形代数1",
    "lecturer": [
        "片桐利真(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "「数学は全ての自然科学の女王にして奴隷」といわれる。この講義では数学そのものの美しい世界ではなく、それを化学分野でいかに使いこなすか、そのための工夫とその理解について講義する。線形代数学は数理工学、特に計算科学的な数値の取り扱いの基礎である。したがって、計算機を用いた数値処理の意味の理解に必修である。現実事象の定量的抽象としての「ベクトル」とその取り扱いの演算子としての行列は、化学分野では量子化学的分子軌道計算、結晶対称性の表示、多変量解析とその推移予想などコンピューターを使った静的・動的な現象解析の道具である。コンピューターが何を行っているのかを理解できれば、「コンピューターに使われる」のではなく「コンピューターを道具として使える」ようになる。本講義では、前半でベクトルと行列・行列式の基礎を学び、後半でその応用として種々の図形の一次変換と固有値問題の意味、その利用としての計算による分子軌道法計算との関わりを学ぶ。",
        "outcomesMeasuredBy": "線形代数学はコンピューター社会における基礎的な教養である【国際的な教養】。この講義をとおして、行列という数学ツールの意味と使い方を理解する。これにより合目的的かつ論理的な数値変換のスキームを組み立てる思考力を身につけることができる【論理的な思考力】。また、その利用としての図形変換、固有値問題による分子軌道法計算を理解できるようになる【実学に基づく専門能力】。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "講義は板書とpptによりすすめる。必要に応じてプリントやexcelファイルをmoodle経由で配布する。資料を紙媒体あるいは電子媒体により配布し、これを講義中に使用する（moodleにアクセスできる、MSExcelを使えるPCなど必須）。また、毎回ミニッツペーパーを課し、その回の講義内容の確認と復習を行う。",
        "notices": "事前に高校数学の単元「ベクトル」を復習しておくこと。１年前期の情報リテラシー演習、特にExcelの取り扱いに習熟すること。必要なら鍵本聡「マンガ線形代数入門」講談社BlueBacks2013を読んでおくこと。",
        "preparatoryStudy": "予習として、教科書を読み、太文字などで記載されている用語を書き出し、その日本語訳を調べ、その意味をノートにまとめておくこと。講義はこの予習の実施を前提とする。復習として、演習問題を配布するので、これを解くこと。これにより自分の理解できていない部分を明らかにし、補うこと。必要ならオフィスアワーに教員を尋ねること。また、学修支援センターも活用すること。",
        "gradingGuidelines": "毎回課すミニッツペーパーによる講義の理解状況（教室への出席状況ではない）６割、と理解度チェック４割により総合的に評価する。必要に応じてノートの提出を求める。また、課題の解答板書実施者には付加点を与える。",
        "textbook": "（Schaum'sOutlines）LinearAlgebra,6thedition",
        "referenceMaterials": "寺田文行「線形代数増訂版」サイエンス社サイエンスライブラリー理工系の数学1974その他、別途リストをmoodleで配布",
        "courseSchedule": "第1回:ベクトル−１第2回:ベクトル−２第3回:行列と行列式第4回:行列と連立方程式第5回:１次変換第6回:エクセルを使った一次変換による図形の回転、移動第7回:理解度チェック",
        "courseDataUpdatedAt": "2024/02/05"
    },
    "updateAt": "2024/08/07"
}