{
    "lectureCode": "K708901",
    "courseName": "サステイナブル材料化学1",
    "lecturer": [
        "山下俊(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "有機材料は分子の構造に応じた機能があり、それらの機能を複合化することにより全く新しい機能をもつ分子を生み出すことができるという特徴がある。将来研究者として新しい機能材料を生み出すためには、ただ単に合成ができるだけ、あるいはただ単に物性解析ができるだけではなく、分子の構造と物性の相関を知り、それらを自在に組み合わせ操る能力が必須である。本講義では、様々な特徴をもつ分子のいくつかの特徴ごとに、その構造と機能の相関を具体的な分子の例に基づいて学び、分子の形からその機能を直感的に感じ取れるようになる「実学に基づく専門能力」が身につく。また、その能力は将来研究者として新素材を開発する際に「論理的な思考力」「分析・評価能力」として効果を発揮する。",
        "outcomesMeasuredBy": "１）分子の構造のうちその機能発現に特徴的な構造を見出し、それがなぜどのような物性となるのか、それをどのような機能に応用できるのか理解し、説明できる【実学に基づく専門能力】【分析・評価能力】【論理的思考力】。２）ある機能をもつ分子と別の機能をもつ分子を組み合わせることにより、２つの分子の機能とは全く異なった優れた機能が発現する例を理解し、説明できる【実学に基づく専門能力】【分析・評価能力】【論理的思考力】。３）様々な機能材料の発見や開発の歴史を知り、それに基づいて材料開発のヒントとなる分子設計の指針が身につく【実学の基づく専門能力】【論理的思考力】。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "黒板およびプロジェクターを用いて説明する。講義内容に即したレポートを提出し、また指示された課題について講義時間に発表を行う。分子ごとの特徴的な構造の例を学んだ後に、どのようにしてサステイナブル工学に貢献できるか考え、また、これらの分子を複合化して思いもかけなかったような新しい機能をもつ分子を受講者ごとに設計し、発表を行う。",
        "notices": "疑問に思うことは講義時間内に質問して解決すること。講義で興味を持った内容についてさらに深く調べまとめると理解が深まる。",
        "preparatoryStudy": "各回の講義内容に関して、書籍やインターネットを活用して各自調べておくこと。講義終了後、各テーマごとの分子の構造と物性を表にまとめ理解を深める。また、講義を聞いた上で関連する材料やその応用について調べ、ノートにまとめる。",
        "gradingGuidelines": "理解度チェック８０％、レポート発表２０％授業中のクイズおよび総合復習において理解度チェックを行うレポートは受講者が発表し、それについて講評する",
        "textbook": "必要に応じて資料を配布する。",
        "referenceMaterials": "必要に応じて資料を配布する。また指示により各自で講義トピックスに関連する内容を調査する。",
        "courseSchedule": "第１回：人の五感と分子構造味と匂いの化学を学ぶ第２回：生命の化学：生理活性物質の構造と機能を学ぶ第３回：超分子化学：超分子の構造と機能発現のメカニズムを学ぶ第４回：ポルフィリンの化学：ポルフィリン構造をもつ化合物の合成と特性、人工血液などへの応用を学ぶ第５回：色の化学：人の視覚、有機化合物の発色のしくみ、色素、機能性色素の構造と応用を学ぶ第６回：光機能材料の化学：フォトクロミック分子の構造と機能を学ぶ第７回：総合復習理解度確認",
        "courseDataUpdatedAt": "2025/01/06"
    },
    "updateAt": "2025/03/21"
}