{
    "lectureCode": "K710601",
    "courseName": "有機化学演習II",
    "lecturer": [
        "須磨岡淳(工学部応用化学科)",
        "片桐利真(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月5"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "有機化学3および4で学んだ内容について演習を行うことで、有機化学3および4で学んだ有機化学の基礎的な知識を確実に修得する。この演習では、特に芳香族、アルコール、エーテル、カルボニル化合物の構造の特徴、合成方法、反応性に関する知識が身につく。本演習では講師の企業（日本鉱業株式会社，現JXTGホールディングス）での防衛特許作成のための実務経験を元に有機化学を講義・演習する実践的科目である。防衛特許の作成は網羅的・体系的でなければならない。そのためには、場当たり的な反応に関する個別の情報や記憶に頼る有機化学ではなく、有機化合物や反応を博物学的に分類する高次の原理や思想の理解を必要とする。本演習では、有機化学の基本原理を基礎的かつ体系的に解説し、それを個々の有機化学反応や事象例と対応させることにより、有機化学分野を俯瞰するだけではなく、その成り立ちの理解に至る。これは、単に有機化学分野だけではなく、博物学的（各論）分野で、個々の技術をどのようにとらえれば、網羅・体系化できるかの哲学（philosophy）である。すなわち、実践的な有機化学を通して、企業での高いレベルの研究に必要な科学技術哲学の獲得を目指す。",
        "outcomesMeasuredBy": "本科目を修得することで、基本的な有機化合物の構造と反応性を学んで以下のことができるようになる【実学に基づく専門能力・論理的な思考力・有機化学の基礎力と化学的思考力】。・芳香族性が説明でき、芳香族求電子置換反応や芳香族求核反応が説明できる。・アルコールとフェノールの合成や反応を説明できる。・エーテルとエポキシド、チオールとスルフィドの合成と反応を説明できる。・アルデヒドとケトンの付加反応について説明ができる。・カルボン酸とニトリルの性質にして説明ができる。・求核アシル置換反応について説明ができる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業は黒板とプロジェクターを併用し、基本的に教科書に沿って進め（教科書とMoodleの資料を用いて予習を十分に行い授業に臨むこと）、必要に応じて理解度チェックを行なう。各講義では、質問に対する回答や理解度チェックの問題の解説なども実施する。また、Moodle上の資料を用いた解説やMoodle上での簡単なクイズを行うことがあるので、ノートPCは必携とする。",
        "notices": "必修科目である化学基礎1および2、化学基礎演習1および2、有機化学1および2、有機化学演習Iを履修して内容を理解しておくとともに、有機化学3および4を履修していることが望ましい。",
        "preparatoryStudy": "予習として、教科書の該当部分およびMoodle上の資料をあらかじめよく読み、理解できなかった部分についてはメール等の指定された方法で質問すること。また、予習問題や復習問題が配付される場合もあるので、指定された期日までに問題を解き、指示に従い提出すること。必要に応じて、オフィスアワーに教員を尋ねたり、学習支援センターを利用したりすること。",
        "gradingGuidelines": "予習課題（20％）、理解度チェック（60%）、授業への取組（20%）から総合的に成績を評価する。期末試験のフィードバックについては、Moodleを通じて行なう。",
        "textbook": "マクマリー有機化学（中）第９版東京化学同人",
        "referenceMaterials": "OrganicChemistry9thEditionJohnE.McMurry「有機化学（第2版）」奥山格（丸善）「ソロモンの新有機化学第11版」T.W.GrahamSolomons,CraigB.Fryhle（廣川書店）「ボルハルト・ショアー現代有機化学第8版」K.P.C.Vollhardt（化学同人）",
        "courseSchedule": "第１回：ベンゼンの化学（ベンゼンと芳香族性、その反応性：芳香族求電子置換反応、置換基効果、ハメット則）に関する演習（片桐）第２回：ベンゼンの化学（承前、置換基効果、反応の位置選択性）に関する演習（片桐）第３回：ベンゼンの化学（承前、芳香族求核置換、芳香族の酸化・還元）に関する演習（片桐）第４回：アルコールとフェノールに関する演習（片桐）第５回：エーテルに関する演習（片桐）第６回：エポキシド、チオールとスルフィドに関する演習（片桐）第７回：第1回～6回に関する総合演習（片桐）第8回：反応機構を書き方（巻矢印の使い方）に関する演習（須磨岡）第9回：アルデヒドとケトン：求核付加反応（1）に関する演習（須磨岡）第10回：アルデヒドとケトン：求核付加反応（2）に関する演習（須磨岡）第11回：カルボン酸とニトリル（1）に関する演習（須磨岡）第12回：カルボン酸とニトリル（2）に関する演習（須磨岡）第13回：カルボン酸誘導体：求核アシル置換反応（1）に関する演習（須磨岡）第14回：カルボン酸誘導体：求核アシル置換反応（2）に関する演習（須磨岡）",
        "courseDataUpdatedAt": "2025/02/05"
    },
    "updateAt": "2025/03/21"
}