{
    "lectureCode": "K710801",
    "courseName": "物理化学演習II",
    "lecturer": [
        "森本樹(工学部応用化学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "金5"
    ],
    "targetDepartment": "工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "「物理化学３」および「物理化学４」で学んだ内容に関する演習をおこなう。受講者は予め配布される、様々な化学事象についての演習問題を解答する。それを学生が講義時間内に発表し、物理化学的な考え方の確認、疑問点などの討論を学生間で行う。また教員が内容の解説をおこない、物理化学の知識を確実なものにする。この演習によって、化学現象を物理化学的な観点で説明・理解する知識を補強することができる。",
        "outcomesMeasuredBy": "「物理化学１」「物理化学２」「物理化学演習１」で扱った熱力学の基本的事項を踏まえて、より実践的な系を題材とする演習を行うことで、高度で実用的な物理化学的内容を理解し、知識を確実に定着させる。また、様々な化学系において実際に直面する問題を解決・理解するために、それらを応用できるスキルを身につける。さらに、その知識や問題解決プロセスを他者に対して分かりやすくまとめ、説明する能力を身につける。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業は主としてプロジェクターを使用する。演習は基本的に毎回配布するまとめ・演習プリントに沿って進め、また、必要に応じて補助資料等を配布する。重要な演習問題の前に、アクティブラーニング形式で要点解説を行い、多くの学生が積極的に回答できる機会を設ける。さらに、その回の内容の理解度を確認する小テストを毎回行い、その要点の確認と復習を行う。ノートPCを使用する場合は事前にアナウンスする。",
        "notices": "大学化学の中でも特に基礎的かつ必要不可欠な物理化学の内容を扱う必修科目であるので、予習・復習が必須である。また、毎回の演習内容をその場でよく理解し、卒業研究などの実践的な場で活用できる知識を身につけるように努めること。また、「物理化学３」および「物理化学４」で使用する教科書・参考書・資料を演習時に持参することは差し支えない。",
        "preparatoryStudy": "「物理化学３」および「物理化学４」で学んだ内容を復習して臨むと、演習内容の理解に大いに役立つ。また、予習においては、毎回配布するまとめ・演習プリントの内容を確認し、演習問題を解き、次回の演習内容を把握しておくこと（60〜120分）。復習では、演習で扱った内容や問題を自分で考え、解き直し、その内容が定着するように努め、またノートに要点をまとめること（60〜120分）。",
        "gradingGuidelines": "毎回の発表状況・小テスト（100%）から総合的に評価する。小テストのフィードバックは各授業時間内に行う。",
        "textbook": "なし（毎回まとめ・演習プリントを配布・使用）",
        "referenceMaterials": "アトキンス物理化学(上)(下)第8版（東京化学同人）",
        "courseSchedule": "第1回：熱力学の基本的事項の復習第2回：化学ポテンシャルの定義、純物質の安定な相第3回：様々な条件における蒸気圧第4回：混合の熱力学、ラウールの法則とヘンリーの法則第5回：希薄溶液の束一的性質第6回：2成分系の相図第7回：活量第8回：化学平衡、平衡定数第9回：化学平衡とギブズエネルギー第10回：平衡電気化学第11回：反応速度論(1)-一次反応と二次反応第12回：反応速度論(2)-反応速度の温度依存性第13回：反応速度論(3)-反応機構第14回：総合演習",
        "courseDataUpdatedAt": "2025/02/04"
    },
    "updateAt": "2025/03/21"
}