{
    "lectureCode": "U60109",
    "courseName": "栄養と健康",
    "lecturer": [
        "遠藤大哉(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水5"
    ],
    "targetDepartment": "医療保健学部リハビリテーション学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "食べることは生きることの基本。食環境の変化が著しい今、健康に、楽しく、環境を考えて食べる必要性が高まっている。また近年、食生活の多様化に伴い疾病構造も変化し、健康維持・増進のための食生活や生活習慣の改善が重要な課題となっている。本講義では、健康の維持・増進に必要な栄養素について科学的に理解し、基本的な生活習慣の問題を押さえたうえで、食事バランスガイドや様々な食品群を活用して正しい食生活と生活習慣を身につけることを目的とする。また栄養学の枠を超え、生活と健康、文化と健康、環境と健康についても考察し、健康リテラシーを高め、生涯にわたって自分で自分を律して生きることができる教養を身につけるウェルネス教育を目指す。本講義では、ウェルネスをWell-Beingなライフスタイルをつくりあげていくという健康観の1つと捉え、授業を通して自分の食生活を見直すきっかけとし、メディアを通して得られる健康科学関連の情報を科学的な根拠に基づき取捨選択をできる力を養い、自分自身の幸福な生き方の実践につなげていくことを目標とする。",
        "outcomesMeasuredBy": "到達目標は、健康の維持増進と生活習慣病予防を自己判断し、実践する力を養うことである。具体的には次の通り。・国際的な見地から健康を捉え、また海外の健康と栄養に関する幅広い知識を身につける（国際的な教養）・栄養と健康について科学的に探究し実証的に真理を解明する（実学に基づく専門能力）・生活習慣病予防の具体的な方策として養生について学ぶ（問題解決力）・ウェルネスなライフスタイルという健康観を確立する（論理的な思考力）・健康づくりにおける栄養素の重要性の理解（論理的な思考力）・生活習慣病の成り立ちの理解と生活習慣病予防策の実践（論理的な思考力）・運動と栄養を組み合わせた健康的な生活習慣の獲得・食の安心、安全な見分け方の実践（分析・評価能力）",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "対面授業。授業毎にmoodleに挙げた動画を視聴し、予習を行う。予習の内容は、課題の確認、重要ポイントの確認、見通し自分の考えを持つこと。本授業では、知識を身に着け、理解度を確認し、知識を活用する学習を行う。さらに課題を与え、教科横断的な学習で学びを深める。ノートPC必携。",
        "notices": "履修登録期間中に履修登録を行ってください。",
        "preparatoryStudy": "普段から関係する新聞記事や雑誌、ニュースなどの情報に注意を払い、栄養や健康に興味を持つように心がける。映像資料を予め視聴したうえで授業に挑むこと（授業では課題を中心に反転授業形式で行う）。",
        "gradingGuidelines": "小テスト（50％）と授業内のレポート課題（50％）の総合評価とし、60％以上の成績をもって単位を認定する。課題に対するフィードバックは、Moodleなどを通じて行う。",
        "textbook": "稲山貴代・大森玲子編著『食と健康の科学』第3版（建帛社）",
        "referenceMaterials": "・日本フードスペシャリスト協会編集（2010）『栄養と健康』（建帛社）・財団法人日体協協会スポーツ医科学専門委員会監修（2001）『アスリートのための栄養・食事ガイド』（第一出版）・藤井久雄編著（2010）『スポーツの栄養学』アイ・ケイコーポレーション・佐々木敏著（2015）『栄養のデータはこう読む！』女子栄養大学出版部",
        "courseSchedule": "第1回：ガイダンス・健康とは第2回：三大栄養素の役割第3回：ビタミンの役割第4回：ミネラルの役割第5回：食事バランスガイド第6回：エネルギーのバランス第7回：食の安全第8回：ライフステージ毎の栄養と健康（子ども・若者世代）第9回：ライフステージ毎の栄養と健康（シニア世代）第10回：生活習慣と健康第11回：生活習慣病予防と健康管理第12回：生活・文化と健康第13回：環境と健康第14回：食育活動の実践第15回：スポーツ栄養学",
        "courseDataUpdatedAt": "2024\/01\/25"
    },
    "updateAt": "2024\/05\/29"
}