{
    "lectureCode": "U60121",
    "courseName": "解剖学I[理学作業]",
    "lecturer": [
        "阿部達彦(医療保健学部リハビリテーション学科作業療法学専攻)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "火4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "身体の運動は骨格と骨格筋の協同作業により行われるので、これらをあわせて運動器という。歩行などの全身運動、指を使うなどの局所（部分）運動、そして姿勢の維持、喜怒哀楽の表現などは、人体の多様な運動は約200個に及ぶ骨が互いに連結されてできる骨格と、その骨格を構成する骨に付着している骨格筋の収縮によって生じる。また筋の収縮の指令は神経の刺激によってなされている。人体の基本構造である骨については個々の骨の名称・位置・構造・働き・特徴を、筋については骨格筋の名称とその働きについて、また筋の支配を行っている末梢神経を同時に理解して学修する。本科目は人体に対する論理的な思考力を修得できる。",
        "outcomesMeasuredBy": "骨格・筋系の構造と機能、正常な人体のしくみと構成を学ぶ。身体の運動は、神経系の調節を受け、骨格と筋が協力して行っている。骨格系では身体を支えている骨について、個々の骨の名称・位置・構造とその働きを理解する。筋系では骨格筋の名称およびその働きを理解する。",
        "learningOutcomes": "論理的な思考力分析・評価能力",
        "teachingMethod": "毎回の授業内容は事前に示し、それらについて教科書・講義資料を用いた講義・解説を行う。を行う。moodle上で講義資料を多量に配布する予定ですので、保管するためのA4のクリア・ファイル等を用意して下さい。",
        "notices": "本科目の内容と構成は、骨学、筋学および神経学の末梢神経系です。学修内容の性格上、骨学は独立して先に学習し、末梢神経の走行とその支配を意識しながら筋について学びます。したがって指定の教科書には記載がない（解剖学Ⅱの指定教科書には記載があります）神経についての学習も先行して行うことになります。",
        "preparatoryStudy": "解剖学Ｉを十分に学修しその効果を得るには解剖学用語、医学用語に早く慣れることである。その状況を作るための予習・復習・自習を十分に行うことが必要である。具体的には、内容を教科書で確認し、事前に講義資料が配布された場合はそれらに目を通しておく。復習にあたっては、その回に学習した内容を記憶できるように各自で整理を行い、疑問点などが生じた場合は早急に講義担当者に質問すること。",
        "gradingGuidelines": "課題10％、期末試験90％で評価し、100点満点中、60点以上で単位認定とする。なお講義終了時に小テストを行い、この成果も成績判定の一部とする。",
        "textbook": "分冊解剖学アトラスⅠ第6版運動器W.Platzer(著)、平田幸男(訳)文光堂",
        "referenceMaterials": "阿波清五郎の解剖学語呂合わせ鹿野俊一著理工図書プロメテウス解剖学コアアトラス(第2版)監訳：坂井建雄医学書院「リハビリテーション解剖アトラス」医歯薬出版標準理学療法学・作業療法学専門基礎分野解剖学（第4版）シリーズ監修：奈良勲/鎌倉矩子編集：野村嶬医学書院他の参考図書については個別に相談すること。",
        "courseSchedule": "第1回:骨格系総論：骨の機能、形成、連結と関節の種類について第2回:体幹の骨格：脊柱と胸郭を構成する骨の名称と形態について第3回:上肢の骨格：上肢帯と自由上肢骨を構成する骨の名称と形態および上肢の関節について第4回:下肢の骨格1：下肢帯を構成する骨の名称と形態について第5回:下肢の骨格2：自由下肢骨を構成する骨の名称と形態および下肢の関節について第6回:頭蓋骨1：頭蓋骨（脳頭蓋・顔面頭蓋）の成り立ちについて第7回:頭蓋骨2：脳頭蓋と顔面頭蓋を構成する骨の名称と形態について第8回:筋系・末梢神経系総論：筋の付着、形、補助装置および筋の作用と運動、末梢神経について第9回:体幹の筋：胸筋、腹筋、背筋について第10回:上肢の筋1：上肢帯の筋と上腕の筋について第11回:上肢の筋2：前腕の筋と手の筋について第12回:下肢の筋1：下肢帯の筋と大腿の筋について第13回:下肢の筋2：下腿の筋と足の筋について第14回:頭頚部の筋：頭部の筋と頚部の筋について第15回:神経系：末梢神経系と中枢神経系について",
        "courseDataUpdatedAt": "2025/01/26"
    },
    "updateAt": "2025/03/21"
}