{
    "lectureCode": "U60107",
    "courseName": "解剖学実習II",
    "lecturer": [
        "阿部達彦(医療保健学部リハビリテーション学科作業療法学専攻)",
        "姉帯飛高(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火4",
        "火5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "Ｍ４０５基礎医学実習室",
        "Ｍ４０７生物・化学実習室"
    ],
    "courceDetails": {
        "courseOverview": "前期では運動器系を系統的にかつ二次元的に学んできた。しかし人体はこれらの構造がひとつにまとまった立体的な構造体であるので、本実習の目的は系統別に学んだ人体の構造を立体的な複合構造として学ぶことである。本実習を通して人体解剖骨格標本などを自らの手で積極的に活用し、自らの眼で確かめることを積み重ね、観察し、思考する力を養ってもらいたい。本科目の習得により人体に対する論理的、総合的な思考力が培われる。",
        "outcomesMeasuredBy": "骨格・筋系の構造と機能、正常な人体のしくみと構成を学ぶ。身体の運動は、神経系の調節を受け、骨格と筋が協力して行っている。骨格系では身体を支えている骨について、個々の骨の名称・位置・構造とその働きを理解する。筋系では骨格筋の名称およびその働きを理解する。感覚器系の構造について理解する。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "日程毎に予習課題を行って準備し、実習当日はその回の実習項目、学修目標に従ってスケッチ等を行う。",
        "notices": "前期では運動器系を系統別に学んできたが、解剖学実習Ⅱでは人体構造を立体的に理解するために局所的すなわち身体を部分別に観察学修するので、前期に学んだことを必ず予習・復習したうえで実習にのぞむことが大切である。具体的には予習課題に対し、教科書等で調べレポートにまとめて報告すること。なおレポートは、病気や怪我などで実習に参加できない場合を除き、基本的に提出の遅延は認めない。",
        "preparatoryStudy": "学生は単にレポートをこなすのではなく、メリハリをつけながら余裕をもって予習、復習に励んでもらいたい。予習課題ではその回に観察する身体の部位について「何を観察するのか」、「どのような構造をしているのか」について予想しながら取り組むこと。観察実習では、上手に描くことや要領よく描くことを考えるのではなく、骨同士の連結の状態や筋の重なり方、神経や血管の走行などについて理解することを常に考えること。",
        "gradingGuidelines": "課題50％、期末試験50％で評価し、100点満点中、60点以上で単位認定とする。加点要件課題は予習課題とレポートの内容で評価を行い、総合して50点満点に換算する。期末試験は通常のペーパーテストを行い正答率で50点満点に換算する。これらを合算して100点とした100点満点中、60点以上で単位認定とする。",
        "textbook": "分冊解剖学アトラスⅠ第6版運動器W.Platzer(著)、平田幸男(訳)文光堂",
        "referenceMaterials": "標準理学療法学・作業療法学専門基礎分野解剖学（第4版）シリーズ監修：奈良勲\/鎌倉矩子編集：野村嶬医学書院プロメテウス解剖学コアアトラス(第2版)監訳：坂井建雄医学書院「リハビリテーション解剖アトラス」医歯薬出版",
        "courseSchedule": "第1回:骨の形態・構造・連結（阿部・姉帯）第2回:上肢帯の骨・上腕骨および上肢帯の筋（阿部・姉帯）第3回:前腕の骨と上腕の筋（阿部・姉帯）第4回:手の骨および前腕と手の筋（阿部・姉帯）第5回:上肢とリハビリテーション（姉帯）第6回:脊柱と胸郭の骨格および胸部・腹部・背部の筋（阿部・姉帯）第7回:下肢帯の骨と筋（阿部・姉帯）第8回:大腿骨・膝蓋骨・脛骨と大腿の筋（阿部・姉帯）第9回:腓骨足の骨と下肢・足の筋（阿部・姉帯）第10回:感覚器の末梢と中枢伝導路（阿部）第11回:下肢とリハビリテーション（姉帯）第12回:頭蓋骨1：頭蓋骨（脳頭蓋・顔面頭蓋）の成り立ちについて（阿部）第13回:頭蓋骨2：脳頭蓋と顔面頭蓋を構成する骨の名称と形態について（阿部）第14回:頭蓋骨および頭頚部の筋（阿部）第15回:中枢神経系と末梢神経系（阿部・姉帯）",
        "courseDataUpdatedAt": "2024\/03\/06"
    },
    "updateAt": "2024\/05\/29"
}