{
    "lectureCode": "U60106",
    "courseName": "解剖学実習I",
    "lecturer": [
        "阿部達彦(医療保健学部リハビリテーション学科作業療法学専攻)",
        "野妻敬子(兼任講師)",
        "姉帯飛高(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "Ｍ４０５基礎医学実習室",
        "Ｍ４０７生物・化学実習室"
    ],
    "courceDetails": {
        "courseOverview": "解剖学実習Ⅰでは内臓学と循環器学を中心に学ぶ。解剖学は医療を専門とする者にとって不可欠な勉強で、内容も多岐にわたっている。皆さんが対象とする患者さんの健康を考える時に、人の正常な姿や人体の構造を隅々まで理解しておく必要がある。医療人としての原点となる最も基本的な解剖学を勉強する。なお本実習は受講者を2つのクラスに分け、各回、講義と実習を1コマずつ受講することになります。",
        "outcomesMeasuredBy": "人体の形態学的な構造のうち、特に内臓系、脈管系、神経系の基本的な構造を理解し、将来的に勉強するであろう臨床科目のバックグラウンドとなる基礎知識を確立する。本科目は人体に対する論理的な思考力を修得できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "基本的に教科書の内容に準拠した講義と実習を行う。2時限連続の実習のため講義と実習をそれぞれ1時限ずつ受講すること。人数的な制限から「1時限目:講義、2時限目：実習」、「1時限目:実習、2時限目：講義」の２グループに全体を分割して実習を行う。また、本年度はアクティブラーニングの一環として、指名―解答―解説を中心としたスタイルの講義も適宜行う。",
        "notices": "講義については、通常の講義と同様に教科書や参考資料を中心とした予・復習を行う必要がある。この予・復習が実習課題の予習にもなっているので、おろそかにしないでほしい。スケッチの目的は臓器や器官系の特徴を理解することであり、美しいスケッチを目指す必要はない。「形はどのようであるか」、「大きさは？」、「形が楕円形であるならば縦と横ではどちらが大きいのか」、「器官の集まり方などに法則性はあるのか」などと詳細に調べ上げていくのが観察であり、スケッチはその記録にすぎない。スケッチしきれないことを言葉で記載することを所見といい、教科書的な知識をコピー＆ペーストすることではない。観察の成否はスケッチ・スキル以前の問題である。",
        "preparatoryStudy": "教科書等を予習することを勧める。既習と思われる内容でも様々な教科書や論文等で勉強を深める癖をつけること。ただし、インターネットで安易に調べることは厳禁とする。また、実習時にも教科書や参考書は必携すること。アクティブラーニング用の問題を配布された場合は、90分程度を目安にした予習を行うこと。正解できなかった問題については十分に復習し、それでも理解できない場合には必ず質問して理解する努力をすること。",
        "gradingGuidelines": "講義50％、実習50％で評価し、100点満点中、60点以上で単位認定とする。加点要件講義は期末試験で通常のペーパーテストを行い、正答率を50点満点に換算する。実習は課題レポートの内容で評価を行い総合して50点満点に換算する。これらを合算した100点満点中、60点以上で単位認定とする。",
        "textbook": "分冊解剖学アトラスⅡ第6版内臓HelgaFritsch(著)、‎WolfgangKühnel(著)、平田幸男（訳）文光堂",
        "referenceMaterials": "人体解剖学改訂第42版藤田恒太郎著南江堂標準理学療法学・作業療法学解剖学第4版野村嶬編集医学書院阿波清五郎の解剖学語呂合わせ鹿野俊一著理工図書プロメテウス解剖学エッセンシャルテキスト(第2版)監訳：中野隆医学書院",
        "courseSchedule": "第1回：講義人体の構造（阿部）第2回：講義消化器系①（阿部）第3回：講義消化器系②（阿部）第4回：講義消化器系③実習１中腔性臓器の構造（全教員）第5回：講義呼吸器系実習２消化管の構造（全教員）第6回：講義循環器系①実習３実質製造機の構造（全教員）第7回：講義循環器系②実習４肝・膵の構造（全教員）第8回：講義循環器系③実習５呼吸器系の構造（全教員）第9回：講義泌尿器系実習６心臓の構造と機能（全教員）第10回：講義男性生殖器実習７循環器系の構造①（全教員）第11回：講義女性生殖器実習８循環器系の構造②（全教員）第12回：講義内分泌系①実習９泌尿器系の構造（全教員）第13回：講義内分泌系②実習１０生殖器系の構造（全教員）第14回：講義皮膚実習１１まとめ実習（全教員）第15回：講義まとめ講義（阿部）",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/05/29"
}