{
    "lectureCode": "U60104",
    "courseName": "生命倫理",
    "lecturer": [
        "岡野浩(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "医療技術と生命工学のめまぐるしい程の進歩は、私たちに多くの恩恵をもたらすとともに、深刻な態度決定を迫るような様々な問題にも直面させる事となりました。この授業では、＜新たな死の形＞としての脳死や移植医療、高度な延命技術とその是非、また多様な生殖補助医療や遺伝子操作等の問題についての基本的な理解を構築するとともに、日本及び世界の動向にも目を向けながら、医療行為や生命工学を通じて確保、実現されるべき＜生命の質（qualityoflife）＞について考えてゆきたいと思います。",
        "outcomesMeasuredBy": "本講義では特に人間の誕生と、死をめぐる医療に焦点を当て、今日の生命倫理の基本的な論点を示す具体的な事件、事例について考える事で、医療専門職として、また一人の社会人として備えておくべき基本的な見識の涵養を目指します。また、移植医療や、安楽死、また生殖補助医療等の重要トピックについて複数回実施する小レポートを通じて、論理的な思考能力、判断の分かれる困難な事例に向き合う問題解決能力、併せて、各自の見解を根拠を明確にしつつ論ずる表現力も養えればと考えています。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "授業は、講義形式で実施いたします。毎回授業前日には文書資料をMoodle上にUPしますので、各自ダウンロード、プリントアウトした上で授業に臨んでください。重要なトピックや問題については、適宜実施する課題やリアクションペーパーを通じて受講者にも意見を求めながら進めてゆく予定です。また、Moodle上に寄せられた受講者の感想や質問を授業時に適宜紹介し、共有する形でのアクティブラーニング形式も採用しています。",
        "notices": "この授業で取り上げる問題はどれも、医療従事者としてはもとより、一般社会人としても受講者自身がその人生の中で直面する可能性のあるものばかりなので、＜単なるトピックとしてのみ捉える＞のではなく、＜自らに引き受け考える＞緊張感を持って授業に参加してください。授業をより実りあるものにするためにも意欲的な発言、質問は歓迎します。",
        "preparatoryStudy": "専門的知識は必要としませんが、受講者には日頃から生命倫理をめぐる諸問題にインターネットや新聞、テレビ等のメディアを通じて注意を向ける習慣を身につけて頂きたいと思います。また、授業資料は毎回授業に先立って配布しておくので、配布された資料、レジュメには常にあらかじめ目を通し、授業の方向性、内容等について把握した上で授業に臨むようにしてください。（予習―３０分程）また、授業後には、当日中に、リアクションシートとしてMoodle上の＜感想、及び質問＞を提出し、授業時のメモ等の整理も行ってください。（復習ー３０分程）",
        "gradingGuidelines": "学期末試験と課題（４～５回実施）、リアクションペーパー等（Moodleの機能を利用）を総合して評価します。また意欲的な発言、質問等授業に対する積極的な取り組みを示す姿勢も評価の参考にしたいと思います。",
        "textbook": "指定しません。毎授業時に配布するレジュメ、資料等がその代わりとなります。",
        "referenceMaterials": "H.T.エンゲルハートH.ヨナス他著加藤尚武飯田亘之編『バイオエシックスの基礎欧米の「生命倫理」論』東海大学出版会（他にも適宜紹介してゆきます）",
        "courseSchedule": "第1回:授業方法、概要について説明。生命倫理のあるトピックを取り上げアンケートを行う予定です。第2回:＜生命倫理＞とは何か(1)いわゆる＜生命倫理（bioethics）＞が創始された背景第3回:＜生命倫理＞とは何か(2)「人間の尊厳」と「社会的効用」をめぐる伝統的倫理学説➀第4回:＜生命倫理＞とは何か(3)「人間の尊厳」と「社会的効用」をめぐる伝統的倫理学説②第5回:脳死と臓器移植をめぐる問題(1)脳死とは何か・・・＜新しい死＞の創出をめぐる問題第6回:脳死と臓器移植をめぐる問題(2)改正臓器移植法と脳死臓器移植の問題点第7回:脳死と臓器移植をめぐる問題(3)事例研究にみる移植医療の持つ根本的問題性第8回:安楽死をめぐる議論（1）安楽死の種類と方法、またその問題点第9回:安楽死をめぐる議論（2）事例研究を通じて考える＜生命の質＞をめぐる問題第10回尊厳ある死とは何か(1)いわゆる＜尊厳死＞の一般的定義と問題点第11回:尊厳ある死とは何か(2)＜良き死＞に含意されるものをめぐる問題第12回:生命の誕生に纏わる＜人為的操作＞多様な生殖補助技術とその使用をめぐる問題第13回:体外受精と代理母生殖補助技術の進歩と＜誕生する命の尊厳＞との葛藤第14回:ヒトはいつから人間と言えるのか。ヒト胚の処遇をめぐる問題第15回:遺伝子診断、出生前診断そして、人工妊娠中絶をめぐる",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/05/29"
}