{
    "lectureCode": "U60213",
    "courseName": "臨床薬理学",
    "lecturer": [
        "岸野吏志(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "水4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "代表的な疾患と治療薬について学修し、臨床で繁用される医薬品を安全に使用するための論理的な思考能力と問題解決能力を養う。特に、基礎的及び専門的な臨床薬理学を学修し、薬物の作用機序、作用点や薬効発現、或いは相互作用の要因となる吸収、分布、代謝、排泄などの薬理学的知識と分析・評価能力を習得する。さらに、主な疾患の成因・病態を理解し、薬による治療戦略（治療効果）、用いられる薬の作用機序と副作用、禁忌などの薬物治療学的知識と実学に基づく専門能力を習得し、各薬物の効果的な使用方法について説明できることを目標とする。",
        "outcomesMeasuredBy": "１．薬の果たす役割と適正使用法を説明できる。２．体の中での動き（吸収、分布、代謝、排泄）を説明できる。３．薬の基本的な作用、副作用、及び作用機序を説明できる。４．副作用の概要、薬害の社会的背景、及び被害者救済制度を概説できる。５．代表的な疾病とその治療薬について説明することができる。６．病態時（肝疾患、腎疾患、等）の適正な薬物使用法を説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "毎回、Powerpointファイルで講義を行う。また、同時に講義内容に沿った復習問等を提示し、授業の理解度を確認する。尚、講義では可能な限り動画等を利用し、理解度の向上をはかる。",
        "notices": "これまで学んだ薬理学の基本的な知識の確認を行う。特に、毎回、閲覧可能とする問題を利用し、授業内容の理解に努める。尚、不明な所、理解できない所は必ず参考書等を用いて確認し、理解を深める。",
        "preparatoryStudy": "これまで学んだ薬理学の基本的知識、特に代表的な疾患に対する治療薬について理解・再確認し、習得しておく。授業の進行に遅れないように予習に努める。参考書等を一読でよいから必ず読んで授業に臨むこと。",
        "gradingGuidelines": "１．成績評価方法課題レポート50％、授業参画度（学習態度など、総合的に評価）50％2．成績評価基準・代表的な疾病とその治療薬について説明することができるか・患者個々の病態に適した薬物療法を考察できるか",
        "textbook": "毎回、講義内容のPDFを配布する。また、授業の理解度を確認するために、講義内容に沿った復習問題を提示する。",
        "referenceMaterials": "授業中に適宜紹介する。",
        "courseSchedule": "第1回:概要（薬の役割、剤型、最適な薬物療法の考え方など）第2回:体内での薬の動き（薬物応答性の個体差、治療の個別化など）第3回:医薬品の最適な投与法１（治療モニタリング、TDMなど）第4回:医薬品の最適な投与法２（PK/PD理論など）第5回:薬物相互作用（薬効に影響を与える因子、薬物・薬物間相互作用、薬物・食物間相互作用など）第6回:医薬品の管理（劇薬、毒薬、麻薬、生物製剤、消毒薬、保管方法、配合変化など）第7回:院内感染と回避方法（予防策など）第8回:有害事象と対応策（初期症状、臨床検査値など）第9回:治療方針決定の根拠（臨床問題の解決方法、EBMなど）第10回:循環器系疾患と治療薬（強心薬、抗不整脈薬、利尿薬など）第11回:代謝疾患と治療薬（フィブラート系、HMG-CoA還元酵素阻害薬など）第12回:消化器疾患と治療薬（PPI、健胃消化薬、鎮けい薬、制吐薬など）第13回:内分泌疾患と治療薬（糖尿病治療薬など）第14回:悪性腫瘍と治療薬（アルキル化薬、抗生物質、代謝拮抗薬など）第15回:まとめ（医療倫理、臓器移植、薬剤疫学など）",
        "courseDataUpdatedAt": "2025/01/13"
    },
    "updateAt": "2025/03/21"
}