{
    "lectureCode": "U60205",
    "courseName": "リハビリテーション医学",
    "lecturer": [
        "清水潤(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "リハビリテーションといった概念が確立されてから久しいが、まだ新しい学問である。対象疾患も広がり変化している。その概念と歴史を理解し、これからリハビリテーションに関わる医療人となるための基礎知識を身につけることを目的とする。対象とする障害の概念を理解し、障害の機能解剖を学ぶ。また、介護保険、障害者支援法などの社会資源についてもふれる。各論では、脳血管障害、脊髄障害、末梢神経、筋障害などの神経内科での知識の上に、リハビリ治療対応を考える。脳外傷、高次脳機能障害については専門の外部講師に講義していただく。呼吸器リハビリ、心臓リハビリ、腎臓リハビリなどの言葉も聞かれるようになっている。これら新しい分野のリハビリテーションについても内部障害としての講義を行う。",
        "outcomesMeasuredBy": "臨床の場でリハビリテーション治療を行うためには、内科疾患、外科疾患ばかりでなく、患者の心の状況への把握が必要である。本講義では、リハビリテーションに関連した個々の患者の問題点の分析・評価能力を身に着け、さらに、さまざまな医学的知識をいかに患者に還元できるように統合するかの論理的な思考力を身に着ける。",
        "learningOutcomes": "問題解決力",
        "teachingMethod": "プリント配布、パワーポイントによるスライド使用で行う。小テストや課題などを行い、理解の確認を行う。",
        "notices": "各講義日で内容は異なるため、その都度理解していく積み重ねが必要である。疾患や病態に関しての基礎的な知識を確立してはじめて、有効なリハビリテーションの実践的知識を得ることが可能となる。ただ知識を覚えるだけでは無意味であり、常に背景の機能解剖・生理に戻り考えるようにしてほしい。",
        "preparatoryStudy": "総論の一部、各論では神経内科をふくめた臨床医学基礎事項の復習が必要である。毎回のテーマに関係する部分を復習しておくこと。（目途：60分程度）毎回の講義のあとには小テストが課題として出されるので復習すること。（目途：30分程度）",
        "gradingGuidelines": "期末試験で評価する。授業終了後に行う小テストおよび授業に対する取り組みも評価に加味する。",
        "textbook": "Crosslinkbasicリハビリテーションテキストリハビリテーション医学メジカルビュー社",
        "referenceMaterials": "江藤文夫・里宇明元（監修）「リハビリテーション医学（第三版）」医歯薬出版株式会社柳澤信夫（監修）「見て知るリハビリテーション医学」丸善出版リハビリテーションビジュアルブック学研",
        "courseSchedule": "第1回：リハビリテーションの歴史、概念第2回：介護保険・身体障碍者手帳・ADL第3回：廃用症候群、サルコペニア第4回：運動障害、痙縮、固縮、拘縮第5回：摂食、嚥下障害第6回：膀胱直腸障害第7回：脳血管障害とリハビリテーション第8回：脊髄損傷とリハビリテーション第9回：内部障害とリハビリテーション(1)第10回：頭部外傷とリハビリテーション第11回：高次機能障害とリハビリテーション第12回：内部障害とリハビリテーション(2)第13回：まとめテスト第14回：神経疾患とリハビリテーション(1)第15回：全体のまとめ",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/05/29"
}