{
    "lectureCode": "U60207",
    "courseName": "神経内科学",
    "lecturer": [
        "清水潤(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "人間は大脳皮質で認知し考え、言葉でそれを表出し、コミュニケーションをとって生活をしていく。同時に、周囲の状況を判断し行動し危険から身を守り、食料確保をしてきた。この認知し行動していく経路の障害、感覚、認知の障害で危険から身を守れず、動いて自ら活動をすることができなくなり、高次脳機能障害、感覚障害、運動障害といった障害が生じる。神経内科疾患はこれら障害の疾患であり、脳血管障害、脊髄障害、神経筋疾患など、療法士が治療に関わる患者のかなりの％を占める。前半では、機能解剖に基づき疾患の病態を学び、後半では各論として疾患ごとの病態、症状、治療を学ぶ。神経疾患に対し、リハビリテーションに関わる医療人として、どう向き合っていくか、治療法としてのリハビリテーションの役割を考えながら講義をすすめる。",
        "outcomesMeasuredBy": "神経内科疾患は神経解剖・生理を理解すると障害部位を理論的に推測できるものが多く、論理的な思考力を身に着ける。学んだ基礎的知識を組み立て、疾患の症状や現象を分析・評価する能力を身に着けることも目標とする。将来、患者の治療に当たるとき、個々の患者の問題点を調べる姿勢の取得も目標とする。",
        "learningOutcomes": "論理的な思考力分析・評価能力",
        "teachingMethod": "プリント配布とスライド併用での講義をする。神経系の解剖学、生理学の理解がないと、疾患の理解は困難である。簡単な解剖の復習、症候学から行い、ビデオの使用も行う。理解の定着をはかる目的で小テストを行う。",
        "notices": "医学一般、特に神経内科学は解剖学用語を覚える必要はあるが、暗記の学問ではなく、理解することが重要である。毎回、履修する項目は異なり、前の積み重ねの上になりたっている。このため、欠席すると理解しにくい事態になる。やむを得ず欠席した場合はすぐにプリント、課題などで自己学修をすることが必要である。復習はその回ごとの、課題、小テストでしっかり行うこと。試験前のまとめての暗記では理解することは不可能である。",
        "preparatoryStudy": "教科書には毎回の講義のテーマに関係する解剖学、生理学の記載があるので、そこは１年で学習した知識の復習にもなるので是非読んでおくこと。（目途：60分程度）毎回の講義のあとには小テストが課題として出されるので復習すること。（目途：30分程度）",
        "gradingGuidelines": "期末試験で評価する。授業終了後に行う小テストおよび授業に対する取り組みも評価に加味する。",
        "textbook": "標準理学療法学・作業療法学専門基礎分野神経内科学医学書院",
        "referenceMaterials": "神経内科学テキスト南江堂第4版ベッドサイドの神経のみかた南山堂神経局在診断学文光堂",
        "courseSchedule": "第1回：神経内科疾患の概要、機能解剖第2回：運動神経・感覚神経系の機能解剖と診察第3回：脳神経系・小脳系の機能解剖と診察第4回：自律神経系の障害、不随意運動（1）ビデオ第5回：基底核系の障害、意識障害、不随意運動（2）ビデオ第6回：高次脳機能障害第7回：脳画像と疾患第8回：脳血管障害第9回：中間のまとめ、テスト第10回：変性疾患（1）第11回：変性疾患（2）第12回：免疫性神経疾患、神経感染症第13回：末梢神経疾患第14回：筋疾患第15回：後半のまとめ",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/05/29"
}