{
    "lectureCode": "U60214",
    "courseName": "整形外科学",
    "lecturer": [
        "熊本久大(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "解剖学・生理学の知識を基礎として、運動器疾患についての知識を深める。総論：整形外科の守備範囲。骨関節、脊髄・末梢神経、筋の機能ならびに病態、運動器疾患の診察、画像診断、治療の基礎を学ぶ。各論：骨・関節の外傷（骨折・脱臼、靭帯損傷）、神経障害・外傷（脊椎疾患、脊髄損傷、末梢神経損傷）、関節リウマチ、骨軟部腫瘍、骨粗鬆症、変形性関節症、小児の疾患・スポーツに伴う外傷や障害を学ぶ。ただし、これらの内容、特に各疾患などは教科書を読めばある程度得られる知識でもある。そのため、実際の授業では実際の現場での経験などを中心に提示していく。そしてこれらの学習を通し、その得たものがが単なる知識ではなく、実際の現場・自分の将来において活用出来る活きた経験になるように解説していく。",
        "outcomesMeasuredBy": "1.運動器疾患の基礎である骨関節、神経・筋の構造や病態の理解。2.整形外科的な診断ならびに治療についての総体的知識の習得。3.運動器障害を起こす主な疾患の総論と各論についての学修。4.チーム医療の時代に対応できる協調性の基礎となる知識の獲得。",
        "learningOutcomes": "実学に基づく専門能力",
        "teachingMethod": "講義（90分）。スライドでの疾患概要や説明、症例提示、要約が基本。講義は全てスライドによる提示となるが、スライドに提示されていない事項も口述されるため、ただスライドを見るだけではなく、ノートに書き留めるという体感が医学の知識を高めるために必須となる。必要に応じて板書や実演も行う。整形外科の範囲は広く、15回の講義でその全てを網羅することはできないため授業に関連した項目を参考書で自習する必要がある。講義の進行具合によって、多少、テーマが前後にずれる可能性あり。",
        "notices": "私語は禁止だが必要な発言は積極的に行う事。また、グループワークなどを行う場合も積極的に行動する事。疑問があれば授業後に質問し、出来るだけその日の内に解決する事。授業中はスライドに提示されている事以外に、口述する内容にも重要な事柄が含まれているため、メモをとることを忘れない事。",
        "preparatoryStudy": "予習・復習を十分に行う事。特に運動器に関わる解剖学（骨・関節・靭帯・筋肉など）、生理学の知識を確認しておくこと。",
        "gradingGuidelines": "成績評価：小テスト（30％）と期末（70％）に筆記試験で評価する。評価の基準：整形外科疾患での身体障害についての理解が大切であり、授業での写真・図表での解説を基に、学生が自ずから患者さんに的確な対応が出来るために必要な知識を得られているかを合格基準とする。",
        "textbook": "標準整形外科学医学書院総編集",
        "referenceMaterials": "解剖学カラーアトラス、ネッター解剖学、プロメテウス解剖学アトラス等",
        "courseSchedule": "第1回：整形外科とは？第2回：整形外科の基礎科学（骨関節の構造・病態生理、筋・神経の構造）第3回：整形外科の診断総論（基本的な評価法;）第4回：整形外科の治療総論（保存療法、手術療法の基礎）第5回：運動器疾患の画像診断第6回：外傷各論１第7回：外傷各論２第8回：変性疾患、骨粗鬆症第9回：関節リウマチ、全身性疾患第10回：脊椎疾患第11回：上肢の運動器疾患第12回：下肢の運動器疾患第13回：小児の運動器疾患第14回：スポーツ障害第15回：スポーツ現場での対応、ファーストエイド",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/05/29"
}