{
    "lectureCode": "U60216",
    "courseName": "公衆衛生学演習",
    "lecturer": [
        "細田武伸(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "公衆衛生学は、人々の生命と生活を築き、またこれを守るための学問である。したがって、疾病の治療のみでなく、積極的な健康増進に到る広い範囲を包含する。本科目では、リハビリ専門職に必要な公衆衛生学の意義と目的、歴史とともに、人々の健康状況の動向および疾病予防や健康増進対策について理解する。本講義は、文部科学省大学教員資格審査にておいて、当該科目の教授の資格がありと判定された教員が講義を行う。",
        "outcomesMeasuredBy": "公衆衛生学は、医療を学ぶ学生にとって共通の科目である。従って、リハビリ専門職として、本科目やそれ以外の授業で学んだ知識を統合し、集団（住民）の健康を守るために必要な分析・評価能力を身に着け、各々が何ができるかを考えられるようになることを目標とする。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力",
        "teachingMethod": "パワーポイントとパワーポイントを印刷したレジメを用いて講義を展開する。また、講義中に適時教科書を用い、教科書及び参考書は復習にも用いる。講義終了時には、不定期にて小テストを実施する。また、講義半ばには、課題レポートの提出を求める。",
        "notices": "本学の学生として誇りを持ち、授業に専念すること。講義にて重要な事項は繰り返し話をするので、後で復習ができるようにその場にて、レジメに書き込みや強調をしておくこと。スマホ等の電子機器の使用は、講義終了時の小テストなど許可がある時以外は控えること。",
        "preparatoryStudy": "課題レポートの準備として、リハビリ専門職として、集団（住民）の健康を守るためにはどのようなことができるか、世間のニュースに関心を持ち、自分の考えをまとめておくこと。",
        "gradingGuidelines": "５選択１式又は５選択２式の期末テスト（70％）と不定期に実施する授業終了後の小テスト（20％）、課題レポート（10％）の合算にて評価する。期末テストは、講義範囲から満遍なく作成するため、各講義終了日中に必ず資料等は整理しておくこと。",
        "textbook": "「シンプル衛生公衆衛生学」南江堂",
        "referenceMaterials": "国民衛生の動向２０２３\/２０２４厚生統計協会",
        "courseSchedule": "第1回：講義ガイダンス、公衆衛生の基礎を学ぶ（1）公衆衛生の歴史的経緯と定義について第2回：公衆衛生の基礎を学ぶ（2）プライマリーヘルスケアの定義と目標について第3回：公衆衛生の基礎を学ぶ（3）基本的人権と人権保護①第4回：公衆衛生の基礎を学ぶ（4）基本的人権と人権保護②第5回：公衆衛生の基礎を学ぶ（５）疫学と健康指標、新しい健康概念と健康づくり支援第6回：健康と環境（1）人にとって環境とは何か？（生態系と環境）第7回：健康と環境（2）生活環境の保全と地球環境第8回：日本の社会保障制度と医療制度体系（１）（医療保険制度と医療法）第9回：日本の社会保障制度と医療制度体系（２）（高齢者に対する保健福祉制度と介護保険制度）第10回：日本の社会保障制度と医療制度体系（３）（公的扶助制度）第11回：公衆衛生の実践（1）地域とは何か？（地域保健とリハビリ専門職）第12回：公衆衛生の実践（2）母子保健、成人保健・高齢者保健第13回：公衆衛生の実践（3）精神保健と難病保健（障がいのある者への支援）第14回：公衆衛生の実践（4）感染症予防と対策第15回：公衆衛生の実践（5）学校保健、産業保健の概要",
        "courseDataUpdatedAt": "2024\/01\/29"
    },
    "updateAt": "2024\/09\/12"
}