{
    "lectureCode": "U60302",
    "courseName": "ケアマネジメント",
    "lecturer": [
        "近藤晴彦(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３０２０１教室"
    ],
    "courceDetails": {
        "courseOverview": "ケアマネジメントの定義・概要を理解する。また、ケアマネジメントに基づいて実践される地域言語聴覚療法の実際を学ぶことで、言語聴覚療士の臨床に必要とされる「実学に基づく専門能力」を身につけることを目指す。ケアマネジメントは多職種による協働により行われるため、今日の言語聴覚療法の実践においては、多職種連携は欠かすことが出来ない。そのため、言語聴覚療法の実践の場で求められる「コミュニケーション能力」や「論理的思考力」「問題解決力」を演習やワークショップを通じて養うことを目指す。また、関連職種との円滑な連携には、卒後においても言語聴覚療法および関連領域に関する最新の理論・技術について知っておく必要がある。そのため、臨床実習を含む言語聴覚士の生涯学習について学び、自身の言語聴覚士としてのキャリアについて考え、教育機関から仕事領域への円滑な移行(アクティブトランジション)を促進することを目指す。",
        "outcomesMeasuredBy": "1）ケアマネジメントの定義、概要について説明できる。2）ケアマネジメントに基づき実践される地域言語聴覚療法について説明できる。3）言語聴覚療法の流れについて説明できる。4）地域言語聴覚療法の実践で求められる言語聴覚士のコミュニケーション能力について説明できる。5)臨床実習を含む言語聴覚士の生涯学習について説明できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義を聴講する講義形式を基本とするが、講義の中には症例提示やVTRを用いて、指名―回答を求める対話形式で実施する場面や演習形式で実施する場面もある。また講師をファシリテーターとした『ワークショップ』形式で実施する回もあり、アクティブラーニングのスタイルで授業を行うこともある。",
        "notices": "・コミュニケーション演習Ⅰ・Ⅱの内容を復習しておく。・成人領域の言語聴覚療法に関連する専門知識について復習しておく。",
        "preparatoryStudy": "指定された資料および映像資料がある場合は、事前に目を通してから参加して下さい。",
        "gradingGuidelines": "講義試験（50％）、毎講義終了時に提出する振り返りシート（30％）、受講態度：グループワーク時のコミュニケーション態度、理解度、感想（20％）などの評価を総合して成績に反映させる。",
        "textbook": "指定しない",
        "referenceMaterials": "半田理恵子・他編.標準言語聴覚障害学地域言語聴覚療法学.医学書院（2021）藤田郁代・他編.標準言語聴覚障害学失語症学第3版.医学書院（2021）阿部晶子・他編.標準言語聴覚障害学高次脳機能障害学第3版.医学書院（2021）",
        "courseSchedule": "第1回：ガイダンス介護保険とケアマネジメントの概要第2回：地域言語聴覚療法とケアマネジメント：ICFの概念とその理解第3回：言語聴覚療法の臨床の流れ：発症から介護保険下でのリハビリテーションまで第4回：言語聴覚士に必要なコミュニケーション能力：他職種連携に必要なコミュニケーション能力第5回：言語聴覚士に必要なマネジメント能力第6回：言語聴覚士の生涯学習第7回：臨床実習に向けてのワークショップ第8回：全体のまとめと学修の振り返り、今後の学習目標の設定(試験)",
        "courseDataUpdatedAt": "2024\/01\/26"
    },
    "updateAt": "2024\/09\/12"
}