{
    "lectureCode": "U60303",
    "courseName": "老年医学",
    "lecturer": [
        "海老原覚(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金4",
        "金5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "現在の超高齢社会では多くの人が複数の慢性疾患・障害を同時に抱えている。このような時代において、リハビリテーション医療の重要性はますます増し、そして多様なものになってきている。そこで求められるのは、慢性化した障害を複数抱えながらも、その高齢者の機能を最大限に引き出すようなリハビリテーションである。したがって現代の超高齢社会において質の良いリハビリテーションを行うには、高齢者に頻度の高い内科外科疾患の知識による臓器別の病態理解に加え、臓器横断的な高齢者の障害の把握とその社会的背景までも加味した包括的理解が必須である。そうして初めて、高齢重複障害者のきめ細かいリスク管理のもと効率的なリハビリテーションを行うことが可能となり、真に効果的なチーム医療を行うことができるのである。そのためには高齢者を臓器横断的・包括的に理解することが必要であり、老年医学（geriatrics）はそのための学問である。本授業では高齢者の医療・保健の特徴を、臓器横断的・包括的に講義し、実学に基づく専門能力と論理的な思考力を涵養することにより、実臨床のリハビリテーションにおいて真に役立つ高齢者の理解を目指すこととする。",
        "outcomesMeasuredBy": "本授業の到達目標は実学に基づく専門能力と論理的な思考力を身に着けることである。そのための個々の到達目標は以下のとおりである。１）高齢者の総合的機能評価を行えるようになる。２）高齢者をとりまく社会的背景が理解できるようになる。３）さまざまな老年症候群について原因、症状、対策を述べられる。４）高齢者の終末期に対する考え方が理解できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "授業計画に基づいて講義を行う。主にパワーポイントを用いた講義を行うが、質疑応答による双方向の授業を行う。また、内容によっては学生間の実習形式やワークショップ形式の授業もできるかぎり取り入れていこうと考えている。",
        "notices": "多くの療法士にとって実際にリハビリテーションを行う対象のほとんどが高齢者である。したがって、ここで学んだことが非常に実践的な内容であることを理解して真剣味を持って講義に望んで欲しい。高齢者の疾病が、家庭・社会生活にどのような支障を与え、生き甲斐や人生観にどのように影響をするかという視点で、老年症候群と老年病を理解するように努める。理学および作業療法を学ぶ立場から、１症候の内容とそれらが身体・精神活動に与える影響、増悪因子、２老年病の発症機序と慢性化・進行を阻止する手段、３重複障害のリハビリテーションの意義を理解する。つねに授業をよく理解するように努め、予習、復習を充分に行う。",
        "preparatoryStudy": "本授業が高齢者の臓器横断的理解を目指すものであるゆえ、高齢者に頻度の高い臓器別疾患についてはあらかじめ習熟していることが授業を受ける前提である。はじめにシラバス全体に目を通して、授業全体の趣旨を理解しておく。また授業前に授業タイトルの相当項目について、参考書により事前学修をしておく。",
        "gradingGuidelines": "成績評価は期末試験によって行う。資料持ち込み不可。授業は理解を深めるためにかなり高度な内容までつっこんで講義するが、試験は教科書に記載されている範囲の出題に限る。教科書の内容を理解すれば合格できる水準の問題を出す。",
        "textbook": "改訂版健康長寿ハンドブック日本老年医学会編メジカルビュー2019定価1000円",
        "referenceMaterials": "高齢者総合診療ノート大庭健三編日本医事新報社2014定価5800円老年医学系統講義テキスト日本老年医学会編西村書店2013定価4500円",
        "courseSchedule": "第1回:老年医学の役割と高齢者総合機能評価第2回:高齢者の定義第3回:老年症候群第4回:高齢者の発熱・誤嚥第5回:老化のメカニズム第6回:サルコペニア・フレイルの概念第7回:高齢者の疾患１第8回:高齢者の疾患２第9回:高齢者の転倒・骨折と骨粗しょう症第10回:高齢者の転倒予防のための包括的介入・リハビリテーション第11回:高齢者の精神疾患と認知症第12回:認知症とどう向き合うか第13回:高齢者の在宅医療・施設医療第14回:高齢者の終末期医療・AdvancedCarePlanning第15回:老年医療総括",
        "courseDataUpdatedAt": "2024/02/02"
    },
    "updateAt": "2024/05/29"
}