{
    "lectureCode": "U61201",
    "courseName": "キネシオロジー演習",
    "lecturer": [
        "渡部祥輝(医療保健学部リハビリテーション学科理学療法学専攻)",
        "吉田真一(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "Ｍ５０８理学・作業療法実習室",
        "Ｍ６０８治癒室",
        "Ｍ６０９機能訓練室２"
    ],
    "courceDetails": {
        "courseOverview": "人間の身体運動を構造と機能の視点から、実習を通して運動学の知識を深めていく。この実習では、観察を通して人間の身体運動の特徴とそれに伴う諸現象の理解を深めることを目的とする。また、課題に基づいたデータ収集を行い、その結果を考察し報告する。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "(1)身体運動を運動学的用語を使用し表現および再現できる。(2)身体運動の観察と実習を通して、人間の運動・動作の特徴とそれに伴う諸現象を口頭およびレポートで説明できる。(3)課題から得られたデータから、結果・考察し報告することができる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "キネシオロジーに関する知識について、提示した課題により実際の身体運動を通して確認、理解していくため、グループ学修を中心に実施する。また、各課題を運動学的に考察し、グループ発表を行う。このグループワークを通して学生の主体的な学び（アクティブラーニング）を促す。課題実施の際に、データ解析や、発表資料作製、プレゼンテーションを行うため、ノートPCは必携となる。",
        "notices": "積極的な学習姿勢で、授業に参加すること。グループワークではメンバーと積極的にコミュニケーションを取り、課題に全員で課題に取り組むこと。教科書の情報だけでなく、研究論文などの情報を積極的に収集し、課題に取り組むこと。",
        "preparatoryStudy": "演習に関連する解剖学、基礎運動学、筋骨格系のキネシオロジーなどの教科書で予習して授業に参加すること．実習に関する予備資料を復習し、演習課題に望むこと（６０分程度）",
        "gradingGuidelines": "発表会の資料（２０％）課題レポート（６０%）最終発表（２０％）最終授業で全体に対するフィードバックを行う。加点減点要件：実習およびグループワークの参加態度",
        "textbook": "西守隆・他：動作のメカニズムがよくわかる実践!動作分析、医歯薬出版",
        "referenceMaterials": "有馬慶美(翻訳）：筋骨格系のキネシオロジー、医歯薬出版中村隆一他：基礎運動学医歯薬出版",
        "courseSchedule": "第1回：オリエンテーションー渡部吉田第2回：講義（立ち上がり動作の特徴と分析方法）ー渡部吉田第3回：演習（立ち上がり動作の運動学的分析）ー渡部吉田第4回：発表会（立ち上がり動作の運動学的分析の考察）ー渡部吉田第5回：講義（歩行の基本的指標を用いた分析方法）ー渡部吉田第6回：演習（歩行の基本的指標を用いた分析）ー渡部吉田第7回：発表会（歩行の基本的指標を用いた分析の考察）ー渡部吉田第8回：講義（身体活動とテコ、筋の長さ張力関係の分析方法）ー渡部吉田第9回：演習（関節の角度と筋張力の関係の分析）ー渡部吉田第10回：発表会（身体活動とテコ、筋の長さ張力関係の考察）ー渡部吉田第11回：講義（姿勢のと重力の関係の分析方法）ー渡部吉田第12回：演習（姿勢の観察と身体に加わる負荷による姿勢変化の分析）ー渡部吉田第13回：発表会（姿勢の観察と身体に加わる負荷による姿勢変化の考察）ー渡部吉田第14回：最終発表会（プレゼンテーション）ー渡部吉田第15回：課題の解説・まとめー渡部吉田",
        "courseDataUpdatedAt": "2024\/01\/18"
    },
    "updateAt": "2024\/05\/29"
}