{
    "lectureCode": "U62103",
    "courseName": "早期体験実習",
    "lecturer": [
        "池田晋平(医療保健学部リハビリテーション学科作業療法学専攻)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金",
        "金2",
        "金3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "Ｍ６０５手工芸室"
    ],
    "courceDetails": {
        "courseOverview": "作業療法士がその対象となる人々に対しどのような支援をしているのか、実際の現場を見学し体験することで学ぶ。作業療法士が医療現場のみならず介護保険サービスや障害福祉サービスでも必要とされていることを理解し、それぞれの領域の作業療法士の役割・責任そしてやりがいについて自ら考え学ぶ。この科目は、医療現場において実務経験を有する専門職が、その経験に基づいた実習を行う実践的科目である。",
        "outcomesMeasuredBy": "1.作業療法士がその対象となる人々にどのような支援をしているか説明できる。2.作業療法の実際場面から、作業療法学概論や専門基礎科目で学んだ知識を確認できる。3.現場を見学することで新たに関心を広め、それについて主体的に学ぶことができる。4.作業療法学生としての実習に臨む態度・姿勢を身につける。本科目は，本学の3ポリシーで定める「実学に基づく専門能力」，「コミュニケーション能力」，「論理的な思考力」を養うものである．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力",
        "teachingMethod": "作業療法士が働く病院・施設等の見学実習の形態をとる。4～5名の班に分かれ、作業療法士が働く急性期・回復期病院、精神科病院、デイケア・デイサービス、介護老人保健施設、自立訓練・就労支援など障害福祉サービス領域、発達障害領域の施設等に出向き、そこで作業療法士から施設の機能や作業療法の業務について説明を受け、作業療法士がどのような支援をしているか実際場面を見学する。実習後は学内で振り返りと報告書を作成することで、到達目標に向けた理解を深めていく。また、この実習から関心を持ったテーマに対し主体的に学ぶ姿勢や方法についても理解を深める。",
        "notices": "学内および学外においてやむを得ない理由以外の遅刻・欠席には十分注意する。体調管理も怠らないこと。見学の際の服装、身だしなみ、態度等に関する注意事項についてオリエンテーションで説明する。見学の際は注意事項を厳守し、病院・施設の職員、患者様・利用者様にご迷惑を掛けないよう考えて行動する。",
        "preparatoryStudy": "作業療法士が働く領域およびその特徴、他職種の役割、連携について事前に学修しておくこと。",
        "gradingGuidelines": "オリエンテーションも含めた実習への取り組む姿勢・態度(20%)、レポート内容(60%)、発表(20%)を総合して評価する。",
        "textbook": "小林法一／小林隆司編著：最新作業療法学講座地域作業療法学，医歯薬出版",
        "referenceMaterials": "担当教員ならびに各実習施設の見学を担当する教員から情報を得ること。",
        "courseSchedule": "第1回：学内オリエンテーション（１）授業概要の説明（池田），視覚・聴覚・コミュニケーション障害体験（池田）第2回：学内オリエンテーション（２）身だしなみ①（石橋），障害者・高齢者の地域生活支援（池田），車椅子体験（伊藤）第3回：学内オリエンテーション（３）疾患・障害等の理解①（発達領域：伊藤），標準予防策・リスク管理・コミュニケーション（伊藤），疾患・障害等の理解②（身障領域：酒井）第4回：学内オリエンテーション（４）疾患・障害等の理解③（精神領域：清家），身だしなみ②（石橋），発達領域の実習心得（特別講師）第5回：学外実習（１）見学・体験、学内振り返り第6回：学外実習（２）見学・体験、学内振り返り第7回：学外実習（３）見学・体験、学内振り返り第8回：学外実習（４）見学・体験、学内振り返り第9回：学外実習（５）見学・体験、学内振り返り第10回：学外実習（６）見学・体験、学内振り返り第11回：学外実習（７）見学・体験、学内振り返り第12回：学外実習（８）見学・体験、学内振り返り第13回：学外実習（９）見学・体験、学内振り返り第14回：学内報告会に向けた準備（池田・伊藤）第15回：学内報告会／まとめ（池田・伊藤）※実習地の受け入れ状況により、第5回～第13回は流動的なスケジュールになる可能性がある。",
        "courseDataUpdatedAt": "2024/01/23"
    },
    "updateAt": "2024/05/29"
}