{
    "lectureCode": "U63103",
    "courseName": "神経系の構造・機能・病態",
    "lecturer": [
        "永井知代子(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "言語聴覚士は，神経系に障害のある方の症状の評価や治療に携わります．様々な神経疾患について学ぶ上で基礎になるのが，神経解剖学と神経生理学の知識です．国家試験出題基準の大項目として掲げられているのが「神経系の構造・機能・病態」で，解剖学・生理学のほか，臨床神経学の総論に当たる，神経症候学と検査法についての項目が含まれています．この授業では，前半で中枢神経・末梢神経の解剖と生理について学び，後半では神経症候学と検査法について学びます．神経系は構造的にも機能的にも緻密な階層構造があります.全体と部分,部位と部位の関係を学ぶことにより,論理的な思考力や分析・評価能力が培われます.",
        "outcomesMeasuredBy": "神経系の構造・機能・病態の知識は，神経内科学や失語・高次脳機能障害学を学ぶ上で必須事項です．到達目標としては，第一に主要な神経系の名称・働きを言えるようになること，第二にそれらが障害されたときに生じる症状の概要を言えるようになることが挙げられます．",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "スライドを用いて説明します．スライド内容はPDFにして配布しますので，適宜メモをとりながら聞いて下さい．第7回・第15回では，それぞれ前半・後半の復習として問題を解いてもらい，授業の後半で解説をします．また，各回の最後に宿題を出し，次の回で解説をしますので，しっかり復習して下さい．国家試験過去問も時々紹介し，どのような知識を習得することが求められているのかを実感していただきます．対面授業の場合は，指名して答えてもらいます．また，授業の中では度々質問を投げかけるので，答えられるようにして下さい．そのためには，常に自ら疑問を持ちつつ授業を聞くことが大切です．自ら疑問を持って，その答えを自ら探すことが真のアクティブラーニングになります．",
        "notices": "毎回次々と新しい難解な単語が出てくるので，まずは言葉に慣れることが大事です．あらゆる感覚器と運動器を使って覚えるようにして下さい．つまり，単語を見るだけでなく，声に出して何度も言ってみる，書いてみる，あるいは絵に描いてみることです．特に解剖に関しては，自分で脳の絵を描けるようになって下さい．また，覚えているかどうか，１週間以上たった頃にチェックしてみることも大事です．",
        "preparatoryStudy": "予習：教科書や参考書で，次の回のタイトルに該当する箇所を軽く読んでおいて下さい．授業はスライドとプリントを中心に進めますが，事前の知識があると理解が楽になります．復習：スライドの最初に，各回に出てくる重要なキーワードを10個ほど挙げます．授業終了後は，これらのキーワードを自分のことばで説明できるかどうか試してみて下さい．また，毎回宿題を出すので答えを書いておいて下さい．",
        "gradingGuidelines": "定期試験の成績を80%，授業内で行う小テストや質問・積極的発言の回数などを20%として，総合的に評価します．",
        "textbook": "15章で学ぶビジュアル臨床神経学出版社：医歯薬出版",
        "referenceMaterials": "病気がみえるvol.7脳・神経MEDICMEDIA",
        "courseSchedule": "第1回：イントロダクション神経系全体に関する概説と，この授業で扱う内容をオーバービューします．第2回：中枢神経系①構造重要な脳部位や脳血管などの名称について説明します．第3回：中枢神経系②機能大脳皮質や伝導路など，脳部位の役割について説明します．第4回：末梢神経系①脳神経脳神経の構造と機能について説明します．第5回：末梢神経系②脊髄神経・自律神経脊髄神経と自律神経の構造と機能について説明します．第6回：ミクロ神経系の構造と機能ニューロンやグリア，シナプスなど，ミクロ構造と機能について説明します．第7回：前半の復習第6回までの内容に関する問題を解いて，理解を深めてもらいます．第8回：神経症候学１脳神経脳神経の診察法と異常所見について説明します．第9回：神経症候学２運動・感覚運動・感覚機能の診察法と異常所見について説明します．第10回：神経症候学３高次脳機能①高次脳機能とは何かについて，脳科学を基盤として説明します．第11回：神経症候学４高次脳機能②高次脳機能障害にはどのようなものがあるのかについて説明します．第12回：補助検査１放射線学的検査臨床検査のうち，MRIなどの画像検査の方法と異常所見について説明します．第13回：補助検査２生理学的検査臨床検査のうち，脳波などの生理学的検査の方法と異常所見について説明します．第14回：臨床神経学ここまで学んできた神経系の知識をもとに，神経系の疾患について概説します．第15回：後半の復習第8回から第14回までの内容に関する問題を解いて，理解を深めてもらいます．",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/12/09"
}