{
    "lectureCode": "U63110",
    "courseName": "言語発達学",
    "lecturer": [
        "未定(所属なし)",
        "池田泰子(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "言語発達の遅れの有無を判断するには定型発達児の言語発達に関する知識が必須となります。本科目では、実学に基づく専門能力の基礎となる乳児期から学童期までのことばの発達を修得します。さらには、コミュニケーションの発達、言語発達を支える言語以外の能力についても理解し、言語発達の遅れの有無を的確に判断する力を身につけます。この科目は、言語発達障害児を対象とした実務経験を有する専門職がその経験に基づいて講義を行う実践的科目です。",
        "outcomesMeasuredBy": "1．言語発達を説明する主な理論の概要を述べることができる2．「前言語期」「幼児前期（1～2歳）」「幼児後期（3～6歳）」「学童期」各期における言語発達の特徴を説明できる",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "・教科書、配布資料、関連動画を用いてシラバスに沿って講義を進めます。シラバスの授業計画に変更が生じた場合は、その都度説明します。・講義で得られた情報を基に自身の考えを記述するリアクションペーパーを毎回課します。・講義資料はムードルにアップするとともに、こちらで印刷し、配布します。・ノートPCは必携ではありません。使用する場合は事前にアナウンスします。",
        "notices": "※関連科目：（1年後期）発達心理学、小児科学、言語発達障害学Ⅰ（2年前期）言語発達障害学Ⅱ、認知・学習倫理学・リアクションペーパーは、提出期限より後に提出されたものは受け取りません。また、授業に欠席した人の提出は認めません。",
        "preparatoryStudy": "・シラバスに示されている授業計画を確認し、教科書の該当部分を読んで予習を行ってください（30分）・授業における学びを振り返り、理解を深めることを目的として、毎授業後にリアクションペーパーの提出を課します（20分）・復習状況を確認するために小テストを実施します。小テストの実施については、授業時にアナウンスします（30分）。",
        "gradingGuidelines": "定期試験：60％、小テスト：30％、毎回のリアクションペーパー：10％リアクションペーパーは下記の基準で評価を行います。【A】自分の考えを根拠とともに過不足のない形で明確に記述（5点）【B】自分の考えと根拠との関連が認められるが、一部明確でない形で記述（3点）【C】根拠を踏まえた記述ではない（1点）【D】期日までに未提出（0点）",
        "textbook": "標準言語聴覚障害学言語発達障害学第3版:深浦順一・藤野博・石坂郁代編、医学書院、2021年",
        "referenceMaterials": "・子どものことばを育てる:能登谷晶子・原田浩美編、協同医書出版社、2021年・言語学・言語発達学：岩田一成・岩崎淳也編、メジカルビュー社、2022年・ことばの発達入門:秦野悦子編、大修館書店、2001年・よくわかる言語発達:岩立志津夫・小椋たみ子編、ミネルヴァ書房、2005年・言語聴覚士の基礎知識音声学・言語学第2版:今泉敏編、医学書院、2020年",
        "courseSchedule": "第1回：オリエンテーション言語発達とは第2回：言語発達を支える基礎的な能力第3回：前言語期の発達第4回：幼児前期（1～2歳）の言語発達第5回：幼児後期（3～6歳）の言語発達①第6回：幼児後期（3～6歳）の言語発達②第7回：学童期の言語発達、言語発達を説明する理論第8回：まとめ",
        "courseDataUpdatedAt": "2025/03/11"
    },
    "updateAt": "2025/03/21"
}