{
    "lectureCode": "U63101",
    "courseName": "発声発語系の構造・機能・病態",
    "lecturer": [
        "吉原俊雄(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "ヒトが生きるために必須な事象は息をすることと食べることである。すなわち、呼吸と摂食・嚥下が学習する基本的事項となる。ヒトは同じ器官を利用して、ことばを話し他人とコミュニケーションをとることを可能にしている。講義では、呼吸と摂食・嚥下、発声発語器官の構造と機能について学習する。正常な発声発語、摂食・嚥下について修得した後に、発声発語と摂食・嚥下に関わる基本的な病態について理解する。本授業は、2年時以降に学ぶ、発声発語障害学、音声障害学、摂食嚥下障害学などの臨床科目の基礎となるもので、言語聴覚士として必須の基本的知識を身につける場である。音声学、音響学などとも関連付けてしっかりと学習する。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行うことにより専門的能力を身に着ける。",
        "outcomesMeasuredBy": "１．発声・発語、摂食嚥下器官の基本構造を説明できる。２．各発声・発語および嚥下器官の機能と神経制御を論理的思考力を持って説明できる。３．発声・発語（声と構音）の生成のメカニズムを説明できる。４．摂食嚥下のメカニズムを説明できる。５．発声・発語・嚥下のそれぞれの代表的な検査の分析・評価能力を習得して病態を説明できる。６．本授業を学ぶことで実学に基づく専門能力を身につけ、様々な疾患に対応するリハビリテーションの問題解決能力を修得する。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "シラバスおよび授業支援計画書に沿って行うが、授業の進行によってシラバスおよび授業支援計画書に変更が生じた場合、適宜修正を行う。基本的にスライド、資料を使って授業を進めていくが、講義後の復習はとくに重要である。引き続く実習にスムースに移行できるよう理解を深めておくことが大切である。必要に応じて国家試験の過去出題問題も利用していく。",
        "notices": "復習科目：（1年前期)解剖学、生理学の習得は発声発語系の構造・病態・機能の授業において理解を深める上で重要である。",
        "preparatoryStudy": "1．事前学修：各授業回の事前学習に掲載してある内容を確認し、学習を進める。テキストや資料などを使って調べ、分からないところを明確にした上で、授業に臨む。平均６０分。2．事後学修：各授業回の事後学習に掲載してある資料（関連文献・国試過去問など）に取り組む。平均６０分。",
        "gradingGuidelines": "定期試験（70％）、小テスト（20％）、課題や質疑応答の評価（10％）とする。",
        "textbook": "・SUCCESS耳鼻咽喉科第２版.洲崎春海、鈴木衞、吉原俊雄監修．金原出版2021.・言語聴覚士のための基礎知識．耳鼻咽喉科学第3版．田山二朗編集、医学書院2023",
        "referenceMaterials": "・新耳鼻咽喉科学第11版南山堂．野村恭也監修，加我君孝編集．2013・新ことばの科学入門第2版．医学書院，廣瀬肇訳．2008・たのしい音声学．くろしお出版．竹内京子，木村琢也著．2019・言語聴覚士のための運動障害性構音障害学第1版．医歯薬出版，廣瀬肇、柴田貞雄、白坂康俊著．2001",
        "courseSchedule": "第1回：発声発語系の概要第2回：呼吸器系について第3回：喉頭の構造第4回：喉頭の機能第5回：口腔咽頭（構音器官）の構造と機能１第6回：口腔咽頭（構音器官）の構造と機能２第7回：口腔咽頭（構音器官）・喉頭と摂食嚥下について第8回：喉頭の検査第9回：喉頭の病態第10回：口腔咽頭（構音器官）の検査と病態第11回：声のしくみと病態第12回：言語音のしくみと生成第13回：発声発語のメカニズムと音声障害第14回：摂食嚥下の概要と復習第15回：発声発語系および摂食嚥下のまとめ",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/09\/12"
}