{
    "lectureCode": "U63103",
    "courseName": "聴覚系の構造・機能・病態",
    "lecturer": [
        "吉原俊雄(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "石津希代子(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "ヒトの有する感覚器のうち、とくに聴覚の重要性を理解するため基礎的な事項を解説する。1．聴器の構造基本的理解①耳介と外耳道から成る外耳の構造、②鼓膜、中耳腔（鼓室）、耳小骨、耳小骨筋、耳管を含む中耳、③蝸牛、半規管と耳石器、内耳窓、骨迷路と膜迷路、蝸牛神経と前庭神経から成る内耳、④聴覚路、聴覚中枢の概要を学習する。2．聴器の機能として集音機能、伝音機能、内耳機能、聴覚中枢機能、両耳聴と方向覚、平衡機能を理解する。3．聴器の病態は多彩であるが、伝音難聴、感音難聴、混合難聴、中枢性難聴、機能性難聴、関連するめまいや平衡障害を修得します。病態の理解の上で常に解剖、生理を復習しながら進める。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行い、実学に基づく専門能力を身に着けることが目標となる。",
        "outcomesMeasuredBy": "1．外耳から始まる聴覚系の基本構造を説明できる。また、より詳細な組織構造も理解する。2．各聴器の生理学的機能を理解し、機能の意義を説明できる。3．代表的な聴器の病態、即ち具体的な疾患を呈示し、検査結果から分析・評価する能力で基本的病態を説明できる。器官の構造、機能、病態を理解することは、他臓器の病態を理解するためにも基本となることを確認する。4．外耳・中耳・内耳の生理機能を説明可能とすることで論理的な思考力を身につけることができる。5．各疾患を理解し、リハビリテーションに必要な問題解決能力を養う。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "シラバスおよび授業支援計画書に沿って行うが、授業の進行によって、シラバスおよび授業支援計画書に変更が生じた場合、適宜修正を行う。基本的にスライド、資料を使って授業を進めるが、講義前後の予習復習は大切であり、基本的態度を身に着ける。引き続く実習にスムースに移行できるよう理解を深めておくこと。国試過去出題問題も利用して講義を進める。",
        "notices": "復習科目：1年前期で学習した一般解剖学、生理学が聴覚系の構造・機能・病態を理解する上で大切である。",
        "preparatoryStudy": "1．事前学修：各授業回の事前学習に掲載してある内容を確認し、学習を進める。テキストや資料などを使って調べ、分からないところを明確にした上で、授業に臨む。平均６０分。2．事後学修：各授業回の事後学修に掲載してある資料（関連文献・国家試験の過去問題など）に取り組みます。平均６０分。",
        "gradingGuidelines": "定期試験（70％）、小テスト（20％）、課題や質疑応答の評価（10％）とする。",
        "textbook": "・言語聴覚士のための基礎知識耳鼻咽喉科学第３版．田山二朗編集、医学書院2023・SUCCESS耳鼻咽喉科第2版．金原出版，洲崎春海，鈴木衞，吉原俊雄監修．2021",
        "referenceMaterials": "・新耳鼻咽喉科学第11版南山堂．野村恭也監修，加我君孝編集．2013・目でみる耳鼻咽喉科疾患池田勝久編集．文光堂，2017",
        "courseSchedule": "第1回：外耳、中耳の解剖、組織構造について（石津）第2回：内耳の解剖：蝸牛、前庭、蝸牛神経・前庭神経から中枢経路（石津）第3回：聴覚生理：聴覚系の受容のしくみと伝導路について（石津）第4回：耳鼻咽喉科医が行う診察法の実際と理解（吉原）第5回：外耳疾患、中耳疾患Ⅰ：急性中耳炎、慢性中耳炎他（吉原）第6回：中耳疾患Ⅱ：真珠腫性中耳炎、耳硬化症他（吉原）第7回：内耳疾患Ⅰ：先天性難聴、内耳炎他（吉原）第8回：内耳疾患Ⅱ：突発性難聴と関連疾患（吉原）第9回：内耳疾患Ⅲ：音響外傷、騒音性難聴、老人性難聴、機能性難聴（吉原）第10回：内耳疾患Ⅳ：メニエール病、良性発作性頭位めまい症他（吉原）第11回：後迷路性疾患：聴神経腫瘍の病態、顔面神経麻痺（吉原）第12回：めまいと平衡障害、聴覚系との関連について（吉原）第13回：各疾患と各検査法の意義と関連についての理解（吉原）第14回：各疾患の治療含めた対応についての理解と復習（吉原）第15回：聴覚系の構造・機能・病態についてのまとめ、補足（吉原）",
        "courseDataUpdatedAt": "2025/02/10"
    },
    "updateAt": "2025/03/21"
}