{
    "lectureCode": "U63102",
    "courseName": "発声発語系の構造・機能・病態",
    "lecturer": [
        "吉原俊雄(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "外山稔(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "ヒトが生きるために必須な事象は息をすることと食べることである。すなわち、呼吸と摂食・嚥下が学習する基本的事項となる。ヒトは同じ器官を利用して、ことばを話し他人とコミュニケーションをとることを可能にしている。講義では、呼吸と摂食・嚥下、発声発語器官の構造と機能について学習する。正常な発声発語、摂食・嚥下について修得した後に、発声発語と摂食・嚥下に関わる基本的な病態について理解する。本授業は、2年時以降に学ぶ、発声発語障害学、音声障害学、摂食嚥下障害学などの臨床科目の基礎となるもので、言語聴覚士として必須の基本的知識を身につける場である。音声学、音響学などとも関連付けてしっかりと学習する。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行うことにより専門的能力を身に着ける。",
        "outcomesMeasuredBy": "１．発声・発語、摂食嚥下器官の基本構造を説明できる。２．各発声・発語および嚥下器官の機能と神経制御を論理的思考力を持って説明できる。３．発声・発語（声と構音）の生成のメカニズムを説明できる。４．摂食嚥下のメカニズムを説明できる。５．発声・発語・嚥下のそれぞれの代表的な検査の分析・評価能力を習得して病態を説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "基本的にはシラバスの内容に沿って進めるが、内容に変更が生じた場合は適宜アナウンスする。講義教材として、教科書、配布資料（Moodle）、パワーポイントを使用する。また、必要に応じて国家試験の過去問題等も使用する。",
        "notices": "復習科目：（1年前期)解剖学、生理学の習得は発声発語系の構造・病態・機能の授業において理解を深める上で重要である。",
        "preparatoryStudy": "1．事前学修：各授業回の事前学習に掲載してある内容を確認し、学習を進める。テキストや資料などを使って調べ、分からないところを明確にした上で、授業に臨む。（60分）2．事後学修：関連文献・国試過去問などに取り組む。（60分）",
        "gradingGuidelines": "定期試験（70％）、小テスト（20％）、課題や質疑応答の評価（10％）とする。",
        "textbook": "1．洲崎春海,鈴木衞,吉原俊雄監:SUCCESS耳鼻咽喉科,第2版.金原出版,2021.2．田山二朗編:言語聴覚士のための基礎知識耳鼻咽喉科学,第3版.医学書院,2023",
        "referenceMaterials": "1．野村恭也監,加我君孝編:新耳鼻咽喉科学,第11版.南山堂,20132．廣瀬肇訳:新ことばの科学入門,第2版.医学書院,20083．竹内京子,木村琢也:たのしい音声学.くろしお出版,2019",
        "courseSchedule": "第1回：発声発語系の概要（吉原）第2回：呼吸器系（吉原）第3回：喉頭の構造（吉原）第4回：喉頭の機能（吉原）第5回：口腔咽頭（構音器官）の構造と機能１（吉原）第6回：口腔咽頭（構音器官）の構造と機能２（吉原）第7回：喉頭と摂食嚥下（吉原）第8回：喉頭の検査（吉原）第9回：喉頭の病態（吉原）第10回：口腔咽頭（構音器官）の検査と病態（吉原）第11回：摂食嚥下のメカニズム（吉原）第12回：発声発語系の言語聴覚障害１（外山）第13回：発声発語系の言語聴覚障害２（外山）第14回：発声発語系の言語聴覚障害３（外山）第15回：総括（吉原）",
        "courseDataUpdatedAt": "2025/02/09"
    },
    "updateAt": "2025/03/21"
}