{
    "lectureCode": "U63201",
    "courseName": "耳鼻咽喉科学",
    "lecturer": [
        "吉原俊雄(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "耳鼻咽喉科学は現在耳鼻咽喉科・頭頸部外科学と称されている。とくに本領域は感覚器のうち聴覚、平衡覚、嗅覚、味覚を包括する領域である。一方で、呼吸、構音に関わる鼻副鼻腔の解剖生理や疾患、唾液腺疾患、鼻副鼻腔、口腔、咽頭、喉頭、頸部に発生する良・悪性腫瘍、など複雑な機能を有しており、多彩な疾患も発症する領域の学習も必須である。口腔がん、鼻副鼻腔がん、咽喉頭がん、頸部食道がんなどの頭頸部がん、悪性リンパ腫等の診断治療と治療後の後遺症に対するリハビリテーションへの理解が必要となる。言語聴覚士として理解しておくべき本領域の構造、生理、病態について学習することを目的とする。様々な疾患の症状から検査・診断と分析・評価能力を向上することが最終目的である。この科目は、実学に基づく専門能力を身に着けるための実践的科目である。",
        "outcomesMeasuredBy": "コミュニケーションに必須の聴覚系の構造・生理を理解し、疾患については全体像を踏まえてその概略を論理的な思考力により説明しうることが目標である。また発声、嚥下、構音に関連する、耳鼻咽喉科・頭頸部外科領域の構造、組織学的特徴を分析・評価する能力を養う。とくに口腔がん、鼻副鼻腔がん、咽喉頭がんの治療は手術、放射線療法、化学療法が中心となるが、救命しえた場合でも治療後に嚥下障害、構音障害、音声障害などが後遺症として残ることがある。言語聴覚士によるリハビリテーションが必要とされることからも診断から治療、治療後の機能障害への問題解決能力が必要となる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "シラバスおよび授業支援計画に沿って行うが、授業の進行によってシラバス等の変更が生じた場合、適宜修正して進める。基本的にスライド、資料を使用しての授業となる。必要に応じて小テスト、確認テスト（授業中の直接の口頭試問））などが行われる。必要に応じて過去の国家試験問題を利用することもある。",
        "notices": "１年後期で学んだ聴覚系の構造・病態・機能および発声発語系の構造・病態・機能と密接にかかわる内容であり、１年時の授業内容や試験の復習が大切である。疑問に感じたことは、早い時期に教科書や参考書で確認し、必要に応じて授業中あるいはオフィスアワーで教員に直接質問するよう心掛けたい。",
        "preparatoryStudy": "事前学習：毎回の授業の事前に配布してある資料の内容を確認し、学習を進めます。テキストや資料、教科書を利用して授業に臨みます。わからない箇所を明確にして授業に臨み、積極的に質問とする。平均６０分。事後学習：授業で使用した資料のチェック、自身のノートやメモを積極的に記載し、教科書や参考図書、さらに国家試験問題などを利用する。平均６０分。",
        "gradingGuidelines": "授業で使用した資料のチェック、自身のノートやメモを積極的に記載し、教科書や参考図書、さらに国家試験問題などを利用する。成績評価方法・基準定期試験（70％）、小テスト（20％）、課題や質疑応答の評価（10％）とする。",
        "textbook": "言語聴覚士のための基礎知識・耳鼻咽喉科学田山二朗編、医学書院2023病気がみえるvol13耳鼻咽喉科．MEDICMEDIA、2020",
        "referenceMaterials": "参考書新耳鼻咽喉科学第11版南山堂．野村恭也監修、加我君孝編集、2013",
        "courseSchedule": "第1回：耳鼻咽喉科学概要第2回：鼻副鼻腔の解剖、生理、検査第3回：鼻副鼻腔の疾患、治療第4回：頭頸部領域の解剖・生理第5回：頭頸部領域の疾患：炎症、良性腫瘍第6回：頭頸部領域の悪性腫瘍の検査、治療、治療後問題点第7回：唾液腺の解剖、生理、疾患、治療第8回：耳の構造と聴覚の理解第9回：難聴を来す疾患と治療第10回：平衡系の病態、検査、治療第11回：口腔・咽頭疾患とその対応第12回：喉頭疾患とその対応第13回：嚥下障害とその対応第14回：救急、難聴スクリーニング、身体障害者の福祉支援など第15回：耳鼻咽喉科学まとめ",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/05\/29"
}