{
    "lectureCode": "U63202",
    "courseName": "形成外科学",
    "lecturer": [
        "千田大貴(兼任講師)",
        "伊藤智之(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金4",
        "金5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "形成外科学は、 体表面における先天的・後天的な変形や欠損に対する機能的・形態的修復を行う外科系診療科である。皮膚の解剖、生理や創傷治癒過程の知識を習得し、形成外科で取り扱う代表的疾患(顔面外傷、顔面熱傷、口唇顎口蓋裂、頭蓋・顔面・耳介の先天異常など)の診断と治療、皮膚移植や遊離組織移植といった再建外科学の概略を学ぶ。また形成外科で行われる治療は嚥下や発声と行った分野に深く関連しており、言語聴覚士として適切な行動を取るために必要な専門能力、論理的思考力、分析・評価能力を高める。",
        "outcomesMeasuredBy": "・形成外科学とはどんな学問分野であるか理解する・形成外科学の社会的意義について説明できる・形成外科学における対象疾患の種類について挙げることができる。・形成外科学における代表的な手術手技について説明できる。・形成外科学において将来関わる可能性のある疾患について理解する。・言語聴覚士として必要な専門能力、論理的思考力、分析・評価能力を養う",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1.教科書、追加資料、パワーポイントなどを利用する。2.講義中は適宜質問を受ける。3.講義終了時に講義のまとめを提示する。4.少人数でグループワークやディスカッションを行う場合もある。",
        "notices": "参考教科書として「標準形成外科学第7版」である。多分野にわたる形成外科の特徴上、重要なポイントを中心に浅く広く講義するため、不明な事項については教科書と参考教科書で復習が望ましい。耳鼻科の頭頸部再建手術の患者は嚥下リハビリや発声リハビリ、口唇口蓋裂などの先天異常の患者は発声のリハビリなどが必要であり、関連する履修済の科目(１年前期の医学概論、解剖学、生理学、１年後期の発声発語系の構造・機能・病態、聴覚系の構造・機能・病態)の復習は有用である。",
        "preparatoryStudy": "特に義務項目はない。関心の高い学生は、各講義前の予習にあたり、参考教科書である標準形成外科学（第7版）を用意し、講義タイトルと同じ項目を読んでおくと理解がさらに深まる。",
        "gradingGuidelines": "定期試験を基に判定する。",
        "textbook": "標準形成外科学（第7版）",
        "referenceMaterials": "標準形成外科学（第7版）",
        "courseSchedule": "第1回：形成外科学総論（形成外科とは何なのか、総論としての講義）（伊藤）第2回：創傷治癒（傷が治る・治らないについて基本的理解を深める講義）（伊藤）第3回：組織移植手術（植皮手術から遊離組織移植術まで、形成外科の代表的外科的治療法についての講義）（伊藤）第4回：組織移植手術（植皮手術から遊離組織移植術まで、形成外科の代表的外科的治療法についての講義）（伊藤）第5回：先天異常1（口唇口蓋裂顎裂を中心に術前・術後・長期ケアなどに関する講義）（千田）第6回：先天異常2（口唇口蓋裂顎裂を中心に術前・術後・長期ケアなどに関する講義）（千田）第7回：先天異常3（上記以外の頭頸部疾患を中心に講義）（千田）第8回：顔面外傷・熱傷（顔面領域の外傷や熱傷、後遺症などに関する講義）（千田）",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/12/09"
}