{
    "lectureCode": "W61105",
    "courseName": "検査・測定学演習",
    "lecturer": [
        "乙戸崇寛(医療保健学部リハビリテーション学科理学療法学専攻)",
        "中山孝(医療保健学部リハビリテーション学科理学療法学専攻)",
        "田中周(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "Ｍ５０８理学・作業療法実習室",
        "Ｍ６０８治癒室",
        "Ｍ６０９機能訓練室２"
    ],
    "courceDetails": {
        "courseOverview": "理学療法対象者の障害像を検査・測定により把握することは、理学療法プログラムを立案する上で必須となる。本科目は、講義科目「検査・測定学」と連動しており、この講義に基づいて理学療法で必要となる検査・測定の実技を行う。また、「実学に基づく専門能力」、「分析・評価能力」「問題解決力」を涵養するため、疾患を想定した実技を行い、患者（対象者）に配慮すべき点についても学修する。本科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "・協調性検査が正確に実施できる。・運動器徒手検査が正確に実施できる。・四肢長・周径の測定が正確に実施できる。・関節可動域検査が正確に実施できる。・徒手筋力検査法が正確に実施できる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・ハンドアウト、スライド資料映写、画像を利用して講義を行った後、実技演習を中心に実施する。ポイントを説明しながらデモンストレーションを行い、理解度を高める。学生同士で実技演習を主体的に行えるように促すアクティブラーニングを採用する。授業として教科書を使用し、ノートPCは使用しない。",
        "notices": "・授業構成を３分割し、それぞれ到達度チェックを行う。テキストを持参する必要がある場合は予め指示する。・実技演習を行うため、四肢の肌を露出しやすく動きやすい服装（Tシャツ・ショートパンツ）で参加すること。・検査に関する実技は正確に実施できるまで授業時間内に練習すること。また、検査結果について説明を求める場合があり、結果の解釈についても理解できるように学修を進めること。",
        "preparatoryStudy": "・授業資料は事前にMoodleへ掲載する。事前に授業内容について確認するとともに、不明な点は可能な範囲で予め調べておくこと。(40分）・「リハビリテーション基礎評価学第2版」の徒手筋力検査動画をあらかじめ視聴した上で授業に臨むこと。（20分）（授業では反転授業形式で実習を行う）・不明な点は担当教員へ質問すること。",
        "gradingGuidelines": "・期末試験（実技）80％、授業中の手技確認テスト（20%)として評価し、60点以上で単位認定とする。",
        "textbook": "・DaleAvers,MarybethBrown,津山直一(翻訳)新・徒手筋力検査法原著第10版[Web動画付],協同医書出版社,2020年",
        "referenceMaterials": "・潮見泰藏,下田信明編集リハビリテーション基礎評価学第2版,羊土社,2019年",
        "courseSchedule": "第1回演習：脳神経検査\/姿勢、動作の協調性と観察法（乙戸）第2回演習：栄養状態・フレイルの評価（田中）第3回演習：運動器徒手検査\/疼痛検査\/感度・特異度・尤度比（乙戸）第4回演習：四肢長・周径の測定法（田中）第5回演習：実技確認1（協調性、運動器徒手検査）（乙戸・田中）第6回演習：実技確認2（四肢長、周径）（乙戸・田中）第7回演習：関節可動域検査頚部、体幹（乙戸・田中）第8回演習：実技確認3（関節可動域検査）上肢・頚部（乙戸・田中）第9回演習：実技確認4（関節可動域検査）下肢・体幹（乙戸・田中）第10回演習：徒手筋力検査肩、肘、前腕、手（乙戸・中山・田中）第11回演習：徒手筋力検査肩甲骨（乙戸・中山・田中）第12回演習：徒手筋力検査股関節、膝、足関節（乙戸・中山・田中）第13回演習：徒手筋力検査頭部、頚部、体幹、SorensenのTrunkholdingテスト）（乙戸・中山・田中）第14回演習：実技確認5（徒手筋力検査）上肢・頚部（乙戸・中山）第15回演習：実技確認6（徒手筋力検査）下肢・体幹（乙戸・中山）",
        "courseDataUpdatedAt": "2024\/03\/06"
    },
    "updateAt": "2024\/09\/12"
}