{
    "lectureCode": "W61204",
    "courseName": "運動療法",
    "lecturer": [
        "忽那俊樹(医療保健学部リハビリテーション学科理学療法学専攻)",
        "土屋順子(医療保健学部リハビリテーション学科理学療法学専攻)",
        "渡部祥輝(医療保健学部リハビリテーション学科理学療法学専攻)",
        "斎藤寛樹(医療保健学部リハビリテーション学科理学療法学専攻)",
        "伊藤咲子(医療保健学部リハビリテーション学科理学療法学専攻)",
        "田中周(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３０２１１教室"
    ],
    "courceDetails": {
        "courseOverview": "本科目では、理学療法の中心的技術である運動療法の理論的な枠組みについて学ぶ。本科目は、これまでに学修した「解剖学」、「生理学」および「キネシオロジー」といった専門基礎科目を基盤として成り立っており、運動器系・神経系・内部障害系などの障害別理学療法学の根幹となる科目である。基本的な運動療法の原理や知識について学び、臨床現場で適用できる力を養う。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "・運動療法の目的と原理を具体的に説明できる。・運動療法を実践するうえで必要な解剖学・生理学・運動学の基礎知識を説明できる。・各種障害の基本的な運動療法の目的や手技について説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "・授業計画に沿って進行する。・授業形態：講義／演習・講義は指定した教科書と配布資料を用いて行う。・ノートPCを使用する際には、事前に教員から連絡する。",
        "notices": "・積極的な学修姿勢で授業に参加すること。・同時期に開講する「運動療法実習」は本科目の延長科目として位置づけられている。「運動療法実習」のシラバスも参照したうえで授業に臨むこと。",
        "preparatoryStudy": "以下の予習・復習を行うこと（90分程度）。・「解剖学」や「生理学」、「キネシオロジー」などの復習をしたうえで授業に臨むこと。・教科書は授業に対応する章を事前に読んでおくこと。・復習を通して、授業での内容を他者へ説明できるようになることが望ましい。",
        "gradingGuidelines": "・定期試験の結果（100点）・加点減点要件：授業中の学修態度など",
        "textbook": "・Crosslink理学療法学テキスト運動療法学、メジカルビュー社、2020",
        "referenceMaterials": "・運動療法学障害別アプローチの理論と実際第2版、文光堂、2014・最新運動療法大全Ⅰ基礎編第6版、ガイアブックス、2016・最新運動療法大全Ⅱ実践編第6版、ガイアブックス、2017",
        "courseSchedule": "第1回：運動療法総論（忽那）第2回：加齢による運動機能変化と運動療法（渡部）第3回：関節可動性と運動療法（伊藤）第4回：バランス機能と運動療法（伊藤）第5回：呼吸機能・循環機能と運動療法（忽那）第6回：代謝機能と運動療法（忽那）第7回：協調性機能と運動療法（土屋）第8回：中枢神経機能と運動療法（田中）第9回：末梢神経機能と運動療法（田中）第10回：前庭機能と運動療法（田中）第11回：筋機能と運動療法（斎藤）第12回：基本動作と運動療法（渡部）第13回：運動学習と運動療法（土屋）第14回：産科領域における腰痛と尿失禁に対する運動療法その1（外来講師）第15回：産科領域における腰痛と尿失禁に対する運動療法その2（外来講師）",
        "courseDataUpdatedAt": "2024/01/24"
    },
    "updateAt": "2024/12/09"
}