{
    "lectureCode": "W61207",
    "courseName": "物理療法実習",
    "lecturer": [
        "石黒圭応(医療保健学部リハビリテーション学科理学療法学専攻)",
        "太箸俊宏(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月3",
        "月4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "Ｍ５１１水治室",
        "Ｍ６０７物療室",
        "Ｍ６０８治癒室",
        "Ｍ６０９機能訓練室２"
    ],
    "courceDetails": {
        "courseOverview": "神経・筋機能障害、痛み、関節拘縮の問題に対して、物理療法による生体反応について理解する。実際に物理療法を適応し、生体反応を視覚的に捉え理解を深める。また、各種物理療法手段の具体的な実施方法を習得し、ケーススタディをとおして、疾患・障害に対する各種物理療法手段を適応できるようにする。この科目は、実学に基づく専門能力を養うため、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "１）神経・筋機能障害、痛み、関節拘縮の病態を説明できる。２）各種物理療法手段の適応、禁忌が判断できる。３）各種物理療法手段の適切な適用量で実施できる。４）各種物理療法手段の方法を実施できる。５）物理的な刺激による生体反応の変化を測定し、説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "小グループに分かれて、疾患・障害別に各種モダリティーの実習を行う。なお、神経生理学的な反応について、各種の評価を行いながら効果を視覚的に捉える。また、ケーススタディを実施し、グループでの検討、発表を行う。グループワークを通して学生の主体的な学び（アクティブラーニング）を促す。",
        "notices": "物理療法では、実施するにあたりリスクを伴う場合がある。そのため、事前に教科書等でリスクを把握するための予習をしておくこと。実習するモダリティについて、実習書を熟読し、予習を十分にしておくこと。",
        "preparatoryStudy": "実習の内容にあわせて考察できるように、事前に資料の準備と理解が必要になる。学修のポイントを提示するので、必ず準備すること。例）電気刺激療法：疼痛抑制のメカニズムについて、資料の準備と理解をしておくこと。",
        "gradingGuidelines": "課題提出50％、報告会50％課題、報告会の内容については講義のまとめでフィードバックを行う。",
        "textbook": "吉田英樹編集：Crosslinc理学療法学テキスト物理療法学（株）メジカルビュー社",
        "referenceMaterials": "嶋田智明・他：物理療法マニュアル、医歯薬出版網本和（編）：標準理学療法学「物理療法学」、医学書院中山孝、菅原仁（編）：理学療法基礎治療学2物理療法、医歯薬出版木村貞治（編）：シンプル理学療法学シリーズ「物理療法学テキスト」、南江堂庄本康治（編）：エビデンスから身につける物理療法、羊土社",
        "courseSchedule": "第1回:物理的刺激に対する脊髄の興奮性変化と相反抑制（太箸）第2回:神経・筋機能障害に対する物理療法の基礎（太箸）第3回:物理療法適用に必要な体表解剖（太箸）第4回:強さ時間曲線・極性興奮，モーターポイント，EMS（太箸）第5回:寒冷療法，ホットパック，パラフィン（石黒）第6回:極超短波，干渉波・TENS・ベルト電極式骨格筋電気刺激法，部分浴（太箸）第7回:ハドマー，部分浴，超音波（石黒）第8回:物理療法適用に必要な疼痛の基礎１（石黒）第9回:物理療法適用に必要な疼痛の基礎２（石黒）第10回:ケーススタディオリエンテーション（石黒・太箸）第11回:ケーススタディ１（石黒・太箸）第12回:ケーススタディ１発表（石黒・太箸）第13回:ケーススタディ２（石黒・太箸）第14回:ケーススタディ２発表（石黒・太箸）第15回:まとめ（石黒・太箸）",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/05/29"
}