{
    "lectureCode": "W61202",
    "courseName": "神経系理学療法評価学",
    "lecturer": [
        "高木健志(医療保健学部リハビリテーション学科理学療法学専攻)",
        "土屋順子(医療保健学部リハビリテーション学科理学療法学専攻)",
        "田中周(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "Ｍ５０８理学・作業療法実習室",
        "Ｍ６０８治癒室",
        "Ｍ６０９機能訓練室２"
    ],
    "courceDetails": {
        "courseOverview": "本講義では理学療法で必要となる神経系の検査測定を学び、その基本手技を習得する。なかでも、理学療法で重要となる脳卒中および脊髄損傷患者の理学療法評価における検査測定項目について、その目的および方法を学び分析・評価能力の習得を目指す。また、それらの知識を整理し臨床で実践できる実学に基づく専門能力・論理的な思考・コミュニケーション能力を習得することが本講義における最終目標となる。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "・神経学的検査が実施できる。・片麻痺機能検査の内容が理解でき、検査を実施できる。・高次脳機能検査の説明ができ、実施できる。・協調性テスト、バランステストの方法を理解し検査を実施できる。・脳卒中および脊髄損傷の理学療法評価で必要となる評価項目を列挙できる。・脳卒中および脊髄損傷の理学療法で必要な各評価項目についてその目的を説明できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "・座学においては、教科書（資料）を用い各評価項目に対する目的および方法を説明する。そのため、あらかじめ講義予定内容については予習をすること。・実技練習が必要な課題に関しては、各担当講師によるデモンストレーションを見学し、その指示に従い実技練習を行う。・ノートPCが必要になる場合は、事前に教員がアナウンスする。",
        "notices": "・予習復習を十分に行うこと。積極的に自ら学修するよう心がけること。・実習に出る準備を兼ねた講義になっているため、実際の臨床実習にふさわしい身なりで受講すること。・技術の習得確認のため実技試験を実施する（日程は後日掲示）。",
        "preparatoryStudy": "・本講義は解剖学・生理学の基礎知識が欠かせない内容となる。受講する際にはすでに学んでいる解剖学・生理学の内容のうち、神経系（中枢神経、末梢神経）に関する内容を事前に復習した上、講義に臨むこと。・講義で学んだ理論・知識を整理するため、毎回の復習として講義ノートを整理すること。また、実際に検査手技を行えるようになることも大きな目標となるので、各回に行った実技の内容を毎回復習すること。",
        "gradingGuidelines": "・実技試験（100％）および筆記試験（100％）により成績評価を行う。・実技試験、筆記試験の両方に合格することが単位認定の条件となる。全ての授業への出席を基本とする",
        "textbook": "・リハビリテーション基礎評価学第２版羊土社・ベッドサイドの神経の診かた改訂18版南山堂",
        "referenceMaterials": "標準理学療法学専門分野理学療法評価学（第2版）医学書院",
        "courseSchedule": "1回：総論・脳の機能と構造・ICF（高木）2回：片麻痺機能検査（田中）3回：片麻痺機能検査（田中）4回：深部腱反射（高木）5回：病的反射（高木）6回：筋緊張（高木）7回：感覚検査（土屋）8回：感覚検査（土屋）9回：バランステスト（土屋）10回：脳神経検査（高木）11回：協調性検査・意識障害（土屋）12回：高次脳機能（田中）13回：高次脳機能（田中）14回：実技試験（全員）15回：実技試験のフィードバック・まとめ（全員）",
        "courseDataUpdatedAt": "2024\/01\/20"
    },
    "updateAt": "2024\/05\/29"
}