{
    "lectureCode": "W61312",
    "courseName": "マニュアルセラピー実習",
    "lecturer": [
        "中山孝(医療保健学部リハビリテーション学科理学療法学専攻)",
        "斎藤寛樹(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火",
        "火2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "Ｍ５０８理学・作業療法実習室",
        "Ｍ６０８治癒室",
        "Ｍ６０９機能訓練室２"
    ],
    "courceDetails": {
        "courseOverview": "本実習授業では、講義科目マニュアルセラピーで得た知識をもとに、徒手的理学療法評価、治療に関し、実習を通して知識・技術の定着をはかる。具体的な検査・評価方法や基本的治療手技を修得し、臨床実習におけるクリニカルリーズニングスキルを学修する。また、最新のエビデンスをどのように活用できるか自主的に考え、可能性を探求する。特にMWM（運動併用モビライゼーション）の概念と基本的な技術は実技演習を経験し、理解を深めること。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "・神経筋骨格系障害の発症メカニズム、徒手理学療法評価と治療目的の概要を説明できる・神経筋骨格系疾患患者に対する問診を含めた主観的評価ができる・各疾患に対する客観的評価の概要を説明できる・徒手を用いた安全で、的確な評価と基本的治療手技が実践できる",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ハンドアウト、パワーポイント、評価プロトコール等を用いた講義、および実技の修得を目的とした実習を行う。ペアで具体的な評価、治療手技を相互に演習し学ぶ。",
        "notices": "実習授業であるため、動きやすいT-シャツやショートパンツで参加すること。また関連する書籍や関連文献を検索して自主学修し、相互で実技演習を行って技術習得を心がける。",
        "preparatoryStudy": "身体各部位の解剖学、運動学の書籍や関連した過去の資料を読み、必ず予習すること。神経系・整形外科疾患、徒手療法に関する基礎知識を再確認し学修すること。",
        "gradingGuidelines": "学期末の筆記試験（60%）、理解度チェック（実技テスト40%：ただし可能な場合）を基準として評価する。",
        "textbook": "特に指定しない",
        "referenceMaterials": "・理学療法のクリティカルパス症例から学ぶグローバルスタンダード上巻：上肢・脊椎下巻：下肢赤坂清和藤縄理監訳エルゼビアジャパン2004年・MageeManske:OrthopedicPhysicalAssessmentその他、授業で参考図書・資料・論文を紹介する",
        "courseSchedule": "第1回：頸椎の評価と治療（中山・斎藤）第2回：神経学的検査①（中山・斎藤）第3回：神経学的検査②（中山・斎藤）第4回：肩甲帯・肩関節の評価と治療①（中山・斎藤）第5回：肩甲帯・肩関節の評価と治療②（中山・斎藤）第6回：腰椎の評価と治療①（斎藤・中山）第7回：腰椎の評価と治療②（斎藤・中山）第8回：肘関節・手関節の評価と治療①（中山・斎藤）第9回：胸椎・胸郭の評価と治療（斎藤・中山）第10回：骨盤帯の評価と治療（斎藤・中山）第11回：股関節の評価と治療（斎藤・中山）第12回：膝関節の評価と治療（中山・斎藤）第13回：膝関節の評価と治療（中山・斎藤）第14回：足関節・足部の評価と治療（中山・斎藤）第15回：MDT特別講義（外来講師）",
        "courseDataUpdatedAt": "2024/01/25"
    },
    "updateAt": "2024/05/29"
}