{
    "lectureCode": "W61309",
    "courseName": "内部障害系理学療法学実習",
    "lecturer": [
        "日下さと美(医療保健学部リハビリテーション学科理学療法学専攻)",
        "忽那俊樹(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月",
        "月2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "Ｍ５０８理学・作業療法実習室",
        "Ｍ６０８治癒室",
        "Ｍ６０９機能訓練室２"
    ],
    "courceDetails": {
        "courseOverview": "本授業では、内部障害の理学療法に関する知識と技術を実習から系統的に学修する。さらに重複障害のリハビリテーションを担えるように、運動耐容能の評価、息切れや疲労感の評価、筋力の評価方法とその解釈も学修する。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "本授業の到達目標は、内部障害系理学療法評価学、内部障害系理学療法学で学修した内容をもとに、各種評価の方法を修得し、実践、結果を説明できることにある。具体的には、1．運動機能・運動耐容能評価の方法から、運動処方に繋がる身体反応を理解し、説明できる。2．気道内分泌物の吸引方法、バイタルサイン・心電図の測定方法を理解し、実践できる。3．呼吸機能の評価方法を理解し、実践できる。4．カルテから理学療法プログラムを安全に実施するための情報を抽出できる。さらに抽出した情報から理学療法プログラムを立案できる。5.在宅で行うアセスメントの内容とその流れを理解する。6．胸部X線写真から理学療法プログラムの立案に必要な情報を読み取り、説明できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1．実習室で行う実習授業である。2．授業の前半は説明を行い、後半は実習を行う。3．内容により全体で実施する場合と、2クラスに分けて実施する場合がある。",
        "notices": "1.ただ参加するだけでなく、問題意識をもって積極的に参加すること。2.Moodleをよく確認すること。3.実習ができる服装で参加する。服装の指示もMoodleに掲載する。",
        "preparatoryStudy": "各回の講義に関する予習・復習は、予習は授業範囲に該当する教科書部分を読む。復習は講義資料、教科書、測定したデータから「理解したことを他者に説明できる」ことを意識して取り組む（45分）",
        "gradingGuidelines": "定期試験の結果（80点）、進行に応じた課題の提出とその内容（20点）加点減点要件：授業中の学修態度",
        "textbook": "医歯薬出版株式会社最新理学療法講座内部障害理学療法学高橋哲也編著；ISBN978-4-263-26738-72022年8月10日第1版第4刷発行",
        "referenceMaterials": "理学療法NAVIここに注目！実践，リスク管理読本、医学書院、2018",
        "courseSchedule": "第1回：運動機能・運動耐容能評価（各種フィールドテストの測定手技の確認）（全教員）第2回：運動機能・運動耐容能評価の実践（問診、運動前アセスメント含む）（全教員）第3回：心肺運動負荷試験（講義、実習）（全教員）第4回：呼吸器体表解剖、徒手的胸郭介助手技、呼吸音聴診\/心電図（全教員）第5回：呼吸器体表解剖、徒手的胸郭介助手技、呼吸音聴診\/心電図（全教員）第6回：気道内分泌物吸引\/呼吸機能測定（全教員）第7回：気道内分泌物吸引\/呼吸機能測定（全教員）第8回：カルテを読む（臨床検査値、理学療法を進める上での重症度を考える）（全教員）第9回：カルテを読む（運動プログラムの立案を中心に）（全教員）第10回：運動処方と実際（第9回で立案した運動プログラムの実践）（全教員）第11回：在宅でのフィジカルアセスメント（日下）第12回：胸部X線の診方（日下）",
        "courseDataUpdatedAt": "2024\/01\/19"
    },
    "updateAt": "2024\/05\/29"
}