{
    "lectureCode": "W61305",
    "courseName": "神経系理学療法学実習",
    "lecturer": [
        "高木健志(医療保健学部リハビリテーション学科理学療法学専攻)",
        "土屋順子(医療保健学部リハビリテーション学科理学療法学専攻)",
        "田中周(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金2",
        "金3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "Ｍ６０８治癒室",
        "Ｍ６０９機能訓練室２"
    ],
    "courceDetails": {
        "courseOverview": "本講義は脳卒中片麻痺患者に対する理学療法を展開できるようになることが大きな目標となる。具体的には脳卒中片麻痺患者（および脳卒中以外の理学療法で対象となる神経系疾患患者）を想定し、理学療法で必要となる基礎知識を整理し理学療法評価から問題点抽出、プログラム立案、プログラム実施についてグループワークを行い、分析・評価能力・問題解決力・論理的な思考能力・コミュニケーション能力の習得を目指す。この科目は、実務経験を有する専門職がその経験に基づいた講義を行う実践的科目であり，実学に基づく専門能力の習得を目指す。",
        "outcomesMeasuredBy": "本講義を通して脳卒中を中心とした神経系疾患患者に対する基本的な理学療法を考え、一部実践できるようになることが到達目標である。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・教科書（資料）を用い、基礎的な知識について講義を行う。ノートPCを使用することがある。・実技練習が必要な課題に関しては、各担当講師によるデモンストレーションを見学し、その指示に従い実技練習を行う。・講義中・講義後に外部講師へ質問できなかった場合は，高木が質問を受け付け外部講師からの回答を得るものとする．",
        "notices": "・実技練習を含むので、授業の際には実際の臨床実習に臨む服装・髪型で受講すること。",
        "preparatoryStudy": "・本講義は解剖学・生理学の基礎知識が欠かせない内容となる。受講する際にはすでに学んでいる解剖学・生理学の内容のうち、神経系（中枢神経、末梢神経）に関する内容を事前に復習した上、講義に臨むこと。また3年前期に行われている、神経系理学療法学で学修した内容についても十分に復習し、講義に臨むよう心がけること。・本講義の内容は、臨床で行われる理学療法を実際に考え実践する内容となる。講義で学んだ知識技術を繰り返し復習、練習することが実際に使える知識技術にするためには重要である。十分な復習を行うよう心がけること。",
        "gradingGuidelines": "期末テスト90％講義課題10%加点減点要件：授業態度・授業への貢献度全ての授業への出席を基本とする",
        "textbook": "・神経障害理学療法学ⅠMEDICALVIEW・神経障害理学療法学ⅡMEDICALVIEW",
        "referenceMaterials": "ステップス・トゥ・フォロー改訂第2版シュプリンガーフェアラーク東京脳卒中基礎知識から最新リハビリテーションまで医歯薬出版株式会社",
        "courseSchedule": "第1回：ICFと評価（高木）第2回：ICFと評価（高木）第3回：神経系理学療法におけるEBPT（高木）第4回：CVAの理学療法（急性期）（田中）第5回：CVAの理学療法（回復期）（田中）第6回：CVAの理学療法（生活期）（田中）第7回：パーキンソン病・脊髄小脳変性症（MSA-P）の理学療法（土屋）第8回：・脊髄小脳変性症（MSA-C）・多発性硬化症の理学療法（外来講師）第9回：筋萎縮性側索硬化症・ギランバレー症候群・重症筋無力症の理学療法（外来講師）第10回：脊髄損傷の理学療法（外来講師）第11回：症例検討（全教員）第12回：症例検討（全教員）",
        "courseDataUpdatedAt": "2024\/01\/25"
    },
    "updateAt": "2024\/09\/12"
}