{
    "lectureCode": "W61308",
    "courseName": "内部障害系理学療法学",
    "lecturer": [
        "日下さと美(医療保健学部リハビリテーション学科理学療法学専攻)",
        "忽那俊樹(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３０２１２教室"
    ],
    "courceDetails": {
        "courseOverview": "本授業では、内部障害の中でもとくに呼吸器疾患、腎臓病や糖尿病による代謝疾患の理学療法に必要な知識を系統的に学修する。超高齢社会では重複障害への理学療法が必須である。各臓器の特異的な問題の理解と、臓器連関を意識した包括的なリハビリテーションの理解を育む。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "本授業の到達目標は、授業内容を理解し、他者に説明できるようになることである。具体的には、1.呼吸機能、腎機能、血糖の調整機序を説明できる。2.呼吸器疾患、腎臓病、糖尿病の病態、症状、各種検査結果の解釈、運動療法、リスク管理を理解し、説明できる。3.臓器連関、重複障害者の特徴を理解し、説明できる。4．重症度に応じた理学療法プログラムの立案を経験する。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1.授業計画に基づいて行う。事前に授業資料を紙媒体で配布し、授業中はパワーポイントと資料、教科書を使用する。2．質疑応答による双方向の授業を行う。内容によって少人数グループ学修（SGL）を一部取り入れ、能動的な学修姿勢および協調的態度を修得する。",
        "notices": "ただ講義に参加するだけでなく、問題意識をもって積極的に参加すること。1．予習、復習を十分に行う。2．Moodleを確認すること。3．質問がある場合はオフィスアワーを利用して積極的に質問する。",
        "preparatoryStudy": "1．各回の講義に関する予習・復習は、予習は授業範囲に該当する教科書部分を読み、解剖学・生理学の「呼吸」「腎臓」「代謝」とこれらを制御する神経系・「安静時から運動時の身体の反応」に関する部分のうち、理解が不十分な内容があれば確認しておく。復習は講義資料、教科書から、「理解したことを他者に説明できる」ことを意識して取り組む（90分）2.専門用語は各自で調べて、授業に臨むこと。",
        "gradingGuidelines": "定期試験の結果（80点）、進行に応じた課題の提出とその内容（20点）加点減点要件：授業中の学修態度",
        "textbook": "医歯薬出版株式会社最新理学療法講座内部障害理学療法学高橋哲也編著；ISBN978-4-263-26738-72022年1月25日第1版第3刷発行",
        "referenceMaterials": "以下のガイドラインは、ともに当該学会のホームページにて無料で閲覧可能である。1.日本呼吸器学会_一般の方へ_呼吸器の病気：一般の方向けに分かりやすく内容が示されているため学習に活用するとよいhttps:\/\/www.jrs.or.jp\/citizen\/disease\/2.糖尿病診療ガイドライン2019、日本糖尿病学会、20193.腎臓リハビリテーションガイドライン、日本腎臓リハビリテーション学会、2018",
        "courseSchedule": "第1回：呼吸器の構造と呼吸調整・呼吸運動（日下）第2回：ガス交換、呼吸不全（日下）第3回：気道内分泌物吸引（日下）第4回：慢性閉塞性肺疾患（病態、診断と治療）（日下）第5回：慢性閉塞性肺疾患（運動療法、生活指導）（日下）第6回：間質性肺炎、肺がんの理学療法（日下）第7回：糖尿病の病態と分類（忽那）第8回：糖尿病の診断・治療と分類（忽那）第9回：糖尿病の診断・治療と合併症（忽那）第10回：糖尿病患者に対する理学療法の実際（忽那）第11回：腎臓機能障害と腎臓の解剖学（忽那）第12回：腎機能の生理学と運動中の腎臓の反応（忽那）第13回：慢性腎臓病患者に対する理学療法の実際（忽那）第14回：慢性腎臓病患者の生活指導・高齢者（忽那）第15回：包括的リハビリテーション（離床、急性期・回復期・生活期）(日下、忽那）",
        "courseDataUpdatedAt": "2024\/01\/19"
    },
    "updateAt": "2024\/09\/12"
}