{
    "lectureCode": "W61303",
    "courseName": "リスク管理論",
    "lecturer": [
        "忽那俊樹(医療保健学部リハビリテーション学科理学療法学専攻)",
        "日下さと美(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３０２１１教室"
    ],
    "courceDetails": {
        "courseOverview": "本科目では、理学療法を実施するうえで修得しておくべきリスク管理の方法および関連法規について学修する。また、臨床現場において必須となるスタンダードプリコーションの知識・技術やリスク管理において必要な基本的知識を修得することも目的とする。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "・理学療法を実施するうえでのリスク管理や関連法規を理解する。・リスク管理における多角的な視点の重要性を理解する。・臨床現場のスタンダードプリコーションを理解し、実践できる。・インシデント／アクシデントを予防する方法を考察し、それらが発生した際の対応方法を理解できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・授業形態：講義／演習・講義は指定した教科書と配布資料を用いて行う。・適宜、少人数でのグループワークを行いながら、実践的な思考を学ぶ。・スタンダードプリコーション演習は、その目的を理解したうえで演習を行う。・ノートPCを使用する際には、事前に教員から連絡する。",
        "notices": "・講義を聴講するだけではなく、積極的な学修姿勢で授業に参加すること。・演習の際には、実技を行うのにふさわしい服装で臨むこと（教員から適宜指示をする）。・疑問点などがある場合には、積極的に質問すること。",
        "preparatoryStudy": "・これまで学修してきた運動器系・神経系・内部障害系の各分野におけるリスク管理について復習したうえで授業や演習に参加すること（60分程度）。・臨床実習に向けた実践的な知識を修得できるように、教科書やレジュメを用いて十分に予習・復習を行うこと（60分程度）。復習までを経て、得た知識を他者へ説明できるようになっておくことが望ましい。",
        "gradingGuidelines": "・定期試験の結果（80点）、進行に応じた課題の提出状況とその内容（20点）・加点減点要件：授業中の学修態度など",
        "textbook": "・理学療法NAVIここに注目！実践，リスク管理読本、医学書院、2018",
        "referenceMaterials": "・リハビリテーション医療における安全管理・推進のためのガイドライン第2版、診断と治療社、2018・リハビリテーションリスク管理ハンドブック第4版、メジカルビュー社、2020",
        "courseSchedule": "第1回：リスク管理総論１（篠原）第2回：リスク管理総論２（篠原）第3回：臨床現場のリスクとその管理（忽那）第4回：臨床現場でのスタンダードプリコーション１＜演習＞（忽那、日下）第5回：臨床現場でのスタンダードプリコーション２＜演習＞（忽那、日下）第6回：インシデント／アクシデント発生時の実践（日下）第7回：理学療法と関連法規、個人情報の取り扱い（日下）第8回：急性期の理学療法におけるリスク管理（忽那、外部講師）第9回：通所リハビリテーションのリスク管理（日下、外部講師）第10回：臨床実習でのリスクとその対応（忽那）第11回：状態変化時の対応（忽那）第12回：安全管理・推進のためのガイドラインと薬剤の知識（忽那）第13回：物理療法とリスク管理（忽那）第14回：転倒とリスク管理（忽那）第15回：まとめ（忽那）",
        "courseDataUpdatedAt": "2024/12/25"
    },
    "updateAt": "2025/03/21"
}