{
    "lectureCode": "W61316",
    "courseName": "理学療法臨床実習III（総合）",
    "lecturer": [
        "石黒圭応(医療保健学部リハビリテーション学科理学療法学専攻)",
        "斎藤寛樹(医療保健学部リハビリテーション学科理学療法学専攻)",
        "伊藤咲子(医療保健学部リハビリテーション学科理学療法学専攻)",
        "高木健志(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "6",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "臨床教育者（CE）とともに、理学療法の基本的な評価過程を実践する。また、疾患・障害の理解と問題点抽出までの臨床思考過程をCEの実践を通して学修する。この際、症例の個別性を尊重した臨床思考へと拡大する。この評価実習は、次年度に実施されるインターン実習へ結び付ける教育期間として位置づけられる。また2022年度より地域・訪問の実習が1週間の実習として加わることとなる。この科目は、医療現場において実務経験を有する専門職が、その経験に基づいた実習を行う実践的科目である。実学に基づく専門能力を修得する最も重要な科目である。",
        "outcomesMeasuredBy": "1)情報収集から対象者の障害像を理解し、問題点の抽出のための統合と解釈までの過程をCEの指導と支援を受けながら実施できる。2)リハビリテーションの一連の流れを理解し、チームに関わるさまざまな職種の役割をCEの連携する姿から認識を深めて、述べることができる。3）地域・訪問等の実習に参加することにより施設及び家庭内の障害像を理解し、生活のリハビリテーションを理解する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "医療機関・福祉施設において、実際に患者様にご協力を頂き臨床実習を行う。そのため、臨床実習前の評価演習を学内で十分に行い、基本的な理学療法評価ができるようにしておく必要があり、学内での評価演習（OSCE）を大切にする。この評価実習は、医療機関・福祉施設での実習であり、臨床現場における諸規則、マナーを守り、医療人、社会人としての姿勢・態度に十分に気を付けること。臨床実習後の振り返りや報告会も実習に含まれる。また、学外での実習は、実習先に所属するCE（理学療法士）によるクリニカルクラークシップで行われる。",
        "notices": "本実習は先行要件となる単位を取得していない場合には履修できない。本実習は臨床現場における長期実習となるため、事前の準備学修を十分に行っておくこと。また、教員や臨床現場における指導を厳守し、患者様を含め、臨床現場への最大限の配慮を怠らないようにすること。学内における事前事後のオリエンテーションや基本演習、実習報告会のプレゼンテーションなども本実習に含まれる。",
        "preparatoryStudy": "これまでの科目の復習を十分に行っておくこと。・基本的な疾患と障害の理解。・基本的な疾患と障害の評価の理解。・基本的な評価手技の演習。",
        "gradingGuidelines": "OSCE（学内での知識の確認）にて20％病院、施設での臨床実習の実施状況（ポートフォリオ）50％オリエンテーションの参加の有無・実習後振り返り、知識確認にて30％",
        "textbook": "特に指定しない。",
        "referenceMaterials": "第1回：オリエンテーション（全教員）第2回：評価実習（全教員第3回：評価実習（全教員第4回：評価実習（全教員）第5回：評価実習（全教員）第6回：評価実習（全教員）第7回：評価実習（全教員）第8回：評価実習（全教員）第9回：評価実習（全教員）第10回：地域・訪問実習（全教員）第11回：地域・訪問実習（全教員）第12回：地域・訪問実習（全教員）第13回：実習報告会（全教員）第14回：OSCE準備（全教員）第15回：OSCE実施・振り返り（全教員）",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/25"
    },
    "updateAt": "2024\/05\/29"
}