{
    "lectureCode": "W61301",
    "courseName": "理学療法研究",
    "lecturer": [
        "日下さと美(医療保健学部リハビリテーション学科理学療法学専攻)",
        "忽那俊樹(医療保健学部リハビリテーション学科理学療法学専攻)",
        "渡部祥輝(医療保健学部リハビリテーション学科理学療法学専攻)",
        "乙戸崇寛(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３０２１２教室"
    ],
    "courceDetails": {
        "courseOverview": "日々変容・進歩する医療保健福祉領域で業務を実践する理学療法においては、ガイドラインに遵守した科学的根拠に基づく医療を実践することは必須である。『理学療法研究』は、研究の意義、プロセスの概要の理解をもとに研究テーマを掲げ、過去の研究成果（論文等）を吟味し、研究デザインの作成、データの収集・解析、結果を分析して解釈する一連の研究プロセスを学修することが目的である。これは、4年次の「卒業研究」の導入と位置付けられる。理学療法士が解決すべき多様な臨床疑問、問いに対し、科学的な視点からそれらを明らかにすることの重要性を認識し、主体的に学ぶ態度、少人数でのグループ学修（SGL）による協働的学びを体験する。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "１．理学療法研究の意義を説明できる２．論文検索の基本的手法を説明できる３．論文を批判的に吟味する意義を説明できる４．さまざまな研究デザインを説明できる５．さまざまな統計手法の選択、適用を説明できる６．一連の研究プロセスの重要性を説明できる",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1．理学療法研究の基礎となる科学的思考能力を培うため、研究の意義、各種研究デザイン、データ分析、過去の論文検索・解釈、統計学的手法などの基本事項を学修したのち、卒業研究ゼミグループにより活動を実践する。2.卒業研究ゼミグループでは、指導教員とともに学生が主体的・継続的に学修（アクティブラーニング）する。3.課題ならびに第15回の内容については講義時に説明する。",
        "notices": "事前学修は必須であり、各自が基礎的な知識の修得に努めたうえで役割を自覚し、与えられた課題をまとめ、グループダイナミクスを生かして行動する。",
        "preparatoryStudy": "各回の講義に関する予習・復習は、予習は各回の担当教員が示したMoodleまたは講義時の内容を進める。復習は講義資料を中心に理解した内容を、他者に説明できるように自分の言葉でまとめることや、関連の文献を検索する（45分）",
        "gradingGuidelines": "定期試験（70点）、進行に応じた課題の提出状況とその内容（30点）",
        "textbook": "配布資料",
        "referenceMaterials": "日本理学療法士会監修理学療法診療ガイドライン第2版医学書院2021https:\/\/www.mhlw.go.jp\/stf\/seisakunitsuite\/bunya\/hokabunya\/kenkyujigyou\/i-kenkyu\/index.html",
        "courseSchedule": "第1回：オリエンテーション、なぜ研究をするのか（日下）第2回：学問としての理学療法研究（乙戸）第3回：研究倫理（乙戸）第4回：文献検索方法の理解と実践（渡部）第5回：論文の構成を知る、批判的吟味とは、論文を要約する（渡部）第6回：臨床研究の分類（日下）第7回：研究方法のデザイン（日下）第8回：研究データの収集方法（忽那）第9回：研究データの解析方法（忽那）第10回：各ゼミ活動（ゼミ担当教員）第11回：各ゼミ活動（ゼミ担当教員）第12回：各ゼミ活動（ゼミ担当教員）第13回：各ゼミ活動（ゼミ担当教員）第14回：各ゼミ活動（ゼミ担当教員）第15回：まとめ（日下、乙戸、忽那、渡部）",
        "courseDataUpdatedAt": "2024\/01\/19"
    },
    "updateAt": "2024\/09\/12"
}