{
    "lectureCode": "W61304",
    "courseName": "神経系理学療法学",
    "lecturer": [
        "高木健志(医療保健学部リハビリテーション学科理学療法学専攻)",
        "土屋順子(医療保健学部リハビリテーション学科理学療法学専攻)",
        "田中周(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "Ｍ６０８治癒室",
        "Ｍ６０９機能訓練室２"
    ],
    "courceDetails": {
        "courseOverview": "近年脳卒中患者に対しては発症初期より理学療法介入が開始され、回復期から在宅まで幅広い関わりが要求されている。そのため脳卒中患者に対する関わりでは医学的な知識だけではなく、介護保険の利用に関する知識など幅広い知識が不可欠となっている。したがって本講義では脳卒中患者の理学療法におけるリスク管理の重要性を理解し、さらに回復期での理学療法の考え方、介護保険分野での理学療法のかかわり方まで学修する。また、脳卒中以外の理学療法で対象となる神経系疾患の病態、医療的ケアなどの基本的事項について学修し、理学療法における評価・治療についても併せて学び、実学に基づく専門能力と論理的な思考力の習得を目指す。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "本講義を通して脳卒中患者を中心とした神経系疾患患者の理学療法全般（急性期～在宅）の考え方を理解すること、および神経難病の理学療法についても病態・理学療法の考え方について理解することが本講義の到達目標である。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "本講義で取り上げた疾患の病態と評価、治療アプローチについて講義資料（教科書）を用い講義を行う。ノートPCを使用することがある。講義中・講義後に外部講師へ質問できなかった場合は，高木が質問を受け付け外部講師からの回答を得るものとする。",
        "notices": "予習復習を十分に行うこと。積極的に自ら学修するよう心がけること。",
        "preparatoryStudy": "・本講義は解剖学・生理学の基礎知識が欠かせない内容となる。受講する際にはすでに学んでいる解剖学・生理学の内容のうち、神経系（中枢神経、末梢神経）に関する内容を事前に復習した上、講義に臨むこと。・講義で学んだ理論・知識を整理するため、毎回の復習として講義ノートを整理すること。",
        "gradingGuidelines": "期末テスト100％加点減点要件：授業態度・授業への貢献度全ての授業への出席を基本とする",
        "textbook": "病気がみえる〈vol.7〉脳・神経メディックメディア神経障害理学療法学ⅠMEDICALVIEW神経障害理学療法学ⅡMEDICALVIEW",
        "referenceMaterials": "理学療法ハンドブック第４版協同医書出版社ステップス・トゥ・フォロー改訂第2版シュプリンガーフェアラーク東京脳卒中最前線第4版医歯薬出版神経障害系理学療法学医歯薬出版株式会社",
        "courseSchedule": "1回：総論/脳の機能と構造・評価（高木）2回：文献検索とガイドライン（高木）3回：脳画像の見方・脳卒中の病態（清水）4回：脳画像の見方・脳卒中の病態（清水）5回：CVAの理学療法（急性期～回復期）（田中）6回：CVAの理学療法（急性期～回復期）（田中）7回：パーキンソン病の理学療法（土屋）8-9回：頭部外傷・脳腫瘍・低酸素脳症、多発性硬化症の理学療法（土屋・高木）10回：筋萎縮性側索硬化症・ギランバレー症候群・重症筋無力症の理学療法（外部講師）11回：脊髄損傷の理学療法（外部講師）12回：症例検討（高木・土屋・田中）13回：症例検討（高木・土屋・田中）14-15回：高次脳機能障害に対する理学療法（外部講師）",
        "courseDataUpdatedAt": "2024/01/25"
    },
    "updateAt": "2024/05/29"
}