{
    "lectureCode": "W6144",
    "courseName": "理学療法臨床実習IV（インターン）",
    "lecturer": [
        "石黒圭応(医療保健学部リハビリテーション学科理学療法学専攻)",
        "斎藤寛樹(医療保健学部リハビリテーション学科理学療法学専攻)",
        "伊藤咲子(医療保健学部リハビリテーション学科理学療法学専攻)",
        "高木健志(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": "12",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "臨床教育者（CE）とともに、実習生が将来、一人の医療従事者として理学療法業務を携わることを想定して、包括的な理学療法業務を実践する。理学療法全般にわたる問題解決の方法についてCEの実践を通して学修する。このインターン実習は、理学療法卒前教育を総括する教育期間として位置づけられ、標準的な理学療法が提供できるための教育の機会として２期間で実施される。両期ともにCEによる臨床業務における指導やディスカッションを通して臨床的思考を養う。また、情報収集の実際から治療プログラムの立案、そしてリスク管理を含む治療プログラムの実践と修正の過程ならびに退院に向けた具体的支援の実践といった理学療法の実用的スキルを体得する。この科目は、医療現場において実務経験を有する専門職が、その経験に基づいた実習を行う実践的科目である。実学に基づく専門能力を修得する最も重要な科目である。",
        "outcomesMeasuredBy": "1)科学的根拠に基づいた理学療法実践の過程を理解して、文献を調査することができる。2)臨床推論的思考を活用し、CEの指導と支援を受けながら対象者の障害や状況に合わせて理学療法を実践できる。3)対象者の社会的背景を把握し、個人と家族、環境に生じている問題に応じる理学療法プログラムの柔軟な対応と医療チームとの共有と調整を一部実施できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "医療機関・福祉施設において、実際に患者様にご協力を頂き臨床実習を行う。そのため、3年次の評価実習で不十分であった知識と技術は学内で十分に補う必要がある。この実習は、医療機関・福祉施設での実習であり、臨床現場における諸規則、マナーを守り、医療人、社会人としての姿勢・態度に十分に気を付けること。臨床実習後の振り返りや報告会も実習に含まれる。学外での実習は、実習先に所属するCE（理学療法士）によるクリニカルクラークシップで行われる。",
        "notices": "本実習は先行要件となる単位を取得していない場合には履修できない。本実習は長期実習となるため、事前の準備学修を十分に行っておくこと。また、教員やCEにおける指導を厳守し、臨床現場への最大限の配慮を怠らないようにすること。学内における事前事後のオリエンテーション、実習報告会のプレゼンテーションなども本実習に含まれる。",
        "preparatoryStudy": "これまでの科目の復習を十分に行っておくこと。・基本的な疾患と障害の理解。・基本的な疾患と障害の評価の理解。・基本的な評価手技の演習。・基本的な治療の理解、演習。",
        "gradingGuidelines": "実習前評価（課題提出、CBT、学修態度）30％病院、施設での臨床実習の実施状況（ポートフォリオ）40％実習後評価（振り返り、報告会内容）30％",
        "textbook": "特に指定しない。",
        "referenceMaterials": "特に指定しない。",
        "courseSchedule": "第1回:オリエンテーション１（全教員）第2回:臨床実習１期第3回:臨床実習１期第4回:臨床実習１期第5回:臨床実習１期第6回:臨床実習１期第7回:報告会１（全教員）第8回:オリエンテーション２（全教員）第9回:臨床実習２期第10回:臨床実習２期第11回:臨床実習２期第12回:臨床実習２期第13回:臨床実習２期第14回:報告会２（全教員）第15回:まとめ（全教員）",
        "courseDataUpdatedAt": "2024\/03\/06"
    },
    "updateAt": "2024\/09\/12"
}