{
    "lectureCode": "W6143",
    "courseName": "理学療法マネジメント論",
    "lecturer": [
        "中山孝(医療保健学部リハビリテーション学科理学療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3",
        "月4",
        "月5",
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "Ｍ５１２多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "近年、理学療法が展開されるフィールドは多様化し、医療のとどまらず保健、福祉、スポーツ、行政など幅広い領域に拡大し、医療福祉制度の整備と相まって理学療法士の業務がより安全で、効率的に遂行されるための高度なマネジメント能力が求められている。臨床においては対象者の持つリスクを把握し、危機管理すること能力は不可欠である。本科目は、理学療法士に求められる管理・マネジメントを狭義に捉えるのではなく、多様化する理学療法の教育、臨床、研究分野においてより広義的に解釈し、社会的責任を持つ個人として、関連職種間での連携をとり、個々の対象者のニーズに的確に答えることができるよう、さまざま領域で必要なマネジメント能力を取り上げ、ディスカッションを含めながら理解を深める。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "・病院・施設・在宅などでの対象者に対する課題の把握とリスク管理、マネジメントについて理解できる・個々の対象者に対して必要なマネジメントを構築し、短期・中期プランを構築できる。・教育・研究・地域活動領域におけるリスク管理が必要であることを理解できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "授業計画で示す回ごとのテーマに沿って、事前に資料や参考文献で学修する。それを基にしたアクティブラーニング形式で授業を実施する。討議はグループまたは全体でのディスカッションを中心に進め、学生が自らの意見や考えを発表する場を多く設定する。",
        "notices": "3年生までに修得したすべての理学療法専門科目をもとに、これまで学んだ知識や技術、考えの総まとめ授業であるため、自分の考えをまとめ、主体的に表出することが求められる。特に事前に修得・履修しておくべき科目はないが、自分の不得意な科目については、授業臨むにあたり復習することを推奨する。",
        "preparatoryStudy": "・理学療法管理学参考図書の中から、各回で該当するトピックスについて予習する。・事前に回答すべき課題については、必ず自分の考えをまとめ提出する。・授業終了後の課された課題についてはレポートを提出する。",
        "gradingGuidelines": "・レポート50%、理解度チェック50％として総合成績をつける。・レポートのフィードバックはMoodleなどを通じて行う",
        "textbook": "指定しない",
        "referenceMaterials": "編集者代表奈良勲著：理学療法管理学,医歯薬出版2022.日本理学療法士協会編集：理学療法白書2021三輪書店2022.石川朗総編集：理学療法管理学,中山書店2020.斎藤秀之他：リハビリテーション管理学,医学書院2020.",
        "courseSchedule": "第1回：理学療法マネジメント論総論医療専門職の一人として（中山）第2回：理学療法士としてのマネジメント（中山）第3回：理学療法管理に求められる能力と領域（中山）第4回：社会保障制度（中山）第5回：医療保険・介護保険リハビリテーション診療（中山）第6回：理学療法士の職場管理：大規模病院（外部講師）第7回：理学療法業務と労務のマネジメント①（中山）第8回：理学療法業務と労務のマネジメント②（中山）第9回：専門職組織のマネジメント理学療法士協会（外部講師）第10回：リーダーシップと人材管理・育成（中山）第11回：他職種連携と地域連携（中山）第12回：医療保湿とリスクマネジメント（中山）第13回：生活期を支援する理学療法マネジメント（高齢者施設）（外部講師）第14回：理学療法士養成教育と卒後教育（中山）第15回：教育評価と教育カリキュラム（中山）",
        "courseDataUpdatedAt": "2024\/03\/06"
    },
    "updateAt": "2024\/09\/12"
}