{
    "lectureCode": "W62210",
    "courseName": "作業療法見学実習",
    "lecturer": [
        "池田晋平(医療保健学部リハビリテーション学科作業療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "作業療法士が働いている身体障害領域，精神障害領域，老年期障害領域，発達障害領域の病院・施設の「訪問リハビリテーション」または「通所リハビリテーション」において，学生は，臨床教育者の指導のもと見学を通した実習を行う．この科目は，医療現場において実務経験を有する専門職が，その経験に基づいた実習を行う実践科目である．",
        "outcomesMeasuredBy": "到達目標は，以下の通りである．1）作業療法の実践場面を通して患者また利用者（以下，対象者）の関わり方を学び，専門職としての基本的な態度や心構えを身につける．2）作業療法士の1週間の業務を見学することで，作業療法士の役割や専門性，多職種連携の方法や重要性について学び，対象者の地域生活を支える医療職であることを理解できる．3）作業療法学概論，基礎作業学実習，作業評価学，各領域の評価学など専門科目で習得した知識・技術を現場で再確認し，専門基礎科目で習得した知識を通して対象者の全体像について理解を深めることができる．本科目は，本学の3ポリシーで定める能力の「コミュニケーション能力」，「論理的な思考力」，「問題解決力」を養うものである．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力",
        "teachingMethod": "作業療法士が働く「訪問リハビリテーション」または「通所リハビリテーション」にて，見学を中心とした実習を行う．到達目標1）では，学生は，臨床教育者が担当する対象者の作業療法場面を通して，作業療法士と対象者の関わりをはじめ対象者の家族や多職種の連携場面から，専門職としての基本的な態度や心構えについて見学・説明を受ける．到達目標2）では，学生は，臨床教育者の1日や1週間の業務の流れや内容を見学する．対象者の臨床場面に留まらず，学生は例えばミーティング，カンファレンス，多職種との連携場面にも参加し，臨床指導者からこれら作業療法関連業務について説明を受ける．このことを通して，作業療法士がリハビリテーション医療職としてどのような専門性を持つのか学ぶ．到達目標3）では，学生は，臨床教育者の指導のもと作業療法場面に参加し，可能な範囲で対象者の関わりを多く経験する．そこで学生は，対象者の語りから地域生活の状況，大切な作業，それらに対する思いを学び，臨床教育者の指導の下，専門的な視点から対象者の全体像を説明する．",
        "notices": "作業療法見学実習の目的を理解した上で，作業療法学生としての節度ある態度と積極的な姿勢で臨むこと．",
        "preparatoryStudy": "2年後期までに履修した専門基礎科目，専門科目について総復習しておくことが必要である．",
        "gradingGuidelines": "実習はオリエンテーション，事前学習，セミナー発表等を含め全出席を原則とする．臨床教育者による成績評価表（70％），事前学習，デイリーノート，ポートフォリオ，セミナー発表（30％）とで総合的に判定する．",
        "textbook": "2年後期までに履修した専門基礎科目，専門科目で使用した全教科書",
        "referenceMaterials": "必要に応じて学生各自が用意すること．",
        "courseSchedule": "第1回：実習前オリエンテーション①第2回：実習前オリエンテーション②第3回：見学実習に向けた事前学習①第4回：見学実習に向けた事前学習②第5回：見学実習に向けた事前学習③第6回：見学実習に向けた事前学習④第7回：見学実習の実施①第8回：見学実習の実施②第9回：見学実習の実施③第10回：見学実習の実施④第11回：見学実習の実施⑤第12回：見学実習の実施⑥第13回：セミナー発表①第14回：セミナー発表②第15回：まとめ",
        "courseDataUpdatedAt": "2024\/03\/06"
    },
    "updateAt": "2024\/05\/29"
}