{
    "lectureCode": "W62207",
    "courseName": "身体機能評価学演習",
    "lecturer": [
        "大野勘太(医療保健学部リハビリテーション学科作業療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金",
        "金2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "Ｍ５０８理学・作業療法実習室"
    ],
    "courceDetails": {
        "courseOverview": "この講義では，「身体機能評価学」に引き続き，身体障害作業療法の臨床で用いられる各種検査・評価の意義や目的，検査の方法，記録の仕方，結果の解釈について学修し，各種検査技術を習得します．さらに，近隣在住の身体障害を有する当事者の方に参加していただき，作業療法の実践過程に基づいて評価計画立案，評価実施，統合と解釈を行う演習では，「実学に基づく専門能力」，「コミュニケーション能力」，「論理的な思考力」，「分析・評価能力」の修得を目指す．この科目は，実務経験を有する専門職が，その経験に基づいた講義を行う実践的科目である．",
        "outcomesMeasuredBy": "・各種検査，評価の意義，目的を説明することができる．・各種検査，評価をマニュアルに準じて正確に実施することができる．・各種検査，評価の結果を適切に解釈することができる．・疾患・障害ごとに適切な評価を選択することができる．・作業療法実践過程に準じて作業療法面接，作業遂行観察を実施することができる．・面接や観察の結果に基づいて評価計画を立案，実施することができる．・面接，観察，評価の結果を統合して作業遂行について解釈することができる．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "評価手技の修得については，事前に動画資料を配布します．授業の開始時に理解度チェックテストを行う反転授業を行うので，学生は授業前に動画を視聴してから授業に臨んでください．授業中は，学生同士で実技を繰り返しながら各種検査技術を修得します．適宜，教科書やマニュアルを確認してください．各検査の習得度を評定するために実技試験を行う．当事者の方に参加していただく評価体験学修では4-6名のグループワークを行う（アクティブラーニング）．",
        "notices": "実技を中心とした演習のため，服装は動きやすい軽装(ジャージ等)とする．軽装が難しい学生は事前に遠慮なく相談することとする．また，当事者の方に参加していただく評価体験実習では，服装は本学科指定のケーシーとする．",
        "preparatoryStudy": "事前に動画資料を配布する．授業中も動画を視聴しながらの演習となるため，ノートPC，スマートフォン，タブレットなどの端末を各自で持参することとする．授業の開始時に理解度チェックテストを行う反転授業を行うので，学生は授業前に指定された範囲の動画を視聴してから授業に臨む．3年次および4年次の臨床実習での使用を目的とした各種評価のマニュアルを記載したポートフォリオの作成を課題とする．普段学修したことを蓄積できるようにこまめに作成することを推奨する．",
        "gradingGuidelines": "理解度チェックテスト（20%），実技試験（30%），期末試験（20%），レポート（10%），ポートフォリオ（20%）",
        "textbook": "岩崎テル子編：標準作業療法学作業療法評価学．医学書院",
        "referenceMaterials": "田崎義昭他著：ベッドサイドの神経の診かた第18版南江堂津山直一・中村耕三訳：新・徒手筋力検査法第10版協同医書",
        "courseSchedule": "第1回：オリエンテーション・バイタルサイン・深部腱反射第2回：運動麻痺検査（FMA，BRS，上田式）第3回：上肢機能検査（ARAT，STEF，WMFT）第4回：知覚検査（触覚，痛覚，運動覚，位置覚，振動覚，母指探し，2PD，セメス）第5回：協調性検査（SARA）・姿勢反射検査（TUG,BBS）第6回：脳神経検査・認知機能検査（HDS-R，MMSE-J，MoCA-J），MAL第7回：評価動画作成課題第8回：作業遂行分析（AMPS）第9回：実技試験第10回：評価体験実習１（オリエンテーション・作業療法面接・観察計画立案）第11回：評価体験実習２（面接に基づいた作業遂行観察・評価計画立案）第12回：評価体験実習３（評価実施）第13回：評価体験実習４（評価実施）第14回：評価体験実習５（評価実施）第15回：評価体験実習６（グループ発表）",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/12/09"
}