{
    "lectureCode": "W62205",
    "courseName": "精神機能評価学",
    "lecturer": [
        "石橋仁美(医療保健学部リハビリテーション学科作業療法学専攻)",
        "清家庸佑(医療保健学部リハビリテーション学科作業療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "Ｍ５１２多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "精神障害に対する作業療法評価は、クライエントの状態やニードなどによって評価の手段、内容が異なってくる。ここではまず初めに、当事者の体験や社会生活に関する語りを聴くことでその必要性を理解する。当事者への面接法・観察法の実践を通して実学に基づく専門能力、分析・評価能力を獲得する。精神障害領域で用いられている様々な評価方法を理解し、臨床現場でどのように評価が行われているのかを学修する。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "到達目標は以下の通りである。・精神障害領域で行われる面接法や観察法について、目的や方法、留意点を理解し、説明できる・作業療法で用いられる評価法について、その概念や実施方法を理解し、説明できる。・作業療法の対象となる方の疾患だけにとらわれない、生活に着目した評価について説明できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本科目はアクティブラーニングのスタイルで実施する。第1回～第3回は、下記授業計画のテーマに沿った講義とともに、当事者の生活の語りを通して作業療法評価の視点を検討する。第4回～第8回は、グループワークを通して当事者の方への面接法・観察法を実践し振り返りを行う。第9回～第14回は、精神障害領域の作業療法で用いる代表的な評価を講義を通して学ぶ。第15回は、臨床の作業療法士による講義で現場でどのように作業療法評価が行われるかを学修する。",
        "notices": "講義には、指定された教科書を中心に、スライド、評価用紙の実物を提示するため、必要に応じてノートテイキングを十分に行うことが重要である。",
        "preparatoryStudy": "講義前には、教科書をよく読んで予習をしておくこと。後半、精神障害領域における代表的疾患・障害についてテーマとなるため、2年次前期に履修した「精神医学」の復習も事前に行っておくこと。",
        "gradingGuidelines": "期末試験の成績(70％)、面接法・観察法の演習（10%）、ポートフォリオ（10%）、小テスト・その他（課題への取り組み、グループワーク）(10％)で総合評価する。",
        "textbook": "標準作業療法学専門分野「作業療法評価学」第3版，医学書院精神障害と作業療法新版，山根寛著三輪書店",
        "referenceMaterials": "授業において随時紹介する。",
        "courseSchedule": "第1回：オリエンテーション、面接法-面接技法と質問法-（石橋）第2回：当事者の社会生活-体験インタビュー-（清家）第3回：見えづらい障害についての理解（清家）第4回：観察法-全身状態の観察と非言語行動の分析-（石橋）第5回：面接法と観察法①-演習の計画-（石橋）第6回：面接法と観察法②-演習の準備-（清家、石橋）第7回：面接法と観察法③-演習-（石橋、清家）第8回：面接法と観察法④-演習の振り返り（石橋、清家）第9回：コミュニケーションと交流技能の評価-ACIS-（清家）第10回：作業遂行と意志の評価（石橋）第11回：精神障害領域における評価（石橋）第12回：作業機能障害とその評価（清家）第13回：認知機能障害の評価-BACS-（清家）第14回：社会生活能力評価法-RehabLASMI-（石橋）第15回：精神障害領域における評価の実際（特別講師）",
        "courseDataUpdatedAt": "2024/01/28"
    },
    "updateAt": "2024/12/09"
}