{
    "lectureCode": "W62313",
    "courseName": "メンタルヘルスと作業療法",
    "lecturer": [
        "中川和美(医療保健学部リハビリテーション学科作業療法学専攻)",
        "石橋仁美(医療保健学部リハビリテーション学科作業療法学専攻)",
        "清家庸佑(医療保健学部リハビリテーション学科作業療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "Ｍ５０９レクリエーション室"
    ],
    "courceDetails": {
        "courseOverview": "メンタルヘルス（精神保健）は、精神面での諸課題に対して対応策や予防策を構築する、実践的な分野である。現在のストレス社会、超高齢社会においては、誰もが健康に暮らしていける生活環境づくりが課題となっており、多方面でのメンタルヘルスケアに作業療法士の活躍が期待される。本授業では、まず出生前から終末期までライフサイクルの各段階におけるメンタルヘルスの課題について学ぶ。さらに、さまざまな保健領域のメンタルヘルスにおける諸課題を整理し、こころの健康づくり、国際社会におけるこころのバリアフリー化、終末期のケアなど、予防活動の実践について理解するとともに、今後の作業療法の発展性について考える。また、これまで学んだ精神機能領域の作業療法の知識と技術を統合し、予防に活かすための実践的な演習を行う。これらの講義や演習を通して、国際的な教養、実学に基づく専門能力、論理的な思考力、分析・評価能力、問題解決力を養い、保健領域で活躍できる能力の獲得を目指す。この科目は、実務経験を有する専門職（医師、作業療法士）が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "１メンタルヘルスの概要、作業療法と予防について理解する２各ライフサイクルの段階や保健活動の実践領域における、メンタルヘルスの課題と実践を理解する３メンタルヘルスを含めた包括的な作業療法を実践するために必要な基礎知識や技術を理解、習得する",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業計画に沿って講義を行う。予防の実践活動について、学外講師による講義も設ける。提出の内容については授業の中でフィードバックする。",
        "notices": "本授業では、出生前から終末期までのライフサイクルの各段階を学修するため、１年次後期で履修した人間発達学を再度復習しておくこと。",
        "preparatoryStudy": "各回において翌週までにするべき課題を提示することもあるため、必ずその課題を実施すること（授業前後1時間程度）。本授業では教科書を指定していないが、シラバスの授業計画を参照し、参考書を確認しておくとよい。",
        "gradingGuidelines": "筆記試験50%、演習やグループワークへの取り組み・課題50%を総合して判定する。",
        "textbook": "特に指定しない。適宜、参考書や統計資料を提示する。",
        "referenceMaterials": "看護のための人間発達学第5版舟島なをみ著医学書院標準理学療法学・作業療法学（基礎専門分野）「精神医学」第４版医学書院新・精神保健福祉士養成講座〈2〉「精神保健の課題と支援第2版」日本精神保健福祉士養成校協会編集中央法規出版精神保健福祉士養成セミナー2「精神保健学」精神保健福祉士養成セミナー編集委員会編集へるす出版厚生の動向増刊「国民の衛生と動向」厚生労働統計協会編集一般財団法人厚生労働統計協会保健は実践活動であるので、最新の本を参照すること。",
        "courseSchedule": "第1回：精神保健概論精神保健（メンタルヘルス）とは／地域精神保健とは／社会と精神保健／ライフサイクルと精神保健／世界の精神保健／作業療法と予防（中川）第2回：ライフサイクルにおける精神保健の課題乳幼児期／学童期／思春期／青年期／成人期／老年期／作業療法の可能性（中川）第3回：メンタルヘルスケアの実際精神障害／認知症／アルコール・薬物関連問題／社会的引きこもり／自殺／家庭環境／学校教育／労働環境／エンドオブライフケア／災害／犯罪／多文化（中川）第4回：予防活動のための基礎知識健康教育と行動科学／ストレスのセルフケア／睡眠衛生教育／地域の精神保健福祉資源の活用／作業療法の適用（中川）第5回：思春期青年期前期の精神保健における作業療法の役割と実際（特別講師）第6回：産業保健領域における作業療法の役割と実際（特別講師）第7回：地域精神保健における作業療法役割と実際（特別講師）第8回：当事者への介入計画と実践準備①（石橋）第9回：当事者への介入計画と実践準備②（石橋）第10回：当事者への介入計画と実践準備③（石橋）第11回：当事者への介入実践①（石橋・清家）第12回：当事者への介入実践②（石橋・清家）第13回：実践後の振り返り①（清家）第14回：実践後の振り返り②（清家）第15回：事例のまとめ（清家）",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/05/29"
}