{
    "lectureCode": "W6242",
    "courseName": "作業療法臨床実習II",
    "lecturer": [
        "酒井弘美(医療保健学部リハビリテーション学科作業療法学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": "7",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "大学等で学んだ知識や技術を臨床現場で実践することで、作業療法士として必要な基本的技術および実学に基づく専門能力、論理的な思考力を習得することを目的とする。また、実際の現場で作業療法部門に関する管理・運営を経験することで、医療スタッフの一員としてふさわしい責任ある行動を養う。この科目は、医療現場において実務経験を有する専門職が、その経験に基づいた実習を行う実践的科目である。この科目を通して、実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力および問題解決力を養う。",
        "outcomesMeasuredBy": "臨床教育者の指導の下に、到達目標は以下のとおりである。1.対象者の作業療法評価ができる。2.対象者の作業療法評価結果を基に目標を設定し、治療計画を立てることができる。3.適切の作業療法治療を行うことができる。4.適切な記録・報告ができる。5.実習施設の概要を理解し、作業療法部門の役割を説明することができる。6.作業療法実習生として適切な態度で実習に臨むことができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "身体障害・老年期障害領域の臨床実習病院・施設（実習施設）において、臨床教育者の指導のもとに実際の対象者を担当し、評価、治療計画立案、治療と再評価による効果の検討という一連の作業療法過程を経験する。臨地実習終了後、大学でのセミナーにおいて発表を行い、フィードバックを受ける。",
        "notices": "臨床実習の目的を理解した上で、作業療法学生としての節度ある態度と積極的な姿勢で臨むこと。臨床実習は全出席を原則とする。",
        "preparatoryStudy": "これまでに履修した専門基礎科目、専門科目について、総復習しておくことが必要である。身体障害領域で見られやすい疾患については、その特徴やリスクを再確認しておくとともに、各種検査・測定手技、治療手技、介助法、記録・報告についても十分に練習しておくこと。",
        "gradingGuidelines": "成績評価は臨床教育者による成績評価表(7割)、事例報告書またはレジュメ・実習報告会での発表(3割)の総合判定とする。",
        "textbook": "特になし",
        "referenceMaterials": "3年後期までに履修した専門基礎科目、専門科目で使用した全教科書および必要に応じて臨床教育者、教員からも紹介する。",
        "courseSchedule": "第1回：実習前オリエンテーション第2回：身体障害・老年期障害領域の実習施設にて実習第3回：身体障害・老年期障害領域の実習施設にて実習第4回：身体障害・老年期障害領域の実習施設にて実習第5回：身体障害・老年期障害領域の実習施設にて実習第6回：身体障害・老年期障害領域の実習施設にて実習第7回：身体障害・老年期障害領域の実習施設にて実習第8回：身体障害・老年期障害領域の実習施設にて実習第9回：身体障害・老年期障害領域の実習施設にて実習第10回：身体障害・老年期障害領域の実習施設にて実習第11回：身体障害・老年期障害領域の実習施設にて実習第12回：身体障害・老年期障害領域の実習施設にて実習第13回：身体障害・老年期障害領域の実習施設にて実習第14回：身体障害・老年期障害領域の実習施設にて実習第15回：大学にてセミナー発表とフィードバック",
        "courseDataUpdatedAt": "2024/01/24"
    },
    "updateAt": "2024/05/29"
}