{
    "lectureCode": "W6313",
    "courseName": "言語聴覚基礎実習",
    "lecturer": [
        "石津希代子(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３０２０１教室"
    ],
    "courceDetails": {
        "courseOverview": "本科目は、学内で行う「実習事前準備」と、学外の実習施設にて行う「病院見学実習」、実習後の「実習振り返り」から構成されます。言語聴覚士や関連職種の業務と役割を理解し、医療・福祉・介護などの現状について関心を持つことを目指します。言語聴覚療法の実際に触れることで言語聴覚療法を学ぶ動機を強化し、言語聴覚士としての心構えや、身につけるべき知識や技能、人間性などについて考えることも目標です。対象者とのコミュニケーション方法を模索し関わり、自分自身の言動や思考、感情を振り返り、今後の学修目標を挙げることもも行います。この科目を通して、実学に基づく専門能力やコミュニケーション能力などの能力の向上をはかります。なお本科目は、言語聴覚士の実務経験を有する教員が実務の観点を踏まえて講義・演習を行い、学外施設における病院見学実習では言語聴覚士の資格を有する実習指導者が指導を担当する実践的科目です。",
        "outcomesMeasuredBy": "1．実習生として必要な行動・態度（挨拶、マナー、身だしなみなど）を理解し、実践することができる。2．医療従事者を目指す学生として、感染予防の重要性とその対策について説明できる。3．医療従事者を目指す学生として、対象者の安全を守ることの重要性とリスク管理について説明できる。4．言語聴覚士の業務や役割、医療・福祉・介護の現状などに疑問・関心をもち、気づいたことを挙げることができる。5．言語聴覚士に関連する職種の業務やチーム医療・多職種連携における役割について説明できる。6．言語聴覚士を目指す学生として、実習に向けて主体的に行動できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業はシラバス・学習支援計画書に沿って進めます。授業進行によって学習支援計画書に変更が生じた場合は、授業内で説明後に修正し、Moodleに最新版の学習支援計画書を掲示します。学内の授業では、臨床実習までに身につけておくべき、態度・知識・技術のうちの態度面を系統的に学びます。授業内では各回のテーマについてペアワークやディスカッション、グループワークなどのアクテイブラーニング型の講義・演習を通して学修を深めます。授業活動ではパソコンを利用するため、毎回、持参するようにして下さい。なお学外施設における病院見学実習は、実際の臨床の場で学ぶ体験型の実習になります。",
        "notices": "※この科目の履修には、原則として「実習事前準備」「病院見学実習」「実習振り返り」のすべてへの参加が必要である。※関連科目：言語聴覚障害学概論、ベーシックセミナー、フレッシャーズゼミⅠ※本科目は、言語聴覚臨床実習Ⅰ、言語聴覚臨床実習Ⅱ、言語聴覚臨床実習Ⅲにつながる実習関連科目の一部です。この科目を通して学外実習に臨む際に求められる各種資料の準備や実習施設への挨拶・報告・確認・相談などを身につけます。※本科目の概略やポイント、参考資料などは、随時、Moodleの当該コースに示します。また、課題や評価基準はMoodleおよび学習支援計画書に記載するため、常に確認の上、学習を進めてください。※毎日体調を記録し、健康記録票を毎回持参してください。",
        "preparatoryStudy": "【事前学習】（平均60分）Moodleと学習支援計画書の各回の事前学習に掲載してある内容を確認し、学習を進めます。事前学習において、自分の考えをまとめ、分からないところを明確にした上で、授業に参加してください。病院見学実習では、実習施設の概要を調べることや自己紹介の内容を考えることなど、実習に向けた準備に取り組みます。【事後学習】（平均60分）Moodleと学習支援計画書の事後学習に掲載してある内容に取り組みます。病院見学実習では、見学を通して気づいたことや学んだことを振り返り、自身の課題を整理して今後の目標を立てます。",
        "gradingGuidelines": "「実習事前準備」「病院見学実習」「実習振り返り」の課題の成果に基づき、総合的に評価する。【評価内容】実習事前準備・実習振り返り：ワークシート（50％）病院見学実習：見学記録、振り返りシート、提出物（50％）【評価基準・フィードバック】各提出物の評価指標（ルーブリック）は事前に提示します。具体的な評価項目と評価指標はMoodleを参照し、提出物をして下さい。提出された課題は、事前に示した評価指標を用いて内容を確認し、随時、フィードバックをします。",
        "textbook": "授業内で病院見学実習マニュアルを配布します。",
        "referenceMaterials": "内山靖,藤井浩美,立石雅子編集:リハベーシックコミュニケーション論・多職種連携論.医歯薬出版,2020遠藤敏,松田隆治,大塚裕一,小林賢,内田正剛,内山量史監修:これで解決!PT・OT・ST臨床実習まるごとガイド.金芳堂,2017順天堂大学保健医療学部理学療法学科編著：リハビリテーション学生のための感染対策・SNSと個人情報・接遇ガイドブック．一般社団法人日本看護学校協議会共済会，2023",
        "courseSchedule": "第1回：科目オリエンテーション、実習生に必要な態度第2回：言語聴覚療法の実際①対象者の観察第3回：言語聴覚療法の実際②言語聴覚士の働きかけ第4回：言語聴覚療法の実際③観察記録第5回：実習オリエンテーション①言葉遣いと実習態度第6回：実習オリエンテーション②身だしなみ第7回：実習オリエンテーション③感染対策第8回：実習オリエンテーション④多職種連携第9回：実習オリエンテーション⑤医療安全、臨床倫理第10回：実習オリエンテーション⑥概要説明第11回：学外実習施設における病院見学実習①第12回：学外実習施設における病院見学実習②第13回：学外実習施設における病院見学実習③第14回：学外実習施設における病院見学実習④第15回：実習振り返り",
        "courseDataUpdatedAt": "2025/01/06"
    },
    "updateAt": "2025/03/21"
}