{
    "lectureCode": "W6311",
    "courseName": "言語聴覚障害学概論",
    "lecturer": [
        "原田浩美(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "石津希代子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "池田泰子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "川上勝也(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "外山稔(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "金3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "ことばやコミュニケーションに障害があるということは、意思・情報伝達・思考に問題が起こり、その人らしく生きることが困難となる。また、食べることに障害がある場合には、食べる喜びが半減するだけでなく、生き続けることそのものに困難を示すこともある。言語聴覚士は、ことばで表現されない不利益から、対象者の人権、尊厳を守り、生きる喜び・意欲を支える専門職である。本講義では、①言語聴覚障害学の歴史と現状を知り、我が国における言語聴覚士養成教育の歴史を学修する。②自らの人権を自らの力のみでは、擁護しにくい方々の立場を理解し、言語聴覚士として得るべき職業的使命感、倫理観を学修する。③言語・コミュニケーション障害が人の生活に及ぼす影響を考え、その理由を言語化し、小グループによるディスカッションを通して検討する。④最後に、言語聴覚障害の種類、評価診断と言語聴覚療法を概観し、主な言語聴覚障害を事例検討を通して学修する。これらを通して、実学に基づく専門能力を理解し、コミュニケーション能力を向上させ、問題解決を探索する力を獲得します。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "1.言語聴覚障害学・言語聴覚士養成教育の歴史を説明できる。2.対象者の人権、尊厳を理解し、倫理綱領を説明できる。3.話し言葉によるコミュニケーションの過程を説明できる。4.言語聴覚障害の種類を説明できる。5.事例検討において、例を参照し、報告資料を作成できる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本科目の進め方は、初回の科目ガイダンスで学習支援計画書を配布し説明します。（Moodleにも、学習支援計画書は示しています）事前に授業資料をMoodleに提示し、授業で使用しますので、ノートPCは必携です。事前の自己学習を基にして、小グループによるディスカッションや、グループ内の考えをまとめて発表するなどのアクティブラーニングのスタイルで進め、協働的対人関係の構築、および主体的な学びを促進します。",
        "notices": "本科目は、これからの4年間で学び進める専門職としての言語聴覚学を知る入口の授業である。ほとんど全てのことが、新しい知識、考え、体験になるので、積極的な思考、発言、話し合いをしてください。",
        "preparatoryStudy": "【予習】各回の事前課題の目標、および内容は、授業支援計画書に明記するので、準備学習を行い（60分程度）、Moodleに事前提出を行ってください。【授業内】【提出】各回、演習結果等を期日までにMoodleに提出してください。【復習】提出物は、コメント記入後、個別にMoodleなどを通じでフィードバックしますので、復習し、疑問、質問があれば、オフィスアワーに直接、または、Moodleやメールを通じて連絡して下さい。",
        "gradingGuidelines": "【評価方法】定期試験（50％）、グループ演習への取り組み（20％）、グループ発表内容（20％）、提出課題内容（10％）【評価基準】基準となるルーブリック等は、授業開始時の配布資料、および、Moodleにも掲載します。【注意事項】課題（提出物）は、コメント記入後、個別にMoodleなどを通じでフィードバックします。（課題によっては、直接フィードバックします）",
        "textbook": "指定しない",
        "referenceMaterials": "毎回、資料を配布する",
        "courseSchedule": "第1回：オリエンテーション（原田）①4年間で学ぶこと②この授業で学ぶこと③Speech,Language,Hearing,Swallowing第2回：言語聴覚障害学・言語聴覚士養成教育の歴史と現状（原田）①STの仕事（ビデオ）②障害学の歴史と養成教育第3回：尊厳と人権（原田）①人権、尊厳、倫理②演習事例の提示③パワーポイントの使い方第4回：尊厳と人権演習（原田）①グループディスカッション②発表③振り返り第5回：コミュニケーション・言語の意義、コミュニケーションの過程（原田）①コミュニケーションと言語モダリティ②コミュニケーションの過程第6回：コミュニケーション演習（原田）①グループディスカッション②発表③振り返り第7回：言語聴覚障害の種類（原田）①言語・認知系②発声発語系③摂食嚥下系④聴覚系第8回：評価、診断と言語聴覚療法（原田）①評価に用いる検査の妥当性と信頼性②言語聴覚療法の基本理念第9回：事例検討：小児言語障害（池田）第10回：事例検討：聴覚障害（石津）第11回：事例検討：成人言語障害（川上）第12回：事例検討：摂食嚥下障害（外山）第13回：言語聴覚士の職務内容・職業倫理（原田）①言語聴覚士法の条文、規定②日本言語聴覚士協会の倫理綱領第14回：倫理的臨床行為実践演習（原田）①グループディスカッション②発表③振り返り第15回：まとめと振り返り（原田）",
        "courseDataUpdatedAt": "2025/01/19"
    },
    "updateAt": "2025/03/21"
}