{
    "lectureCode": "W63104",
    "courseName": "ベーシックセミナーII",
    "lecturer": [
        "原田浩美(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３０２０１教室"
    ],
    "courceDetails": {
        "courseOverview": "本科目は、臨床実習前教育に位置付けられており、臨床実習までに身につけておくべき、態度・知識・技術のうちの態度面を系統的に学び、必要なスキルを身につけます。グループワークやディスカッションを通して、コミュニケーション技術や課題解決に向けた手順、論理的思考方法を学修し、コミュニケーション能力・論理的思考能力を高めます。また、人間関係を築くための基本的マナーと、自己に対する肯定的な考え方を修得します。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目です。",
        "outcomesMeasuredBy": "相手の立場になって考えるとは、どういうことか？また、医療従事者が、親身になって対象者のことを考えるとは、どういうことか？具体的な事例を用いて、考えます。また、新しい人間関係を構築しながら、どのように、学業や将来への不安に対処していくかを日常生活の体験から学んでいきます。１．豊かな人間性とは何かを考え、言葉で表現できる２．目標とした人間像に近づく行動ができる３．良好なコミュニケーションを築く思考ができる４．考え方を変換し、折れない心を持つ準備ができる５．他職種の専門性を理解し、多職種連携の重要性を説明できる",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "本科目は、臨床実習までに身につける能力のうちの態度面を中心として、アクティブラーニングのスタイルで進めます。進め方は、初回の科目ガイダンスで学習支援計画書に沿って説明します。（Moodleにも、学習支援計画書は示しています）自己分析、自己表現、マナー実践をグループワーク、ロールプレイを通じて繰り返します。ノートＰＣは必携です。",
        "notices": "関連科目：（1年前期）言語聴覚障害学総論、ベーシックセミナーⅠ、（１年後期）言語聴覚基礎実習",
        "preparatoryStudy": "【予習】各回、事前に準備課題を提示するので、準備学習をし（60分程度）授業前までにMoodleに提出してください。【授業内】各回、事前の提出課題を基にして、授業内で演習を行います。【提出】各回、指定の課題を期日までにMoodleに提出してください。【復習】提出物は、コメント記入後、個別にMoodleなどを通じでフィードバックしますので、復習し、疑問、質問があれば、オフィスアワーに直接、または、Moodleやメールを通じて連絡して下さい。",
        "gradingGuidelines": "【評価方法】事前・事後ワーク提出（70％）、グループ演習への取り組み（30％）【評価基準】基準となるルーブリック等は、授業開始時の配布資料、および、Moodleにも掲載します。【注意事項】課題（提出物）は、コメント記入後、個別にMoodleなどを通じでフィードバック、もしくは、全体に対しての振り返り時にコメントします。なお、学修したことは、日々の生活に反映させられるように、日常生活で意識的に用いて下さい。",
        "textbook": "リハベーシックコミュニケーション論・多職種連携論内山靖、藤井浩美、立石雅子医歯薬出版(2020）",
        "referenceMaterials": "毎回、当日もしくは、前週の授業内で、資料を配布します。",
        "courseSchedule": "第1回：科目ガイダンス①本科目の位置づけ、目的、進め方の説明②プロフェッショナリズム第2回：自己認識、他者認識第3回：他者に対する想像力自身のプロフェッショナリズムについてのまとめ第4回：コミュニケーションと人間関係第5回：見方を変える表現（リフレーミング）第6回：自身のコミュニケーションについてのまとめ第7回：他職種理解第8回：多職種連携",
        "courseDataUpdatedAt": "2024\/01\/26"
    },
    "updateAt": "2024\/09\/12"
}