{
    "lectureCode": "W63208",
    "courseName": "発声発語障害学I",
    "lecturer": [
        "外山稔(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "池田泰子(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月3",
        "月4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１９１１発声発語検査室"
    ],
    "courceDetails": {
        "courseOverview": "本科目では、これまでに学修した言語発達学、音声学、発声発語系の構造・機能・病態の知識を整理し、小児の発話障害にみられる機能性構音障害の特徴と評価・訓練技能を学修します。新版構音検査を用いた評価演習では、実施した検査の結果を解釈し、問題点の抽出に至る論理的な思考力と分析・評価能力の向上をはかります。また、科目終盤では、問題点の抽出と訓練プログラムの立案に至る専門的臨床能力を養います。※この科目は、実務経験を有する医療専門職（言語聴覚士）が、その経験に基づいて講義を展開する実践的科目です。",
        "outcomesMeasuredBy": "1.小児の発話障害の臨床の流れを説明できる。2.音韻と構音の発達を理解し、小児の発話障害の原因・要因と発症メカニズムが説明できる。3.機能性構音障害の定義、特徴的な構音の誤りを説明できる。4.機能性構音障害の評価に向けた情報収集、必要な検査の特徴・適応を理解し、手順に沿って実施できる。5.評価のまとめから言語病理学的診断を行い、支援方針・訓練プログラムを立案できる6.系統的構音訓練を理解し、各訓練に効果的な教材を選択できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "基本的にはシラバスの内容に沿って進めます（講義の進め方は初回講義でアナウンスします）。講義教材として、教科書、配布資料、パワーポイントを使用し、重要な部分は講義時間内に繰り返し説明します。発声発語器官の観察、新版構音検査、訓練プログラムの立案と実施など、臨床的手技を学ぶ演習回では、ペア・ワークもしくはグループ・ワークによる実技（模擬）演習を実施します。授業毎のリアクションペーパー、授業内課題・理解度確認テスト（小テスト）を実施して、知識と技能の整理・統合をはかります。",
        "notices": "※復習科目（1年前期）言語発達学（1年後期）音声学Ⅰ、発声発語系の構造･機能･病態※関連科目（2年前期）音声学Ⅱ、耳鼻咽喉科学（2年後期）発声発語障害学Ⅱ",
        "preparatoryStudy": "次回の講義予定範囲に相応する教科書のページに目を通し、疑問点や不明な部分があれば、教科書にコメントやチェックを入れて講義に臨んでください。（60分程度）講義終了後は、各自その内容を振り返り、リアクションペーパー等で疑問解決に努めてください。併せて、講義用ノートやデータに要点をまとめて理解を深めてください。（60分程度）",
        "gradingGuidelines": "定期試験（50％）、授業内課題・理解度確認テスト（43％）、リアクションペーパー（7％）",
        "textbook": "1)佐藤亜紀子,緒方祐子編:小児発声発語障害(クリア言語聴覚療法5).建帛社,20242)構音臨床研究会編:新版構音検査手引書.千葉テストセンター,2021",
        "referenceMaterials": "1)山下夕香里,武井良子,佐藤亜紀子,山田紘子編:わかりやすい側音化構音と口蓋化構音の評価と指導法舌運動訓練活用法.学苑社,20202)阿部雅子:構音障害の臨床基礎知識と実践マニュアル(改訂第2版).金原出版,2008",
        "courseSchedule": "第1回：音韻と構音の発達（外山）第2回：発話障害の評価･訓練に必要な日本語音声表記（外山）第3回：発話障害の概念と分類（外山）第4回：発話(speech)の症状、情報収集（外山）第5回：構音･音韻に関する検査①（外山）第6回：構音･音韻に関する検査②（外山）第7回：発話障害の原因や要因に関する評価（外山）第8回：評価のまとめ（外山）第9回：言語治療の原則、言語治療のプロセス（池田）第10回：訓練･支援①（池田）第11回：訓練･支援②（池田）第12回：訓練･支援③（池田）第13回：訓練･支援④（池田）第14回：訓練･支援⑤（池田）第15回：総括（外山）",
        "courseDataUpdatedAt": "2025/01/24"
    },
    "updateAt": "2025/03/21"
}