{
    "lectureCode": "W63211",
    "courseName": "聴覚障害学演習I",
    "lecturer": [
        "原田浩美(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "石津希代子(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "聴覚障害学Ⅰで学修した成人に対する聴覚検査の理論・方法を基にして、各検査の実施法を正しく理解し、演習を通して実技を身につけ、「実学に基づく専門能力」を高めます。また、検査結果を解釈し、聴覚障害の有無、種類、程度を考察できるように、演習に並行してワークを実施し、「論理的な思考力」、「分析・評価能力」を修得します。毎回、演習の相手をランダムに設定することによって、「コミュニケーション能力」を高めながら、複合的な検査技能を修得します。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目です。",
        "outcomesMeasuredBy": "1.各検査の実施方法を具体的な手順や教示の仕方なども含め、簡潔に説明できる。2.各検査を（検査マニュアルに沿って）実施できる。3.各検査結果を図や表を用いて、正しく記載できる。4.各検査結果を簡潔にまとめることができる（解釈できる）。5.各検査結果から導かれた事実について、そこから何が分かるのかを説明することができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "毎回、指定する聴覚検査機器を用いて、ペアになり学生同士で測定を行います。聴覚障害学Ⅰの講義で理論・方法を学修した後に、事前に検査マニュアルを自己学修し、自律的に演習を行います。担当教員は常時、質問・疑問に応えられるよう、危険があった時に介入する準備をし、演習室に待機します。検査結果を記載、解釈、考察及び、関連する事例検討等は、ペアワーク、または、グループワークで、当日中に課題を仕上げます。",
        "notices": "※関連科目：（１年後期）聴覚系の構造・機能・病態、（2年前期）聴覚障害学Ⅰ",
        "preparatoryStudy": "【予習】各回、事前に配布する検査実施マニュアルを熟読し、準備学習（60分程度）を行ってください。【授業内】聴覚検査演習に並行して、結果の記入、結果解釈、記録のワークを実施します。【提出】各回、演習結果及び、完成したワークを期日までにMoodleに提出してください。【復習】提出物は、コメント記入後、個別にMoodleなどを通じでフィードバックしますので、復習し、疑問、質問があれば、オフィスアワーに直接、または、Moodleやメールを通じて連絡して下さい。",
        "gradingGuidelines": "【評価方法】定期試験（30％）、演習レポート（40％）、課題ワーク（30％）【評価基準】基準となるルーブリック等は、授業開始時の配布資料、および、Moodleにも掲載します。【注意事項】課題（提出物）は、コメント記入後、個別にMoodleなどを通じでフィードバックします。",
        "textbook": "指定しない（毎回演習1週間前に、実施マニュアルを配布します。また、必ず、対応する聴覚障害学Ⅰの学習資料を持参して下さい。）",
        "referenceMaterials": "（聴覚障害学Ⅰの教科書）聴覚検査の実際改訂5版日本聴覚医学会編南山堂2024",
        "courseSchedule": "第1回：科目ガイダンス（聴覚障害学における本科目の位置づけ、目的、進め方説明）（原田）第2・3回：標準純音聴力検査（気導検査）（原田、石津）第4・5回：インピーダンスオージオメトリー＆自記オージオメトリー（原田、石津）第6・7回：語音聴力検査（原田、石津）第8・9回：SISI検査＆耳音響放射（Otoacousticemissions:OAE）（原田、石津）第10・11回：標準純音聴力検査（骨導検査）（原田、石津）第12回：聴性脳幹反応検査（auditorybrainstemresponse:ABR）（原田、石津）第13・14回：事例検討（原田、石津）第15回：全体のまとめと学習の振り返り（原田）",
        "courseDataUpdatedAt": "2024\/01\/26"
    },
    "updateAt": "2024\/09\/12"
}