{
    "lectureCode": "W63207",
    "courseName": "言語発達障害学III",
    "lecturer": [
        "池田泰子(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３０２０２教室",
        "３１９１３聴力検査・モニタリング室"
    ],
    "courceDetails": {
        "courseOverview": "本科目では、「言語発達障害学Ⅰ」および「言語発達障害学Ⅱ」で学んだ知識・技術を基に、言語発達障害児に対して効果的な訓練を行うために必要な知識や技術を学修します。臨床に対するイメージをより明確なものにするために、模擬ケースを対象として評価、訓練プログラムの立案、訓練の流れの体験を通して、専門的な実践力を養います。この科目は、実務経験を有する専門職がその経験に基づいた講義を行う実践的科目です。",
        "outcomesMeasuredBy": "1．言語発達障害児に対する代表的な訓練法の特徴について説明できる2．評価結果に基づいた訓練目標を立案できる3．訓練目標を踏まえて具体的な訓練プログラムを提案できる",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・教科書、配布資料、スライドを用いてシラバスに沿って講義を進めます。シラバスの授業計画に変更が生じた場合は、その都度説明します。・講義で得られた情報を基に自身の考えを記述するリアクションペーパーを毎回課します。・講義資料はムードルにアップするとともに、こちらで印刷し、配布します。・ノートPCは必携ではありません。使用する場合は事前にアナウンスします。・第10～12回は、グループワーク演習です。訓練プログラムの立案、企画書の作成、訓練の実践を行います。",
        "notices": "※関連科目：（1年前期）言語発達学、（2年前期）言語発達障害学Ⅰ、言語発達障害学Ⅱ、（3年前期）言語発達障害学演習・リアクションペーパーは、提出期限より後に提出されたものは受け取りません。また、授業に欠席した人の提出は認めません。",
        "preparatoryStudy": "・シラバスに示されている授業計画を確認し、教科書の該当部分を読んで予習を行ってください（30分）・授業における学びを振り返り、理解を深めることを目的として、毎授業後にリアクションペーパーの提出を課します（20分）・復習状況を確認するために小テストを実施します。小テストの実施については、授業時にアナウンスします（30分）。",
        "gradingGuidelines": "定期試験：60％、小テスト：30％、毎回のリアクションペーパー：10％リアクションペーパーは下記の基準で評価を行います。【A】自分の考えを根拠とともに過不足のない形で明確に記述（5点）【B】自分の考えと根拠との関連が認められるが、一部明確でない形で記述（3点）【C】期日までに未提出（0点）",
        "textbook": "・深浦順一・藤野博・石坂郁代編：標準言語聴覚障害学言語発達障害学第3版、医学書院、2021年・国リハ式＜S-S法＞言語発達遅滞検査マニュアル第4版:小寺富子他、エスコアール、1998年",
        "referenceMaterials": "・石田宏代・石坂郁代編：言語聴覚士のための言語発達障害学第2版、医歯薬出版、2016年・佐竹恒夫・小寺富子・倉井成子ら：<S-S法>言語発達遅滞訓練マニュアル<1>第6版、エスコアール、2000年・佐竹恒夫・小寺富子・倉井成子ら：<S-S法>言語発達遅滞訓練マニュアル<2>、エスコアール、1994年・佐竹恒夫・小寺富子・倉井成子：言語聴覚士のための言語発達遅滞訓練ガイダンス、医学書院、2004年",
        "courseSchedule": "第1回：オリエンテーション、訓練について概説第2回：検査結果のまとめ、評価のまとめ第3回：訓練目標の立案①第4回：訓練目標の立案②第5回：領域別プログラム第6回：演習訓練プログラム立案第7回：記録法①第8回：演習記録法②第9回：模擬ケースの評価・評価のまとめ、訓練目標・プログラム立案第10回：グループワーク模擬ケースの訓練企画書の作成第11回：グループワーク模擬ケースの訓練演習①第12回：グループワーク模擬ケースの訓練演習②第13回：訓練演習の総括第14回：その他の支援法①第15回：その他の支援法②、まとめ",
        "courseDataUpdatedAt": "2024/01/29"
    },
    "updateAt": "2024/12/09"
}