{
    "lectureCode": "W63215",
    "courseName": "コミュニケーション演習II",
    "lecturer": [
        "川上勝也(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "石津希代子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "宮首由美子(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木",
        "木2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "本科目は、臨床実習関連科目に位置づけられており、臨床実習までに身につけておくべき、態度・知識・技術の基本を学修します。学内で行う講義・演習と、学外施設にて実施する保育園実習を通して、「実学に基づく専門能力」や「コミュニケーション能力」、「論理的な思考力」、「問題解決力」などの能力の向上をはかります。学内で行う講義・演習では、言語聴覚士を目指す学生として、さまざまなコミュニケーション方法を考え、対象児・者に合わせたコミュニケーションの工夫を実践することを目指します。また、看護学科教員によるバイタルサイン講義・演習を通して、医療専門職に必要な、対象児・者の安全管理に関する知識を確認し、技能を学修します。科目後半に行う保育園実習では、保育士の子どもへの関わり方を観察し、コミュニケーションの工夫をしながら子どもと関わる体験をします。さらに、保育士の業務と役割を把握し、言語聴覚士との連携の在り方について考えます。本科目は、言語聴覚士の実務経験を有する教員が、実務の観点を踏まえて講義・演習を行い、学外施設における保育園実習では、教員および保育士が指導を行う実践的科目です。",
        "outcomesMeasuredBy": "１．対象児・者の年齢や特性に合わせた、コミュニケーションを取りやすくするための工夫を実践できる。２．講義・演習および保育園実習を通して、自身のコミュニケーションの良い点と改善点を列挙できる。３．対象児・者の安全管理（バイタルサイン、感染対策、事故防止等）の必要性を説明できる。４．子どもを対象とする言語聴覚士と保育士の業務を理解し、双方の強みを列挙できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "本科目は、シラバスおよび学習支援計画書（授業開始前に当該科目のMoodleコースに掲示）に沿って進めます。授業進行によって、シラバスおよび学習支援計画書に変更が生じた場合は、学習支援計画書を修正し、説明します。学内では、ペアワークやディスカッション、グループワークなどによるアクティブラーニング型の講義・演習や子どもと関わる場面を想定したシミュレーション演習により学修を深めます。学外施設では、実際に保育園に赴き学ぶ、体験型の実習を行います。",
        "notices": "※復習科目：言語発達学、言語発達障害学Ⅰ、言語発達障害学Ⅱ※関連科目：（１年前期）ベーシックセミナーⅠ、（1年後期）ベーシックセミナーⅡ、言語聴覚基礎実習、（2年前期）コミュニケーション演習Ⅰ※本科目の概略やポイント、参考資料などは、随時、Moodleの当該コースに示します。課題、評価基準はMoodleおよび学習支援計画書に記載するため、常に確認の上、学修を進めてください。",
        "preparatoryStudy": "【事前学習】Moodleと学習支援計画書の各回の事前学習に掲載してある内容を確認し、学習を進めます。事前学習(60分程度)において自分の考えをまとめ、授業に参加します。保育園実習では、事前学習として実習施設のリサーチ、実習時の行動目標の設定、子どもの定型発達の振り返りなどを行い、実習に臨みます。【事後学習】講義・演習においてはMoodleと学習支援計画書の事後学習に掲載してある内容に取り組んでください(60分程度)。保育園実習終了後、事後学習として、振り返りシートの記載、お礼状の作成、振り返り面談を実施し、保育園実習のまとめを行います。",
        "gradingGuidelines": "【評価内容】本科目の履修には、「講義・演習」「実習事前準備」「保育園実習」「実習事後学習」のすべてへの参加が必要です。それぞれにおいて課題を提示します。各課題について評価基準に基づき、その成果を総合的に評価します。レポート（80％）、ポートフォリオ（10％）、チェックシート・実習に関する報告・連絡（10％）で評価します。【評価基準・フィードバック】「講義・演習」「実習事前準備」「保育園実習」「実習事後学習」の課題に基づいて行います。具体的な評価項目と点数の配分は、Moodleに掲載するルーブリックおよび学習支援計画書を参照してください(科目オリエンテーションでも説明します）。すべての課題は、提出された際に確認し、随時、個別にフィードバック（評価・コメントなど）をします。粗点等はMoodleや学習支援計画書で確認できるようにします。",
        "textbook": "保育園実習マニュアル(2024年度版)授業開始時に配布します。",
        "referenceMaterials": "リハビリテーション学生のための感染対策SNSと個人情報接遇ガイドブック順天堂大学保健医療学部理学療法学科一般社団法人日本看護学校協議会(2023)リハベーシックコミュニケーション論・多職種連携論内山靖、藤井浩美、立石雅子医歯薬出版(2020）",
        "courseSchedule": "第1回：科目ガイダンス、保育園の概要（川上、石津）第2回：対象児者とのコミュニケーションの工夫（川上、石津）第3回：バイタルサイン講義/標準感染予防講義（宮首、川上、石津）第4回：バイタルサイン演習/コミュニケーション技能演習（宮首、川上、石津）第5回：標準感染予防講義/バイタルサイン講義（宮首、川上、石津）第6回：コミュニケーション技能演習/バイタルサイン演習（宮首、川上、石津）第7回：保育士が行うコミュニケーションの工夫（川上、石津）第8回：保育士が行う事故防止、実習記録の書き方（川上、石津）第9回：保育園実習事前オリエンテーション（川上、石津）第10回：保育園実習（川上、石津）第11回：保育園実習（川上、石津）第12回：保育園実習（川上、石津）第13回：保育園実習（川上、石津）第14回：保育園実習（川上、石津）第15回：保育園実習事後学習（振り返り、まとめ）（川上、石津）※第3〜6回は2班に分けて受講",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/05/29"
}