{
    "lectureCode": "W63214",
    "courseName": "コミュニケーション演習I",
    "lecturer": [
        "石津希代子(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "本科目では、1年次の言語聴覚基礎実習の科目内で行った病院見学実習での振り返り（実習生として行動・態度、対象者の心身面を理解する姿勢、自身のコミュニケーションの特徴など）を踏まえて、言語聴覚士として対象者や家族、関連職種との間でよい人間関係を構築するために、自分を表現し相手を理解することができるコミュニケーションの能力を高めることをめざします。また、他者の気持ちや価値観を考えることや、自己・他者の態度からわかる情報の分析を行い、言語聴覚士としての「論理的な思考力」「問題解決能力」などの向上をはかります。この科目は、言語聴覚士の実務経験を有する教員が実務の観点を踏まえて講義を行う実践的科目です。",
        "outcomesMeasuredBy": "1.自分の言動・態度（挨拶、常識・マナーなど）、コミュニケーションの特徴を挙げることができる。2.コミュニケーション場面やコミュニケーション相手の状況（背景、価値観など）によって、コミュニケーションの内容・方法が変化することを説明できる。3.コミュニケーション場面やコミュニケーション相手の状況や伝達意図を考え、相応しい対応を考え実行できる。4．コミュニケーション場面に応じて、言語聴覚士（実習生）として求められる態度を考え、挙げることができる。5.自分自身の言動や思考、感情の特徴を踏まえて、言語聴覚士（実習生）として高めていくべき、今後のコミュニケーション課題を挙げることができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "授業はシラバス・学習支援計画書に沿って進ます。授業進行によって、シラバスおよび学習支援計画書に変更が生じた場合は、授業内で説明後に修正し、Moodleに最新版の学習支援計画書を掲示します。本科目では、臨床実習までに身につけておくべき、態度・知識・技術のうちの態度面を系統的に学びます。授業内では各回のテーマについてペアワークやディスカッション、グループワークなどを通して学習を深めます。授業活動ではパソコンを利用するため、毎回、持参するようにして下さい。",
        "notices": "※復習科目：ベーシックセミナーⅠ、ベーシックセミナーⅡ、言語聴覚基礎実習※関連科目：コミュニケーション演習Ⅱ※この科目は、3・4年次の言語聴覚臨床実習Ⅰ、言語聴覚臨床実習Ⅱ、言語聴覚臨床実習Ⅲにつながる実習関連科目の一部です。この科目を通して、臨床実習を含めた学外実習の際に求められる実習生としての姿勢・態度を身につけます。※授業内容の概略やポイント、参考資料、課題は、Moodleの当該コースに随時示します。※シラバス・学習支援計画書・Moodleは、毎回、必ず確認した上で、受講するようにしてください。※授業後、Moodleに授業概要および事後学習用の資料を提示します。各自で確認し学習を進めて下さい。特に遅刻・欠席をした場合は、Moodleに沿って授業内容を確認し、自分で学習を進めたうえで、必要に応じて質問・相談に来てください。",
        "preparatoryStudy": "【事前学習：40分程度】※講義終了時に次回の実施内容をアナウンスします。また、Moodleには、毎回、事前学習用の資料や準備物を提示します。※Moodleと学習支援計画書の各回の事前学習欄に掲載してある内容を確認し、学習を進めます。講義動画や資料などを確認し、自分の考えをまとめた上で、授業に参加します。※必ず事前に事前学習に取り組み、準備をした上で受講して下さい。講義は、事前学習を行ってきていることを前提にして進めます。【事後学習：80分程度】Moodleと学習支援計画書の事後学習に掲載してある内容に取り組み、事前学習と授業で学んだことを、さらに深める学習に取り組むことを勧めます。",
        "gradingGuidelines": "【成績評価】提出物（70%）、活動相互評価（30%）【課題に対するフィードバック】各提出物の評価指標（ルーブリック）は事前に提示します。具体的な評価項目と評価指標はMoodleを参照し、提出物をして下さい。提出された課題は、事前に示した評価指標を用いて内容を確認し、随時、フィードバックをします。",
        "textbook": "特になし。授業内で資料を提示します。",
        "referenceMaterials": "リハベーシックコミュニケーション論・多職種連携論内山靖、藤井浩美、立石雅子医歯薬出版(2020）ISBN：978-4263266335",
        "courseSchedule": "第1回：科目オリエンテーション言語聴覚士に必要な態度・コミュニケーションスキル➀第2回：自己認識第3回：言語聴覚士に必要な態度・コミュニケーションスキル②第4回：日本語のコミュニケーション言語表現➀：主張と意見第5回：言語表現➁：反論、婉曲表現第6回：言語表現➂：アサーティブな対応第7回：他者理解➀：意図理解第8回：他者理解➁：言外の意味、気持ちの理解第9回：他者理解➂：価値観の理解と尊重第10回：態度による印象形成第11回：人間関係の理解：人間関係のマネジメント第12回：言語表現応用➀：わかりやすい表現で伝える第13回：言語表現応用②：ロールプレイ振り返り第14回：言語表現応用➂：実習生としての態度第15回：言語表現応用④：ロールプレイ振り返り",
        "courseDataUpdatedAt": "2024/01/24"
    },
    "updateAt": "2024/12/09"
}