{
    "lectureCode": "W63210",
    "courseName": "聴覚障害学I",
    "lecturer": [
        "石津希代子(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "1年次に学んだ聴覚器官とメカニズム、聴覚疾患に関する知識をもとに、この科目では聴覚機能の診断に必要とされる基本的な知識や聴覚検査の理解を深めることをめざします。各種聴覚機能検査の原理を確認し、検査の目的や実施の概要、結果の分析と考え方を学習します。さらに、成人期の聴覚障害の特徴について理解を深め、その評価を学んでいきます。科目を通して、論理的な思考力や分析・評価能力などの能力の向上をはかります。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目です。",
        "outcomesMeasuredBy": "1．各種聴覚検査の検査意義や原理や適応、検査方法を説明できる。2．各種聴覚検査の検査結果から分かることを説明できる。3．成人期の聴覚障害の特徴について説明できる。4.成人聴覚障害者の聴覚機能およびコミュニケーション面の評価について説明できる。5．領域の行動目標シートに沿って学修内容を振り返り、さらに知識・技術を深めていくための行動目標を挙げることができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本科目は反転授業を組みこんだアクティブラーニング型の授業です。授業は事前学習で学んだ内容をもとに、各回のテーマについてペアワークやディスカッション、グループワークなどを通して学習を深めます。授業活動ではパソコンを利用するため、毎回、持参するようにして下さい。",
        "notices": "※復習科目：解剖学Ⅰ、言語聴覚障害学総論、聴覚系の構造・機能・病態※関連科目：耳鼻咽喉科学、聴覚障害学演習Ⅰ※授業内容の概略やポイント、参考資料、課題は、Moodleの当該コースに随時示します。※授業は、シラバス・学習支援計画書・Moodleに沿って進めます。毎回、必ず確認した上で、受講するようにしてください。シラバスおよび学習支援計画書に変更が生じた場合は、授業内で説明した後に、Moodleに学習支援計画書の最新版を掲示します。※授業後、Moodleに授業概要および事後学習用の資料を提示します。各自で確認し学習を進めて下さい。特に遅刻・欠席をした場合は、Moodleに沿って授業内容を確認し、自分で学習を進めたうえで、必要に応じて質問・相談に来てください。※事前・事後学習では、Moodleに示したキーワードを「説明できる」ように学習を進めて下さい。",
        "preparatoryStudy": "【事前学習：80分程度】※講義終了時に次回の実施内容をアナウンスします。また、Moodleには、毎回、事前学習用の資料や準備物を提示します。※Moodleと学習支援計画書の各回の事前学習欄に掲載してある内容を確認し、学習を進めます。講義動画や資料を確認し、自分の考えをまとめ、分からないところを明確にした上で、授業に参加します。※必ず事前に事前学習をした上で受講して下さい。講義は、事前学習を行ってきていることを前提にして進めます。【事後学習：40分程度】Moodleと学習支援計画書の事後学習に掲載してある内容に取り組み、事前学習と授業で学んだことを、さらに深める学習に取り組むことを勧めます。",
        "gradingGuidelines": "【成績評価】提出物15%、レポート20%、小テスト15%、定期試験50%【課題に対するフィードバック】提出物やレポートは、事前に評価指標（ルーブリック）を提示します。具体的な評価項目と評価指標はMoodleを参照して下さい。提出された課題は、事前に示した評価指標を用いて内容を確認し、随時、フィードバックをします。毎回の小テストはMoodle上で実施・フィードバックを行います。",
        "textbook": "日本聴覚医学会編:聴覚検査の実際改訂5版.南山堂,2024城間将江,鈴木恵子,小渕千絵編:標準言語聴覚障害学聴覚障害学第3版.医学書院,2021",
        "referenceMaterials": "医療情報科学研究所:病気がみえるvol.13耳鼻咽喉科．メディックメディア,2020",
        "courseSchedule": "第1回：科目オリエンテーション（シラバス、受講ルール、学習支援計画書、学習目標）聴覚関連知識の復習（聴覚系の構造・機能、伝導路、難聴の分類）聴覚検査の種類（自覚的検査・他覚的検査）第2回：オージオメータとオージオグラム（オージオメータの構成、オージオグラムの構成と書き方）第3回：標準純音聴力検査➀（気導聴力検査・骨導聴力検査）第4回：標準純音聴力検査②（陰影聴取とマスキング、マスキングの実際、解釈と考え方）第5回：自記オージオメトリー（仕組みと記録、Jergerの分類）第6回：語音聴力検査（スピーチオージオグラム、語音了解閾値検査、語音弁別検査）第7回：インピーダンスオージオメトリー（ティンパノメトリー、ティンパノグラム、音響性耳小骨筋反射）第8回：中間まとめ、耳音響放射第9回：内耳機能検査（バランス検査、DL検査、SISI検査、MCL/UCL検査）第10回：聴性誘発反応、平衡機能検査第11回：選別聴力検査、各検査結果の解釈と聴覚障害第12回：成人期の聴覚障害の特徴第13回：成人聴覚障害者の聴覚評価とコミュニケーション能力の評価第14回：成人聴覚障害者の心理社会的問題第15回：成人聴覚障害者の評価と支援、まとめ（第3回～第10回は、聴覚障害学演習Ⅰの進行状況と学習効果を鑑みて、取り扱う内容を入れ替える場合があります）",
        "courseDataUpdatedAt": "2024/01/24"
    },
    "updateAt": "2024/12/09"
}