{
    "lectureCode": "W63208",
    "courseName": "発声発語障害学I",
    "lecturer": [
        "生井友紀子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "山下夕香里(兼任講師)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3",
        "月4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３０２０１教室",
        "３１９１１発声発語検査室"
    ],
    "courceDetails": {
        "courseOverview": "小児の構音障害に多くみられる機能性構音障害を理解し、評価・訓練できることを目標とする。構音の誤りがみられる代表例の映像を視聴し、音声言語の専門知識に基づいて評価する。この取り組みにより、「実学に基づく専門能力」の向上を目指す。新版構音検査を手順通りに実施し、得られた結果から指導計画を立案する。この取り組みにより「論理的な思考力」や「分析・評価能力」の向上を目指す。構音訓練の概要を理解し、代表的なカ行音とサ行音の訓練ステップを実施して臨床実習に向けた基礎を学ぶ。ST役と子ども役を通じて訓練に必要な言語聴覚士として必要な専門知識の学修と「コミュニケーション能力」「問題解決力」の向上を目指す。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "1）構音障害（特に機能性構音障害）の定義・構音発達について説明できる。2）機能性構音障害にみられる音の誤りについて説明できる。3）小児の構音障害の情報収集・検査・評価を理解し説明できる。4)医療面接の目的と意義、実施内容を理解し（説明でき）、正しく実施し、記述し、評価できる。4）新版構音検査の目的と意義、実施内容を理解し（説明でき）、正しく実施し、記述することができる。5)新版構音検査の結果から、音声言語病理学的評価をし、訓練計画を立てることができる。6）構音訓練法について理解し、代表的な誤り音の訓練が実施できる。7)日本語を音声記号で表記できる。8)呼吸発声発語嚥下器官の構造機能病態の基本的事項を説明できる。9)構音を聴きとり、正常か異常の判定ができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "初回オリエンテーションで授業の進め方について説明する。基本的にはシラバスの内容に沿って進める。変則的な授業になることがあり、変更がある場合には、説明連絡する。進捗状況によって、授業内容が前後することがあっても全体の内容に変更はない。スライドと配布資料と教科書と音声/動画などを使用して授業を進める。授業資料は、当日配布する。適宜Moodleに資料を挙げるので自修に活用する。グループワークに必要な資料は前もって配布する。検査、訓練に限らず、個人・ペア・グループワークによるアクテイブラーニングのスタイルを適宜導入して授業を行う。準備物が必要な場合は教員から授業中とMoodleで連絡する。教科書1・2・3は毎回授業に持参すること。毎回小テストを実施する。グループワークなど演習の実施後は、感想を期限内に提出する。",
        "notices": "1．音声学で学んだ音声記号に関する知識を復習しておく。2．１年後期に学んだ「発声発語の構造機能病態」「音声学Ⅰ」の復習をしておく。また２年前期に学ぶ「耳鼻咽喉科学」「形成外科学」および「口腔外科学」「音声学Ⅱ」「音響学」の専門知識を予習復習しながら授業に臨むこと。3.授業時間前後の予習復習は必須である。指定した予習復習については、必ず実施すること。",
        "preparatoryStudy": "第1回－4回：教科書1のP377－380の内容の予習・復習。第5回－10回：教科書2のP1-14,P15－34の内容の予習・復習。第10回ー15回：教科書1のP380－382の内容の予習・復習。第12回ー16回：配布されたグループワーク資料を予習・復習。【その他】・指示した箇所の予習復習を必ず実施して授業に臨む。・訓練演習では訓練教材の作成と準備．作成内容の詳細は授業内で説明．・日本語の音声記号は完全に覚えるまで復習と練習を継続すること。・第１回授業開始前に、１年後期に学んだ「発声発語の構造機能病態」と「音声学Ⅰ」は必ず復習しておく。",
        "gradingGuidelines": "期末試験（60％）小テスト（25％）原則として小テストの再試験追試験はない。演習時の取り組みとコミュニケーション態度.感想レポート（15％）",
        "textbook": "教科書：言語聴覚士テキスト第3版.医歯薬出版.2018教科書2：新版構音検査手引き書第10刷千葉テストセンター.2021教科書3：病気がみえるvol3.耳鼻咽喉科学．MEDICMEDIA.2020授業開始までに必ず教科書は購入しておく。",
        "referenceMaterials": "日本語音声学入門【改定版】.斎藤純男.三省堂2007発声発語障害学第2版.熊倉勇美他.医学書院2015たのしい音声学.竹内京子、木村琢也著.くろしお出版2019",
        "courseSchedule": "第1回：オリエンテーション.（生井）構音障害の定義と発声発語器官と日本語音声表記.教科書1P377.耳鼻科の授業資料を復習.教科書2日本語音声表記の理解.表記できるように覚える。第2回：日本語音声の表記.構音発達.（生井）教科書1P377－378.教科書2とプリントを使用して音声記号を覚える。第3回：発達途上の構音の誤り.（生井）教科書1P378.教科書2P10第4回：特異な構音操作の誤り.（生井）教科書1P378－379.教科書2P10－12.第5回：新版構音検査の実施法.（山下1）教科書1P380.教科書2P1－9.P15－18.教科書1P380.教科書2P19－23.第6回：新版構音検査グループワーク演習.（山下2）教科書2P15－23.第7回：構音検査のまとめ・分析MWさん演習と解説.（山下3）教科書2P15－23第8回：構音検査のまとめ・分析Aさん演習と解説。音声の聞き取り演習.（生井）教科書2P15－23第9回：構音障害の評価法.医療面接グループワーク演習.（生井）教科書1P380.医療面接手順の予習構音訓練1.教科書1P380-382.教科書2P24－34.第10回：構音訓練1.（山下4）教科書1P380-382.教科書2P24－34第11回：構音訓練2.パ行音・カ行音の訓練の解説.（山下5）準備：パ行音・カ行音の訓練教材資料を作成予習第12回：パ行音・カ行音の訓練のグループワーク演習.（生井）第13回：サ行音の訓練の解説.（山下6）準備：サ行音の訓練教材資料を作成予習第14回：サ行音の訓練のグループワーク演習（山下7）第15回：まとめ（生井）",
        "courseDataUpdatedAt": "2024/01/27"
    },
    "updateAt": "2024/12/09"
}