{
    "lectureCode": "W63209",
    "courseName": "発声発語障害学II",
    "lecturer": [
        "生井友紀子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "山下夕香里(兼任講師)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月3",
        "月4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３１０１３教室",
        "３１９１１発声発語検査室"
    ],
    "courceDetails": {
        "courseOverview": "器質性構音障害を理解し、評価・訓練できることを目標とする。小児領域では、口蓋裂の構音障害や鼻咽腔閉鎖機能不全に伴う開鼻声について、症例の映像を視聴し、音声言語の専門知識に基づいた的確な評価を行う。この取り組みにより言語聴覚士としての「論理的な思考力」や「分析・評価能力」の向上を目指す。医師・歯科医師に対して言語聴覚士として検査結果を的確に伝える能力を学修する。口蓋裂チーム治療における言語聴覚士の役割を理解し、多職種と緊密に連携できるスタッフを目指す。この取り組みにより、「実学に基づいた専門能力」を向上させ「コミュニケーション能力」を高める。成人領域では、口腔疾患に伴う構音障害、特に口腔癌切除後の構音障害について口腔機能を適切に評価し、言語聴覚士の専門知識を生かした訓練が出来るようにする。また医師・歯科医師から信頼され良好な「コミュニケーション能力」を形成するために言語領域に限らず医学領域一般の専門知識を学修する。この科目は、実務経験を有する専門職が、その経験に基づいた講義と演習を行う実践的科目である。",
        "outcomesMeasuredBy": "1）器質性構音障害の定義、特徴について説明できる。2）口蓋裂発話障害に伴う発話障害について評価・訓練できる。3）鼻咽腔閉鎖機能不全に伴う構音障害の治療法について説明できる。4）口腔疾患に伴う構音障害の症状と評価法・指導法と治療方法について説明できる。基本的なものについては正しく実施できる。5）口腔癌切除後の構音障害の症状と評価法・指導法と治療法（補綴物含む）について説明できる。基本的なものについては正しく実施できる。6)発語器官、鼻咽腔閉鎖機能について、イラストを描いて、専門用語を用いて、また専門用語を用いずに患者とその家族が理解できるように説明できる。7)開鼻声、呼気鼻漏出による子音の歪の有無を、特徴的なものについては聞き取ることができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "初回オリエンテーションで授業の進め方について説明する。基本的にはシラバスに沿って進める。変更がある場合には、前もって説明する。スライドと配布資料と教科書と音声\/動画などを使用して授業を進める。授業資料は、適宜Moodleに資料を挙げるので自修に活用する。グループワークに必要な資料は前もって配布する。検査、訓練に限らず、個人・ペア・グループワークによるアクテイブラーニングのスタイルを適宜導入して授業を行う。準備物が必要な場合は教員から授業中とMoodleで連絡する。教科書1・2・3は毎回授業に持参すること。毎回小テストを実施する。グループワークなど演習の実施後は、感想を期限内に提出する。",
        "notices": "・「発声発語系の構造・機能・病態」と「耳鼻咽喉科学」および「形成外科学」「口腔外科学」の口唇・舌・顎・口蓋裂・口腔疾患の授業資料を整理し、専門知識を復習しておく。・「臨床歯科医学」の授業で学んだ点について随時本授業に取り入れること。・授業時間前後の予習復習は必須である。指定した予習復習については、必ず実施して授業に臨むこと。・教科書３冊は毎回必ず持参すること。",
        "preparatoryStudy": "第1回－7回：教科書1のP382－385の内容の予習復習．第10回－11回：教科書2のP232－244の内容の予習復習．第12回ー15回：教科書1のP392－395の内容の予習復習．・グループワーク・演習の場合は、配布された資料を予習・復習．・上記以外、授業計画に記載の教科書のページを予習復習．・授業後は教科書と配布資料と授業中のノートなどを整理総合して復習.小テストに向けて復習．・解剖生理機能として教科書2P8-16.42-45.教科書3P204-210.214-217",
        "gradingGuidelines": "期末試験結果（60％）小テスト（25％）レポート・感想・授業の取り組みと態度（15％）以上を総合してして成績に反映させる。",
        "textbook": "教科書：言語聴覚士テキスト第3版医歯薬出版2018（購入済）教科書2：言語聴覚士のための臨床歯科医学・口腔外科科学ー器質性構音障害第2版第6刷医歯薬出版.2022（購入済）教科書3：病気がみえるvol3.耳鼻咽喉科学．MEDICMEDIA．2020（購入済）",
        "referenceMaterials": "発声発語障害学第2版医学書院2015",
        "courseSchedule": "第1回：器質性構音障害概論.（生井）教科書2（以下教2）P200－203第2回：口蓋裂に伴う発話障害.(生井）教1P382.教2P214－216第3回：発声発語器官の機能と形態・鼻咽腔閉鎖機能（生井）教2P8-16.P42－45.教3P204-210.214-217第4回：発声発語器官の機能と携帯・鼻咽腔閉鎖機能演習（生井）発声発語器官検査医療面接口蓋裂言語検査解説(DVD).教1P382－384.教2P204－208.208-213.214-216第5回：口蓋裂言語検査演習.（山下1）第6回：鼻咽腔閉鎖機能不全に対する検査・評価・治療.（生井）教1P384.教2P204－208.208-213.214－216第7回：鼻咽腔閉鎖機能不全に対する検査・評価・治療（山下2）教1P384.391.教2P260-262第8回：口蓋裂の一貫治療.(山下3）教1P385.教2P263－268.第9回：舌小帯短縮症による構音障害の評価と治療（山下4）教2P151-152.P223-227第10回：口腔疾患による構音障害の評価（山下5）教2P232－244.第11回：口腔癌切除後の構音障害概論.（生井）教1P392－395.教2P245-259第12回：上顎中咽頭切除の構音障害の症状・評価・治療（山下6）.第13回：舌・口底切除後の構音障害の症状・評価・治療（生井）第14回：舌運動訓練．舌接触補助床.補綴的治療（山下7）第15回：器質性構音障害のまとめ（生井）教1P383－384.394-395.教2P260-262",
        "courseDataUpdatedAt": "2024\/01\/27"
    },
    "updateAt": "2024\/05\/29"
}