{
    "lectureCode": "W63206",
    "courseName": "言語発達障害学II",
    "lecturer": [
        "池田泰子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "内山美保(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金4",
        "金5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３０２０２教室",
        "３１９１１発声発語検査室"
    ],
    "courceDetails": {
        "courseOverview": "子どもの評価結果から訓練の方針を立案するため、評価結果は子どもを良い方向に支援するための重要な根拠となります。評価の1つとして行う検査は、数多くあるため、各検査の特徴を理解していなければ子どもの状態に合った検査を選択することはできません。本科目では、「言語発達学」「発達心理学」で学んだ知識を基に、言語発達障害児に対して適切な評価を行うために必須となる検査の知識と技術を学び、実学に基づく専門能力を学修します。また、演習を通して実施方法、採点方法、結果の解釈等を学修します。この科目は、実務経験を有する専門職がその経験に基づいた講義を行う実践的科目です。",
        "outcomesMeasuredBy": "1．主要な検査の特徴を説明できる2.マニュアル通りに検査を実施できる4．マニュアルに従って正しく採点できる5.検査結果のまとめを作成することができる",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・教科書、配布資料、スライドを用いてシラバスに沿って講義を進めます。シラバスの授業計画に変更が生じた場合は、その都度説明します。・講義で得られた情報を基に自身の考えを記述するリアクションペーパーを毎回課します。・講義資料はムードルにアップするとともに、こちらで印刷し、配布します。・ノートPCは必携ではありません。使用する場合は事前にアナウンスします。・第1回から10回までは、数人で1つの検査用具を使用するグループ演習を行います。・第14回は、検査の特徴を調べてまとめるグループワークを実施し、第15回にその発表を行います。",
        "notices": "※関連科目：（1年前期）言語発達学（2年前期）言語発達障害学Ⅰ、言語発達障害学Ⅱ、小児科学（2年後期）言語発達障害学Ⅲ・リアクションペーパーは、提出期限より後に提出されたものは受け取りません。また、授業に欠席した人の提出は認めません。",
        "preparatoryStudy": "・シラバスに示されている授業計画を確認し、教科書の該当部分を読んで予習を行ってください（30分）・授業における学びを振り返り、理解を深めることを目的として、毎授業後にリアクションペーパーの提出を課します（20分）・復習状況を確認するために小テストを実施します。小テストの実施については、授業時にアナウンスします（30分）。",
        "gradingGuidelines": "定期試験：60％、小テスト：30％、毎回のリアクションペーパー：10％リアクションペーパーは下記の基準で評価を行います。【A】自分の考えを根拠とともに過不足のない形で明確に記述（5点）【B】自分の考えと根拠との関連が認められるが、一部明確でない形で記述（3点）【C】期日までに未提出（0点）",
        "textbook": "標準言語聴覚障害学言語発達障害学第3版:深浦順一・藤野博・石坂郁代編、医学書院、2021年国リハ式＜S-S法＞言語発達遅滞検査マニュアル第4版:小寺富子他、エスコアール、1998年",
        "referenceMaterials": "標準言語聴覚障害学言語聴覚療法評価・診断学:深浦順一・植田恵編、医学書院、2020年言語聴覚士のための言語発達障害学第2版:石田宏代・石坂郁代編、医歯薬出版、2016年",
        "courseSchedule": "第1回：オリエンテーション、検査の種類、検査実施の注意点（池田）第2回：演習絵画語い発達検査PVT-R(池田）第3回：演習WISC-Ⅳ（1）検査の特徴、記録（池田・内山）第4回：演習WISC-Ⅳ（2）検査実施準備（池田・内山）第5回：演習WISC-Ⅳ（3）模擬ケース1検査（池田・内山）第6回：演習WISC-Ⅳ（4）模擬ケース2結果のまとめ（池田・内山）第7回：演習国リハ式＜S-S法＞言語発達検査（1）検査の特徴、記録（池田・内山）第8回：演習国リハ式＜S-S法＞言語発達検査（2）検査演習の準備（池田・内山）第9回：演習国リハ式＜S-S法＞言語発達検査（3）模擬ケース1検査（池田・内山）第10回：演習国リハ式＜S-S法＞言語発達検査（4）模擬ケース2評価のまとめ（池田・内山）第11回：グループワーク：その他の検査①（池田）第12回：発表：その他の検査②（池田）第13回：講義田中ビネー知能検査V（池田）第14回：講義新版K式発達検査2020（池田）第15回：講義KABC-II、まとめ（池田）",
        "courseDataUpdatedAt": "2024\/03\/11"
    },
    "updateAt": "2024\/09\/12"
}