{
    "lectureCode": "W63308",
    "courseName": "摂食嚥下障害学",
    "lecturer": [
        "外山稔(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火3",
        "火4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "本科目では、これまでに学修した発声発語・摂食嚥下諸器官の解剖生理、発声発語障害の知識を統合し、正常な摂食嚥下機能及び疾患の特性と障害の発現機序を整理します。また、成人を対象とした摂食機能療法に必要とされる摂食嚥下障害の評価と診断理論を学び、問題点の抽出と訓練プログラムの立案、訓練法とリスク管理に至る専門的臨床能力を養います。科目を通して、論理的な思考力や分析・評価能力の向上をはかります。※この科目は、リハビリテーション専門病院での実務経験を有する専門職が、その経験に基づいて講義を展開する実践的科目です。",
        "outcomesMeasuredBy": "1.嚥下諸器官の解剖生理、発声発語障害の知識を理解し、正常な摂食嚥下機能（生理学的メカニズム）が説明できる。2.摂食嚥下障害の原因となる疾患特性と障害の発現機序が説明できる。3.摂食嚥下機能評価・検査の特徴と適応が説明できる。4.摂食嚥下障害の病態に応じた間接・直接的訓練法が選択できる。5.嚥下障害の外科的治療、気管切開、代替栄養を理解し、訓練以外のマネジメントについて簡潔に説明できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "基本的にはシラバスの内容に沿って進めます（講義の進め方は初回講義でアナウンスします）。講義教材として、教科書、配布資料、パワーポイントを使用し、重要な部分は講義時間内に繰り返し説明します。【講義開始時】前講義回の理解度確認テスト（小テスト）を実施します。【講義終了時】翌講義回の事前学習課題を提示します。",
        "notices": "※復習科目：（1年前期）解剖学Ⅰ（1年後期）発声発語系の構造･機能･病態、神経系の構造･機能･病態（2年前期）口腔外科学（3年前期）発声発語障害学Ⅲ※関連科目：（3年後期）摂食嚥下障害学演習",
        "preparatoryStudy": "次回の講義予定範囲に相応する教科書のページに目を通し、疑問点や不明な部分があれば、教科書にコメントやチェックを入れて講義に臨んでください。（60分程度）講義終了後は、各自その内容を振り返り、リアクションペーパーを提出してください。併せて、講義用ノートやデータに要点をまとめて理解を深めてください。（60分程度）",
        "gradingGuidelines": "定期試験（45％）、授業内課題・小テスト（40％）、リアクションペーパー（15％）",
        "textbook": "上羽瑠美著:摂食嚥下のすべて改訂第2版.学研メディカル秀潤社,2022",
        "referenceMaterials": "1)益田慎監:発声発語・摂食嚥下の解剖・生理学.メジカルビュー社,20222)椎名英貴,倉智雅子編:標準言語聴覚障害学摂食嚥下障害学第2版,医学書院,20213)才藤栄一,植田耕一郎監:摂食嚥下リハビリテーション第3版.医歯薬出版,20164)藤島一郎監:疾患別嚥下障害.医歯薬出版,2022",
        "courseSchedule": "第1回：摂食嚥下障害の定義と特徴第2回：摂食嚥下のメカニズム嚥下運動の流れ第3回：嚥下に関わる解剖生理と神経基盤第4回：嚥下に関わる解剖生理と神経基盤第5回：嚥下障害を探る質問とケア、合併症とリスク管理第6回：情報収集・問診・質問紙、スクリーニング検査第7回：嚥下機能評価嚥下造影検査第8回：嚥下機能評価嚥下内視鏡検査、その他の検査第9回：嚥下障害の重症度第10回：摂食嚥下障害のリハビリテーション姿勢調整第11回：摂食嚥下障害のリハビリテーション間接訓練第12回：摂食嚥下障害のリハビリテーション直接訓練第13回：嚥下障害の手術的治療と気管切開第14回：リハビリテーション栄養第15回：総括",
        "courseDataUpdatedAt": "2024\/01\/28"
    },
    "updateAt": "2024\/05\/29"
}