{
    "lectureCode": "W63311",
    "courseName": "言語聴覚総合演習I",
    "lecturer": [
        "原田浩美(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "石津希代子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "内山美保(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "池田泰子(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月",
        "月2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３１９１１発声発語検査室"
    ],
    "courceDetails": {
        "courseOverview": "本科目は、臨床実習前教育であり、これまで学内で修得した体験の積み重ねを臨床実習における実践へつなげるための橋渡しとしての位置付けになっています。言語聴覚臨床実習Ⅰへのレディネスを形成するために、これまでに修得した態度・技能・知識を統合します。実践に則した演習を通して、コミュニケーション技術や課題解決に向けた手順、論理的思考方法を修得します。また、臨床実習を前提とした人間関係を築くための基本的マナー、患者中心の考え方を定着させます。本科目内で、技能・知識と臨床実践とのマッチングを行うのは、聴覚領域と言語発達領域です。この科目は、医療現場での実務経験を有する専門職が、その経験に基づいた演習を行う実践的科目です。",
        "outcomesMeasuredBy": "1.対象者の尊厳を深く考え、相手に合わせた行動ができる。2.対象者の利益を優先する思考、行動ができる。3.対象者の話に共感することができる。4.対象者と環境に合わせたコミュニケーション技能（言語・非言語）を使用できる。5.技能・知識に関する到達度を把握し、自律的に学修を進めることができる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本科目は、臨床実習への橋渡しの位置づけ科目として、アクティブラーニングのスタイルで進めます。グループワークやロールプレイ、ディスカッションなどの経験を通して、プロフェッショナリズムに必要な要素を獲得し、より質の高い臨床実践に結びつけます。進め方は、初回の科目ガイダンスで学習支援計画書に沿って説明します。（Moodleにも、学習支援計画書は示します）ポートフォリオ形式で実践を見える化し、個人の到達度を把握できるようにします。",
        "notices": "3年次前期までの全ての必修専門科目をしっかり復習しておいてください。",
        "preparatoryStudy": "【予習】各回、事前に準備課題を提示するので、当日までに、仕上げてください。【授業内】各回、事前の課題を基にして、授業内で演習を行います。【提出】各回、指定の課題を期日までにMoodleに提出してください。【復習】提出物は、コメント記入後、個別にMoodleなどを通じてフィードバックしますので、復習し、疑問、質問があれば、オフィスアワーに直接、または、Moodleやメールを通じて連絡して下さい。",
        "gradingGuidelines": "実技試験（70%）、到達度評価（15%）、グループ演習への取り組み（15％）",
        "textbook": "指定しない必要に応じて、事前、当日、事後に資料を配布します。",
        "referenceMaterials": "3年次前期までの専門科目で用いたすべての教科書",
        "courseSchedule": "第1回：科目ガイダンス（全員）①臨床実習関連科目における本科目の位置づけ②目的③進め方第2回：挨拶・マナー・身だしなみ（全員）①挨拶、自己紹介②姿勢・態度・わかりやすい言葉第3回：【態度】プロフェッショナリズム１（全員）①対象者中心の思考②対象者の利益を優先する思考第4回：【態度】プロフェッショナリズム２（全員）①求められる態度②求められる行動・言動第5回・第6回：【技能】聴覚領域（原田・石津）①これまでに修得した技能の復習②自律的実践③臨床推論第7回・第8回：【技能】言語発達領域（池田・内山）①これまでに修得した技能の復習②自律的実践③臨床推論第9回・第10回：【知識】聴覚領域（原田・石津）①これまでの学修の振り返り②これまでの学修と臨床実習で必要なことのマッチング演習第11回：聴覚領域（原田・石津）臨床実践演習第12回・第13回：【知識】言語発達領域（池田・内山）①これまでの学修の振り返り②これまでの学修と臨床実習で必要なことのマッチング演習第14回：言語発達領域（池田・内山）臨床実践演習第15回：まとめと振り返り（全員）",
        "courseDataUpdatedAt": "2024\/01\/28"
    },
    "updateAt": "2024\/05\/29"
}