{
    "lectureCode": "W63304",
    "courseName": "言語発達障害学演習",
    "lecturer": [
        "池田泰子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "後藤多可志(兼任講師)",
        "廣瀬綾奈(兼任講師)",
        "内山美保(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3",
        "月4",
        "木3",
        "木4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１９１３聴力検査・モニタリング室"
    ],
    "courceDetails": {
        "courseOverview": "本科目は、「言語発達障害学Ⅰ」で学んだ言語発達障害と関連する障害に関する知識、「言語発達障害学Ⅱ」で学んだ検査を中心とした評価に関する知識・技術、「言語発達障害学Ⅲ」で学んだ言語訓練に関する知識・技術を踏まえ、今までの学びを臨床現場における実践へとつなげる総合的な位置付けとなります。子どもを対象とした臨床において重要な保護者との連携、幼稚園教諭、保育士、学校教諭、保健師等の関連職種との連携を行う意義について学ぶとともに、他職種に言語聴覚士が実施した評価結果を子どもの支援に活かしていただくための報告書の作成を通して論理的な思考力を養います。また、摂食嚥下障害児に対する支援についても学びます。この科目は、実務経験を有する専門職がその経験に基づいて講義を行う実践的科目です。",
        "outcomesMeasuredBy": "1.保護者との連携を効果的に行うためのポイントを複数列挙できる2.摂食嚥下障害児に対する支援のポイントを複数列挙できる3.読み書き障害児に対する支援のポイントを複数列挙できる4.子どもの状態が概ね伝わる報告書を作成することができる",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・教科書、配布資料、スライドを用いてシラバスに沿って講義を進めます。シラバスの授業計画に変更が生じた場合は、その都度説明します。・講義で得られた情報を基に自身の考えを記述するリアクションペーパーを毎回課します。・講義資料はムードルにアップするとともに、こちらで印刷し、配布します。・ノートPCは必携ではありません。使用する場合は事前にアナウンスします。",
        "notices": "・関連科目：言語発達学、言語発達障害学Ⅰ-Ⅲ、小児科学・リアクションペーパーは、提出期限より後に提出されたものは受け取りません。また、授業に欠席した人の提出は認めません。",
        "preparatoryStudy": "・シラバスに示されている授業計画を確認し、教科書の該当部分を読んで予習を行ってください（30分）・授業における学びを振り返り、理解を深めることを目的として、毎授業後にリアクションペーパーの提出を課します（20分）・復習状況を確認するために小テストを実施します。小テストの実施については、授業時にアナウンスします（30分）。",
        "gradingGuidelines": "定期試験：60％、小テスト：20％、レポート：10％、毎回のリアクションペーパー：10％リアクションペーパーは次の基準で評価を行います。【A】自分の考えを根拠とともに過不足のない形で明確に記述（5点）【B】自分の考えと根拠との関連が認められるが、一部明確でない形で記述（3点）【C】期日までに未提出（0点）",
        "textbook": "・標準言語聴覚障害学言語発達障害学第3版:深浦順一・藤野博・石坂郁代編、医学書院、2021年・国リハ式＜S-S法＞言語発達遅滞検査マニュアル第4版:小寺富子他、エスコアール、1998年",
        "referenceMaterials": "・言語聴覚士のための言語発達障害学第2版:石田宏代・石坂郁代編、医歯薬出版、2016年・言語聴覚士のための言語発達遅滞訓練ガイダンス:佐竹恒夫・小寺富子・倉井成子、医学書院、2004年・学校でできる言語・コミュニケーション発達支援入門～事例から学ぶことばを引き出すコツ～:池田泰子・松田輝美・菊池明子著、学苑社、2022年・言語聴覚士のための臨床実習テキスト小児編:深浦順一・内山千鶴子編、建帛社、2022年",
        "courseSchedule": "第1回：オリエンテーション、WISC-Ⅴ・新版K式(池田）第2回：初回情報収集（問診・観察）（池田）第3回：保護者との連携（池田）第4回：保健、福祉との連携（池田）第5回：教育との連携（池田）第6回：訓練の長期経過（池田）第7回：報告書作成①（池田）第8回：報告書作成②（池田）第9回：小児を対象とした摂食嚥下に関する基礎演習①（池田・内山）第10回：小児を対象とした摂食嚥下に関する基礎演習②（池田・内山）第11回：脳性麻痺児等を対象とした摂食嚥下の評価・訓練①（廣瀬）第12回：脳性麻痺児等を対象とした摂食嚥下の評価・訓練②（廣瀬）第13回：発達性読み書き障害児を対象とした評価・指導/支援①（後藤）第14回：発達性読み書き障害児を対象とした評価・指導/支援②（後藤）第15回：まとめ（池田）",
        "courseDataUpdatedAt": "2024/03/11"
    },
    "updateAt": "2024/12/09"
}