{
    "lectureCode": "W63306",
    "courseName": "発声発語障害学IV",
    "lecturer": [
        "生井友紀子(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水",
        "水2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１９１１発声発語検査室"
    ],
    "courceDetails": {
        "courseOverview": "ヒトの生存基盤となる呼吸と摂食嚥下器官を利用してヒトは発話（発声発語）している。話しことばの音の基盤となるのが声である。1～2年時に学んだ発声発語系と神経系の構造・機能・病態、耳鼻咽喉科学、神経内科学、発声発語障害学ⅠⅡ、音声学ⅠⅡ、音響学の知識を踏まえ、声・発声について、また音声障害の基本的事項とともに、検査や訓練などの知識と手技も学ぶ。音声障害の種類と症状・病態などの特徴、音声障害をきたす疾患の症状・病態などの特徴、臨床経過と治療方法、情報収集・検査・評価と音声言語病理学的診断について学修する。実学に基づく専門能力、論理的な思考を養成する科目である。この科目は、実務経験を有する専門職が、その経験に基づいた講義と演習を行う実践的科目である。音声障害はその臨床に携わる言語聴覚士は少ない。本授業を通して、音声障害の患者への理解を深め、将来、機会があれば積極的に音声障害の臨床に取り組めるようになることを目指している。",
        "outcomesMeasuredBy": "・発声のメカニズムを説明できる。（呼吸発声発語（嚥下）器官の説明ができることを含む）。・声の特性について説明できる。・音声障害をきたす代表的疾患の病態と症状と検査法と治療法を説明できる。・声の検査（情報収集）の目的と内容と実施方法を説明できる。・声の検査（情報収集）を正しく実施し、かつ、その結果を正しく記述し、かつそこから音声言語病理学的判定をすることができる。・評価・音声言語病理学的診断から治療方針をたてることができる。・音声障害に対する代表的な治療と音声治療について、適応と方法を説明できる。・音声治療について、部分的に実施することができる。・喉頭摘出者の解剖生理学的障害と生活上の障害を説明できる。・無喉頭リハビリテーションの目的と内容を説明できる。・無喉頭音声の種類とそれぞれの特徴と適応を説明できる。・無喉頭音声リハビリテーションの目的と内容と実施方法を説明できる。・ごく基本的な声の判定ができる。・喉頭所見を述べることができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "初回オリエンテーションで授業の進め方について説明する。基本的にはシラバスの内容に沿って進める。変則的で変更がある可能性もある。授業ごとに次回の授業の確認をするように。授業では、スライド、印刷資料、教科書、音声\/動画、Webサイトなどを使用し、重要な部分は復習しながら繰り返し学習する。理解を深めるために、ひとりで、ペアで、小グループで、身体を動かし発声発語してもらうなど随時演習をするアクテイブラーニングを導入する。なおグループワークや発表だけでなく、毎回の授業について、授業時間外に十分な予習復習と準備が必要である。小テスト、レポート課題、グループ発表などで、臨床で必要な知識と技術だけでなく態度の学修度も確認していく。",
        "notices": "授業は集中して積極的に真剣に取り組むこと。小テストは、授業開始時だけでなく、授業終了時の実施も予定している。本授業では、下記の【履修済み関連授業科目】からもわかるように、こうした知識と技術をすでに学んできたことを前提にしている。毎回の授業では、発声発語系と神経系の構造・機能・病態と耳鼻咽喉科学に関連したものだけでなく、多くの医学的用語と専門用語による説明を伴う。授業中はただ聴いているだけではなく、メモやノートをとり、症状や発声発語を真似するなど、手も口も身体も声も頭もフル回転させて動かして知識と技術と態度の習得に集中すること。まずは授業時間を十分に有効に活用する。授業時間外の学習は必須である。復習を中心に予習も実施すること。余裕をもって時間を確保して、予習復習をする。個々人だけでなく、ペアやグループでも、自学自修する。検査やロールプレイ発表など、グループで授業時間外に十分に準備し練習して授業に臨むこと。【履修済み復習授業科目】・発声発語系の構造機能病態・神経系の構造機能病態・耳鼻咽喉科学・神経内科学・口腔外科学・臨床歯科学・発声発語障害学Ⅰ・発声発語障害学Ⅱ・音声学ⅠⅡ・音響学",
        "preparatoryStudy": "【予習】①予習として指示したことは必ず実施してから授業に臨む。②履修済み関連授業科目で学んだことで不確かなことは、前期の前半で復習し理解できるように計画をたて自修しておく。③授業の該当箇所を読み理解し、演習が予定されているものについては、自分で予習をしておく。【復習】①授業後ただちにその日の授業内容に目を通して、資料とノートと教科書などで、何を学んだかの確認をする。可能な限り、グループでの確認と一人での自学自修による確認をすることを推奨する。②情報収集や検査などの演習は、手技に習熟するよう練習を繰り返す。CDやDVDや検査道具は貸し出す。③課題を期限内に提出する。④小テストの準備をして授業に臨む。⑤授業終了時の小テストもある。授業中から自ら理解を深めるように積極的に授業に参加する。",
        "gradingGuidelines": "小テスト（30％）:小テストの再試追試はない。授業態度・演習・グループワーク・発表（10％）課題提出（5％）定期テスト（55％）",
        "textbook": "教科書：音声障害診療ガイドライン.2018年金原出版教科書2：病気がみえるvol3.耳鼻咽喉科学．MEDICMEDIA.2020教科書3：言語聴覚士テキスト第3版.医歯薬出版.2018教科書4：STのための音声障害診療マニュアル廣瀬肇監修インテルナ出版2008",
        "referenceMaterials": "・新ことばの科学入門第2版.廣瀬肇訳.医学書院.2008・言語聴覚士のための音声障害学.医歯薬出版.・音声障害治療学.廣瀬肇、生井友紀子他著.医学書院.2018・動画で見る音声障害ver2.0日本音声言語医学会2018・新編声の検査法日本音声言語医学会（編集）2009・図解言語聴覚療法技術ガイド第2版.文光堂,2022・言語聴覚士のための臨床実習テキスト成人編.建帛社,2017・言語聴覚療法臨床マニュアル改訂第3版.協同医書出版,2014",
        "courseSchedule": "第1回：オリエンテーション.第2回：発声のメカニズム．呼吸発声発語（嚥下）器官の解剖生理機能（１）第3回：声（１）呼吸発声発語（嚥下）器官の解剖生理機能（２）第4回：声（２）呼吸発声発語（嚥下）器官の解剖生理機能（２）第5回：音声障害をきたす疾患と要因と治療法（１）第6回：音声障害をきたす疾患と要因と治療法（２）第7回：音声障害をきたす疾患と要因と治療法（３）第8回：音声障害をきたす疾患と要因と治療法（４）第9回：情報収集・検査・評価（１）第10回：情報収集・検査・評価（２）第11回：情報収集・検査・評価（３）第12回：音声障害の治療の概要の基礎第13回：グループ発表の準備：ペアワーク、症例のまとめ方第14回：グループ発表の準備：グループワーク第15回：グループ発表第16回：グループ発表第17回：音声治療の実際第18回：音声治療の実際第19回：音声障害の臨床のマネジメント第20回：無喉頭リハビリテーション（１）第21回：無喉頭リハビリテーション（２）第22回：無喉頭リハビリテーション（３）第23回：まとめ",
        "courseDataUpdatedAt": "2024\/03\/06"
    },
    "updateAt": "2024\/05\/29"
}