{
    "lectureCode": "W63312",
    "courseName": "言語聴覚総合演習II",
    "lecturer": [
        "浦野雅世(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "川上勝也(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "外山稔(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火",
        "火2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３１９１１発声発語検査室"
    ],
    "courceDetails": {
        "courseOverview": "本授業科目は、臨床実習関連科目に位置付けられており、臨床実習までに身につけておくべき、態度・知識・技術を学内で学修します。成人言語聴覚障害の臨床を想定して、コミュニケーションに障害がある患者と信頼関係を築きつつ、自由会話、基本的な情報収集・検査・評価を実施できる能力の獲得を目的として演習をします。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目です。",
        "outcomesMeasuredBy": "①コミュニケーション障害を有する成人患者について対象者情報を収集し、発声発語機能を含むスクリーニング検査を実施し、評価することができる。②コミュニケーション障害を有する成人患者に対するRCPMとSLTA、AMSDの検査を正しく実施し、患者の反応を記録することができる。③コミュニケーション障害を有する成人患者に対して収集した情報（検査など）の結果をまとめ、対象者とその障害の特徴を把握し説明することができる。④コミュニケーション障害を有する成人患者と信頼関係を築きつつ、自由会話をすることができる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業は基本的にはシラバスに沿って進めます。スライド・配布資料・各種検査マニュアル・教科書などを使用します。個人での自由会話・検査・評価演習、ペアないし小グループでの自由会話・検査・評価演習（グループワーク）を主に行います。失語・高次脳機能障害と発声発語機能障害などについて基礎知識と検査手続きと評価に関する理解度を確認するため、小テストを実施し、またレポート課題にも取り組み提出してもらいます。",
        "notices": "・コミュニケーション障害を有する成人患者を対象とした臨床実習の準備のための授業です。履修済みの授業科目の復習をして授業に臨んでください。演習を通して、これまで学修した態度と知識と技術を統合していくので、積極的に授業に臨んでください。・演習に必要な物品や資料などは各自忘れずに持参してください。・実技（実演）試験を実施しますので、演習した内容については、ひとりで実施できるように繰り返し練習をして習得に努めてください。・臨床での患者や医療スタッフなどを想定して、常に真摯な態度で授業に臨んでください。【履修済みで復習しておくべき授業科目】●発声発語系の構造・機能・病態、●神経系の構造・機能・病態、●神経内科学、●失語・高次脳機能障害学Ⅰ〜Ⅲ、●失語・高次脳機能障害学演習Ⅰ〜Ⅲ、●発声発語障害学Ⅰ〜Ⅳ、●言語聴覚診断学【関連科目】●総合演習Ⅰ●臨床実習Ⅰ～Ⅲ",
        "preparatoryStudy": "【予習】（60分）・該当する失語高次脳機能障害学、発声発語障害学、またその基礎となる「解剖生理」「機能」「病態」の基礎知識を理解して授業に臨んでください。授業までに予習として、しっかりと復習し整理して理解に努めてください。・演習内容に相応する資料や検査マニュアルの内容を把握し理解しておいてください。【復習】（60分）・授業後は、各自で自由会話や検査や評価などの臨床場面を繰り返し練習し、態度・知識・技術の習熟に努めてください。検査道具一式などは貸し出します。",
        "gradingGuidelines": "定期試験（50％）、レポート課題（20％）、小テスト（30％）",
        "textbook": "・日本高次脳機能障害学会編：標準失語症検査マニュアル改訂第2版.新興医学出版,東京,2003．・西尾正輝:標準ディサースリア検査（新装版）.インテルナ出版,東京,2004.",
        "referenceMaterials": "・深浦順一,内山千鶴子,城間将江,他編:図解言語聴覚療法技術ガイド第2版.文光堂,2022・深浦順一,爲数哲司,内山量史編:言語聴覚士のための臨床実習テキスト成人編.建帛社,2017",
        "courseSchedule": "第1回：オリエンテーションRCPM自由会話第2回：模擬患者への自由会話①第3回：模擬患者への自由会話②第4回：模擬患者への自由会話③第5回：発声発語器官の観察第6回：SLTA/AMSD①第7回：SLTA/AMSD②第8回：SLTA/AMSD③第9回：SLTA/AMSD④第10回：模擬患者へのSLTA①第11回：模擬患者へのSLTA②第12回：模擬患者へのSLTA③第13回：模擬患者へのAMSD①第14回：模擬患者へのAMSD②第15回：模擬患者へのAMSD③全教員が全回担当",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/05/29"
}