{
    "lectureCode": "W63311",
    "courseName": "言語聴覚総合演習I",
    "lecturer": [
        "原田浩美(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "石津希代子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "池田泰子(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火3",
        "火4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１９１１発声発語検査室"
    ],
    "courceDetails": {
        "courseOverview": "本科目は、臨床実習前教育であり、これまで学内で修得した体験の積み重ねを臨床実習における実践へつなげるための橋渡しとしての位置付けになっています。言語聴覚臨床実習Ⅰへのレディネスを形成するために、これまでに修得した態度・技能・知識を統合します。検査とその結果のまとめを実践に則した演習を通して、修得します。また、臨床実習を前提とした人間関係を築くための基本的マナー、患者中心の考え方を演習に取り入れて対応します。",
        "outcomesMeasuredBy": "発達・聴覚の両領域において、1．必要な検査をマニュアルに沿って、滞りなく実施できる。2.検査終了後、すぐに結果を簡潔にまとめて記載できる。3.対象者（患者を含む）を想定し、挨拶からはじまる導入を経て、問診（インタビュー含む）、検査選択、検査の実施、その解釈を一連の流れで実施できる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本科目は、臨床実習への橋渡しの位置づけ科目として、アクティブラーニングのスタイルで進めます。グループワークやロールプレイ、ディスカッションなどの経験を通して、プロフェッショナリズムに必要な要素を獲得し、より質の高い臨床実践に結びつけます。進め方は、初回の科目ガイダンスで学習支援計画書に沿って説明します。（Moodleにも、学習支援計画書は示します）",
        "notices": "3年次前期までの全ての必修専門科目をしっかり復習しておいてください。",
        "preparatoryStudy": "【予習】各回、事前に準備課題を提示するので、当日までに、仕上げてください。【授業内】各回、事前の課題を基にして、授業内で演習を行います。【提出】各回、指定の課題を期日までにMoodleに提出してください。【復習】提出物は、コメント記入後、個別にMoodleなどを通じてフィードバックしますので、復習し、疑問、質問があれば、オフィスアワーに直接、または、Moodleやメールを通じて連絡して下さい。",
        "gradingGuidelines": "実技試験（100％）",
        "textbook": "指定しない必要に応じて、事前、当日、事後に資料を配布します。",
        "referenceMaterials": "3年次前期までの専門科目で用いたすべての教科書",
        "courseSchedule": "第1回：オリエンテーション全員身だしなみ、礼節、必要な配慮（実践）第2回：聴覚障害領域①事例に対しての情報収集（問診含む）（原田・石津）第3回：聴覚障害領域②事例に対しての検査の選択と実施（原田・石津）第4回：聴覚障害領域③検査の実施（発達検査は含まない）（原田・石津）第5回：聴覚障害領域④検査の実施（発達検査は含まない）（原田・石津）第7回：発達領域①（池田・小泉）第8回：発達領域②（池田・小泉）第9回：発達領域③（池田・小泉）第10回：聴覚障害領域⑤検査結果のまとめ（原田・石津）第11回：聴覚障害領域⑥検査結果のまとめ（原田・石津）第12回：言語発達領域④（池田・小泉）第13回：言語発達領域⑤（池田・小泉）第14回：聴覚障害領域⑦導入から検査結果のまとめまで（原田・石津）第15回：聴覚障害領域⑧導入から検査結果のまとめまで（原田・石津）実技試験に向けての情報公開※講師の都合により授業回が前後することもありますが、事前に案内します。",
        "courseDataUpdatedAt": "2025/03/11"
    },
    "updateAt": "2025/03/21"
}