{
    "lectureCode": "W63307",
    "courseName": "吃音学",
    "lecturer": [
        "池田泰子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "矢田康人(兼任講師)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木3",
        "木4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１１１１ＰＣ演習室１"
    ],
    "courceDetails": {
        "courseOverview": "本授業では、吃音を中心とした流暢に話すことができない流暢性障害について学びます。吃音訓練を実施している言語聴覚士が少ないという現状があり、吃音児者は訓練を受けたくても受けられないため、専門家と関わることなく苦悩に向き合っています。このような背景を踏まえ、当事者が抱えている苦悩の理解を深めるとともに、吃音臨床の流れに沿って情報収集、評価・分析、訓練法について学ぶ実践につながる実学に基づく専門能力を学修する。この科目は、実務経験を有する専門職がその経験に基づいた講義を行う実践的科目です。",
        "outcomesMeasuredBy": "1.吃音児者の苦悩を具体的に列挙できる2.吃音症状と正常範囲の非流暢性の違いを説明できる3.主要な吃音症状について説明できる4.マニュアル通りに吃音検査法を実施することができる5.主要な訓練法の特徴について説明できる",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・教科書、配布資料、スライドを用いてシラバスに沿って講義を進めます。シラバスの授業計画に変更が生じた場合は、その都度説明します。・講義で得られた情報を基に自身の考えを記述するリアクションペーパーを毎回課します。・講義資料はムードルにアップするとともに、こちらで印刷し、配布します。・ノートPCは必携ではありません。使用する場合は事前にアナウンスします。",
        "notices": "・関連科目：発声発語障害学Ⅰ-Ⅳ、言語聴覚総合演習Ⅰ・Ⅱ・リアクションペーパーは、提出期限より後に提出されたものは受け取りません。また、授業に欠席した人の提出は認めません。",
        "preparatoryStudy": "・シラバスに示されている授業計画を確認し、教科書の該当部分を読んで予習を行ってください（30分）・授業における学びを振り返り、理解を深めることを目的として、毎授業後にリアクションペーパーの提出を課します（20分）・復習状況を確認するために小テストを実施します。小テストの実施については、授業時にアナウンスします（30分）。",
        "gradingGuidelines": "定期試験：60％、小テスト：30％、リアクションペーパー：10％リアクションペーパーは下記の基準で評価を行います。【A】自分の考えを根拠とともに過不足のない形で明確に記述（5点）【B】自分の考えと根拠との関連が認められるが、一部明確でない形で記述（3点）【C】期日までに未提出（0点）",
        "textbook": "クリア言語聴覚療法７「吃音・流暢性障害」池田泰子坂田善政編著建帛社ISBN978-4-7679-4557-6",
        "referenceMaterials": "・改訂吃音、都筑澄夫編、建帛社・間接法による吃音訓練：都筑澄夫編、三輪書店、2022年・BarryGuitar:AnIntegratedApproachtoItsNatureandTreatment5thedition、LippincottWilliams&Wilkins・FrankenM.C.・Putker-deBruijn.D:Restart-DCMMethod、2007年・冨里周太・矢田康人・白石紗衣・和佐野浩一郎：吃音11症例における低強度認知行動療法の有効性、日本耳鼻咽喉科学会会報123（5）,363-370、2020年備考にも参考書を掲載します",
        "courseSchedule": "第1回：基礎知識①吃音児・者の苦悩、支援の現状、定義、種類、発症とその後の経過（池田）第2回：基礎知識②：原因論、特徴、他の疾患との鑑別、吃音症状（池田）第3回：評価①評価の流れ、吃音検査法の実施（池田）第4回：評価②吃音検査法結果のまとめ（池田）第5回：評価③問診・観察情報（池田）第6回：訓練①各ライフステージにおける訓練の特徴（池田）第7回：訓練②幼児を対象とした訓練法1(矢田)第8回：訓練③流暢性形成法・吃音緩和法(矢田)第9回：訓練④認知行動療法(矢田)第10回：訓練⑤統合的アプローチ(矢田)第11回：訓練⑥RASS理論年表方式のメンタルリハーサル法1（池田）第12回：訓練⑦RASS理論年表方式のメンタルリハーサル法2（池田）第13回：訓練⑧幼児を対象とした訓練法2「RASS理論環境調整法」（池田）第14回：発達性吃音以外の流暢性障害、セルフヘルプグループ他（池田）第15回：まとめ（池田）",
        "courseDataUpdatedAt": "2024/05/13"
    },
    "updateAt": "2024/12/09"
}