{
    "lectureCode": "W63306",
    "courseName": "発声発語障害学IV",
    "lecturer": [
        "未定(所属なし)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "金4",
        "金5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "音声障害について、解剖や生理学の学びを通して、実際の臨床症状から、どのような発声メカニズムで障害が起こっているのかの理解を深めます。また適切なリハビリテーションプログラムの立案や訓練が実施できる技術を身に付けることを目指します。",
        "outcomesMeasuredBy": "技術面:GRBAS尺度を用いて嗄声の程度を評価し、初歩的な音声治療の計画を立てることができる。知識面:音声障害の主な診断分類(器質性・機能性・その他)と音声特徴が理解できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "教員はPCにてスライドやホワイトボード(黒板)を使用し講義を行うことを基本とし、学生はレジュメや資料を中心とした講義を行う。講義の回によってはグループディスカッション、やディベート、グループワーク、実技などを2~4名程度の班単位で実施する。「ノートPC必携」",
        "notices": "講義内におけるスマートフォン、音声機器などの録画録音媒体の使用不可",
        "preparatoryStudy": "特になし",
        "gradingGuidelines": "期末試験結果:80%60点以上を「可」/59点以下を不可とするレポート:20%レポートは提出後の最初の講義で全体にフィードバックを行う",
        "textbook": "言語聴覚士のための音声障害学大森孝一(編集)医歯薬出版(2015/9/25)",
        "referenceMaterials": "STのための音声障害診療マニュアル廣瀬肇(著,監修,読み手),城本修(著),小池三奈子(著),遠藤裕子(著),生井友紀子(著)インテルナ出版;第1版(2008/6/19)",
        "courseSchedule": "第1回：定義と分類音声障害の概要、分類法B30:B49、音声コミュニケーションの重要性第2回：音声器官の解剖と生理発声のメカニズムについて1第3回：音声器官の解剖と生理発声のメカニズムについて2第4回：音声障害の種類と原因器質性・機能性その他音声特徴について第5回：音声検査の目的と種類聴覚心理的評価（GRBAS）自覚的評価(VHI)第6回：音声検査の目的と種類客観的評価(発声機能検査)第7回：音声検査の目的と種類喉頭内視鏡検査、ストロボスコピーの診方など第8回：検査の解釈と鑑別診断患者の主訴や得られた評価の情報と診断について第9回：音声治療の種類と方法保存や薬物治療、喉頭内腔からの手術第10回：音声治療の種類と方法喉頭外から経皮的アプローチ(主に甲状軟骨形成術)第11回：音声リハビリテーションについて概要(間接訓練と直接訓練など）第12回：音声治療について「高さ」を主訴とした患者への訓練方法や・治療方針(変声障害、性別不合)第13回：音声治療について「強さ」を主訴とした患者への訓練方法や・治療方針(痙攣性、心因性発声障害)第14回：音声治療について「音質」を主訴とした患者への訓練方法や・治療方針(ポリープ、浮腫性声帯炎)第15回：音声治療について「持続性」を主訴とした患者への訓練方法や・治療方針(声帯麻痺、声帯萎縮)第16回：ケーススタディ実際の症例を用いて音声評価と治療計画1(グループワーク)第17回：ケーススタディ実際の症例を用いて音声評価と治療計画2(グループワーク)第18回：神経疾患と音声障害について(ALS、Parkinson、MSA)など第19回：気管切開とカニューレの適応、嚥下障害との関連性について第20回：無喉頭音声喉頭摘出後の呼吸・発声・発語のメカニズム第21回：無喉頭音声悪性腫瘍(頚部食道癌や喉頭癌、肺癌)第22回：無喉頭音声の種類と特徴および選択基準人工喉頭、食道発声、気管食道瘻発声第23回：音声障害者への支援社会復帰の問題点言語聴覚士の役割",
        "courseDataUpdatedAt": "2025/01/29"
    },
    "updateAt": "2025/03/21"
}