{
    "lectureCode": "W63313",
    "courseName": "言語聴覚臨床実習I",
    "lecturer": [
        "外山稔(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "原田浩美(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "石津希代子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "生井友紀子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "内山美保(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "池田泰子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "川上勝也(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "浦野雅世(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "臨床実習は、医療従事者としての適切な態度を体得するとともに、専門科目（言語聴覚学応用科目群及び発展科目群）で修得した知識・技能の統合を目指す科目です。言語聴覚臨床実習Ⅰ（見学実習）では、医療機関又は福祉施設における20日間の見学を通し、実習施設における言語聴覚士の役割と職務、実習生としての対応を学修します。臨床実習施設の指導者の指導のもと、指導者が提供する言語聴覚療法の見学や記録を行うとともに、対象児・者の身体や行動の観察、情報の収集、観察記録によって生じた疑問を整理し、対象児・者及び言語聴覚療法への理解を深めます。また、言語聴覚士の対象児・者に対する接遇、他職種との連携についても学び、専門的臨床能力を養います。※指導にあたる担当教員全員が医療機関又は福祉施設における実務経験を有し、それらの経験を活かして実習を展開します。実務経験豊富な実習指導者のもと、言語聴覚療法及び摂食機能療法に関する実習を行う実践的科目です。",
        "outcomesMeasuredBy": "1.医療職を目指す学生として、実習施設内外において良識ある態度・行動をもって見学に臨むことができる。2.実習施設の機能・特徴を理解し、施設の規則や心得を遵守できる。3.コミュニケーション障害を有する児・者への対応を見学し、医療職に求められる基本的接遇を持って行動できる。4.臨床実習指導者が実施する情報収集や検査・訓練を見学し、コミュニケーション障害を有する児・者ごとのコミュニケーション方法の違いを整理できる。5.実習施設内における職種間コミュニケーション・連携の場面を見学し、他職種連携の必要性と各職種の役割を理解できる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "言語聴覚臨床実習Ⅰ（見学実習）は、学内で実施する事前準備学習と事後学習、学外の臨床実習施設で実施する見学実習により構成されます。事前準備学習と事後学習は、ペア・ワークやグループ・ディスカッションなどのアクティブラーニング型の講義・演習が含まれます。学外で実施する見学実習では、実際の言語聴覚療法（臨床）を見学して学びを深めます。（指定した事前準備学習プログラムと事後学習プログラムへの参加＋予復習60分以上）",
        "notices": "3年前期までに開講された言語聴覚学応用科目群の単位修得を履修条件とします。※復習科目：（1年前期〜3年後期）言語聴覚学応用科目群※関連科目：（4年前期）言語聴覚臨床実習Ⅱ、言語聴覚臨床実習Ⅲ事前準備学習と実習指導者会議、臨床実習後の事後学習は、原則全員出席です（無断欠席が続いた場合は、学外で実施する実習を許可しません）。",
        "preparatoryStudy": "臨床実習施設の概要及び地域での役割を調べ、実習に向けた予備知識を得てください。言語聴覚療法の対象児・者に対する適切な接し方・観察ができるように、言語聴覚応用科目群で学修した言語聴覚障害の種類と特徴、各種検査手続きを十分に復習してください。言語聴覚臨床実習の手引きを熟読し、実習生としての対応（身だしなみやマナー、緊急事対応を含む）を理解してください。",
        "gradingGuidelines": "事前準備学習・実技試験（25%）、実習指導者による評価（50%）、実習記録及び実習後の振り返り・口頭試問（25%）。",
        "textbook": "教科書は指定しません（資料を配布します）。",
        "referenceMaterials": "1)深浦順一,内山千鶴子,城間将江,他編:図解言語聴覚療法技術ガイド第2版.文光堂,20222)深浦順一,爲数哲司,内山量史編:言語聴覚士のための臨床実習テキスト成人編.建帛社,20173)深浦順一,内山千鶴子編:言語聴覚士のための臨床実習テキスト小児編.建帛社,2017",
        "courseSchedule": "【事前準備学習】・科目オリエンテーション、見学実習の目標・実習生に必要な行動と態度、体調管理・臨床実習施設の調査・見学記録（記録/メモの内容・注意点・情報の取り扱い）・検査手続き・反応記録・報告・連絡・相談・インシデントとアクシデント、ハラスメント・実習指導者会議の準備と対応・実技試験【見学実習】臨床実習施設において、実習指導者の監督・指導のもと実施します。・実習オリエンテーション・実習指導者が提供する言語聴覚療法の見学と記録・実習スケジュール（20日間：実習施設との調整により開始日・終了日を決定）【事後学習】・お礼状の作成と送付・見学実習の振り返り・次期実習に向けた課題の整理・口頭試問",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/12/09"
}