{
    "lectureCode": "W63310",
    "courseName": "聴覚障害学III",
    "lecturer": [
        "原田浩美(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3",
        "木4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３１９１３聴力検査・モニタリング室"
    ],
    "courceDetails": {
        "courseOverview": "補聴器や人工内耳をはじめとした聴覚障害者の聴覚補償手段および、その適合の基礎知識を学修します。また、学修を基礎として機器を用いた測定技能を修得し、「実学に基づく専門能力」を高めます。機器の特性、最良の聞こえを確保するフィッティング調整、マッピング調整については、理論に基づいた実践を行い、「論理的な思考力」、「分析・評価能力」を修得します。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目です。",
        "outcomesMeasuredBy": "1.補聴器の性能・機能、特性測定を説明できる。2.専用機器を用いた補聴器の特性測定、フィッティング調整を実践できる。3.補聴器適合検査を説明し、機器を用いて実践できる。4.人工内耳の原理・構造、人工内耳の適応と評価について説明できる。5.人工内耳のマッピング調整を機器を用いて模擬的に実践できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本科目では、補聴機器の基礎知識と実技を修得します。講義で得た知識を基に行う実践演習は、グループで行いますが、実践結果のまとめは個人で行います。全体の進め方の詳細は、初回の科目ガイダンスで学習支援計画書に沿って説明します。（Moodleにも、学習支援計画書は示します）自律的な予習、協同したグループディスカッションが中心となりますので、事前配布資料、関連科目の教科書および、自作のノート、ノートＰＣは必携です。",
        "notices": "聴覚障害学Ⅰ、聴覚障害学Ⅱで学修した知識、聴覚障害学演習Ⅰ、聴覚障害学演習Ⅱで修得した技能、思考法を基に実施するため、再度、関連科目の復習をしておいてください。",
        "preparatoryStudy": "【予習】講義については、資料を配布し、機器を用いながら説明します。機器を用いた演習については、事前にマニュアル資料を配布するので、しっかり読み込んで理解し（60分程度の学習）、実践に臨んで下さい。【授業内】事前配布のマニュアルを基に自律的演習を行います。理解の促進を目的としたワークを同時に行います。【提出】指定の演習レポート、ワークを期日までに提出してください。【復習】提出物は、コメント記入後、個別にフィードバックしますので、復習し、疑問、質問があれば、オフィスアワーに直接、または、Moodleやメールを通じて連絡して下さい。",
        "gradingGuidelines": "【評価方法】定期試験（50%）、演習課題（50％）【評価基準】定期試験については、授業内で学修したことを中心とした筆記試験を行います。演習課題については、つぎの回で、フィードバックを行います。",
        "textbook": "指定しない毎回、必要な資料を提示、配布します。",
        "referenceMaterials": "聴覚障害学Ⅰ・聴覚障害学Ⅱの教科書日本聴覚医学会編:聴覚検査の実際改訂4版.南山堂,2017標準言語聴覚障害学聴覚障害学第3版.医学書院,2021",
        "courseSchedule": "第1回：科目ガイダンス①本科目の位置づけ、目的、進め方の説明②補聴器の原理・構造と機能第2回：補聴器の特性測定と調整方法第3回：補聴器特性測定（実技演習含む）第4回：補聴器のフィッティング調整第5回：補聴器のフィッティング調整（実技演習含む）第6回：補聴器適合検査第7回：補聴器適合検査（実技演習含む）第8回：補聴器のまとめ第9回：人工内耳の原理・構造と機能第10回：人工内耳の適応と評価第11回：人工内耳の最新情報①第12回：人工内耳の最新情報②第13回：人工内耳のマッピング調整第14回：人工内耳のマッピング調整（実技演習含む）第15回：その他の聴覚補償機器・まとめ",
        "courseDataUpdatedAt": "2024/01/26"
    },
    "updateAt": "2024/05/29"
}