{
    "lectureCode": "W63305",
    "courseName": "発声発語障害学III",
    "lecturer": [
        "外山稔(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月",
        "月2",
        "月3",
        "月4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１９１３聴力検査・モニタリング室"
    ],
    "courceDetails": {
        "courseOverview": "dysarthriaは、神経系の損傷や機能不全によって起こる発声発語の異常です。発声発語には、大脳皮質と基底核・小脳といった神経回路が深く関わっており、神経系の機能不全をきたす疾患や状態によって話しことばの品質が低下します。本科目は、これまでに学修した発声発語系と神経系の構造・機能・病態、神経内科学、音声学、音響学の知識を踏まえて実施します。言語聴覚療法に必要とされるdysarthriaの病態と評価・検査を学び、問題点の抽出と訓練プログラム（訓練手技）に至る専門的臨床能力を養います。一連の学修を通して、論理的な思考力と分析・評価能力の向上をはかります。本科目は、リハビリテーション専門病院での実務経験を有する専門職が、その経験に基づいて講義を展開する実践的科目です。",
        "outcomesMeasuredBy": "1.dysarthriaの発生メカニズムを説明できる。2.dysarthriaの分類と特徴、代表的な原因疾患を説明できる。3.dysarthriaの診断に必要な観察、聴覚印象評価、発声発語器官機能検査を実施できる。4.観察評価や検査の結果に基づき、dysarthriaの鑑別診断（音声言語病理学的診断）を実施できる。5.dysarthriaのリハビリテーションの流れを把握し、発声、共鳴、構音に関する代表的な訓練法を説明できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "基本的にはシラバスの内容に沿って進めます（演習の進め方は初回オリエンテーションで説明します）。講義教材として、教科書、配布資料、パワーポイントを使用し、重要な部分は講義時間内に繰り返し説明します。発声発語器官の観察、聴覚印象評価、発声発語器官機能検査など、臨床的手技を学ぶ演習コマでは、ペア・ワークもしくはグループ・ワークによる実技（模擬）演習を実施します。授業毎のリアクションペーパー、授業内課題・小テストを実施して、知識と技能の整理・統合をはかります。",
        "notices": "※復習科目：（1年前期）解剖学Ⅰ（1年後期）発声発語系の構造･機能･病態、神経系の構造･機能･病態、音声学Ⅰ（2年前期）神経内科学、音声学Ⅱ、音響学、発声発語障害学Ⅰ（2年後期）発声発語障害学Ⅱ※関連科目：（3年前期）発声発語障害学Ⅳ、言語聴覚障害診断学（3年後期）摂食嚥下障害学、摂食嚥下障害学演習、言語聴覚総合演習Ⅱ",
        "preparatoryStudy": "次回の予定範囲に相応する教科書のページに目を通し、内容を把握してから講義・演習に臨んでください。また、疑問点や不明な部分があれば、教科書にコメントやチェックを入れ、講義・演習時間もしくはリアクションペーパー等で疑問解決に努めてください。講義・演習終了後は、聴覚印象評価や発声発語器官機能検査を繰り返し練習し、評価・検査手技の正確性の向上に努めてください。（120分程度）※演習時は、不織布マスク、鼻息鏡、ペンライト、ストップウオッチ、手鏡、クリップボードを持参してください。演習に必要となる他の準備物・服装は、その都度、事前に指示します。",
        "gradingGuidelines": "定期試験（45％）、授業内課題・小テスト（40％）、リアクションペーパー（15％）",
        "textbook": "1)西尾正輝著:ディサースリア臨床標準テキスト第2版.医歯薬出版,20222)西尾正輝著:標準ディサースリア検査（新装版）.インテルナ出版,2004",
        "referenceMaterials": "1)益田慎監修:発声発語・摂食嚥下の解剖・生理学.メジカルビュー社,20222)苅安誠著:神経原性発声発語障害dysarthria.医歯薬出版,20173)廣瀬肇監修:発話障害へのアプローチ診療の基礎と実際.インテルナ出版,20154)苅安誠監訳:運動性構音障害基礎・鑑別診断・マネージメント.医歯薬出版,20045)廣瀬肇,柴田貞雄,白坂康俊著:言語聴覚士のための運動障害性構音障害学.医歯薬出版,2001",
        "courseSchedule": "第1回：構音障害とdysarthria定義と特徴第2回：発声発語器官の構造と神経機構第3回：発声発語器官の構造と神経機構第4回：dysarthriaのタイプ分類と原因疾患第5回：発声発語器官の運動機能障害、聴覚的な発話特徴第6回：発声発語器官の運動機能障害、聴覚的な発話特徴第7回：弛緩性構音障害の病態特徴と重症度第8回：痙性構音障害の病態特徴と重症度第9回：失調性構音障害の病態特徴と重症度第10回：運動低下性構音障害の病態特徴と重症度第11回：運動過多性構音障害の病態特徴と重症度第12回：UUMN、混合性構音障害の病態特徴と重症度第13回：dysarthriaの評価と検査概要第14回：評価と検査標準ディサースリア検査第15回：評価と検査標準ディサースリア検査第16回：評価と検査標準ディサースリア検査第17回：評価と検査標準ディサースリア検査第18回：評価と検査標準失語症検査補助テスト第19回：評価と検査標準失語症検査補助テスト第20回：評価と検査標準失語症検査補助テスト第21回：評価と検査運動障害性（麻痺性）構音障害dysarthriaの検査法第22回：評価と検査運動障害性（麻痺性）構音障害dysarthriaの検査法第23回：評価と検査運動障害性（麻痺性）構音障害dysarthriaの検査法第24回：dysarthriaの言語治療･訓練概要第25回：言語治療･訓練姿勢と呼吸第26回：言語治療･訓練発声第27回：言語治療･訓練共鳴第28回：言語治療･訓練口腔と構音第29回：言語治療･訓練発話速度の調整第30回：言語治療･訓練AAC",
        "courseDataUpdatedAt": "2024/01/31"
    },
    "updateAt": "2024/12/09"
}