{
    "lectureCode": "W63302",
    "courseName": "失語・高次脳機能障害学III",
    "lecturer": [
        "浦野雅世(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３１９１１発声発語検査室"
    ],
    "courceDetails": {
        "courseOverview": "失語・高次脳機能障害学Ⅰ・Ⅱ、失語・高次脳機能障害学演習Ⅰ・Ⅱで学んだ知識を復習した上で、失語症におけるリハビリテーションの流れ、インテーク、スクリーニングの実施、評価、診断、問題点の抽出、アプローチの方針とプログラムの立案、セラピーの実際、失語症その他の高次脳機能障害によるコミュニケーション障害に対する評価・訓練について学修します。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目です。",
        "outcomesMeasuredBy": "①失語症におけるリハビリテーションの流れを理解できる。②得られた情報からどのように問題点を抽出するかを理解できる。③適切な評価バッテリーの選択や診断の仕方を理解できる。④訓練プログラムの立案に必要な各訓練手法を理解できる。⑤社会参加や生活期に対する支援を理解できる。⑥報告書の書き方を理解できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業の進め方は初回オリエンテーションで説明します。シラバスに沿って進めますが、進行上変更が生じる場合は連絡します。配布資料、音声\/動画を用いて講義を進め、重要な内容は講義時間内に繰り返し説明します。毎回の授業終了時に、講義に関する意見・感想や質問をリアクションペーパーに記述し、提出してもらいます。また、講義内容をどの程度理解出来ているか確認するため、小テストを数回行います。小グループによるディスカッションやペアワークも行います。",
        "notices": "＊関連科目：（1年前期）言語聴覚障害学総論、（1年後期）神経系の構造・機能・病態（2年前期）精神医学、神経内科学、失語・高次脳機能障害学Ⅰ・Ⅱ、（2年後期）失語・高次脳機能障害演習Ⅰ・Ⅱ、（3年前期）失語・高次脳機能障害学演習Ⅲ。疑問点は決してそのままにせずにリアクションペーパーないしは授業前後の時間に積極的に質問してください。また、各授業の復習を丁寧に行ってください。",
        "preparatoryStudy": "【予習】60分2年で学修した失語・高次脳機能障害学Ⅰ・Ⅱおよび失語・高次脳機能障害演習Ⅰ・Ⅱの内容を充分理解しておく必要があります。配布資料や教科書に目を通し復習しておいてください。【復習】60分失語・高次脳機能障害学演習Ⅲと双方向性に講義・演習を進めますので、その都度内容を照合し、演習でのグループワークに内容が活かせるよう努めてください。",
        "gradingGuidelines": "定期試験（55％）、小テスト（30％）、リアクションペーパー（15％）",
        "textbook": "・藤田郁代,立石雅子,菅野倫子編:標準言語聴覚障害学失語症学（第3版）,医学書院(2021)・藤田郁代,阿部晶子編.標準言語聴覚障害学高次脳機能障害学第3版.医学書院（2021）・深浦純一,植田恵編:標準言語聴覚障害学言語聴覚療法評価・診断学医学書院（2020）",
        "referenceMaterials": "・鹿島晴雄,大東祥孝,種村純編.よくわかる失語症セラピーと認知リハビリテーション.永井出版（2008）.・種村純編著.失語症臨床標準テキスト.医歯薬出版（2019）・石合純夫:高次脳機能障害学第3版.医歯薬出版（2022）.",
        "courseSchedule": "第1回：オリエンテーションこれまでに学修した失語症\/高次脳機能障害の復習第2回：失語症リハビリテーションの全体的な流れ臨床観察、情報収集の進め方第3回：インテークおよびスクリーニング検査、およびこれまでに得られた情報の統合、問題点の抽出第4回：評価・診断包括的言語検査の実施、掘り下げ検査の選択第5回：機能回復訓練①語彙訓練第6回：機能回復訓練②構文訓練第7回：機能回復訓練③文字・音韻訓練第8回：機能回復訓練④発語失行訓練第9回：活動・参加訓練①実用コミュニケーション訓練第10回：活動・参加訓練②重度失語症の訓練第11回：生活期の訓練・支援第12回：社会参加、心理・社会的問題の支援第13回：言語以外の高次脳機能障害の評価・訓練第14回：認知コミュニケーション障害\/認知症に伴うコミュニケーション障害への訓練・支援第15回：報告書のまとめ方",
        "courseDataUpdatedAt": "2024\/03\/11"
    },
    "updateAt": "2024\/09\/12"
}