{
    "lectureCode": "W63309",
    "courseName": "摂食嚥下障害学演習",
    "lecturer": [
        "外山稔(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "内山美保(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金",
        "金2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３１９１１発声発語検査室"
    ],
    "courceDetails": {
        "courseOverview": "本科目では、摂食嚥下障害学で学修した摂食嚥下障害の評価と診断理論に基づき、嚥下障害の評価診断及び摂食機能療法に必要とされる技能を学修します。演習では、初回面接（観察・問診）、嚥下スクリーニングテスト、嚥下造影と嚥下内視鏡検査等の結果を解釈し、病態生理に至る論理的な思考力と分析・評価能力の向上をはかります。演習に並行して、臨床場面を想定した事例検討を実施し、問題点の抽出と訓練プログラムの立案（間接訓練、直接訓練、姿勢調整・代償法）などの専門的臨床能力を養います。※この科目は、医療機関での実務経験を有する専門職が、その経験に基づいて演習を展開する実践的科目です。",
        "outcomesMeasuredBy": "1.成人の摂食嚥下障害の評価診断の流れを説明できる。2.スクリーニング検査の種類と方法を理解し、手順に沿って実施できる。3.嚥下造影検査の手順、評価の概要を説明できる。4.嚥下内視鏡検査の手順、評価の概要を説明できる。5.摂食嚥下障害の病態に応じた訓練法を選択し、支援プログラムを立案できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "演習の進め方は初回オリエンテーションで説明します（基本的にはシラバスの内容に沿って進めます）。摂食嚥下障害学で学修した嚥下評価及び訓練・代償手段の知識に基づき、ペア・ワークもしくはグループ・ワークによる演習を行います。授業内課題や理解度確認テスト（小テスト）を実施して知識と技能の統合を図ります。",
        "notices": "※復習科目（1年前期）解剖学Ⅰ（1年後期）発声発語系の構造･機能･病態、神経系の構造･機能･病態（2年前期）口腔外科学（2年後期）コミュニケーション演習Ⅱ標準予防策（スタンダード・プリコーション）（3年前期）発声発語障害学Ⅲ※関連科目：（3年後期）摂食嚥下障害学",
        "preparatoryStudy": "次回の演習内容に相応する教科書のページ及び付属DVDに目を通し、内容を把握してから演習に臨んでください。演習終了後は、各自で繰り返し練習し、手技の習熟に努めてください。（120分程度）※不織布マスクを準備・持参してください。演習に必要となる他の準備物・服装は、その都度、事前に指示します。",
        "gradingGuidelines": "定期試験（40％）、授業内課題・理解度確認テスト（40％）、レポート課題（20％）",
        "textbook": "1)藤島一郎,柴本勇監:摂食・嚥下障害患者のリスクマネジメント.中山書店,20092)上羽瑠美著:摂食嚥下のすべて改訂第2版.学研メディカル秀潤社,2022",
        "referenceMaterials": "1)藤島一郎,柴本勇監:摂食・嚥下リハビリテーション.中山書店,20042)福岡達之編:言語聴覚士のための摂食嚥下リハビリテーションQ\u0026A.協同医書出版,20163)日本耳鼻咽喉科学会編:嚥下障害診療ガイドライン2018年度版.金原出版,2018",
        "courseSchedule": "第1回：科目別オリエンテーション、演習の進め方（外山）第2回：摂食嚥下機能の評価手順（外山）第3回：摂食嚥下機能の観察と評価バイタル測定喀痰吸引（外山、内山）第4回：摂食嚥下機能の観察と評価バイタル測定喀痰吸引（外山、内山）第5回：摂食嚥下機能の観察と評価情報収集・問診・質問紙（外山）第6回：摂食嚥下機能の観察と評価スクリーニング検査（外山、内山）第7回：摂食嚥下機能の検査と評価嚥下造影検査（外山）第8回：摂食嚥下機能の検査と評価嚥下内視鏡検査（外山）第9回：摂食嚥下障害のリハビリテーション姿勢調整、食品調整（内山、外山）第10回：摂食嚥下障害のリハビリテーション姿勢調整、食品調整（内山、外山）第11回：摂食嚥下障害のリハビリテーション間接訓練（外山）第12回：摂食嚥下障害のリハビリテーション直接訓練（外山）第13回：事例検討問題整理と介入計画立案（外山）第14回：事例検討問題整理と介入計画立案（内山、外山）第15回：総括（外山、内山）",
        "courseDataUpdatedAt": "2024\/01\/28"
    },
    "updateAt": "2024\/09\/12"
}