{
    "lectureCode": "W6342",
    "courseName": "言語聴覚臨床実習III",
    "lecturer": [
        "浦野雅世(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "原田浩美(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "石津希代子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "生井友紀子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "内山美保(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "池田泰子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "川上勝也(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "外山稔(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": "6",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "臨床実習は、医療従事者としての適切な態度を体得するとともに、専門科目（言語聴覚学応用科目群及び発展科目群）で修得した知識・技能の統合を目指す科目です。臨床実習Ⅲ（総合実習）では、医療機関における30日間の実習を通し、コミュニケーション障害を有する児・者を対象とした一連の言語聴覚療法を学修します。臨床実習施設の指導者の指導のもと、コミュニケーション障害を有する児・者を対象とした評価（情報収集、検査の選択、検査の実施、結果の解釈とまとめ）を実施し、訓練・指導プログラムの一部を立案・実施します。また、他職種との連携についても学び、専門的臨床能力を養います。※指導にあたる担当教員全員が医療機関又は福祉施設における実務経験を有し、それらの経験を活かして実習を展開します。実務経験豊富な実習指導者のもと、言語聴覚療法及び摂食機能療法に関する実習を行う実践的科目です。",
        "outcomesMeasuredBy": "1.実習生として良識ある行動・態度を理解し、臨床実習施設内外で実践できる。  2.臨床実習施設の機能・特徴を理解し、施設の規則や心得を遵守できる。  3.コミュニケーション障害を有する児・者への対応を見学し、医療職に求められる基本的接遇を以て行動できる。  4.評価結果の解釈・問題点の抽出と予後予測を踏まえ、訓練目標を立案できる。 5.訓練プログラムの候補を挙げることができる。 6.臨床実習指導者の指示・監督の下、基本的な言語聴覚療法の一部が実施できる。 7.対象児・者の反応に基づき訓練プログラムを修正できる。 8.実施した言語聴覚療法の記録を作成できる。 9.訓練記録を整理し、反応や変化などの全体像を説明できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "臨床実習Ⅲ（総合実習）は、学内で実施する実習事前準備及び実習事後学習と、学外の臨床実習施設にて実施する総合実習で構成されます。実習事前準備及び実習事後学習は、ペア・ワークやグループ・ディスカッション、プレゼンテーションなどのアクティブラーニング型の講義・演習によって学びを深めます。学外で実施する総合実習では、実際の言語聴覚療法（臨床）を見学し、評価・訓練の一部を学修します。（指定した事前準備学習プログラムと事後学習プログラムへの参加＋予復習60分以上）",
        "notices": "言語聴覚臨床実習Ⅰの単位習得を履修条件とします。※復習科目：（1年前期〜3年後期）言語聴覚学応用科目群、言語聴覚臨床実習Ⅰ※関連科目：（4年前期）言語聴覚臨床実習Ⅱ臨床実習前に行われる実習事前準備と実習指導者会議、臨床実習後の実習事後学習は、原則全員出席です（無断欠席が続いた場合は実習を許可しません）。",
        "preparatoryStudy": "臨床実習施設の概要及び地域での役割を調べ、実習に向けた予備知識を得てください。言語聴覚療法の対象児・者に対する適切な接し方・観察ができるように、言語聴覚応用科目群で学修した言語聴覚障害の種類と特徴、各種検査手続き、基本的な訓練法を十分に復習してください。言語聴覚臨床実習手引きを熟読し、実習生としての対応（身だしなみやマナー、緊急事対応を含む）を理解してください。",
        "gradingGuidelines": "訓練プログラムに関する臨床問題・筆記試験（25%）、実習指導者による評価（評価票）（50%）、振り返りシート・見学\/実施数のまとめ、実習報告会（25%）",
        "textbook": "指定しません。",
        "referenceMaterials": "1)深浦順一,内山千鶴子,城間将江,他編:図解言語聴覚療法技術ガイド第2版.文光堂,20222)深浦順一,爲数哲司,内山量史編:言語聴覚士のための臨床実習テキスト成人編.建帛社,20173)深浦順一,内山千鶴子編:言語聴覚士のための臨床実習テキスト小児編.建帛社,2017",
        "courseSchedule": "【実習事前準備】・科目オリエンテーション、実習生に必要な行動と態度、体調管理・臨床実習施設の調査、総合実習での学習目標の作成・即時記録（記録\/メモの内容・注意点・情報の取り扱い）・検査手続き・反応記録・報告・連絡・相談・インシデントとアクシデント、ハラスメント・実習指導者会議の準備と対応・直前オリエンテーション（目標の再確認・共有、実習に向けた諸注意、臨床実習後の流れなど）・全般的知識、評価、訓練にかかわる筆記試験【臨床実習（総合実習）】臨床実習施設において、実習指導者の監督・指導のもと実施します。・実習オリエンテーション・実習指導者が提供する言語聴覚療法の見学と記録、評価\/訓練の実施・実習スケジュール（30日間予定：各実習施設との調整により決定）【実習事後学習】・お礼状の作成と送付・総合実習の振り返りと課題の共有・実習報告会",
        "courseDataUpdatedAt": "2024\/03\/06"
    },
    "updateAt": "2024\/05\/29"
}