{
    "lectureCode": "W6431",
    "courseName": "医療安全・人間工学概論",
    "lecturer": [
        "篠原一彦(医療保健学部臨床工学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "医療従事者として理解すべき安全について、ヒューマンエラーの認知科学的基礎・ソフトウエア・ハードウエア・マネージメントからみた事故事例、安全対策・事例分析の手法、チーム形成・危険予知活動など安全人間工学の各領域について、航空や電力などの産業領域の事例や教訓も提示しながら学際的に教育する。また働きやすさを人間と機械全体からとらえる学際的な科学である人間工学についてその概要を学修する。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "様々な学問と産業領域で取り組まれている安全と人間工学の基礎と活動について理解し、医療人・社会人としての業務や生活の中で調査、実践できる素養を修得することで、専門能力、コミュニケーション能力、論理的思考力と分析評価能力、問題解決能力を育成する。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "医療人として必要な安全と人間工学についての基礎と実践について、画像教材や事例分析をテーマとした相互討議や分析調査の発表も含めた講義を行う。",
        "notices": "事故事例に関する動画などを供覧するとともに、適宜討議も行うので、積極的な講義への参加が必須である。",
        "preparatoryStudy": "シラバスを参考にして教科書や参考書だけでなく、新聞報道や関連図書など自由にかつ広く関連資料にあたって欲しい。",
        "gradingGuidelines": "適宜提出する課題、レポートなどで総合的に評価する。",
        "textbook": "医療のための安全学入門（篠原、丸善、2005）",
        "referenceMaterials": "医療におけるヒューマンエラー（河野龍太郎、医学書院、2004）イラストで学ぶ看護人間工学（小川鑛一、東京電機大学出版局）",
        "courseSchedule": "第1回:ヒューマンファクタ科学の概要：ヒューマンファクタ科学の必要性と概要について学修する第2回:ヒューマンエラーの基礎：人間がエラーに陥る心理学・認知科学的要因について学修する第3回:ソフトウエアからみたエラー：エラーを誘発する書類や表示、規則等の因子について学修する第4回:人間工学概論１：人間工学の概要と人間工学に配慮した[ものづくり]について学修する第5回:人間工学概論２：人間工学の観点から疲労と人間について学修する第6回:人間工学概論３：コンピュータや映像の人間工学について学修する第7回:ハードウエアからみたエラー：機械がもたらすエラーや事故について学修する第8回:医療機器の安全：医療機器の安全対策、特に電気安全を中心に学修する第9回:日常生活の事故と対策：日常生活用品や地域での事故と対策について学修する第10回:事故の分析手法：RCAやFMEAなどの分析手法について学修する第11回:安全のための教育手法：一般産業で活用されている安全の教育手法について学修する第12回:ヒューマンファクタと社会：安全を取り巻く社会や法制度の課題について学修する第13回:医療事故の事例解析：医療事故の事例と教訓について学修する第14回:医療事故における被害者と行政：医療事故対策における行政の動きや被害者ケアについて学修する第15回:トピックス：安全に関するトピックスを講じる",
        "courseDataUpdatedAt": "2023/12/25"
    },
    "updateAt": "2024/12/09"
}