{
    "lectureCode": "W6438",
    "courseName": "言語聴覚支援工学",
    "lecturer": [
        "石津希代子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "萑部明美(兼任講師)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月3",
        "月4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３０２０１教室"
    ],
    "courceDetails": {
        "courseOverview": "この科目では、言語聴覚障害の方のコミュニケーション活動における課題に対し、コミュニケーション方法や機器の導入や操作の工夫など、具体的な支援方法の検討を行います。実際の言語聴覚障害の方への支援について、対象者の「参加」と「活動」に焦点をあてたプログラムを思考・立案します。これらの実践を通して、これからの医療・介護・福祉分野への活用や言語聴覚療法の在り方について考えます。科目を通して、対象者の課題を論理的に思考し、分析・評価し、問題解決をはかる能力の向上をはかります。また専門職としての自身の考えや判断を他者（対象者・他職種）に伝えていくコミュニケーション能力の向上も目指します。この科目は「言語聴覚士」の実務経験を有する教員と、医療施設において「言語聴覚士」として実務を行う講師が、実務の観点を踏まえて教授する実践的科目です。",
        "outcomesMeasuredBy": "1．言語聴覚障害の方の状況（背景・価値観、言語症状、コミュニケーションなど）を推察・把握し、説明できる。2．言語聴覚障害の方の状況を踏まえて、コミュニケーション活動における課題を挙げることができる。3．言語聴覚障害の方のコミュニケーション活動を支援するための具体的な支援プログラムを作成できる。4．支援プログラムの実践を確認し、改善点や工夫点を挙げることができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "シラバスおよび学習支援計画書（授業開始前に当該科目のMoodleコースに掲示）に沿って進めます。授業進行によって、シラバスおよび学習支援計画書に変更が生じた場合は、説明後に修正をし、Moodleに最新版を掲載します。本科目は事前学習を前提に、ディスカッション、グループワーク、プレゼンテーションなどのアクテイブラーニングを通して学習を深めます。講義内ではパソコンを利用するため、毎回、持参します。",
        "notices": "※復習科目：言語聴覚障害診断学※関連科目：言語聴覚総合演習Ⅰ、言語聴覚総合演習Ⅱ※授業内容の概略や補足説明、参考資料などは、随時、Moodleの当該コースに示します。また課題や評価基準はMoodleに記載するため、常に確認の上、学習を進めるようにしてください。",
        "preparatoryStudy": "【事前学習：60分程度】※講義終了時に次回の内容をアナウンスします。また、Moodleには事前学習用の資料や準備物などのアナウンスを提示します。※Moodleと学習支援計画書の各回の事前学習欄に掲載してある内容を確認し、学習を進めます。事前に準備してくる内容を確認し、自分で調べたり考えをまとめたりした上で、授業のディスカッションに参加します。必ず事前に準備をし受講します。【事後学習：60分程度】授業後、Moodleに授業概要を示すとともに、事後学習用の資料を掲示します。授業内容をさらに深める学習に取り組むようにします。",
        "gradingGuidelines": "【評価内容】提出物（20%）、活動相互評価（25%）、プレゼンテーション（25%）、成果物（30%）【評価基準・フィードバック】授業内の提出物、課題、プレゼンテーション、成果物について評価を行います。具体的な評価項目と評価指標（ルーブリック）は、Moodleに事前に提示します。各課題は、提出された際に確認・評価を行い、随時、個別もしくは対象グループにフィードバックをします。",
        "textbook": "特になし。授業内で資料を提示します。",
        "referenceMaterials": "授業内で紹介します。",
        "courseSchedule": "第1回科目オリエンテーション事例紹介:コミュニケーションの課題（石津・萑部）第2回事例検討・グループ検討➀：コミュニケーションの課題に対する支援の検討（石津・萑部）第3回グループ検討②：具体的支援方法の検討・作成（石津）第4回グループ検討➂：具体的支援方法の検討・作成（石津）第5回グループ検討➃：具体的支援方法の検討・作成（石津）第6回グループ検討➄：具体的支援方法の検討・作成（石津）第7回プレゼンテーション：発表、質疑、応答グループ検討➅：実践内容の再検討・修正（石津・萑部）第8回事例への実践の実際とフィードバック（石津・萑部）",
        "courseDataUpdatedAt": "2024\/01\/24"
    },
    "updateAt": "2024\/05\/29"
}