{
    "lectureCode": "W6439",
    "courseName": "地域言語聴覚療法学",
    "lecturer": [
        "原田浩美(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "池田泰子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "外山稔(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "浦野雅世(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３０２０１教室"
    ],
    "courceDetails": {
        "courseOverview": "本講義では、地域リハビリテーションの理念に基づき、言語聴覚・摂食嚥下機能などに障害のある方々が生活を営む場所である地域において、言語聴覚士に求められる役割・活動・支援のあり方について学修します。地域言語聴覚療法の理解には、それらを支える社会制度、医療機関との連携、各論で学修した言語聴覚療法の基礎知識を統合、向上させることにより、「実学に基づく専門能力」、「論理的な思考力」、「分析・評価能力」を身につけます。さらには、「問題解決を探索する」力を獲得します。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目です。",
        "outcomesMeasuredBy": "1.地域リハビリテーションの意義をリハビリテーションの歴史と背景の中で説明できる。2.地域言語聴覚療法における言語聴覚士の役割を説明できる。3.地域包括ケアシステムの定義、地域包括支援センターの役割を説明できる。4.地域における発達・教育支援の概要を説明できる。5.災害支援活動における言語聴覚士の役割を説明できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本科目は、言語聴覚療法における発展的内容を学修する科目であり、対象者のさまざまな背景、地域特性を考慮して実践、検討を行います。そのため、概ねアクティブラーニングのスタイルで進めますので、ノートPCは必携です。進め方は、初回の科目ガイダンスで学習支援計画書に沿って説明します。（Moodleにも、学習支援計画書は示しています）",
        "notices": "3年前期までの専門科目、言語聴覚学応用のすべての単位を修得して下さい。",
        "preparatoryStudy": "【予習】指定回には、事前に準備課題を提示する（約60分）ので、授業前までにMoodleに提出、または、授業開始までに準備してください。【授業内】事前の提出課題を基にして、授業内でグループワークを行います。【復習】提出物は、コメント記入後、個別にMoodleなどを通じでフィードバックしますので、復習し、疑問、質問があれば、オフィスアワーに直接、または、Moodleやメールを通じて連絡して下さい。",
        "gradingGuidelines": "【評価方法】定期試験（90%）、演習取り組み（10％）【評価基準】定期試験については、授業内で学修したことを中心とした筆記試験による知識確認を行います。演習への取り組みについては、演習内の発言、協力行動などを評価します。",
        "textbook": "標準言語聴覚障害学地域言語聴覚療法学医学書院,2019",
        "referenceMaterials": "第1回：科目ガイダンス（原田）①本科目の位置づけ、目的、進め方の説明②地域リハビリテーションの社会的背景と意義第2回：地域言語聴覚療法（原田）①地域言語聴覚療法とは②地域における言語聴覚士の役割③地域包括ケアシステムと制度④医療関係のシステムと制度第3回：成人・高齢者の地域生活を支える①失語症（浦野）第4回：成人・高齢者の地域生活を支える②聴覚障害（原田）第5回：小児の地域生活を支える言語発達障害（池田）第6回：成人・高齢者の地域生活を支える②摂食嚥下障害（外山）第7回：災害リハビリテーション支援（平時の備え）（原田）第8回：災害リハビリテーション支援（チームビルディング、グループ演習）（原田）",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/28"
    },
    "updateAt": "2024\/05\/29"
}