{
    "lectureCode": "W6437",
    "courseName": "言語聴覚研究",
    "lecturer": [
        "生井友紀子(医療保健学部リハビリテーション学科言語聴覚学専攻)",
        "川上勝也(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３１９１１発声発語検査室"
    ],
    "courceDetails": {
        "courseOverview": "言語聴覚士の臨床は、日々進歩する医療福祉領域での業務です。科学的根拠に基づく医療の実践には臨床とともに研究することも必須です。本授業は、研究の意義と一連の研究の概要を学修することを目的としており、４年時「言語聴覚卒業研究」のための準備・導入になります。また言語聴覚研究の理解と取り組み方と考え方を深めることで、臨床の理解と取り組み方と考え方も深めます。研究倫理とともに医学的・科学的態度の重要性を認識・理解し、「論理的な思考力」「分析・評価能力」「問題解決力」「実学に基づく専門能力」「コミュニケ－ション能力」を育みます。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目です。",
        "outcomesMeasuredBy": "・言語聴覚研究の意義を説明できる。・研究プロセスの重要性と概要を説明できる・さまざまな研究デザインを説明できる。・論文検索の基本的手法を説明でき、基本的な論文検索をすることができる。・研究倫理の意義と内容を説明できる。・研究におけるデータのとり方の概要と基本的な統計手法の選択と適用を説明できる。・参考文献や引用文献を正しく記述できる。・学術論文の種類とその特徴、論文の項目だてについて説明できる。・論文を読んで概要をまとめ、説明・記述することができる。・論文を読んで、そこから自分なりに課題をみつけ研究テーマを検討することができる。・研究に取り組む姿勢がどのように臨床に生かされるかを理解し説明することができる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "基本的にはシラバスの内容について学修する。授業の進めかた（順番）と内容は進捗状況によって変更する。授業は、スライドの使用や配布資料はない。教科書、WEB資料などを学生個々に使用して自ら検索・調査し、学習し、自ら言語聴覚研究の基礎となる科学的態度と思考能力を培います。研究の意義、研究プロセスの概要、研究倫理、研究デザイン、データ分析と統計学的手法、論文検索、論文の読み方などについて自分で調べて学修することがベースになります。一人で、ペアで、グループでのアクテイブラーニングも随時実施します。",
        "notices": "授業中は集中して、積極的に学修する。事前の準備・学習と授業後の復習は必須ですが、「研究」を理解し実践できるようにすることを目的とした授業ですので、授業中はもとより、授業時間外に、自発的かつ主体的な研究態度と学修態度が要求されます。授業の予習復習ということだけではなく、自発的に情報収集や検索や論文抄読や統計学的演習などとともに、理解が不十分な知識については理解できるように自学自修してください。「調べる」「読む」「整理する」「まとめる」「書く」「理解する」「実践する」時間を十分に確保してください。特に論文を多数検索して抄録を多数読み選択します。最低でも５～６の文献については精読します。自分の頭で考え、積極的に能動的に、学修する態度が必須です。",
        "preparatoryStudy": "講義内容に合わせて主体的に事前学習を行ってから授業に臨んでください。課題には必ず取り組み、提出物は期限内に提出してください。４年次の「言語聴覚卒業研究」で使用できるように、授業内容などは自分でまとめてノートを作成し、資料などは整理まとめてファイルする。理解が不十分な知識については理解できるように自学自修する。教科書２冊は第１回目の授業以降必ず持参する。参考書の中から、または参考書以外でも自分で選択した参考書や教科書をさらに１冊以上購入または図書館で借りて持参することが望ましい。",
        "gradingGuidelines": "定期試験（60％）（＝筆記試験とレポート２本の提出）授業中に提示した課題の提出（25％）授業/課題などの取り組み態度（15％）注意：「研究倫理のe-ラーニング」を期限内に実施しておく（詳細は説明する）。「研究倫理のe-ラーニング」を期限内に終了していなければ、定期試験の受験はできない。再試験は実施しない。",
        "textbook": "・言語障害の研究入門はじめての研究そして発表まで.伊藤元信著.協同医書出版社.2008年・コメデイカルスタッフのための論文の書き方―初心者から上級者まで―.西尾正輝著.インテルナ出版.2018年",
        "referenceMaterials": "・臨床研究の道標第2版上・下巻.福原俊一著.健康医療評価研究機構.2017・リサーチクエスチョンの作り方第3版.福原俊一著.健康医療評価研究機構.2015",
        "courseSchedule": "第1回：オリエンテーション研究とは（生井）第2回：研究の種類.研究デザイン.リサーチクエスチョン（生井）第3回：論文の種類と論文の読み方.（生井）第4回：情報収集・文献検索.文献の書き方（川上）第5回：研究倫理（生井）第6回：データのとり方・測定.統計学（生井）第7回：研究のまとめ方・発表のしかた（生井）第8回：まとめ（生井）",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/05/29"
}