{
    "lectureCode": "W6443",
    "courseName": "言語聴覚療法プロジェクト",
    "lecturer": [
        "石津希代子(医療保健学部リハビリテーション学科言語聴覚学専攻)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "この科目では、社会に広く貢献できる人間性豊かな言語聴覚士を目指して、卒業後の自分自身のキャリアコースについて考え、自分の将来像を描くことを目指します。現在活躍されている言語聴覚士から、さまざまな言語聴覚士の働き方について聞き、将来におけるキャリアを検討するとともに、それに向けて学ぶことの意味を再確認することを目的とします。科目を通して、自分自身を分析・評価し、目標に向けた問題解決をしていく能力の向上をはかります。この科目は「言語聴覚士」の実務経験を有する教員と、医療施設において「言語聴覚士」として実務を行う講師が、実務の観点を踏まえて教授する実践的科目です。",
        "outcomesMeasuredBy": "1．言語聴覚士になることを目標にするだけでなく、言語聴覚士として何をすることを目的にするのかを考え挙げることができる。2．言語聴覚士を目指す自身のキャリアデザインを描くことができる。3．言語聴覚士として生涯学習の意義を説明できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "シラバスおよび学習支援計画書（授業開始前に当該科目のMoodleコースに掲示）に沿って進めます。授業進行によって、シラバスおよび学習支援計画書に変更が生じた場合は、説明後、修正をします。本科目は事前学習を前提に、ディスカッション、グループワーク、プレゼンテーションなどのアクティブラーニングを通して学習を深めます。講義内ではパソコンを利用するため、毎回、持参するようにしてください。",
        "notices": "※復習科目：言語聴覚臨床実習Ⅰ、言語聴覚臨床実習Ⅱ、言語聴覚臨床実習Ⅲ※授業内容の概略やポイント、参考資料などは、随時、Moodleの当該コースに示します。また課題や評価基準はMoodleおよび学習支援計画書に記載するため、常に確認の上、学習を進めるようにしてください。",
        "preparatoryStudy": "【事前学習：60分程度】※講義終了時に次回の実施内容をアナウンスします。また、Moodleには、事前学習用の資料や準備物を提示します。※Moodleと学習支援計画書の各回の事前学習欄に掲載してある内容を確認し、学習を進めます。講義資料を確認し、自分の考えをまとめた上で授業に参加します。【事後学習：60分程度】Moodleと学習支援計画書の事後学習に掲載してある内容に取り組み、事前学習と授業で学んだことを、さらに深める学習に取り組むことを勧めます。",
        "gradingGuidelines": "【評価内容】提出物（70％）、活動相互評価（15％）、プレゼンテーション（15％）【評価基準・フィードバック】授業における提出物、課題、プレゼンテーションについて評価を行います。具体的な評価項目と評価指標（ルーブリック）は、事前に提示します。学習支援計画書およびMoodleを参照し、提出物の作成をして下さい。各課題は、提出された際に確認・評価を行い、随時フィードバックをします。",
        "textbook": "特になし。授業内で資料を提示します。",
        "referenceMaterials": "授業内で紹介します。",
        "courseSchedule": "第1回科目オリエンテーション（石津）第2回言語聴覚士としての活動の実際➀（石津、西脇）第3回言語聴覚士としての活動の実際②（石津、西脇）第4回言語聴覚士としての活動の実際③（石津、西脇）第5回言語聴覚士としての活動の実際④（石津、西脇）第6回自己のキャリアデザインを考える➀（石津）第7回自己のキャリアデザインを考える②（石津）第8回自己のキャリアデザインを考える③（石津）",
        "courseDataUpdatedAt": "2025/01/06"
    },
    "updateAt": "2025/03/21"
}