{
    "lectureCode": "T0900",
    "courseName": "法学[医療]",
    "lecturer": [
        "未定(所属なし)"
    ],
    "regularOrIntensive": "基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "日頃の生活のなかで、法律・契約がかかわる局面ごとに、最低限知っておくとよい知識を整理し、法学の発想のしかたを体感していただく内容を講義します。また、受講生の専攻を考慮して、医療従事者／独立or社内デザイナーとして活動する際にかかわってくる契約関係について、各１～２回程度を説明に充てる方針です。",
        "outcomesMeasuredBy": "日常生活において法律がどのような役割を果たしているかをおおよそ理解し、紛争が生じたときに専門家に答えを尋ねる必要がある問題か否かを見分ける力を養うことを目標とします。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "対面講義（テーマによって、一部グループ討論を取り入れる場合があります。以下の授業計画にGの表記ある場合にその可能性があります）。また、自宅学習課題（任意）を提供することがあるので、指定文献または動画を見てくることを前提に講義が進行することがあります（事前に指示します）。",
        "notices": "ノートPCの使用は自由（ただし、試験時にPCを参照することは認めません）",
        "preparatoryStudy": "各回ごとに、次回に向けた準備内容（読んでくるべき資料や、視聴してくるべき動画等）を指示します。また、自主課題を数回提供する場合は、授業中に指示された内容に従って提出してください（任意提出）。",
        "gradingGuidelines": "期末試験８０％、授業内における小レポート２０％の合算で評価する。（必要な連絡（評価方法の変更を含みます）は全て授業内でのみ行います。重要な変更のときは第10回授業時に授業内で説明します。なお、指定自主課題を任意に提出した場合には、期末試験についての加点要素と扱います）。フィードバックは、基本的に、当該実施直後の教室において（期末試験の場合は、試験実施直後に模範解答を書面配布します）、質疑等を受けることによって行います。",
        "textbook": "指定しないが、適宜レジュメ・資料を提供する予定（毎回では、ありません）。なお、紙資料は当該回とその次の回までしか保存しません。",
        "referenceMaterials": "法学の一般的な参考文献として、永井和之編「法学入門」第4版中央経済社。各分野の参考文献は、都度紹介します。",
        "courseSchedule": "第1回：人はどのように生活の糧を得て、暮らすのかキーワード（KW）;契約、裁判、強制力第2回：国がもつ強制力は、どのようにコントロールされるかKW;憲法、行政サービス、国境、条約第3回：他人の財産を盗んで暮らそうとする人に国はどう対処するかKW;刑事裁判、民事裁判、処罰、医療行為第4回G：他人の悪口をネットに書き込む人にどう対処するかKW;不法行為、発信者情報開示第5回：アパートの部屋を借りるKW;賃貸借契約、約款、退去義務、賃借権第6回：大家さんが死去したら、賃借した部屋は退去すべき？KW;相続、契約上の地位の譲渡、相続人、相続放棄、婚姻関係第7回G：診察時に処方された薬が誤って処方箋に記載されていたら？KW;医療サービス提供契約、薬機法、個人情報、守秘義務、商標法第8回：自分の居住地域が地震に見舞われたら？KW;被害者救済、災害対策、緊急避難、トリアージ第9回：デザイン創作活動にAIを利用して問題ないか？KW;意匠法、権利侵害、AIアシスト第10回：著作権法との付き合い方はどうあるべきかKW;著作権法、著作者人格権、引用、SNS第11回：雇用契約に署名するとは、どういうことを意味するかKW;雇用契約、守秘義務、個人情報、労働基準法第12回：会社を興すことのメリットは？KW;法人、会社、設立登記、有限責任第13回：宇宙空間の法（ルール）自分が設計したものが宇宙ステーションで実験対象とされたときの取り扱いKW;国際法、宇宙法、条約第14回：子育て、介護の法と、地方公共団体等の支援策（地方自治体により支援策が異なってもよい理由）KW;介護保険、健康保険、地方自治体第15回：現代社会を生き抜くために・・・授業の重要点を振り返り、質問を受けます。",
        "courseDataUpdatedAt": "2025/02/17"
    },
    "updateAt": "2025/03/21"
}