{
    "lectureCode": "T1000",
    "courseName": "コミュニケーション論[医療]",
    "lecturer": [
        "志岐裕子(兼任講師)"
    ],
    "regularOrIntensive": "基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１００３教室"
    ],
    "courceDetails": {
        "courseOverview": "私たちの日常生活において、コミュニケーションは避けて通れないものです。その対象は、友人、家族、クラス、職場、社会など様々です。近年では、SNS等を通じて不特定多数の相手と相互に交流することも容易になり、コミュニケーションの対象やその手段は急速に拡大しています。同時にそれに伴うトラブルや炎上現象も増加しつつあり、社会問題化していることはみなさんもご存知の通りです。今、コミュニケーションに関する様々な事例や研究結果に基づいた知見について学ぶことは、これからの日常生活におけるコミュニケーションを円滑に進めていくためにも大切なことといえます。授業では、まず対人レベルのコミュニケーションについて学んでいき、徐々にその対象を広げながら、中盤〜終盤には社会レベルのコミュニケーションについて学んでいきます。各テーマに関する具体的な事例や研究の紹介等を通じて、コミュニケーション論における研究方法や基礎的概念を修得するとともに、主要な理論についての理解を深めます。また、コミュニケーションにかかわる様々な問題について考察し、解決策を見出す力を養うことを目指します。この授業で学んだ知識をもとに、自らのコミュニケーションを客観的に振り返り、今後の円滑なコミュニケーションのために活用してください。",
        "outcomesMeasuredBy": "(1)コミュケーション論における主要な概念や理論、研究方法を理解し、コミュニケーション能力を向上させるための基盤を形成すること。(2)学んだ知識をもとに自らのコミュニケーション行動を振り返る分析・評価能力、課題の発見やその解決策を見出す問題解決力を身につけること。(3)今日の様々な社会的問題に対し、コミュニケーション論の視点から理解を深め考察する論理的な思考力を身につけること。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "各テーマについて講義を中心におこないます。いくつかのテーマについては、事前に自身の体験や考えについて尋ねたり、アンケートを実施することがあります。提出にはMoodleを利用しますので、ノートPC、スマートフォン等、Moodleが利用できる環境を準備しておいてください。学期の途中で授業内容の理解度を確認する小テストを実施することがあります。小テストの実施時期については、あらかじめ授業内で予告します。",
        "notices": "第1回では、授業の進め方とその他注意事項を説明します。必ず出席してください。教員に質問や相談がある場合は、授業前の時間に対応します。",
        "preparatoryStudy": "予習：事前に考えておいてほしいテーマを提示するので、日頃の自分のコミュニケーションを思い返したり、積極的に文献等を使用しながら、意見をまとめておいてください。復習：授業後は、講義資料を用いて内容を復習しましょう。（予習・復習それぞれ120分程度）",
        "gradingGuidelines": "授業参加度（授業態度、発言回数、授業中にディスカッションを行なった場合は、ディスカッション参加への積極性等）・小テスト・提出課題（50%)および期末試験（50%）によって評価します。100点満点中60点以上で単位認定とします。提出課題・小テストへのフィードバックは授業の中で行います。",
        "textbook": "指定しない",
        "referenceMaterials": "橋元良明,コミュニケーション学への招待,大修館書店,1997池田謙一・唐沢穣・工藤恵理子・村本由紀子,社会心理学（補訂版）,有斐閣,2019その他、授業で紹介する学術論文や書籍の情報は、授業時に紹介します。",
        "courseSchedule": "第1回：イントロダクション授業全体に関する説明第2回：対人魅力：対人好悪の決定要因第3回：対人関係の状態とその影響：関係が悪化する要因とその対応第4回：援助行動：助けてもらえる人、もらえない人第5回：攻撃行動：どんな人が攻撃行動を起こしやすいのか第6回：集団の影響：集団で仕事をすると本当にはかどる？第7回：リーダーシップ：効果的なリーダーシップとは第8回：群衆心理：パニック・デマ・流言第9回：流行：流行を生み出す心理第10回：マス・コミュニケーションの発展第11回：マス・コミュニケーションの効果第12回：メディアと暴力：暴力描写は悪影響をもたらすのか第13回：オンライン・コミュニケーション(1)：炎上が起こる原因と対処第14回：オンライン・コミュニケーション(2)：SNSとマスメディア第15回：まとめ※授業の進み具合によって、スケジュールに多少の変更を加えることがあります。また、コミュニケーションにかかわる新しいニュースや出来事が起きた場合は、適宜授業に取り入れていくため、授業内容に若干の変更を加える場合があります。",
        "courseDataUpdatedAt": "2024/02/02"
    },
    "updateAt": "2024/12/09"
}