{
    "lectureCode": "T1500",
    "courseName": "スポーツ・コンディショニング[医療]",
    "lecturer": [
        "内藤通昭(兼任講師)"
    ],
    "regularOrIntensive": "基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "文明の発展に伴い、人々の生活様式も多様化・複雑化するとともに情報機器の活用が生活の中心になり、ストレスや運動不足、睡眠の質等が課題となっています。また、少子高齢化、人生100年時代の中にあって、健康や体力の向上、平均寿命と健康寿命の差を縮めることなども課題となっています。また、将来の健康とともに、介護予防や生活の質の向上を目指した心身のコンディショニング、筋力トレーニングは必要不可欠になってきています。本講座では、「健康や体力」「健康寿命」の現状や介護予防等に関する課題等を理解し、自らの体力を高めるとともに、そのコンディショニングと筋力トレーニング、筋肉肥大と食生活における栄養素の摂り方等を身につけ、今後の「健康寿命」を伸ばすための正しい知識と態度を学修していきます。",
        "outcomesMeasuredBy": "・運動やスポーツの効用を理解するとともにそれを自ら日常生活に活用しながら実学に基づく専門能力を構築する。・論理的な思考力を身に付ける。・分析・評価能力を身に付ける。これらの目標に対する各自の到達度は，平常の授業課題や試験等で確認する。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "初回の授業ガイダンスを含め，合計15回を講義形式で展開します。また，授業では参考書を使った学修やプレゼンテーション、配付資料を使って学修を展開します。履修学生は，参考書とともに授業時に配付する資料やプレゼンテーションを参考に、課題学修を実践して試験に備えます。課題に対するフィードバックはMoodleなどを通じて行う。",
        "notices": "授業は、原則として全出席を基本としますが、やむを得ない事情での欠席や遅刻の場合は、授業時やその後の授業時に申し出てください。",
        "preparatoryStudy": "授業のための予習は特に必要ありませんが，関係するニュースや新聞記事等に普段から目を通し，正しい知識の獲得に努めることが大切です。",
        "gradingGuidelines": "期末試験により評価します。授業に関する理解度や応用力を100点満点で採点し,6割以上に達した学生を合格とします。",
        "textbook": "特になし",
        "referenceMaterials": "「筋肉をつくる食事・栄養パーフェクト事典」(監修)岡田隆竹並恵里(発行者)田村正隆(発行所)株式会社ナツメ社2018年，価格（本体1,600円+税）",
        "courseSchedule": "第1回：ガイダンス…授業全般の諸注意、評価方法、スポーツについて、国の政策等第2回：運動と栄養と健康について食生活チェック、運動チェック等、ビデオ視聴第3回：筋肉の成分と筋肥大のしくみ（その１）、ビデオ視聴第4回：筋肉の成分と筋肥大のしくみ（その２）関節の動き、けが予防とコンディショニング第5回：筋肉の成分と筋肥大のしくみ（その３）ホルモンのはたらき、アミノ酸第6回：食事と三大栄養素（その１）食事と栄養バランス、三大栄養素のはたらき、練習問題（その１）第7回：食事と三大栄養素（その２）糖質と脂質の種類と特徴ビデオ視聴第8回：タンパク質のはたらきと特徴（その１）、練習問題（その２）第9回：タンパク質のはたらきと特徴（その２）タンパク質の変性と加工特性第10回：ＰＦＣバランスについてタンパク質の過剰摂取、血糖値の上昇する弊害等ビデオ視聴アスリートと食事第11回：睡眠について睡眠の質を高めるために練習問題（その３）ビデオ視聴第12回：筋肥大に有効な栄養素についてBCAA、ビタミン、ミネラル第13回：コンディショニングについてピリオダイゼーション練習問題（その４）第14回：生活習慣を見直す腸内環境について各自の生活習慣を見直す第15回：アスリートのコンディショニング、練習問題（その５）期末試験の説明ほか",
        "courseDataUpdatedAt": "2024\/01\/10"
    },
    "updateAt": "2024\/09\/12"
}