{
    "lectureCode": "T1500",
    "courseName": "スポーツ・コンディショニング[医療]",
    "lecturer": [
        "未定(所属なし)"
    ],
    "regularOrIntensive": "基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３Ｂ１１０大講義室（地下ホール）"
    ],
    "courceDetails": {
        "courseOverview": "運動・身体活動と健康との関連についての理解を深め、生活習慣を見直し、健康の保持増進に活用できる実践的な知識を身につけることを目的とする。",
        "outcomesMeasuredBy": "(1)筋骨格系の基本的な知識を習得し、生活習慣がもたらす日頃のちょっとした不調（姿勢不良による肩こり等）を緩和できるようになる。(2)スマートフォンや記録用紙を活用して日々の行動をはかる方法を知り、データをもとに健康上の課題を見出し、より良い行動につなげられるようになる。(3)健康関連行動（食べる、動く、寝る）の基礎知識を習得し、行動医学等の分野における研究動向を踏まえ、国内外の現状や課題を説明できるようになる。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "【毎回の授業の流れ】前回の概要を確認した後、当日の講義を行う。スライドを用いる。【実施方法】基本的に対面で授業を行う予定である。状況により、オンラインに変更する場合もある。【提出物について】締切を過ぎたもの、指定された方法以外で提出されたものは採点対象としない（事前に相談があった場合を除く）。",
        "notices": "・「自分で考える」、「自分の言葉で表現する」ことを重視します。・スマートフォンをお持ちでない方は事前に相談してください。スマートフォンを使って歩数を計ったり、食べたものを写真で記録したりする課題があります。・授業の内容や進め方は、必要に応じて調整していきます。",
        "preparatoryStudy": "【予習】キーワードの意味や関連情報を調べてくる。第6回、第7回は事前課題あり。【復習】当日中に、授業内容を3文以内で要約する。",
        "gradingGuidelines": "課題を合計100点満点で採点し、60点以上を合格とする。個々の課題に対する配点はその都度事前に知らせる。各課題に対するフィードバックは授業時あるいはMoodle上で行う。",
        "textbook": "指定しない",
        "referenceMaterials": "(1)人体の取扱説明書:科学的に正しい体の使い方と,トラブルへの対処法がわかる改訂第2版,ニュートンプレス,2022.(2)睡眠の教科書:眠りの科学で、最高のパフォーマンスを手に入れる増補第2版,ニュートンプレス,2021.(3)筋肉の科学知識:健康に生きるための筋肉の鍛え方体づくり編,ニュートンプレス,2021.(4)KarenGlanz,BarbaraK.Rimer,K.Viswanath,editors,Healthbehavior:theory,research,andpractice:5thed,Jossey-Bass,aWileybrand,2015.その他、授業内で適宜紹介する。",
        "courseSchedule": "第1回：【ガイダンス】授業の目的や進め方の説明、授業内容の概説第2回：【健康とは】キーワード：平均余命、平均寿命、疾病構造、アブセンティーイズム、プレゼンティーイズム第3回：【食事と健康】キーワード：肥満、やせ、体脂肪率、BodyMassIndex、食生活指針、フードガイド第4回：【睡眠と健康】キーワード：睡眠-覚醒リズム、断眠、睡眠圧、体内時計、睡眠負債、睡眠指針第5回：【身体活動と健康】キーワード：身体活動、運動、座位行動、身体活動指針第6回：【生活習慣の見直し（食事）】事前課題あり。自分のデータをもとに考察を行う。健康上の課題を明らかにし、今後1週間の具体的な行動目標を立てる。第7回：【生活習慣の見直し（身体活動・睡眠）】事前課題あり。自分のデータをもとに考察を行う。健康上の課題を明らかにし、今後1週間の具体的な行動目標を立てる。第8回：【ウェアラブルデバイスを活用した身体活動・睡眠の測定と応用】キーワード：ウエアラブルデバイス、スマートフォン、加速度センサ、ビッグデータ第9回：【前半のまとめ】第2回～第8回の授業内容のおさらい。前半の理解度確認。第10回：【からだが動くしくみ（骨・関節・筋）】キーワード：可動関節、解剖学的基本肢位、骨格筋、短縮性筋活動、伸張性筋活動、等尺性筋活動第11回：【下肢の主な筋と骨格】キーワード：腓腹筋、ヒラメ筋、前脛骨筋、大腿四頭筋、ハムストリングス、内転筋群、腸腰筋、大殿筋、蝶番関節、球関節、単関節筋、二関節筋第12回：【上肢の主な筋と骨格】キーワード：上腕二頭筋、上腕三頭筋、三角筋、車軸関節、主働筋、拮抗筋第13回：【体幹の主な筋と骨格】キーワード：僧帽筋、胸鎖乳突筋、脊柱起立筋群、広背筋、腹直筋、大胸筋、肩甲骨、骨盤、脊柱、伸張反射第14回：【後半のまとめ】第10回～第13回の授業内容のおさらい。後半の理解度確認。第15回：【総括】今学期の授業で何を学び、それをどのように活用できるのか、自らの言葉で説明する。全体の理解度確認。",
        "courseDataUpdatedAt": "2025/01/24"
    },
    "updateAt": "2025/03/21"
}