{
    "lectureCode": "T1600",
    "courseName": "スポーツ・コンディショニング実習",
    "lecturer": [
        "巴伸一(兼任講師)"
    ],
    "regularOrIntensive": "基礎教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "医療保健学部リハビリテーション学科言語聴覚学専攻",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３０２０１教室"
    ],
    "courceDetails": {
        "courseOverview": "スポーツコンディショニングでは、心身の状態を整えることを実践的に行う。普通の生活における各自の心拍数を知り、運動をどれくらいの強さでどのくらい続けると心拍数がどのくらい上昇するのかを意識して運動を行う習慣を身につける。毎回、はじめと６分間のウォーキング（ジョギング）後の心拍数を計測し、運動強度と目標心拍数の関係を知るとともに、メンタルにも影響する呼吸の重要さについての理解を深め、自重を活かしたトレーニング方法について学び、心身のコンディショニング向上について実践する。また、数種類の軽スポーツ（パラスポーツ）を行う中で、ルールを学び、マナーを身につけ、ゲームを通してコミュニケーション能力、社会性や協調性を身につけ、生涯にわたってスポーツライフを楽しめる一助とする。",
        "outcomesMeasuredBy": "・実践的にコンディショニングを修得する過程において、その意義について理解を深めることができる。・心身のコンディショニング方法を学び、自身の健康管理に役立てることができる論理的な思考力を身につける。・多様なコンディショニング方法を修得し、目的に応じてコンディショニングを選択できるようになる分析・評価能力を身につける。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "第1回目は、ガイダンスを行い授業の流れ、準備、評価方法等について説明する。第1回目の集合場所は30201教室です。第2回目以降は、アリーナで身体を動かしコンディショニングを実践する。第2回目以降は、体操服等の身体が動かしやすい服装と運動靴を着用して授業に参加することが求められる。また、アクセサリー等の着用は不可である。本授業では、身体活動や運動を行うため、水分補給のための飲み物やタオルなどを準備すること。※体操服や運動靴など着用を忘れた場合は、評価減点の対象となるため注意すること※インフルエンザや新型コロナ等の感染状況によって、学生は教員の指示に従いマスクの着用、用具のアルコール消毒など予防対策に協力し、感染予防に努めることが求められる。",
        "notices": "本講義では授業への出席を重要視している。そのため、理由なく遅刻・欠席する者を厳しく取り扱う。遅延・欠席を認める主な理由として、公共交通機関の遅延、異例の天候災害、医療機関での受診などである。遅刻・欠席する場合は、必ず、公共交通機関が発行する遅延証明書（web上のものは受理しない）、医療機関の領収書コピーの提出が必要である。その他理由がある場合は、教員に相談することが必要である。",
        "preparatoryStudy": "実践的授業のため、授業に参加することが重要となる。授業に参加できるように、日ごろから健康管理を実践し、授業の参加に影響しないように努めることが必要となる。",
        "gradingGuidelines": "評価は、参加意欲・態度（50%）、理解度（25%）、協調性（25%）の視点で行い、合計で60%以上を獲得したものを合格とする。※原則、全授業に参加することが必須である。※遅刻や無断欠席した場合は、総合評価から減点する。",
        "textbook": "指定しない",
        "referenceMaterials": "第1回：ガイダンス※集合場所は30201教室第2回：目標心拍数の設定、6分間ウォーキング、呼吸法、ストレッチ第3回：6分間ウォーキング、呼吸法、ストレッチ、筋力トレーニング第4回：6分間ウォーキング、呼吸法、ストレッチ、筋力トレーニング第5回：6分間ウォーキング、呼吸法、ストレッチ、筋力トレーニング第6回：6分間ウォーキング、ストレッチ軽スポーツ第7回：6分間ウォーキング、ストレッチ軽スポーツ第8回：6分間ウォーキング、ストレッチ軽スポーツ第9回：6分間ウォーキング、ストレッチ軽スポーツ第10回：6分間ウォーキング、ストレッチ軽スポーツ第11回：6分間ウォーキング、ストレッチ軽スポーツ第12回：6分間ウォーキング、ストレッチ軽スポーツ第13回：6分間ウォーキング、ストレッチ軽スポーツ第14回：6分間ウォーキング、ストレッチ軽スポーツ第15回：6分間ウォーキング、ストレッチ軽スポーツ",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/15"
    },
    "updateAt": "2024\/05\/29"
}