{
    "lectureCode": "T2200",
    "courseName": "コンピュータ概論II[医療]",
    "lecturer": [
        "藤澤幸太郎(教養学環)"
    ],
    "regularOrIntensive": "基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１００３教室"
    ],
    "courceDetails": {
        "courseOverview": "現代社会では至るところにネットワークが張り巡らされており、モバイル機器や計測技術が飛躍的に発展した結果、従来とは質も量も異なる多種多様で膨大なデータ、ビッグデータが生み出されるようになった。このような社会ではデータは資源などと同様に大きな価値を持つものであり、問題の予測や意思決定など多岐に渡ってデータが活用されている。このように、蓄積されていくデータを、数理的な手法や人工知能(AI)などを駆使して分析することで、問題を解決したり有益な知見を引き出したりするものがデータサイエンスである。データの活用は企業や研究での活動にとどまらず、幅広く社会での意思決定にも用いられており、そのような社会はデータ駆動型社会とも呼ばれている。このようなデータ駆動型社会に生きる我々は、データをもとに事象を適切に捉えるデータ思考を養う必要がある。また、AIに関するリテラシーも高めることで、自らの意思でAIの恩恵を享受・活用することも重要である。そこで本講義では、デジタル社会の基礎知識である数理、データ、AIに関する知識や技能などを育み、社会のあらゆる分野で活躍できることを目指し、実際にデータの分析を行いながらデータサイエンスに触れて、その理解を深めていくことを目指す。具体的には、まずは社会におけるデータ・AIの活用に関して概観する。次に、具体的なデータの読み方や説明方法、扱い方や留意点などに関して学ぶ。またデータサイエンスを学ぶためには、実際にデータを分析し論理的な思考力を育むことも大切である。そのため本講義では一方的な講義にとどまらず、ノートパソコンでExcelを用いて実際のデータを解析するなど、データサイエンスやAIに関する初歩的な演習も行い理解を深めていく。",
        "outcomesMeasuredBy": "データサイエンスは社会のありとあらゆる分野で重要になってきている。そこで本講義では、以下の項目を到達目標とする。1.データ駆動型社会におけるデータの活用に関して理解する2.様々な種類のデータを理解して扱い、説明できるようになる3.データやAIを扱う際の留意点に関して理解する4.与えられたデータを実際に解析できるようにする5.AIやビッグデータに触れることで、理解を深める",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本講義では、スライドを用いて進めていく。スライドは講義資料として配布する。また授業ではMoodleを使った小テストやExcelなどを用いた演習を行うため、Excelが使えるノートパソコンを持ってくること。",
        "notices": "本講義では、数式やExcelを使った課題演習などを行う。数式やExcelに関してはなるべく説明を行うが、苦手な場合は高校の数学やExcelの使い方を復習しながら学習すると良い。",
        "preparatoryStudy": "予習：アップロードされた講義資料や参考書などに目を通しておくこと(120分)。復習：授業の内容や小テストで分からなかった部分に関して、もう一度取り組んでおくこと。データサイエンスでは、実際にデータを読んで説明できることが重要であるので、授業の内容を説明できるように復習しておくのも重要である(120分)。",
        "gradingGuidelines": "成績評価は、Moodle上で行う小テスト(20%)とExcelの課題演習（10%）と期末試験（70%）によって行う。小テストと課題演習については授業内で解説を行う。",
        "textbook": "教科書は指定しない。",
        "referenceMaterials": "Society5.0を生き抜くための必須教養Excelで学べるデータサイエンス入門講義ISBN-10:4296200143データ分析に必須の知識・考え方統計学入門仮説検定から統計モデリングまで重要トピックを完全網羅ISBN-10:4802613199",
        "courseSchedule": "第1回：社会におけるデータサイエンスとAI第2回：質的データと量的データ第3回：データ表現とグラフ第4回：データの分布と代表値とばらつき第5回：データの分布と誤差第6回：相関と因果第7回：回帰分析第8回：時系列データ解析第9回：前半のまとめと演習第10回：データサイエンスの動向と事例紹介第11回：AIの技術と動向と事例紹介第12回：データの法と倫理(村上、オンデマンド)第13回：AIに触れてみる第14回：AIの仕組み第15回：全体のまとめと演習",
        "courseDataUpdatedAt": "2024\/02\/02"
    },
    "updateAt": "2024\/05\/29"
}