{
    "lectureCode": "T2500",
    "courseName": "フレッシャーズゼミ[医療]",
    "lecturer": [
        "各教員(所属なし)"
    ],
    "regularOrIntensive": "基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "この授業のねらいは、（１）キャンパスのある蒲田や大田区の特徴を知り、大学生活を円滑に過ごすこと、（２）医療従事者としての倫理観を持ち、自分の意見を論理的に示す力の基礎を身につけること、の２点にある。グループワークを通して、学生間でコミュニケーションを図り、適切な人間関係「分析・評価能力」「問題解決力」を育むことができるように授業を進めていく。",
        "outcomesMeasuredBy": "到達目標は、（１）大田区蒲田の特徴を「国際的な教養」として身につけること、（２）少人数のグループで特定のテーマについて調査し、ディスカッションにより内容をまとめる「論理的な思考能力」、（３）自己表現および他の人に向けてプレゼンテーションする「コミュニケーション能力」の３点である。",
        "learningOutcomes": "国際的な教養コミュニケーション能力論理的な思考力",
        "teachingMethod": "全体で共通の講義を聞いてから、各クラスの小グループで意見交換した上で、自分の考えを文章にまとめる回と、テーマに沿ってグループワークをして、成果を発表しあう回がある。クラスは学科内のみではなく、学科混合でも編成する。",
        "notices": "担当教員はアドバイザーとして、大学での履修や生活に関する相談に応じる。個別面談の指定日以外にも必要に応じて、相談してもよい。各回、各クラス教員からの指示をよく聞き、メモをとる習慣をつけて欲しい。",
        "preparatoryStudy": "事前調査などの予習が必要な時は、各クラス教員から指示があるので、取り組むこと。",
        "gradingGuidelines": "授業態度，文章作成やプレゼンテーションの課題に積極的に取り組んだ学生に単位を認定する。",
        "textbook": "特になし",
        "referenceMaterials": "適宜紹介する。",
        "courseSchedule": "〈前期〉第1回：ガイダンス、各学科活動、図書館ガイダンス第2回：東京工科大学史、大学生活に必要なコミュニケーション第3回：学修方法、学生生活を考える、各学科活動第4回：GPS-Academic振り返り、学生生活の目標設定、各学科活動第5回：目指す職種の理解１、各学科活動第6回：目指す職種の理解２、各学科活動第7回：目指す職種の理解３、各学科活動第8回：目指す職種の理解４、各学科活動第9回：目指す職種の理解５、各学科活動第10回：目指す職種の理解６、各学科活動第11回：目指す職種を説明する準備、各学科活動第12回：学科混合活動１（自己紹介、大田区・蒲田を知る）第13回：学科混合活動２（目指す職種を説明する）第14回：学科混合ゼミの振り返り、各学科活動第15回：ハラスメント、性感染症、こころの健康、まとめ（前期試験に向けて）、各学科活動〈後期〉第1回：後期の抱負（個別面談）、各学科活動第2回：グループ発表のまとめ方、各学科活動第3回：グループの決定、発表の準備、他：各学科活動第4回：グループ発表の準備、他：各学科活動第5回：グループ発表の準備、他：各学科活動第6回：グループ発表の準備、他：各学科活動第7回：グループ発表の準備、他：各学科活動第8回：グループ発表の準備、他：各学科活動第9回：グループ発表の準備、他：各学科活動第10回：各学科・専攻内発表会：発表、投票、各学科活動第11回：各学科・専攻内発表会：発表、投票、各学科活動第12回：学科混合活動３：発表会第13回：学科混合活動４：発表会第14回：各学科・専攻優秀発表グループの発表第15回：１年の振り返り：各学科活動",
        "courseDataUpdatedAt": "2025/03/13"
    },
    "updateAt": "2025/03/21"
}