{
    "lectureCode": "T2722",
    "courseName": "フレッシャーズゼミ[臨工2]",
    "lecturer": [
        "笠井亮佑(医療保健学部臨床工学科)"
    ],
    "regularOrIntensive": "基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "Ｍ４０５基礎医学実習室"
    ],
    "courceDetails": {
        "courseOverview": "この授業のねらいは、（１）キャンパスのある蒲田や大田区の特徴を知り、大学生活を円滑に過ごすこと、（２）自己を表現でき、グループで協力して作業できるようになること、（３）看護師、臨床工学技士、理学療法士、作業療法士、言語聴覚士および臨床検査技師の仕事内容を理解する、の３点にある。グループワークを通して、学生間でコミュニケーションを図り、適切な人間関係「分析・評価能力」「問題解決力」を育むことができるように授業を進めていく。",
        "outcomesMeasuredBy": "到達目標は、（１）大田区蒲田の特徴を「国際的な教養」として身につけること、（２）少人数のグループで特定のテーマについて調査し、ディスカッションにより内容をまとめる「論理的な思考能力」、（３）自己表現および他の人に向けてプレゼンテーションする「コミュニケーション能力」の３点である。",
        "learningOutcomes": "国際的な教養コミュニケーション能力論理的な思考力",
        "teachingMethod": "全体で共通の講義を聞いてから、各クラスの小グループで意見交換した上で、自分の考えを文章にまとめる回と、テーマに沿ってグループワークをして、成果を発表しあう回がある。クラスは学科内のみではなく、学科混合でも編成する。",
        "notices": "担当教員はアドバイザーとして、大学での履修や生活に関する相談に応じる。個別面談の指定日以外にも必要に応じて、相談してもよい。各回、各クラス教員からの指示をよく聞き、メモをとる習慣をつけて欲しい。",
        "preparatoryStudy": "事前調査などの予習が必要な時は、各クラス教員から指示があるので、取り組むこと。",
        "gradingGuidelines": "授業態度，文章作成やプレゼンテーションの課題に積極的に取り組んだ学生に単位を認定する。",
        "textbook": "特になし",
        "referenceMaterials": "適宜紹介する。",
        "courseSchedule": "〈前期〉第1回：ガイダンス、自己紹介第2回：学修法、図書館ガイダンス（個別面談）第3回：東京工科大学史、新大学生を狙った日常に潜む危険（個別面談）第4回：学生生活の目標設定（エティカ入力）第5回：GPS-Academic振り返り、「医療従事者を目指す理由」の作文第6回：大田区、蒲田の理解１第7回：大田区、蒲田の理解２第8回：大田区、蒲田の理解３第9回：目指す職種の理解１第10回：目指す職種の理解２第11回：学科混合活動（自己紹介）第12回：学科混合活動（大田区、蒲田の紹介）第13回：学科混合活動（目指す職種の紹介）第14回：学科混合活動の振り返り、ハラスメント（個別面談）第15回：性感染症、まとめ（前期定期試験に向けて）（個別面談）〈後期〉第1回：後期の抱負（個別面談）第2回：学科混合ディスカッション第3回：学科混合ディスカッション第4回：学科混合ディスカッション第5回：発表のまとめ方第6回：班の決定、発表内容の検討第7回：発表内容の検討第8回：発表内容の検討第9回：発表資料作成第10回：発表資料作成第11回：発表資料作成、発表タイトル提出〆切第12回：発表資料、動画提出〆切第13回：発表会（閲覧、投票）第14回：発表に関する振り返り（個別面談）第15回：優秀発表表彰、１年の振り返り",
        "courseDataUpdatedAt": "2024/03/18"
    },
    "updateAt": "2024/05/29"
}