{
    "lectureCode": "T3100",
    "courseName": "化学の世界[医療]",
    "lecturer": [
        "下村美文(医療保健学部臨床工学科)"
    ],
    "regularOrIntensive": "基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１００１階段教室２"
    ],
    "courceDetails": {
        "courseOverview": "「化学」は身の回りのすべてのものを構成する物質の、性質や反応を解明する身近な学問である。目に見えている現象のメカニズムを、目に見えない原子・分子レベルで認識し、化学の目（想像力）で理解を深めることを目指す。すべての物質の基本となる、原子、分子の構造を理解し、専門科目の理解に必要な、無機化学、有機化学、高分子化学、生命化学、環境化学など多岐にわたる領域の化学に関する基礎知識の修得を目指す。本講義を通じて、「なぜ？」という疑問を化学的に説明できるようになり、身近なものの現象に対して好奇心をもって観察し、「化学の目で見る」習慣を身に着ける。",
        "outcomesMeasuredBy": "多岐にわたる領域の化学の基礎知識、語句、用語、定義を理解し、簡潔に説明できるか。pH、浸透圧、ボイル・シャルルの法則、熱力学、溶液濃度などの計算力が身に着いたか。実学に基づく専門能力の習得を目指す。",
        "learningOutcomes": "実学に基づく専門能力",
        "teachingMethod": "基本的には教科書にしたがって実施する。パワーポイントを用いた講義を主体として行い、随時課題を含める。授業中の課題の解答は挙手により行い、アクティブラーニング形式で授業を行う。moodle上の資料を見ながら講義を受講できるように、ノートPCを必携すること。",
        "notices": "予習・復習を十分に行うこと。資料をmoodle上にアップする。",
        "preparatoryStudy": "予習は教科書をあらかじめ読んでおくことが望ましい。復習は授業中に説明した国試、練習問題、教科書、授業ノートを見直すこと。",
        "gradingGuidelines": "理解度をチェックするために授業中に行う、授業内容に即した課題（40%）および期末試験の成績（60%）を総合的に判断する。専門科目を学ぶ上で、十分な基礎学力がついたかどうかを評価基準とする。課題評価後、講義内で理解の不足している部分の補足説明を行い、moodle上に模範解答および解き方を掲示することでフィードバックを行う。",
        "textbook": "ステップアップ大学の総合化学改訂版（齋藤勝裕、裳華房、2022）参考資料は毎回、moodle上にアップする。",
        "referenceMaterials": "コ・メディカル化学改訂版（齋藤勝裕ほか、裳華房、2022）メディカル化学改訂版（齋藤勝裕ほか、裳華房、2021）化学入門（井口ら編、実教出版、2007）ゼロからはじめる化学（立屋敷哲、丸善、2008）改訂実感する化学上、下（廣瀬千秋訳、NTS、2015）",
        "courseSchedule": "第1回:化学の基礎と生命：生命現象にはどのような化学の基礎が関係するのか、講義全体の目標と指針を概説第2回:原子構造と電子配置：原子・原子核の構造、電子殻と軌道、電子配置と価電子、周期表の元素の周期性第3回:化学結合と分子構造：イオン結合と金属結合、共有結合と結合電子、分子間に働く力、結合エネルギー第4回:元素の性質と反応：各族の元素とその分子、遷移元素、希土類、放射線元素第5回:到達度演習まとめ①：語句、用語、定義の理解度チェック第6回:物質の状態：気体・液体・固体、状態図、ボイル・シャルルの法則、気体状態方程式第7回:溶液の性質：溶解と溶解度、蒸気圧と沸点・凝固点、半透膜と浸透圧第8回:化学反応の速度と化学反応とエネルギー：比熱、熱量保存則第9回:酸化反応・還元反応：酸・塩基、pH、緩衝作用、中和、酸性・塩基性、酸化数、酸化還元反応、イオン化傾向第10回:到達度演習まとめ②：pH、浸透圧、ボイル・シャルルの法則、熱力学、溶液濃度などの計算力チェック第11回:炭化水素の構造と性質：炭化水素の結合と構造、構造式の種類、炭化水素の構造と命名法、異性体第12回:有機化合物の性質と反応：官能基、炭化水素の反応、酸素を含む化合物第13回:高分子化合物の構造と性質：ポリエチレン、PET、樹脂、ゴム、生分解性プラスチック第14回:生命と化学反応：アミノ酸、タンパク質、酵素の構造と働き、糖類、ビタミン、核酸第15回:環境と化学物質：環境と化学、健康と化学物質、エネルギーと化学、地球環境と化学、地球温暖化",
        "courseDataUpdatedAt": "2024/01/27"
    },
    "updateAt": "2024/12/09"
}