{
    "lectureCode": "T3150",
    "courseName": "化学の世界[臨検]",
    "lecturer": [
        "三上あかね(医療保健学部臨床検査学科)"
    ],
    "regularOrIntensive": "基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "医療保健学部臨床検査学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３０３１１教室"
    ],
    "courceDetails": {
        "courseOverview": "臨床検査の対象となるヒトの生命活動は，生体内で起こる生物化学反応によって担われ，生命体自体もまた多くの化学物質からできている。これらの生体反応，生体物質については，生化学，遺伝子検査学，免疫検査学などで詳しく学ぶ。一方，臨床検査法の多くは，化学反応の原理に基づいており，詳しくは臨床化学で学ぶ。そこで，本講義では，すべての物質の基本となる，原子，分子の構造を理解し，臨床検査学の専門科目の理解に必要な，無機化学，有機化学，高分子化学，生命化学，など多岐にわたる領域の化学に関する基礎知識の習得を目的とする。演習を通して，特に，原子・分子，原子量・分子量，化学式，濃度，酸・塩基，pH，イオン等に関する基礎知識及び，専門分野への応用法を学び，臨床検査における専門能力(実学に基づく専門能力)及び論理的な思考力の礎となる化学の基礎を学修する。",
        "outcomesMeasuredBy": "1．臨床検査に必要な化学の基礎知識を理解できる2．専門科目において頻出する化学の単位および用語を理解できる3．代表的な化学計算を修得し実習へ応用できる上記の項目を通して，測定結果の分析・評価能力，及び問題解決力を身に着けることを本講義の到達目標とする。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "PC必携とする。スライド，板書(ZOOM)を用いて授業を行う。指名―回答―解説を中心としたアクティブラーニングのスタイルで授業を行う。講義開始時に理解確認のための小テストを毎回実施する。",
        "notices": "WiFi，Zoom機能を使えるようPCを設定しておく。必ず予習課題を解いて、前日までに提出し、講義に臨むこと。講義中に指名された場合は、速やかに回答を板書(ZOOM書き込み)すること。またMoodle上の復習課題(理解度確認)を講義後1週間以内に必ず行うこと。",
        "preparatoryStudy": "Moodle上のフラッシュカードを行うこと(予習課題1)。事前に配布された講義資料を熟読し，必ず，問題を解いてくること(予習課題2)。疑問点，質問事項を整理しておくこと。また，事前に提示された教科書の問題を必ず解いてから，講義に臨むこと(予習課題3)。",
        "gradingGuidelines": "課題(小テスト，予習課題，理解度確認)(3割)及び，期末試験の結果(7割)で総合的に評価する。小テスト，予習課題等については講義中に，理解度確認についてはMoodleなどを通じてフィードバックを行う。",
        "textbook": "立屋敷哲「溶液の化学と濃度計算」丸善出版2004年",
        "referenceMaterials": "「コンパクト化学」南江堂「化学基本の考え方13章」東京化学同人「最新臨床検査学講座臨床化学検査学」医歯薬出版「臨床検査学講座化学」医歯薬出版など",
        "courseSchedule": "第1回：概論・有効数字・IS系単位第2回：原子・分子の構造第3回：分子量・式量第4回：物質量第5回：気体の状態方程式\u0026比重第6回：濃度第7回：希釈第8回：化学平衡第9回：酸塩基とpH第10回：酸化還元第11回：理解度確認第12回：応用-1吸光度第13回：応用-2酵素活性値と検量線第14回：応用-3酵素のカイネティックパラメーター第15回：応用-4電気泳動法と検量線",
        "courseDataUpdatedAt": "2024\/02\/05"
    },
    "updateAt": "2024\/05\/29"
}