{
    "lectureCode": "T3320",
    "courseName": "数学基礎[臨工]",
    "lecturer": [
        "須田拓馬(教養学環)"
    ],
    "regularOrIntensive": "基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木4"
    ],
    "targetDepartment": "医療保健学部臨床工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１０１４教室"
    ],
    "courceDetails": {
        "courseOverview": "数学は実生活の中で幅広く応用されている。例えば、平面や空間を把握したり表現したりする方法の一つに、数学を用いるものがある。また近年のコンピュータを用いた映像処理は目をみはる凄さだが、中で行っていることはすべて数学の計算である。一方、医療機器の仕組みを理解するには数学の理解が不可欠であり、生命科学を学ぶうえでも、基礎となるのは数学である。本授業では、さまざまな数学分野について基本的な事項を理解することを目指し、演習問題を解きながら内容を理解していく。高校数学の繰り返しにとどまることなく、計算過程を丁寧に追っていくことで、新しい「気づき」を得たり、より深い理解が得られることを目指す。",
        "outcomesMeasuredBy": "1.多項式や分数式の基本的な演算ができるようになる。2.2次関数、指数関数、対数関数、三角関数といった初等関数の基本事項を理解し、自由に使いこなせるようになる。3.初等関数の微分積分ができるようになる。4.ベクトルの概念を理解し、基本的な演算ができるようになる。5.集合や確率の概念を理解し、実際的な問題について考えることができるようになる。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "-この授業では高校数学レベルの基本的な内容を学生が主体的に学べるようになっている。-毎回の授業の冒頭で、前回の内容について復習する小テストを行う（初回は除く）。10分間程度の解答時間が与えられ、時間内にMoodleに解答を入力する必要がある。小テストの時間中は教科書、ノートなどを参照してはならない。授業開始前にしっかりと復習しておくこと。-小テストの解答、解説は小テスト直後に行うとともに、解答例は後日Moodleにアップロードする。-小テストの得点(10点満点)と平均点、満点者の人数、3点以下の人数を公表する。-授業時間内で演習の時間をとり、実際の計算問題に慣れてもらう。計算演習はペアかグループで行うことが望ましいので、授業開始時にペアやグループを作りやすいように着席すること。-小テストの得点が低い状態が続いた学生は、学修支援センターの利用を促されることがある。",
        "notices": "高校数学IAを前提とし、IIBは前提としない。授業開始前までに授業資料をMoodleにアップロードする。授業時間中には演習問題に取り組む時間がある。ペアやグループでの活動を推奨するので、解答を見せ合ったり、相談しながら解くなど各自で工夫してほしい。授業をやむを得ない事情で欠席する場合は、事情を説明する証明書の写真をメール添付で送るか、授業時間の前後に証明書類を見せること（原本の提出は求めない）。やむを得ない事情と証明書類の一例は以下の通り（これがすべてではない）。-病欠：病院の日付入りの領収書-忌引：告別式の案内やむを得ない事情による欠席が認められれば、小テストは免除扱いとなり、成績評価において不利になることはない。授業中の飲食は推奨しないが、水分補給は禁止しない。授業に関する内容について学生同士で話し合うことは推奨するが、私語は周囲の学生が授業を受ける権利を侵害するので十分に留意すること。居眠りや他の授業の課題を行うといった行為は効率性の観点から推奨しないが、各自の事情を考慮して注意はしない。ただし、スマートフォンでゲームをするといった行為は極めて非生産的であり、見つけ次第止めるよう注意する。",
        "preparatoryStudy": "予習：次週の内容を教科書およびおよび高校数学の教科書(I,II,B)で予習する(60分)復習：小テストで間違った箇所を解き直したり、授業中の演習時間に終わらなかった問題を解いて理解する(180分)必要に応じて適宜学修支援センターを利用すること。",
        "gradingGuidelines": "各回の小テスト（全14回を予定）の合計と期末試験によって評価する。小テストの合計点を30点満点、期末試験の得点を70点満点として換算し、100点満点で評価する。60点以上を合格の目安とする。ただし、欠席が多い場合は合格基準を満たしてもX評価となる。成績評価の段階で合格基準に満たなかった者は再試験レポートを提出する機会が与えられる。再試験レポートの合格基準は一律ではなく、小テストの合計点と期末試験の得点に応じて個別に決定される。小テストと期末試験の得点が低い者ほど、合格に必要なレポートの得点は高くなる。提出すれば自動的に合格となるわけではないことに注意すること。",
        "textbook": "「大学新入生のための数学入門増補版」（石村園子）共立出版",
        "referenceMaterials": "第1回：数と式の計算(教科書p.2-7)第2回：分数式の計算、方程式(p.8-12)第3回：関数とそのグラフによる表現(p.14-19)第4回：三角比(p.26-34)第5回：三角関数のグラフと公式(p.35-39)第6回：指数法則、指数関数とそのグラフ(p.42-48)第7回：対数の概念、対数関数とそのグラフ(p.52-58)第8回：関数の極限(p.60-67)第9回：微分係数と導関数(p.70-76)第10回：関数の増減とグラフ、不定積分(p.78-81,84-85)第11回：定積分と面積(p.86-91)第12回：ベクトルの概念と、その基本演算(p.108-113)第13回：ベクトルを用いた平面、立体図形の表現(p.114-118)第14回：集合、集合の演算と個数(p.120-124)第15回：順列と組み合わせ、確率（p.126-127,p.130-134)",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/09\/12"
}