{
    "lectureCode": "T4222",
    "courseName": "海外研修II[ロサンゼルス]2025年春HS",
    "lecturer": [
        "キャンベル，Ａ(教養学環)"
    ],
    "regularOrIntensive": "他学部・他大学科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "社会は刻々と変化を続け、ますますグローバル化が進んでいる。このような社会では、日本にいても、国境のないグローバルな社会に所属しているといえる。したがって、グローバルという概念を理解することが重要なのだが、本やインターネットを通して学んでも実感はなかなか湧かないのが実情である。本コースでは、海外へ行き、そこでじかに現地の人々の社会・言語・文化に触れ、異なった言語・文化・習慣・価値観への理解を深める。今後の自分のビジョンを、外から日本を見る経験を基して描いてみることも目的の一つである。滞在先はアメリカ合衆国ロサンゼルス。",
        "outcomesMeasuredBy": "以下を到達目標とする。・自信をもって、英語で自分の考えを伝える。・自己管理能力を高める。・他国の文化に触れ、異なる価値観を持つ人々への理解を深める。・GlobalCommunicationSkillsを身につける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "今年度は下記の内容で実施予定。実施時期：2024年春の8日間（6泊8日。出発前にオリエンテーション、事前授業を数回実施、帰国後に事後授業を1回実施予定）実施場所：ロサンゼルス主な研修場所：ハリウッド、サンタモニカ、南カリフォルニア大学、ゲッティミュージアム、ディズニーランド、ユニバーサルスタジオ、全米日系人博物館など。課題等へのフィードバックは、研修前の事前授業、研修中、研修後の事後授業、またGoogleClassroomなどで行う。",
        "notices": "・研修前に、参加方法などを説明するオリエンテーションを実施するので必ず参加のこと。・事前授業・事後授業も実施。現地に行く前に様々なこと学ぶ機会なので、必ず出席のこと。・研修後はレポートを提出する必要がある。詳しくはガイダンス時に。・海外研修1単位認定。ただし海外研修II単位認定の詳細については、自分が所属するキャンパスの学務課で確認すること。・渡航費などについてはガイダンス、募集説明会で説明する",
        "preparatoryStudy": "普段からどれだけ積極的に英語を学んでいるかが英語力向上の大きな秘訣である。研修の効果を上げるため、日ごろから積極的に英語に触れるようにするとよい。またガイドブック、関連サイトなどで事前リサーチをしておくことを勧める。毎日予習・復習を十分（1～2時間）行うこと。",
        "gradingGuidelines": "次のすべてに出席し、課題にも期限厳守で取り組むこと。・参加者説明会（オリエンテーション）・事前授業2日間・現地研修・事後授業1日・研修レポート作成",
        "textbook": "特になし。",
        "referenceMaterials": "アメリカのガイドブックは各自で用意すること。参考文献等は必要に応じて紹介する。",
        "courseSchedule": "第1回:オリエンテーション(1)：パスポートの取得、エスタの取得、旅行保険の加入、その他第2回:事前授業(1)：アメリカという国の多様性第3回:事前授業(2)：カリフォニアの文化とロサンゼルスの歴史第4回:事前授業(3)：異文化コミュニケーションについて第5回:事前授業(4)：グループワークおよびポスターセッション第5回:オリエンテーション(2)：出発の案内、研修の準備・行程の最終確認第6回～第14回:ロサンゼルス研修第7回:事後授業および最終レポート",
        "courseDataUpdatedAt": "2024\/02\/16"
    },
    "updateAt": "2024\/09\/12"
}