{
    "lectureCode": "U5203",
    "courseName": "医用工学概論",
    "lecturer": [
        "佐々木聰(医療保健学部臨床検査学科)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３０２１２教室"
    ],
    "courceDetails": {
        "courseOverview": "臨床検査技師は、医師又は歯科医師の指示の下に、検体検査と心電図、超音波、脳波、呼吸機能などの生理機能検査を行う。これらの検査に用いられる装置は、電気・電子工学の知識をもとに開発されたものである。特に医療にかかわるこのような装置にかかわる学問を医用工学と称する。検査を行う上で必要な知識を習得する目的で本講義は行われる。",
        "outcomesMeasuredBy": "医用計測器を使う上で最低限必要となる数学、物理学、化学を身につけ、最低限使えるようにすることが目標である。これは、ひろく「実学に基づく専門能力」「コミュニケーション能力」「論理的な思考力」「分析・評価能力」「問題解決力」を身につけることにつながる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "講義と学修到達度確認演習によって実施する。",
        "notices": "教員が何を伝えようとしているかを理解するよう努めること。覚えるだけではこの授業は成り立たない。理解する、あるいは理解できるように努めること。",
        "preparatoryStudy": "三角関数、対数、複素数、微積分、線形微分方程式に関する知識が必要である。未履修の者、履修したはずだがさっぱりわからないという者は、学修支援センターで理解できるまで準備してくることが求められる。",
        "gradingGuidelines": "定期試験の得点で評価される。授業態度を考慮することがある。",
        "textbook": "臨床検査学講座医用工学概論（医歯薬出版株式会社）",
        "referenceMaterials": "",
        "courseSchedule": "第1回：医用工学の概論、臨床検査と生体物性第2回：臨床検査と生体物性生体物性とは、生体組織固有の性質、生体の電気的、機械的性質、超音波に対する性質、生体の熱、光、磁気,電磁波及び放射線に対する性質第3回：臨床検査と生体物性身の回りの電気現象、静電気と電荷、電圧,電流と抵抗の概念、オームの法則、キルヒホッフの法則、ブリッジ回路第4回：電気・電子工学の基礎抵抗と抵抗率、ジュールの法則、電気エネルギーと電力量、電力の概念、直流と交流の違い、交流回路の基本的性質第5回：電気・電子工学の基礎交流回路における受動素子、RLC直列回路と周波数特性、過渡現象と時定数、RC直列回路の過渡応答第6回：電気・電子工学の基礎半導体の特徴、n型半導体とp型半導体、ダイオード,トランジスタ,FETの基本的性質第7回：医用電子回路電源回路、増幅回路、フィルタ回路第8回：医用電子回路論理回路の基礎、パルス発振回路、AD・DA変換、変調復調の概念、アナログ変調、デジタル変調第9回：生体情報の収集生体情報の種類、生体情報収集における必要条件、生体情報検出用トランスデューサと生体計測装置の基本構成、生体電気現象と体積導体、生体電気導出法と電極の種類、検出電極の電極電位と分極電圧、不分極電極第10回：生体情報の収集トランスデューサに対する要求事項、物理量センサ、化学量センサ第11回：情報科学１情報の原理第12回：情報科学２情報の応用第13回：波動に関する演習第14回：電磁気に関する演習第15回：情報に関する演習",
        "courseDataUpdatedAt": "2025/01/14"
    },
    "updateAt": "2025/03/21"
}