{
    "lectureCode": "U54020",
    "courseName": "保健医療福祉総論[臨検]",
    "lecturer": [
        "今村倫敦(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３０２１１教室"
    ],
    "courceDetails": {
        "courseOverview": "１．保健衛生が健康な生活を営むために国民に行われる予防医学的な措置であることを学び、その仕組みや果たす役割を理解し、論理的な思考力を養う。２．医療を取り巻く様々な社会的環境を理解し、我が国の医療供給体制の実際を学び医療従事者として必要な実学に基づく専門能力を身に付ける。３．高齢者など社会的弱者を対象に行われる様々な福祉サービスの実態、提供体制を学び、医療と福祉の連携のあり方にも着目し、医療従事者として備えておくべき知識を身に付ける。４．１～３の知識に基づき、医療従事者としてのコミュニケーション能力を養う。",
        "outcomesMeasuredBy": "１．医学の歴史を学び、先人の業績が理解できる。２．我が国の医療制度、医療供給体制について理解できる。３．医療保険制度、介護保険制度についてその仕組みが理解できる。４．我が国の社会保障制度について理解できる。５．医療の質の評価の必要性、患者の心理と行動、医の倫理、医療従事者の心構えが確立できる。",
        "learningOutcomes": "実学に基づく専門能力",
        "teachingMethod": "授業計画に従ったテーマに沿って解説する。授業方法は対面・オンラインのいずれかの方法で行う。授業は主にPCを使用して説明するため、ノートPCまたはタブレット端末は持参すること。習熟度の確認を目的に、授業の終わりに簡単な小テストを行う。",
        "notices": "既に学習した公衆衛生学の履修内容を参考に、医療従事者になるものとして興味をもって授業に参加してもらいたい。",
        "preparatoryStudy": "自分自身や家族などの身近にある医療制度について思い浮かべてみること。病院やクリニックにどんなスタッフがいるのか、明細にはなんと書いてあったか、なぜその病院を選んだか、どのような医療を望むか、など医療に関することをなんでもいいので掘り下げて考えてみること。授業後に、学んだことの中で最も興味を持った部分についてまとめること。",
        "gradingGuidelines": "小テスト（２０％）、期末試験（８０％）",
        "textbook": "指定しない",
        "referenceMaterials": "床検査学講座保健医療福祉概論高木康著医歯薬出版（株）",
        "courseSchedule": "第1回：医学の歴史：原始医術・古代・中世の医学第2回：医学の歴史：近世の医学・日本の医学と医療・医療観のうつりかわり・医療行政の変遷第3回：社会保障制度：社会保障財源と医療費の財源第4回：病院の各部門とその役割：医療部門、看護部門、医療技術部門、事務部門、その他の部門第5回：わが国の医療制度：医療体制、一次・二次・三次医療、救急医療、生活習慣病対策第6回：わが国の医療制度：高齢者医療（含む在宅医療）、終末期医療、精神疾患医療、感染症対策、難病、へき地医療、災害時医療第7回：医療提供体制：医療施設、開設者、設立母体、医療従事者の需給と身分第8回：医療提供体制：医療保険制度、診療報酬支払い制度、公費医療制度、保険外併用医療費、DPCとDRG\/PPS第9回：医療提供体制：クリニカルパス・EBM、医療法とその改正、諸外国の医療制度第10回：病院管理：業務の機能分担・管理指標・病院財務・会計・医療関連サービス第11回：わが国の福祉制度：高齢者福祉・ゴールドプラン・障害者福祉・ノーマライゼーション第12回：介護保険制度：介護保険の仕組み、医療保険制度との違い、高齢者福祉の現状第13回：病院医療の質の維持と向上：医療の質と評価、病院機能評価、医療指導監査、ISO第14回：患者の心理と行動：外的要因と内的要因、ヘルス・ビリーフ、ウエルビーイング第15回：医の倫理と医療従事者の心構え：医療チームの一員としての自覚、患者の権利、終末期医療",
        "courseDataUpdatedAt": "2024\/03\/06"
    },
    "updateAt": "2024\/05\/29"
}