{
    "lectureCode": "W5211",
    "courseName": "免疫検査学",
    "lecturer": [
        "三上あかね(医療保健学部臨床検査学科)",
        "伊藤さやか(兼任講師)",
        "横田恭子(兼任講師)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３０２１２教室"
    ],
    "courceDetails": {
        "courseOverview": "ヒトの免疫システムの基本，及び免疫学的検査法の原理を学び、感染症、自己免疫疾患、アレルギー性疾患、腫瘍などの免疫機能異常が関与する疾患、および血清蛋白質検査等に関する解説を通して、検査法と臨床的意義の関係を理解できるようにする。また並行して行われる輸血検査学において重要となる免疫学的機序を理解する。",
        "outcomesMeasuredBy": "免疫検査学の基礎となる免疫系の仕組みについて確認し，免疫検査法の原理，免疫系が関連する疾患の機序を理解する。まず免疫系の仕組みについて確認し，検査法・検査結果・疾患機序について理解する礎を学修する。次に、臨床検査法として応用される免疫学的検査法の原理を理解する。また、免疫系が関与する疾患及び、移植輸血副作用の機序について理解する。更に疾患に対する、代表的な検査法、及び検査結果の臨床的意義を理解し、臨床現場にて求められる検査結果の分析・評価能力を身につけることを目的とする。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "教科書の内容を中心に、パワーポイントのスライド、プリントなどを教材とした講義（90分）を行う。講義の進行具合によって、多少、テーマが前後にずれる可能性あり。",
        "notices": "予習・復習を必ず行うこと。",
        "preparatoryStudy": "予習として、講義範囲について教科書及び講義資料を必ず読んでおくこと。また予習課題(予習プリント及びMoodle上の課題)を行うこと。復習ではノートを見直し、不明部分を調べノートに加筆すること。また講義終了後1週間以内に必ず復習課題(理解度チェック)を行うこと。",
        "gradingGuidelines": "課題および講義の理解度チェック（30%）、定期試験（70%）の結果を用いて評価する。",
        "textbook": "最新臨床検査学講座免疫検査学/輸血・移植検査学第2版（医歯薬出版）上記の本を教科書として、授業計画に則って講義を進める。",
        "referenceMaterials": "新版臨床免疫学第3版（講談社）、臨床検査学講座臨床免疫学（医歯薬出版）、エッセンシャル免疫学（メディカル・サイエンス・インターナショナル）、JAMT技術教本シリーズ臨床免疫検査技術教本(丸善出版)、JAMT技術教本シリーズ輸血検査技術教本(丸善出版)、スタンダード輸血検査テキスト第3版(医歯薬出版)",
        "courseSchedule": "第1回：免疫系の仕組みI-免疫概要免疫系の構成要素（三上）第2回：免疫系の仕組みIIa-自然免疫1炎症反応（三上）第3回：免疫系の仕組みIIb-自然免疫2補体系（三上）第4回：免疫系の仕組みIII-獲得免疫概要（三上）第5回：免疫系の仕組みIV-獲得免疫における細胞性免疫（三上）第6回：免疫系の仕組みV-獲得免疫における液性免疫（三上）第7回：免疫学的検査の原理-1（三上）第8回：免疫学的検査の原理-2標識抗体（三上）第9回：免疫学的検査と疾患Ia-感染症と免疫概要（三上）第10回：免疫学的検査と疾患Ib-感染症と免疫(横田)第11回：免疫学的検査と疾患Ic-感染症と免疫(横田)第12回：免疫学的検査と疾患II-アレルギーと免疫（三上）第13回：免疫学的検査と疾患III-自己免疫疾患と免疫（三上）第14回：免疫学的検査と疾患IV-腫瘍と免疫（三上）第15回：免疫学的検査と疾患V-免疫不全症（伊藤）",
        "courseDataUpdatedAt": "2025/01/14"
    },
    "updateAt": "2025/03/21"
}