{
    "lectureCode": "W5307",
    "courseName": "生理検査学実習II",
    "lecturer": [
        "榎本みのり(医療保健学部臨床検査学科)",
        "花尾麻美(医療保健学部臨床検査学科)",
        "櫻井進(兼任講師)",
        "迫西大輔(医療保健学部臨床検査学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "火3",
        "火4",
        "火5",
        "木3",
        "木4",
        "木5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "Ｍ３０３生理学実習室"
    ],
    "courceDetails": {
        "courseOverview": "臨床生理学実習Ⅰに続き、生理検査機器を駆使して、被検者から様々な生理的情報を取得・解析し、そのデータを疾病の診断・治療に役立たせる生理検査学を学ぶ。検査時の検者の急変への対応、検査機器障害への迅速な対応、安全対策を含め、生理検査機器の取り扱いの実技、および生理検査法の手順を習得する。生理検査学Ⅰ・Ⅱ、画像検査学で扱った、超音波検査、呼吸機能検査、循環機能検査、神経生理学的検査における臨床生理学的検査について、実学に基づく専門能力およびコミュニケーション能力を身につける実習を行う。",
        "outcomesMeasuredBy": "原理、測定方法、操作方法に基いて、画像検査、生理学検査の必要最低限の技術を習得する。生理検査学実習Ⅰで学んだコミュニケーション能力を重視し、患者接遇についても、身だしなみ、言葉遣い、態度を整え、検査時の被検者の気持ちも理解できるようにする。自分が学んだことを他の人へ分かりやすく伝えられるようにする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "実習は実習書に沿って行う。90分✕３コマで、実習は小グループに分かれてグループごとに行う。指名された者は、責任を持って次のグループへ実習内容を引き継ぐ。臨床と同じ機器を用いて、各々被検者、検査者両方を実習する。実習の前には予習課題、実習後には実習課題をこなすこと。進行度によりテーマが前後に移ることがある。",
        "notices": "臨地実習と同じ格好、白衣・シューズを着用して参加。髪の毛、爪、アクセサリーにも配慮し、身だしなみが整っていない者は、実習室には入室出来ないこととする。手首、足首に電極を装着するためストッキング、タイツなどは不可。腹部、胸部にも電極類を装着するためワンピースなどの上下つながっている洋服も不可。携帯電話はロッカーへ置き、実習室へは持ち込まない。実習後には片付け、掃除まで行うこと。",
        "preparatoryStudy": "解剖学、生理学の知識が必要であり、1・２年次の講義（生理検査学Ⅰ〜Ⅲ）、実習(生理検査学実習Ⅰ)を復習しておくこと。検査の原理ついてよく復習しておくこと。",
        "gradingGuidelines": "実習態度（レポート含む）（50％）、試験（50％）により評価する。試験は筆記試験と口頭試問・実技試験を含む。実習書参照のこと。",
        "textbook": "最新臨床検査学講座生理機能検査学（医歯薬出版）解剖と正常像がわかる！エコーの撮り方完全マスター（医学書院）人体解剖の基本がわかる事典（西東社）腹部超音波検査ドリル（総合医学社）",
        "referenceMaterials": "",
        "courseSchedule": "第1回:頸動脈・下肢血管エコー検査（全教員）第2回:頸動脈・下肢血管エコー検査（全教員）第3回:頸動脈・下肢血管エコー検査（全教員）第4回:心臓エコー検査（全教員）第5回:心臓エコー検査（全教員）第6回:心臓エコー検査（全教員）第7回:腹部エコー検査（外部講師・全教員）第8回:腹部エコー検査（外部講師・全教員）第9回:腹部エコー検査（外部講師・全教員）第10回:超音波検査（異常所見）（全教員）第11回:超音波検査（異常所見）（全教員）第12回:超音波検査（異常所見）（全教員）第13回:肺機能検査（外部講師・全教員）第14回:肺機能検査（外部講師・全教員）第15回:肺機能検査（外部講師・全教員）第16回:心電図検査（異常所見）・負荷心電図検査（全教員）第17回:心電図検査（異常所見）・負荷心電図検査（全教員）第18回:心電図検査（異常所見）・負荷心電図検査（全教員）第19回:誘発電位（全教員）第20回:誘発電位（全教員）第21回:誘発電位（全教員）第22回:脳波（全教員）第23回:脳波（全教員）第24回:脳波（全教員）第25回:神経伝導検査（外部講師・全教員）第26回:神経伝導検査（外部講師・全教員）第27回:神経伝導検査（外部講師・全教員）第28回:肺機能検査・まとめ（外部講師・全教員）第29回:肺機能検査・まとめ（外部講師・全教員）第30回:肺機能検査・まとめ（外部講師・全教員）",
        "courseDataUpdatedAt": "2025/01/15"
    },
    "updateAt": "2025/03/21"
}