{
    "lectureCode": "11079K36",
    "courseName": "フレッシャーズゼミ[6]",
    "lecturer": [
        "黒川弘章(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "講義実験棟３０４"
    ],
    "courceDetails": {
        "courseOverview": "大学における４年間の学修に加え、大学生活全般に必要となる環境への適応や仲間づくり、さらに社会人として求められる能力を養うことを目的とします。そこで、履修や学習に関する情報を共有し、また、日本語スキルアップカリキュラムやグループワークを通じて、工学部および電気電子工学科における教育・研究の全体像を把握することで、大学での学びにおけるモチベーションを高め、個人またはグループとして活動する能力を身につけます。この授業によって、自分自身の行動をマネージメントする能力を身につけ、４年間の大学生活を円滑に進めるための知識・技術を獲得します。",
        "outcomesMeasuredBy": "本授業科目では，本学の「６つのラーニングアウトカム」のうち・コミュニケーション能力・論理的な思考力・分析・評価能力の３つを目指し，より具体的には以下を到達目標とする。日本語スキルアップカリキュラム、グループワークやポスター制作等を通て、自律的に学習計画・行動計画を立てられると同時に、他の学生と協力して活動できるようになる。また，分かり易く効果的なプレゼンテーション資料の作成が行え，かつプレゼンテーションを行うことができるようになる。さらに、工学部および機械工学科における教育・研究の全体像を把握することができ、4年間に渡る学科教育に対するモチベーションが高まる。一方，安全講習会やハラスメント講習会により社会人にふさわしい行動ができるようになる。さらに、問題解決力を測る外部テスト(GPSAcademic)の受験とフィードバックにより、各自の問題解決力の状況を確認し、それを伸ばすことができる。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "各クラスについて教員１名が担当し、小人数のゼミ形式で授業を行います。これに加えて、学部全体で他学科と連携して行うグループワークにも取り組みます。ポスター制作等にノートPCが必要となるので、クラス担当教員の指示に従い、持参すること。",
        "notices": "到達目標を達成するためには、学生自身の主体的な取り組みおよび他の学生との連携が必須です。学習の目標や課題に対して自分自身で考え、またグループで討論し、実際に行動に移すように心がけてください。",
        "preparatoryStudy": "各回の内容に応じて、各教員が指示します。",
        "gradingGuidelines": "・最終回に製作したパスターについての評価結果をフィードバックする。・グループワークおよびポスター制作・発表への参加・貢献度(60%)と、その他の課題(40%)から、表記割合を基準に評価します。",
        "textbook": "特に教科書はありません。",
        "referenceMaterials": "特に参考書はありませんが、必要に応じて補助資料を紹介または配付します。",
        "courseSchedule": "第1回：フレゼミ概要、履修計画、自己紹介第2回：大学施設見学第3回：学科全教員の研究紹介、ポスター制作・発表概要第4回：教育・研究調査、ポスター制作(1)第5回：教育・研究調査、ポスター制作(2)第6回：教育・研究調査、ポスター制作(3)第7回：ハラスメント・安全教育第8回：教育・研究調査、ポスター制作(4)、要旨作成第9回：教育・研究調査、ポスター制作(5)、要旨作成第10回：大学の理念と歴史の理解、問題解決力アセスメントフィードバック第11回：ポスタープレビュー第12回：ポスター制作(7,まとめ)第13回：3学科合同ポスター発表会第14回：ポスターフィードバック、夏休みの計画",
        "courseDataUpdatedAt": "2024\/01\/17"
    },
    "updateAt": "2024\/09\/13"
}