{
    "lectureCode": "K000904",
    "courseName": "地域連携課題[2Q][電]",
    "lecturer": [
        "坪川宏(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3",
        "月4",
        "月5",
        "水3"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "講義実験棟１０１",
        "講義実験棟１０２",
        "講義実験棟１０３",
        "講義実験棟１０４"
    ],
    "courceDetails": {
        "courseOverview": "地域連携課題では、地域社会と学生との交流の重要性に鑑み、学生が地域の関係者への調査を行いながら地域・社会的な課題等に取り組む。その際、地域・社会的な情報は様々なビックデータであるため、総務省地理情報システムや地域のオープンデータを活用した調査・分析も行う。具体的には、学生が自ら地域での課題を見出し、その調査・分析等はグループ（5名前後）に分かれて異なる視点や手法で行い、それらの結果を比較検討することによってさらに課題への理解を深める。その成果は発表会などを通じて共有し、相互に評価することで切磋琢磨する。",
        "outcomesMeasuredBy": "将来の就業に向けて、コーオプ演習Ⅰで培った能力（コミュニケーション能力、論理的な思考能力、分析評価能力、問題解決力)をさらに実戦的なレベルに高める。具体的には、下記の5つが目標である。①課題の発見・設定：自ら課題を見出すことができる②課題の分析：課題に対してその分析ができる③評価：分析の結果から評価ができる④取りまとめ：分析結果、評価を整理することができる⑤プレゼン力：取りまとめた内容を伝えることができる",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "個々に地域が抱える各種の課題を調査し、各自の関心事項について意見交換後、５名程度のグループワークにより、グループで取り組むべき課題に収束させて課題設定を行う。次に、グループ内で役割分担を決め、グループワークにより八王子市内のフィードワークを行い、課題設定としての妥当性について、調査・分析を進める。その過程で必要なそれぞれの調査・分析の進捗状況の確認や必要な情報・データの共有は各自が適宜PCを活用して行う。従って、授業においては各自が必要な情報やデータを全て共有しているとの前提でグループ討議を効率的に行い、設定した課題に対して理路整然とした一定の方向性又は結論を出す。最終的には、その討議結果を適切に整理してまとめ、分かりやすいプレゼンテーション資料として仕上げることとする。また、各自のグループワークへの貢献度を評価するため、原則毎回、①授業日毎の課題又は目標、②グループワークの具体的内容、③その結果又は成果、及び④各自の貢献内容等をリポートとして課すこととする。本授業の中心はグループワークであるため、グループメンバー間で必要な情報・データなどの共有が容易に行える必要があり、ノートPCは必携とする。",
        "notices": "本授業はフィールドワークによる現場感覚を重視しており、積極的に地域と関わろうとする姿勢が非常に重要である。また、本授業の目的は課題の気付き・解決能力の向上であるので、課題の設定おいては、必ずしも正解があるわけではない。その意味で、安易な方向（結論が見え透いているなど）に走り、真に興味のない課題設定は行なわないように注意すること。",
        "preparatoryStudy": "予習：設定課題ごとに関連する各市町村のホームページや、省庁の公開しているデータを事前に調査し、整理しておくこと復習：グループ内での各自分担項目不足内容を見直し、次回報告書に記入できるようにしておくこと",
        "gradingGuidelines": "成績評価は基本的に①プレゼンテーションの質（50%）及び②授業日毎に課されるリポートで確認された各自の貢献度（50%）により行う。①プレゼンテーションの質については、プレゼンテーションの内容の質により以下の基準（S,A,B,C）で成績評価を行う。S:結論に至る全体の論理性、調査・分析内容、表現力の全てにおいて特に優秀であるA：B＋表現力においても優れていると認められる。B：C+調査・分析において評価に値する独自の視点、緻密さ、労力などが認められる。C：プレゼン内容が、設定した課題に対して理路整然と一定の方向性や結論が示されている。②各自の貢献度については、毎回課されるリポートで確認された各自の貢献度により以下の基準で成績評価を行う。S：全授業を通じて結果又は成果に対して、常に本質的かつ優れた貢献を行ったと認められる。A：同じく、常に本質的な貢献を行い、かつ時々優れた貢献も行ったと認められる。B：同じく、常に本質的な貢献を行ったと認められる。C：常に何らかの貢献を行ったと認められる。",
        "textbook": "特になし。",
        "referenceMaterials": "書籍ではないが，下記Web，各種データベースなどが参考となる・八王子市まち・ひと・しごと創生総合戦略http://www.city.hachioji.tokyo.jp/shisei/001/001/001/001/p007376_d/fil/sougousenryaku.pdf・八王子市http://www.city.hachioji.tokyo.jp/shisei/002/006/index.html・東京都総務局統計http://www.toukei.metro.tokyo.jp/homepage/bunya.htm#bun12・政府統計データベースe-stathttps://www.e-stat.go.jp/SG1/estat/eStatTopPortal.do",
        "courseSchedule": "第1回：授業の進め方、ブレーンストーミング・KJ法の復習、各種資料検索法(個人)第2回：八王子市の特徴調査（SWOT分析）(グループ)第3回：八王子市の問題調査(グループ)第4回：現地調査①地域選定、調査項目抽出(グループ)第5回：現地調査①(グループ)第6回：現地調査結果分析、解決策検討、中間報告資料作成(グループ)第7回：中間報告会第8回：中間報告フィードバック、解決策の改善・再提案(グループ)第9回：現地調査②地域選定、調査項目抽出(グループ)第10回：現地調査②第11回：現地調査結果、解決策の有効性分析、最終報告資料作成(グループ)第12回：最終発表会第13回：最終発表フィードバック、提案書アウトライン作成第14回：提案書作成",
        "courseDataUpdatedAt": "2023/12/25"
    },
    "updateAt": "2024/12/02"
}