{
    "lectureCode": "K000312",
    "courseName": "社会連携演習I[電]",
    "lecturer": [
        "新海健(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "講義実験棟１０３",
        "講義実験棟１０４",
        "講義実験棟２０１",
        "講義実験棟２０２",
        "講義実験棟２０３",
        "講義実験棟２０４"
    ],
    "courceDetails": {
        "courseOverview": "この授業を通じて、今後のコーオプ実習を円滑にすすめるための準備として、一般企業での仕事において必要なコミュニケーション能力、分析・評価能力、論理的な思考能力および問題解決力を向上する。具体的には、技術課題・時事問題・業務改善・身の回りの課題などから、解決すべき課題を設定し、個別ワークとグループワークを交えながら、課題解決方法を検討してまとめ、最終的にプレゼンテーションによる提案を行う。このプロセスで必要となる情報調査の方法、プロジェクト管理の方法、会議の方法、プレゼンの準備方法について、各種ツールを使用したり、ケーススタディやロールプレイングを取り入れながら修得することを目指す。",
        "outcomesMeasuredBy": "この授業を通じて、一般企業での仕事を進めるために必要なコミュニケーション能力、課題に対する気付き・分析・考察の力、および、以下の基礎力を身に付けることを目標とする。(1)情報調査の方法、ツール活用方法を身に付ける。(2)プロジェクト管理の方法、情報共有の方法、ツール活用方法を身に付ける。(3)会議の意義と運営方法、ツール活用方法を身に付ける。(4)プレゼンの論理組み立て、スライド作成手法を身に付ける。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "個別ワークとグループワークを交えながら演習を進める。技術課題・時事問題・業務改善・身の回りの課題などから、解決すべき課題を設定し、課題解決方法を検討してまとめ、最終的にプレゼンテーションによる提案を行う。このプロセスで必要となる情報調査の方法、プロジェクト管理の方法、会議の方法、プレゼンの準備方法について、各種ツールを使用したり、ケーススタディやロールプレイングを取り入れながら学ぶ。原則毎回、課題を提出する。",
        "notices": "PCを持参すること。",
        "preparatoryStudy": "各回の授業において、グループごとに検討する課題に関して、次回授業までに調査あるいは検討すべき事項が示されるので、各自がこれら事項について必要な調査等を行った上で結果をグループごとのフォルダにアップすること。(120分程度)また、同時に行われる「社会連携概論」は、本授業の課題設定および調査・分析作業の一助になると考えられ可能な限り有効に活用することが望まれる。",
        "gradingGuidelines": "毎回提出する課題(80%)とグループワークへの貢献度(20%)で評価を行う。",
        "textbook": "特になし",
        "referenceMaterials": "講義内で紹介する。",
        "courseSchedule": "第1回：ガイダンス（本演習の趣旨と今後の進め方のポイントの説明）（戸井）第2回：グループワーク手法（課題設定でのブレインストーミングとKJ法）（外部講師）第3回：グループワーク手法（問題解決でのブレインストーミングとKJ法）（外部講師）第4回：テーマ設定（情報調査・検索の手法）第5回：プロジェクト管理の基本（管理ツール）第6回：解決策検討（情報調査・検索の手法）第7回：会議の基本（意義と方法）第8回：会議の基本（役割分担と議事録）第9回：プレゼン手法（論理組み立て）第10回：プレゼン論理の検討第11回：プレゼン手法（スライド表現）第12回：プレゼンスライド作成第13回：プレゼン提案第14回：フィードバック",
        "courseDataUpdatedAt": "2024/02/06"
    },
    "updateAt": "2024/09/03"
}