{
    "lectureCode": "K601102",
    "courseName": "プログラミング基礎(E)2023年以前入学者用",
    "lecturer": [
        "天野直紀(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "実際に社会で用いられる電気機器、電子機器の多くはコンピューターによる制御が行われている。したがって電気電子技術を活用するにはコンピューター制御のためのソフトウェア作成が必須である。また、近年、世界的にプログラミング教育を低学年から行う傾向がある。これはプログラミングを通じて修得できるコンピューターへの理解、論理的思考能力の獲得が重要視されているためである。これらの視点から、この授業ではプログラミングに不可欠・共通的な知識の獲得と実際にソフトウェアを作成できるスキルの獲得を行う。",
        "outcomesMeasuredBy": "プログラミングに不可欠・共通的な知識の獲得と実際にソフトウェアを作成できるスキルの獲得を行う。これを通じて「論理的な思考力」「実学に基づく専門能力」「問題解決力」「電子工学の基礎力」を身につける。具体的には以下の通り。・ソフトウェア開発の共通的な流れを説明できる。・変数、条件分岐、繰り返しといった言語に依存しない共通的な内容を説明できる。・変数、条件分岐、繰り返しについて、実際にC#言語での実装できる。・比較的簡単な構造のソフトウェアを設計・実装・検証できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "オンデマンド形式＋実技試験（対面）で実施する。詳細は「成績評価方法・基準」欄を参照すること。",
        "notices": "原則として読み替え科目である1年次後期のプログラミング基礎を受講（再履修）することが望ましい。この再履修集中科目の履修は時間割上の都合などから、読み替え科目を履修できない場合を基本的な想定とする。更に、この再履修集中科目はそれよりも前に「プログラミング基礎」を履修したことが履修条件となる。ここで履修とは履修登録を行い、14回の演習に出席したことを意味する（一般的には評価Dであったことがこれに相当すると理解できる）。この再履修集中科目の履修にあたっては履修登録と前に説明の確認と登録を必須とします。「リンク先ホームページアドレス」を必ず確認すること。",
        "preparatoryStudy": "過去にプログラミング基礎を履修した内容について総復習を行うこと。",
        "gradingGuidelines": "この再履修科目で得られる成績評価はCのみであり、S、A、Bは得られない。B以上の成績評価を希望する場合には再履修（この再履修科目ではなく2024年度前期に開講されるプログラミング基礎）すること。14回分に相当するオンデマンド講義があるので、それらを期日内に受講し、課題を提出すること。その詳細は講義資料ページに掲載する。すべての課題を期日内に提出した者を実技試験（対面）対象者とする。実技試験は前期末試験期間内の2年次以上の科目のない時間帯に実施する予定である。実技試験で2/3正解で成績評価Cと認定する。",
        "textbook": "なし",
        "referenceMaterials": "C#の絵本,株式会社アンク,翔泳社,4798114618",
        "courseSchedule": "第1回：はじめに。プログラミング言語とは？環境構築第2回：コーディングの仕方第3回：変数（整数、実数、四則演算、表示）第4回：条件分岐（基礎。if...else...。条件式)第5回：条件分岐（応用。elseif。true/false)第6回：到達度確認（１）第7回：繰り返し（while）第8回：繰り返し（for）第9回：配列（基礎）第10回：配列（応用）第11回：到達度確認（２）第12回：関数（利用）第13回：関数（作成）第14回：到達度確認（総合）（上記を数回のオンデマンド形式に集約して実施する）",
        "courseDataUpdatedAt": "2025/03/13"
    },
    "updateAt": "2025/03/21"
}