{
    "lectureCode": "K601801",
    "courseName": "電子回路I",
    "lecturer": [
        "木村康男(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ５０２"
    ],
    "courceDetails": {
        "courseOverview": "電子回路は、半導体素子をはじめとする能動素子と受動素子を組み合わせた回路網であり、電子機器を構築する上で基礎をなすものである。電子回路Iでは、半導体の種類やP型半導体、N型半導体といった半導体そのものの特性や性質について理解する。さらに、それらを用いたデバイスであるダイオードやバイポーラトランジスタ、電界効果型トランジスタなどの基本的な電子素子の特性やその応用について学ぶと共に等価回路を用いた回路解析手法を習得する。",
        "outcomesMeasuredBy": "電子回路Iでは、電子工学の基礎である半導体の種類やP型半導体、N型半導体といった半導体そのものの特性や性質について理解する。さらに、それらを用いたデバイスであるダイオードやバイポーラトランジスタ、電界効果型トランジスタなどの基本的な電子素子の動作原理及び特性をバンドダイアグラムを通して理解するとともに、等価回路を用いた回路解析手法を習得する。これにより、実学に基づく電子回路に関する専門能力及び分析・評価能力を身が身につく。具体的には、以下のことができるようになる。１）バイポーラトランジスタと電界効果トランジスタの特徴を理解し使い分けができる。２）バイポーラトランジスタのバイアス回路の設計ができる。３）接合型電界効果トランジスタのバイアス回路の設計ができる。４）各種トランジスタを用いた回路の特性を解析することができる。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力",
        "teachingMethod": "全体としては講義形式で行うが、必ずノートをとるように心掛ける。適宜演習を行い理解を深める。電子工学演習Iと連動しながら講義を進めていくことにより、ダイオード、トランジスタといった基本的な電子素子の特性や回路解析手法を習得する。",
        "notices": "電気回路I,IIを習得し、電気回路IIIを履修していることが望ましい。必ずノートと筆記用具を持参する。",
        "preparatoryStudy": "毎回、次回の主題等を説明するので、事前に予習し一般的な調査・理解をしておくこと。適宜演習を行うのでノートを持参する。電子回路演習Iと連携して授業を進める。復習しわからない点を次週に残さぬよう心掛ける。",
        "gradingGuidelines": "提出物及び期末試験の合計で成績を評価する。ただし、その割合は、順に30:70とする。",
        "textbook": "「よくわかる電子回路の基礎」電気書院堀佳太郎著ISBN978-4-485-30054-1",
        "referenceMaterials": "「わかりやすい電子回路」コロナ社篠田庄司監修和泉勲編著宇田川弘著田丸雅夫著ISBN978-4-339-00781-7「電子回路」コロナ社篠田庄司、田丸雅夫、藤川孝著ISBN978-4-339-08765-9「電子回路シミュレータLTspice入門編」CQ出版社神崎康宏著ISBN978-4-7898-3631-9",
        "courseSchedule": "第1回：電気回路の基礎（テブナンの定理、ノートンの定理）第2回：各種電子素子（LCR回路・PN接合・ダイオードとその回路）第3回：バイポーラトランジスタ（作製プロセス・スイッチング素子としてのバイポーラトランジスタ）第4回：バイポーラトランジスタの等価回路（バイアス回路・等価回路・エミッタ接地）第5回：バイポーラトランジスタ増幅回路①（周波数特性・ミラー効果・コレクタ接地、ベース接地の紹介）第6回：バイポーラトランジスタ増幅回路②（バイポーラトランジスタを用いた回路の解析法の復習）第7回：これまでの復習と理解度チェック第8回：理解度チェックの復習第9回：電界効果型トランジスタとその等価回路（構造、作製プロセス、特徴）第10回：電界効果型トランジスタ増幅回路（バイアス回路・等価回路・ソース接地）第11回：増幅回路の接合（エミッタ接地・コレクタ接地・ベース接地・それらの応用回路）第12回：差動増幅回路と電力増幅回路（差動増幅器の原理・カレントミラー回路・A級、B級、C級電力増幅器）第13回：これまでの復習と理解度チェック第14回：理解度チェックの復習とまとめ",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/12/02"
}
