{
    "lectureCode": "K601104",
    "courseName": "プログラミング基礎(E)",
    "lecturer": [
        "天野直紀(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金",
        "金2"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "実際に社会で用いられる電気機器、電子機器の多くはコンピュータ・マイコンによる制御（マイコン制御）が行われている。したがって電気電子技術を活用するにはマイコン制御のためのソフトウェア開発が必須である。マイコン制御はマイコン単体でなくアクチュエータやセンサーとの組み合わせが不可欠である。このためこの演習でもアクチュエータやセンサーを用いた制御システムの構築を通じたソフトウェア開発のスキルを修得する。",
        "outcomesMeasuredBy": "ソフトウェア開発に不可欠・共通的な知識の獲得と実際にプログラミングするスキルの獲得を行う。ソフトウェア開発には基礎的なスキルを修得した上で、多様なリソースを取り込んだ応用システムの実現する構築・評価スキルが不可欠である。・ソフトウェア開発の共通的な流れを説明できる・変数、条件分岐、繰り返しといったプログラミング言語に依存しない共通的な内容を説明できる・変数、条件分岐、繰り返しについて、実際にArduino言語で実装できる・比較的簡単な構造のソフトウェアを設計・実装・検証できる",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "毎回、取り上げるプログラミング上の技術について説明と演習を繰り返す。この授業では各自のノートPC上でArduino言語を用いたプログラミング（ソフトウェア作成）に関する演習を行う。また、出席確認、資料の閲覧などにもノートPCは必須である。",
        "notices": "特にプログラミングの経験のほとんどない場合には、何度も実際のプログラム作成を繰り返すことで、理解とスキル習得を行う必要がある。このため、タイピング速度が遅いと実質的な体験の機会が少なくなるのでタイピング速度を向上させておくことで学習効果を向上させることができる。なおこちらは2024年度から始まる新カリキュラム科目である。同名の旧カリキュラムの科目とは内容が大きく異なるので、再履修希望者は2024年度前期の同名科目あるいは再履修科目を履修することを推奨する。",
        "preparatoryStudy": "プログラミングの基礎を学ぶため、経験の有無による差が大きく現れる傾向にある。このため1年次の実験以外でプログラミング経験がない学生は、前期の情報リテラシー演習で扱うマイコンやセンサーのサンプルコードを読むなどし、事前に次回の内容（if。forなど）についての基本的な文法についての予習（試行）を済ませておくことを強く推奨する。講義期間中においては理解が不十分な部分は講義資料ならびにオンラインコンテンツ（講義中に紹介するpaizaラーニングなど）を用いて相当部分を復習すること。また次回講義資料を参照して予習すること。",
        "gradingGuidelines": "14回の講義を通じて行う到達度確認の結果に基づいて成績評価を行う。具体的には到達度確認（１）、到達度確認（２）、到達度確認（総合）によって評価し、その割合は20:20:50（D～A評価の判定）となる。また、加点要素として毎回の演習時間内の「授業参加」がある。ここで「授業参加」とは授業中の発言、報告などの活動のことを言う。その具体的な定義は講義中に適宜、明示する。また基準量を超えた分についてはS評価に関わる加点要素とする。",
        "textbook": "なし",
        "referenceMaterials": "講義内で適宜紹介する",
        "courseSchedule": "第1回：はじめに。プログラミング言語とは？環境構築第2回：基礎1：マイコン単体、コーディングの仕方第3回：基礎2：変数（整数、実数、四則演算、表示）第4回：基礎3：条件分岐（基礎。if...else...。条件式)第5回：基礎4：到達度確認（１）第6回：アクチュエータ：サーボモータの制御第7回：アクチュエータ：繰り返し第8回：センサー：繰り返しと配列第9回：到達度確認（２）第10回：通信：繰り返し第11回：通信：繰り返しと配列第12回：バランスロボット：総合第13回：バランスロボット：アルゴリズム第14回：到達度確認（総合）",
        "courseDataUpdatedAt": "2024/08/02"
    },
    "updateAt": "2024/12/02"
}
