{
    "lectureCode": "K601502",
    "courseName": "工学基礎実験II(E)[B]",
    "lecturer": [
        "中払周(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火4",
        "火5"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "私たちをとりまく生活や環境において、電気電子工学に関する知識と技術は重要な役割を担っている。とくに、電気に関連した部品、装置、システムは様々な所で使用されており、本授業ではこれらに関わる基礎技術の習得を大きな目的とする。また、実験レポートや論文等をPCを使用して作成する際の作法の習得は、実社会においても重要になるであろう。そのため、物理・電気電子基礎系の実験と、マイコン基礎系の実験とに大別して実施する。物理・電気電子基礎系の実験では、ガイダンスを行った後、まずはPC上のソフトウェアを用いたデータの扱い方や解析の仕方、図表やグラフを正しく作成する方法、それらをドキュメントにまとめる技能を身に着ける。その上で、基礎物理の実験として重力加速度、電磁誘導、直流・交流測定の基礎、ならびにレーザー光の回折と干渉に関する実験とそれらの実験レポートの作成を通じて、物理・電気電子実験の基礎を習得する。",
        "outcomesMeasuredBy": "この授業を通じて、物理学と電気電子工学に関わる実験における専門知識と技術、論理的な思考力および問題解決力を身につけることを目標とする。具体的には、基礎的な物理と電子部品の電気特性を正しく評価することの意味を理解し、その結果を適切に伝えるためのレポート作成技術を習得する。これらの基礎的な電気工学および電子工学の一連の実験に関する知識を踏まえて、２年次以降の専門的学習への高い関心をもつことを到達目標とする。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "安全面と教育上の観点から、学生実験は特に時間に正確で順を追った進行を意識する。始めに、担当教員または実験講師が概説と実験手順の説明を行い、各自が一つひとつ課題を達成していく。担当教員、実験講師が各自の達成度および理解度を一人ひとり確認する。課された実験レポートをそれぞれの期限までに提出することを求める。提出の期限と場所については、担当教員または実験講師が指示する。提出されたレポートについて、担当教員または実験講師と学生との間での綿密な質疑応答を通して各自の理解度を確認する。理解度の不足が認められた場合や、内容上不十分なレポートについては修正・再提出などの指示があり、これを満たしたレポートのみが正式に受理される。なお工学基礎実験は、物理・電気電子基礎系とマイコン基礎系に大きくわかれて実施する。各自どのテーマから学習するか連絡があるため留意すること。",
        "notices": "安全面と教育上の観点から、学生実験は時間通り特に正確に開始し、予定の段階を一つひとつ理解し達成していく必要がある。そこで欠席および遅刻の記録を正確に行い、安全および教育上問題が想定される際は、当日の実験実施ができない場合がある。電源回路や電子部品、光学機器の取り扱いを誤ると、切り傷や刺し傷、感電、火傷、失明のおそれがあるため、指導教員の指示に十分注意を払うこと。実験データの解析やレポート作成に必要であるため、各自必ず、ノートＰＣを持参すること。その他、授業の詳しい進め方や注意事項については、各実験テーマの始めに行われるガイダンスにて説明される。",
        "preparatoryStudy": "配布される各実験のテキストをよく予習すること。実験実施前日までの予習により、実験技術の習得および知識・技術の理解と記憶の面で大きな効果が期待できる。また、実験テキストを復習することにより、それぞれの実験の流れがよく理解・説明できるようになる。なお、予習・復習の具体的な範囲や内容については、各回授業の中で指摘し注釈を行うので注意を要する。指摘した内容の復習および予習には少なくとも合計で約60分の時間が必要である。",
        "gradingGuidelines": "実験レポートの提出とその内容により総合的に評価する。各実験で課される小問や課題に対する学習および完成の度合いを評価する。実験レポートの提出、修正および完成（60%）、実験の取り組みの態度（20%）、質疑応答の内容（20%）を基準に評価する。",
        "textbook": "実験専用のテキストが教科書であり、これは事前に履修学生へ順次配布される。",
        "referenceMaterials": "特にないが必要に応じてインストラクタより紹介する。",
        "courseSchedule": "第1回：ガイダンス、安全に関する注意事項、実験の基礎的事項第2回：実験データの扱い方と解析の方法第3回：グラフの描き方の基礎第4回：実験レポートの書き方第5回：重力加速度の測定第6回：電磁誘導第7回：オシロスコープと交流信号第8回：抵抗とダイオードの静特性第9回：レポートの指導および質疑応答第10回：交流測定の基礎第11回：レポートの指導および質疑応答第12回：レーザーの回折と干渉第13回：レポートの指導および質疑応答第14回：まとめ",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/12/02"
}
