{
    "lectureCode": "K601201",
    "courseName": "プログラミング応用(E)",
    "lecturer": [
        "坪川宏(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火4",
        "火5"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義実験棟４０２",
        "講義実験棟４０３"
    ],
    "courceDetails": {
        "courseOverview": "基本的なJava言語を習得した後、統合開発環境(AndroidStudio)でのアプリケーション開発手順を身につけ、画面描画、イベント、ファイル入出力、センサー情報取得についてのプログラミングを実践する。また、各自アプリケーション設計・実装を行い、グループ内での実装評価をプレゼンテーションを通して行う。",
        "outcomesMeasuredBy": "実際のスマートフォンやタブレット型Android端末におけるアプリケーション開発により実学に基づく専門能力を習得し、プログラミングによる論理的な思考能力を養う。また、グループワークによる設計、実装を通してコミュニケーション能力を身につける。1)統合開発環境でのプログラミング、エラー表示を理解したデバッグができるようになる。2)画面描画とイベント処理を用いて、簡単なユーザインターフェースを実装できるようになる。3)ファイル入出力手順を理解し、データアクセスができるようになる。4)実機でのアプリケーション設計・開発ができるようになる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力",
        "teachingMethod": "毎回各自のノートPCで、プログラミング演習を行い、報告書を作成する。また、課題作成1、課題作成２では、総合的な課題作成を行い、アプリケーション制作課題においては、グループ単位でアプリケーション設計・実装に取り組む。",
        "notices": "各自のノートPC上でプログラミングを行うので、ノートPCを必ず持参すること。持参しない場合、履修を認めない。プログラミング基礎を習得していない場合、難易度が高くなるので注意すること。",
        "preparatoryStudy": "授業前に授業資料をよく読み、プログラム作成課題に関係する箇所、命令を抽出しておくこと。授業後、授業で作成した課題プログラムを再度見直して実行するとともに、課題作成が終わらなかった箇所について、必ず次回授業前までに終わらせ、次回授業において報告を行う準備をしておくこと。",
        "gradingGuidelines": "課題作成１＋課題作成２を７割、アプリケーション制作課題を３割で評価を行う。授業中の課題については、正解をチェックし、誤りについてのフィードバックを行う。",
        "textbook": "特に指定はしないが、下記の参考書1が参考となる。授業内容、説明はWeb等により閲覧可能とする。",
        "referenceMaterials": "1.やさしいAndroidプログラミング、高橋麻奈、ソフトバンククリエイティブ2.JavaからはじめようAndroidプログラミング、大津真、インプレス",
        "courseSchedule": "第1回：Java環境、開発環境設定、利用方法、エミュレータ、プロジェクト作成手順、エミュレータでの画面表示と基本命令の実行確認第2回：オブジェクト指向の基礎とクラス、メソッドの利用第3回：テキスト表示、ボタン表示、イベント、文字入力第4回：リストビュー、グリッドビュー、図形描画、再描画による図形移動第5回：課題作成１第6回：リソースの理解、画像表示とアニメーション第7回：音声・音楽情報の利用とカメラ操作第8回：センサ利用、センサ情報による図形アニメーション第9回：ファイル入出力第10回：課題作成２第11回：アプリケーション制作課題Ⅰ(設計)第12回：アプリケーション制作課題Ⅱ(実装)第13回：アプリケーション制作課題Ⅲ(評価)第14回：報告書まとめ",
        "courseDataUpdatedAt": "2023/12/25"
    },
    "updateAt": "2024/09/03"
}