{
    "lectureCode": "K602201",
    "courseName": "電子物性",
    "lecturer": [
        "前田就彦(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ３０３"
    ],
    "courceDetails": {
        "courseOverview": "エレクトロニクス分野で用いられる様々な電子材料の特性や電子デバイスの動作を理解する上で不可欠となる固体における電子の振る舞い（固体物性／電子物性）について学ぶ。まず基礎として、原子の構造と電子の性質、固体の結晶構造などについて学ぶ。引き続いて、古典的な電子伝導モデル、さらに、現代の電子物性・電子デバイス工学を理解する上で不可欠となる量子力学の基礎を学び、結晶構造に起因するエネルギーバンド構造について理解するのがひとつの山場である。その上で、様々な結晶中の電子輸送（電気伝導）の相異をエネルギーバンド構造に基づいて理解し、さらに、電子材料の中でも光・電子デバイス材料として特に重要な半導体の基礎物性を体系的に学ぶ。この授業により、金属、半導体、絶縁体などの電子材料の物性やそれらのデバイス応用についての知識が得られ、これを基にして光・電子デバイスの動作を理解し、その設計や開発ができるようになるための基礎的な能力が身につく。",
        "outcomesMeasuredBy": "本科目を習得することにより、電子材料の物性やそれらのデバイス応用に関して、実学に基づく専門能力、理論的な思考力、分析・評価能力、問題解決力、電子工学の基礎力が身につく。具体的には下記のことができるようになる。・金属、半導体、絶縁体の相異をエネルギーバンド構造に基づいて説明できる。・結晶中の電子の運動をエネルギーバンド構造に基づいて説明できる。・真性半導体と不純物半導体、電子と正孔について説明できる。・Ｎ型半導体とＰ型半導体、ＰＮ接合、ヘテロ接合構造について説明できる。・半導体のデバイス応用への基盤となる電気的・光学的性質について説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "プロジェクターと黒板を用いた講義形式で行い、適宜、演習を行う。",
        "notices": "本科目は数学と物理学を基盤としているので、微分積分I、II、線形代数、電気数学、電気回路I、IIおよび電子回路Iを履修し、数学および電気電子回路の基礎を習得していることが望ましい。また、本科目と併せて電気磁気学および電子回路IIも履修することが望ましい。さらに本科目履修後、電子デバイスも併せて履修することが望まれる。",
        "preparatoryStudy": "毎回の講義の復習を十分に行うことが次回の講義への予習ともなる。その際には、授業内容に関連する数学や物理学、電気電子回路などのこれまでの学習事項を振り返って学習することが、エレクトロニクス分野の総合的な理解を深める上で大変有意義である。また、参考書「キッテル固体物理学入門」は固体物理学/電子物性の定番的教科書であり、初学者にとって難解な点はあるが、適宜参照することにより将来的な学習の発展に繋がる。",
        "gradingGuidelines": "演習（30%）と期末試験（70%）により評価する。",
        "textbook": "指定しない",
        "referenceMaterials": "「キッテル固体物理学入門第８版（上）」CharlesKittel原著、宇野良清、津屋昇、新関駒二郎、森田章訳（丸善）",
        "courseSchedule": "第1回：導入（エレクトロニクスにおける電子物性の位置づけ）第2回：原子の構造と電子の性質第3回：原子の結合と結晶構造第4回：古典的伝導モデル、量子力学の基礎第5回：結晶とエネルギーバンド構造（金属、半導体、絶縁体の相異）第6回：結晶中の電子の運動（有効質量、移動度、散乱過程）第7回：これまでのまとめと復習第8回：半導体における電子と正孔、金属の電気伝導との相異第9回：真性半導体と不純物半導体第10回：Ｎ型半導体とＰ型半導体、ホール効果第11回：不純物半導体におけるキャリア統計第12回：半導体の光学的性質第13回：ＰＮ接合、半導体の光・電子デバイスへの応用第14回：まとめ",
        "courseDataUpdatedAt": "2025/01/06"
    },
    "updateAt": "2025/03/21"
}