{
    "lectureCode": "K602901",
    "courseName": "ディジタル回路",
    "lecturer": [
        "木村康男(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０３"
    ],
    "courceDetails": {
        "courseOverview": "本講義では、論理回路に続いてディジタル回路の諸特性と設計についての技術を学ぶ。初めに論理回路で学んだディジタル回路に関する基本事項について復習した後に、様々なディジタル回路の実現方法について理解する。次に、TTLやCMOSによる論理ゲート構造を理解し、これらによる集積回路の動作原理や回路構造などを学び、それらの特性を理解する。これらの知識を基にディジタル集積回路を用いた様々な回路についての設計方法を習得する。また、本講義で習得する知識は、集積回路、マイクロプロセッサを理解する上で予備知識となる。",
        "outcomesMeasuredBy": "ディジタル回路では、電子回路の知識を基礎としてTTLやCMOSによる論理ゲート構造を理解し、それらを論理回路へ適用するための技術を習得する。また、演算器やカウンタなどの基本的な論理回路の実現手法を学ぶことにより、より複雑な集積回路を理解し、その応用方法を習得する。これにより、実学に基づくディジタル回路関する専門能力が身につく。具体的には、以下のことができるようになる。１）アナログとディジタルの特徴を理解し、それらの回路の使い分けができる。２）2進数による論理表現を理解し、論理を真理値表で表すことができる。３）論理を論理ゲートによって表現できる。４）汎用ロジックIC等で回路を設計できる。",
        "learningOutcomes": "実学に基づく専門能力",
        "teachingMethod": "全体としては講義形式で行うが、必ずノートをとるように心掛ける。適宜演習を行い理解を深める。",
        "notices": "電気回路I,II、電子回路I,II、論理回路を習得していることが望ましい。適宜演習を行うのでノートを持参すること。",
        "preparatoryStudy": "毎回、次回の主題等を説明するので、事前に予習し一般的な調査・理解をしておくこと。復習しわからない点を次週に残さぬよう心掛ける。",
        "gradingGuidelines": "提出物及び期末試験の合計で成績を評価する。ただし、その割合は、順に30:70とする。",
        "textbook": "「電気・電子系教科書シリーズ13ディジタル回路」コロナ社伊原充博、若海弘夫、吉沢昌純著ISBN:978-4-339-01193-7",
        "referenceMaterials": "「しっかり学べる基礎ディジタル回路」森北出版湯田春雄、堀端孝俊共著ISBN:978-4-627-79171-8",
        "courseSchedule": "第1回：ディジタルとアナログ第2回：ブール代数①（論理式・真理値表・ド・モルガンの法則）第3回：ブール代数②(論理式の簡単化・カルノー図)第4回：ディジタル回路の設計法第5回：ディジタル回路の実現素子（TTLIC・CMOSIC）第6回：組合わせ回路(エンコーダとデコーダ・マルチプレクサ)第7回：これまでの復習と理解度チェック第8回：理解度チェックの復習第9回：加算器・減算器（半加算器・全加算器・半減算器・全減算器・多ビット加算器）第10回：フリッププロップ(RSフリップフロップ・JKフリップフロップ)第11回：カウンタとレジスタ第12回：ディジタル回路の応用(A-D変換、D-A変換)第13回：これまでの復習と理解度チェック第14回：理解度チェックの復習とまとめ",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}