{
    "lectureCode": "K602301",
    "courseName": "論理回路",
    "lecturer": [
        "黒川弘章(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０３"
    ],
    "courceDetails": {
        "courseOverview": "本講義では論理回路についてその構成方法と動作について学ぶ。論理回路はコンピュータを実現するための基本回路であり、コンピュータを基盤技術として成り立つ現代において実学に基づく専門能力を身に付けるために必要な基礎科目である。はじめに論理回路を学ぶ意義について理解し、論理回路における数の表現と論理回路素子に関する基本的な知識を習得する。つづいて論理関数を記述する真理値表から回路での表現を求める方法について学ぶ。さらに順序回路を用いた論理回路についてその構成と動作を学び、最終的にいくつかの実例を用いて論理回路の構成と動作について学ぶ。",
        "outcomesMeasuredBy": "電気電子工学におけるものづくりの基本となる論理回路を理解するために必要な基本技術を身につけることにより、【電気工学の基礎力】及び【電子工学の基礎力】を身につける。また、論理回路の仕組みを学ぶことにで【論理的な思考能力】を身に付ける。具体的な達成目標は、（1）数の表現方法を理解し扱えるようになる、（2）基本論理回路素子について理解し扱えるようになる、（3）論理関数を回路で表せるようになる、（4）代表的な論理回路の動作を理解できる、である。ただし、本講義では、代表的な論理回路として、シフトレジスタ、カウンタ、エンコーダ、デコーダ、加算器を取り上げる。",
        "learningOutcomes": "論理的な思考力",
        "teachingMethod": "【授業形態：講義】授業計画に挙げた項目に沿って解説する。第8回と第14回の理解度チェックの他に、毎回小テストを行う。授業ではスライド資料を用いるため資料閲覧用にノートPCが必要である。",
        "notices": "授業概要を理解した上で履修すること。",
        "preparatoryStudy": "予習として、スライド資料を用いて各自で学習する。復習は講義内容を自分で用意したノートにまとめ理解を深めた上でmoodleに用意された小テストを行う。",
        "gradingGuidelines": "課題（小テスト）の提出状況（30%）と2回の理解度チェックの結果（70%）を用いて成績評価を行う。",
        "textbook": "教科書は用いない。",
        "referenceMaterials": "コンピュータ概論、半谷精一郎、見山友裕、長谷川幹雄、コロナ社（計算機工学の教科書でもある）わかりやすい論理回路、三堀邦彦、斎藤利通、コロナ社論理回路の基礎、田丸啓吉、工学図書速解論理回路、宮田武雄、コロナ社だれにもわかるディジタル回路、相磯秀夫、天野英晴、武藤佳恭、オーム社",
        "courseSchedule": "第1回：論理回路を学ぶ意義第2回：数と符合の表現第3回：ブール代数における基本演算と諸定理第4回：ブール代数における基本演算と諸定理第5回：電子回路による論理回路の表現第6回：組み合わせ論理回路の設計第7回：組み合わせ論理回路の設計第8回：ここまでのまとめと理解度チェック第9回：加算器の構成と動作第10回：エンコーダとデコーダの構成と動作第11回：順序回路の構成とフリップフロップ第12回：順序回路の設計第13回：シフトレジスタとカウンタの構成と動作第14回：全体のまとめと理解度チェック",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}