{
    "lectureCode": "K603201",
    "courseName": "エネルギー工学",
    "lecturer": [
        "新海健(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金4"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ４０３"
    ],
    "courceDetails": {
        "courseOverview": "サステイナブルな社会の実現のために、電気電子工学では発電や送電などの電気的エネルギー制御や、情報処理におけるエネルギー消費、更には情報技術によるエネルギー制御の効率化追求という形で深く関わる。これらの技術や基礎学理を習得するにあたり、物理学におけるエネルギーの概念の基礎から、エネルギーマネージメント技術の全般に至る、エネルギー問題の基礎と概要を習得する。その基礎のもとに、発電法や輸送・貯蔵や、近年の環境問題において重要な自然エネルギーの概要、そして社会におけるエネルギー利用の経済システムに至るまでの全般的な知見を得ることができる。",
        "outcomesMeasuredBy": "本科目を修得することで、エネルギー問題に関する専門基礎能力、分析・評価能力、及び本課題に対する論理的な判断力を身につけることを目指す。具体的には、以下のことができるようになる。１）エネルギーの基礎的な概念について説明できる。２）エネルギーの生成・変換・評価に関する基礎的な技術について説明できる。３）近年の環境問題におけるエネルギー問題について、広範な知識に基づく考察と意見を述べることができる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "基本的に講義形式で行うが、適宜以下の課題を課すものとする。・毎回の講義の基礎的な問題についての演習問題やレポートを課す。・最終回の演習は、全体を俯瞰するものとして総合演習とする。",
        "notices": "サステイナブル工学基礎の復習をしておくこと。日頃からエネルギー問題に関する報道や言説等に注目し、エネルギー環境問題に関して自分の意見・立場を明確にするように心がけること。",
        "preparatoryStudy": "毎回の授業内容について、教科書の該当ページを通読し、その回の講義の内容を概観・把握するとともに、興味ある題材についての最新動向を事前に調査すること。また、授業後はその回の演習問題やレポート課題について、更に理解を深めるように自ら探求すること。",
        "gradingGuidelines": "授業中の演習および定期試験との結果から評価する。総合する際の比率は、それぞれ、40%および60%とする。",
        "textbook": "藤井康正(著)\"エネルギー環境経済システム\",コロナ社；（2018/6）ISBN:978-4-339-06646-3",
        "referenceMaterials": "伊東弘一(著),大岡五三実(著),武田洋次(著),片山紘一(著),町井令尚(著)：\"エネルギー工学概論\",コロナ社;(1991/9).",
        "courseSchedule": "第1回：エネルギーとは？第2回：エネルギーの分類I：熱エネルギーと化学的エネルギー第3回：エネルギーの分類II：電気的エネルギーと核エネルギー第4回：エネルギーの変換I：熱機関と発電機第5回：エネルギーの変換II：水力発電と揚水発電第6回：エネルギーの変換III：燃料電池と太陽光発電第7回：エネルギーの輸送と貯蔵第8回：化石燃料のエネルギーシステム第9回：核燃料のエネルギーシステム第10回：自然エネルギー資源の利用とシステム第11回：エネルギー供給と最終エネルギー消費第12回：エネルギーと環境第13回：エネルギーの経済システム第14回：エネルギー工学のまとめ",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/12/02"
}