{
    "lectureCode": "K603101",
    "courseName": "電気機器",
    "lecturer": [
        "高木茂行(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "変圧器、発電機、電動機などの電気機器は工場や商業ビルから一般家庭にまで幅広く浸透している。また、エネルギー変換装置である電気機器は省エネルギー問題に関して重要な要素でもある。このような社会的背景を踏まえて、本講義では、変圧器、直流機、誘導機、同期機などの電気機器を取り上げ、それらの動作原理、構造、諸特性及び制御方法などについて理解することを目的とする。電気機器について、実際の構造・諸特性・制御方法と、等価回路による解析方法の両面から説明する能力を身につける。",
        "outcomesMeasuredBy": "以下の目標に到達することにより、電気工学の基礎と電気電子工学の実学に基づく専門能力を習得する。また、（１）の変圧器、（２）の誘導機に対する等価回路を導出する過程を通して、論理的な思考能力を習得する。（１）変圧器：変圧器はすべての電子機器の基礎となる内容。変圧器の動作原理を理解し、実際の変圧器の等価回路を抽出できる。（２）誘導電動機：誘導電動機は鉄道、産業機器で広く使われ、最も重要な回転機器である。（１）を基に等価回路が抽出でき、使用目的に応じた速度制御方法を選択できるようにする。（３）同期機・直流機：同期機を使った発電、直流機を使った回転速度の制御について習得する。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "・授業の基本的な進め方は、35分の講義後に15分の演習問題を行うとうアクティブラーニング形式で実施し、100分間に2回の講義と演習を行う。・電気機器が実際に使われている適用例を示し、それぞれの電気機器の具体的イメージを説明する。・電気機器の動作原理を説明し、等価回路の抽出ついて説明する。・講義時間内で簡単な演習を行い、動作原理、等価回路についての理解を深める。・講義中に行う演習では、PCを使用する。",
        "notices": "・1年上期の電気回路Ⅰを受講・理解しておくこと。・関連科目となる2年上期の電磁気学を受講していなくても理解できるよう講義を進めるが、受講しておくことで理解が深まる。",
        "preparatoryStudy": "・予習：授業の前に概要をまとめた予習資料をMoodleにアップする。その中に、講義で予定しているテキストのページも明記しておくので、予習資料を参考に、テキストを読み、事前に予習しておくこと。・復習：授業終了後に、講義と演習問題・解答の資料をMoodleにアップする。講義資料を見ながらテキストを読み、演習問題をもう一度解いて、授業の復習をしておくこと。",
        "gradingGuidelines": "・毎回行う演習は講義時間内に解答と演習の解説についてフィードバックする。同じく中間演習では、終了後に解答と演習の解説をフィードバックする。・講義中に行う中間演習（40％）と期末試験（60％）の合計で成績を評価する。",
        "textbook": "森本雅之：”よくわかる電気機器第2版”，森北出版",
        "referenceMaterials": "天野耀鴻，乾茂里：”わかりやすい電気機器”，共立出版持永芳文，蓮池公紀：”電気機器学”，コロナ社",
        "courseSchedule": "第1回：電気機器:定義・特徴と電磁現象第2回：変圧器：動作原理とインダクタンス第3回：変圧器：理想変圧器の等価回路と鉄損を含んだ等価回路第4回：変圧器：等価回路定数測定（無負荷試験、短絡試験）第5回：電気機器：回転運動とトルク、三相交流による回転磁界第6回：誘導機：動作原理と構造、誘導機の特性パラメータ第7回：誘導機：静止時の等価回路と回転時の等価回路第8回：中間演習第9回：誘導機：特性（速度、トルク、負荷）と速度制御第10回：誘導機：インバータ・単相誘導機・同期機の原理と構造第11回：同期機：発電機の理論と性能指標第12回：同期機：永久磁石型同期機と各種同機器電動機第13回：直流機：原理・構造と特性式第14回：直流機：励磁方式と運転特性（始動、回転制御）",
        "courseDataUpdatedAt": "2025/01/07"
    },
    "updateAt": "2025/03/21"
}