{
    "lectureCode": "K603801",
    "courseName": "パワーエレクトロニクス",
    "lecturer": [
        "高木茂行(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木4"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義実験棟４０３"
    ],
    "courceDetails": {
        "courseOverview": "電源が供給あるいは送電されてくるエネルギーは必ずしもそのままでは利用に適しているわけではなく、パワーデバイスを使って電電圧・電流・周波数の形態を変換するパワーエレクトロニクスが不可欠となる。適切かつ損失の少ない電力変換を行うことで、電力の利用効率を格段に高めることができる。パワーデバイスの構造・特性と、これを使った電力変換回路について、企業で大容量半導体スイッチ電源の研究開発に携わった実務経験を踏まえた授業を行う実践的科目である。さらに、パワーエレクトロニクス回路は、直流モータや永久磁石同期モータの駆動制御に広く活用されている。とくに、永久磁石同期モータでは、ベクトル制御と呼ばれる手法により、回転数、トルクを任意にコントロールできるようになっている。パワーエレクトロニクス回路を使ったベクトル制御について学ぶ。",
        "outcomesMeasuredBy": "以下の項目を学習することにより、電気電子工学の基礎と電気電子工学の実学に基づく専門能力を習得する。さらに、講義で行う演習問題を通して、パワーエレクトロニクス分野の問題解決力と、回路設計ができる論理的な思考能力を習得することを到達目標とする。(1)ダイオード、トランジスタ、サイリスタ、MOSFET、IGBTといったパワーデバイスの構造と特性(2)交流を直流に変換する整流回路と位相制御回路の回路構成と動作(3)直流電圧を任意に変えるDC-DC変換器の回路構成と動作(4)直流から交流を発生させるインバータ回路の原理と動作。モータの駆動・制御に使われるPWMインバータの回路構成と動作(5)ベクトル制御の基本となる電圧方程式、座標変換、トルク方程式(6)ベクトル制御の回路構成と、実際の回転速度、トルク制御",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "・授業の基本的な進め方は、35分の講義後に15分の演習問題を行うとうアクティブラーニング形式で実施し、100分間に2回の講義と演習を行う。・パワーエレクロトロニクスが実際に使われている適用例と，それによりもたらさせた省エネ効果を示し，パワーエレクトロニクスの具体的イメージを説明する。・パワーエレトロニクスの回路と動作原理を説明し、回路について等価回路の抽出ついて説明する。・講義中に行う演習では、PCを使用する。",
        "notices": "・1年前期の電気回路Ⅰを受講・理解しておくこと。・関連科目である2年前期の電気磁気学、2年後期の電気機器は受講していなくても理解できるよう講義を進める。・パワーエレクトロニクスは電気電子工学の広い分野と関係しているので、半導体応用、電気電子回路、制御に興味がある学生にも有益な専門能力が得れる。",
        "preparatoryStudy": "・予習：授業の前に概要をまとめた予習資料をMoodleにアップする。その中に、講義で予定しているテキストのページも明記しておくので、予習資料を参考に、テキストを読み、事前に予習しておくこと。・復習：授業終了後に、講義と演習問題・回答の資料をMoodleにアップする。講義資料を見ながらテキストを読み、演習問題をもう一度解いて、授業の復習をしておくこと。",
        "gradingGuidelines": "・講義中に行う演習（40％）と中間・期末試験（60％）の合計で成績を評価する。・毎回行う演習は講義時間内に解答と演習の解説についてフィードバックする。同じく中間演習では、終了後に解答と演習の解説をフィードバックする。",
        "textbook": "高木茂行，長浜龍：”これでなっとくパワーエレクトロニクス”，コロナ社",
        "referenceMaterials": "髙木茂行編「エンジニアの悩みを解決パワーエレクトロニクス」小山純，佐藤良三，花本剛士，山田洋明：”パワーエレクトロニクス入門”，朝倉書店",
        "courseSchedule": "第1回：パワー・エレクトロニクスの概要第2回：パワーデバイスⅠダイオード，トランジスタ，サイリスタ第3回：パワーデバイスⅡMOSFET，IGBT，スイッチング損失第4回：整流回路と位相制御回路Ⅰ単相の整流回路と位相制御回路第5回：整流回路と位相制御回路Ⅱ三相の整流回路と位相制御回路第6回：DC-DC変換器ⅠDC-DC変換器の原理，降圧チョッパ第7回：DC-DC変換器Ⅱ昇圧チョッパ，昇降圧チョッパ第8回：中間演習第9回：インバータ回路Ⅰ単相インバータ第10回：インバータ回路Ⅱ三相インバータ第11回：インバータ回路ⅢPWMインバータ第12回：直流モータと永久磁石同期モータの特性第13回：永久磁石同期モータの位置検出第14回：ベクトル制御の基本式電圧方程式、トルク方程式、運動方程式",
        "courseDataUpdatedAt": "2024\/01\/10"
    },
    "updateAt": "2024\/09\/03"
}