{
    "lectureCode": "K604501",
    "courseName": "電波法規",
    "lecturer": [
        "鈴木昭浩(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義実験棟１０１"
    ],
    "courceDetails": {
        "courseOverview": "20世後半に急速に発達した無線技術は、近年、5G、無線LAN、Bluetoothなど利用範囲が広がり、社会生活に欠かせないものになっている。これに伴い、電波関連法規は電波の有効利用や電波の利用秩序を円滑に確保する上で、その重要性がますます高まっている。本科目では、電波を利用する際に必要となる法律の知識を習得し、プロの無線技士の資格である第一級陸上特殊無線技士および第一級海上特殊無線技士の国家試験合格レベルを目指す。また、電波の実際の利用例や、法令を理解するために必要な無線通信設備に関する技術的な基本事項についても解説する。",
        "outcomesMeasuredBy": "本授業科目では、本学の「６つのラーニングアウトカムズ」のうち、実学に基づく専門能力の習得を目指し、具体的には、第一級陸上特殊無線技士、第一級海上特殊無線技士の国家試験科目「法規」に合格可能なレベルまで、電波法令を理解することができることを目標とする。",
        "learningOutcomes": "実学に基づく専門能力",
        "teachingMethod": "プロジェクタによる投影を中心に対面での授業を行う。ノートPCは使用しない。",
        "notices": "必須ではないが、無線機器の構成や変調方式についての基礎知識があることが望ましい。",
        "preparatoryStudy": "予習：次回の講義で取り上げる項目と該当する教科書のページを指示するので、教科書を読んで事前学習する。復習：講義終了後、講義資料をアップするので、講義資料を見ながら教科書を読んで復習する。",
        "gradingGuidelines": "毎回の授業で実施する演習問題と、中間演習および課題レポートで評価を行う。・講義中に行う演習（30%）・中間演習および課題レポート（70%）演習やレポートに関するフィードバックは授業の中で実施する。",
        "textbook": "「よくわかる教科書電波法大綱」一般財団法人情報通信振興会",
        "referenceMaterials": "「無線従事者養成課程用教科書第一級・第二級・国内電信級陸上特殊無線技士法規」一般財団法人情報通信振興会「無線従事者養成課程用教科書第一級・第二級・レーダー級海上特殊無線技士法規」一般財団法人情報通信振興会",
        "courseSchedule": "第1回：総則(1)電波法令の体系、用語の定義等、電波法の概要について理解する。第2回：総則(2)電波法令の意義を確認するため、電波の実際の利用例について理解する。第3回：無線局の免許(1)無線局の免許に関する規定について、無線局の開設までの手続き等を理解する。第4回：無線局の免許(2)無線局の免許に関する規定について、無線局の開設以降の手続き等を理解するとともに、その他免許に関連する事項を理解する。第5回：無線設備(1)無線局の機能上の分類を理解するとともに、電波の質、送信設備よび受信設備の一般的条件について理解する。第6回：無線設備(2)付帯設備の条件について理解するとともに、無線設備の技術的条件について理解する。第7回：中間演習第1回から第6回までの演習を行う。第8回：無線従事者(1)無線設備の操作、監督の範囲等について理解する。第9回：無線従事者(2)無線従事者の免許の要件、試験制度等について理解する。第10回：無線局の運用(1)免許状記載事項の遵守等、無線局に共通の運用方法の規定について理解する。第11回：無線局の運用(2)一般通信方法等の規定について理解する。第12回：無線局の運用(3)海上局、陸上局等の運用方法の規定について理解する。第13回：監督等無線局に対する命令、検査等、監督に関する規定について理解する。第14回：雑則基準不適合設備に対する勧告や電波利用料等、電波法の雑則について理解する。※国際法規（国際電気通信連合憲章・国際電気通信連合条約）の概要について第14回で解説予定。※授業の状況により計画を変更する場合があるが、その際は授業の中で新たな計画を提示する。",
        "courseDataUpdatedAt": "2024\/02\/06"
    },
    "updateAt": "2024\/09\/13"
}