{
    "lectureCode": "K604001",
    "courseName": "プロセス工学",
    "lecturer": [
        "前田就彦(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金3"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義実験棟４０２"
    ],
    "courceDetails": {
        "courseOverview": "企業研究所において半導体デバイスの研究開発に従事した実務経験に基づき、現代のエレクトロニクスを支えている半導体集積回路や様々な半導体デバイスの製造プロセスについて、基本的なプロセス技術および半導体集積回路のこれまでの進展、さらに今後の技術展開の可能性などについて解説し、ともに考える実践的科目である。具体的には、ナノスケールにまで微細化された現代の集積回路がどのようにして製造されるのか、シリコン単結晶成長、イオン注入・熱処理プロセス、リソグラフィーによる微細加工、エッチング、成膜プロセス、平坦化プロセス等の一連のプロセスを、クリーンルーム環境やそれぞれの過程で用いられるプロセス装置、今後の技術動向を含めて学ぶ。また、集積回路のパッケージングまでを行う後工程プロセスにおいて、近年重要度を増しているワイヤレスボンディング技術や３次元実装技術などについても最近の技術動向を含めて学ぶ。この授業により、半導体集積回路や半導体デバイスの作製プロセスについての知識が身につき、得られた知識を基にしてナノデバイスが作製できるようになるための基礎的な能力が身につく。",
        "outcomesMeasuredBy": "本科目を習得することにより、半導体集積回路や様々な半導体デバイスの製造プロセスに関して、実学に基づく専門能力、理論的な思考力、問題解決力、電子工学の基礎力が身につく。具体的には下記のことができるようになる。・代表的な半導体デバイスの構造について説明できる。・半導体プロセスの流れ・概要について説明できる。・イオン注入、リソグラフィー、エッチングなどの重要プロセスについて説明できる。・パッケージングまでの後工程プロセスの概要や最近の技術動向について説明できる。・半導体プロセス、半導体産業の流れや最近の動向について説明できる。・作製したい構造のデバイスの作製プロセスを考案することができる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "プロジェクターと黒板を用いた講義形式で行い、適宜、演習を行う。",
        "notices": "本科目はいわば半導体産業の現場、ものづくりの実際についての学修という側面があるので、半導体に関する様々な知識や理解があることでより興味深く学修することができる。その意味で、電子物性、電子デバイス、電子回路IおよびII、集積回路などの科目を履修している／することが望ましい。",
        "preparatoryStudy": "授業は概ね教科書に沿って進めるので、受講前に該当項目を予習しておくこと。また、受講後にはレジュメおよび教科書を復習すること。なお、電子デバイスや電子回路などのこれまでの学修内容を振り返っておくと同時に、日頃から半導体産業について関心を持つようにすると、本科目の学修がより意義深いものとなる。",
        "gradingGuidelines": "演習（30%）と期末試験（70%）により評価する。",
        "textbook": "「半導体プロセスの基本と仕組み第4版」佐藤淳一著（秀和システム）",
        "referenceMaterials": "指定しない",
        "courseSchedule": "第1回：導入（半導体プロセスの歴史、半導体産業の流れ）第2回：集積回路の発明と発展微細化・高集積化の歴史と現在第3回：代表的な半導体デバイスの構造シリコン単結晶とシリコンウェーハ第4回：クリーンルームと半導体プロセスの概要第5回：洗浄・乾燥プロセス、イオン注入・熱処理プロセス第6回：リソグラフィープロセス第7回：これまでのまとめと復習第8回：エッチングプロセス第9回：成膜プロセス、成膜材料の最近の進化第10回：平坦化プロセス第11回：後工程プロセスの概要第12回：後工程プロセスの最近の進化第13回：半導体プロセスの今後の動向第14回：まとめ",
        "courseDataUpdatedAt": "2024/01/08"
    },
    "updateAt": "2024/09/03"
}