{
    "lectureCode": "K604901",
    "courseName": "電子回路演習II",
    "lecturer": [
        "前田就彦(工学部電気電子工学科)",
        "小原翔馬(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火5"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "講義実験棟４０３"
    ],
    "courceDetails": {
        "courseOverview": "電子回路IIの演習を行う。主に講義形式の電子回路IIでは、通信機器や音響機器、その他様々な電子機器で用いられているアナログ電子回路について学ぶ。具体的には、オペアンプ（演算増幅器）回路、発振回路、変調・復調回路、電源回路について学ぶ。授業では、電子回路Iで学んだトランジスタの基本的な増幅回路について復習した後、現代のアナログ電子回路設計において極めて重要なオペアンプの基礎と応用について学び、次に、コンピュータの動作信号や通信回路の基準信号等を発生させる際に基本となるＲＣ発振回路やＬＣ発振回路について学ぶ。また、音声信号などを伝送・受信する際に必要な変調回路・復調回路、さらに、電子機器内の電子回路を動作させるために必要な電源回路について学ぶ。電子回路演習IIにおいては、前記内容の演習に取り組むことにより、アナログ電子回路についての実践的な知識と理解、応用能力が身につく。",
        "outcomesMeasuredBy": "本科目を習得することにより、アナログ電子回路の理解や設計に関して、実学に基づく専門能力、理論的な思考力、分析・評価能力、問題解決力、電子工学の基礎力が身につく。具体的には下記のことができる実践的な能力が身につく。・トランジスタを用いた増幅回路を理解し、応用できる。・オペアンプ回路について理解し、応用できる。・発振回路について理解し、設計や応用ができる。・変調回路と復調回路について理解し、設計や応用ができる。・電源回路について理解し、設計や応用ができる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "電子回路IIの授業内容の演習に取り組む。解説はプロジェクターと黒板を用いて行う。",
        "notices": "本科目は受講の前提となる電子回路IIと併せて履修すること。",
        "preparatoryStudy": "電子回路IIの予習と受講を行うこと。電子回路IIの授業は概ね教科書に沿って進めるので、受講前に該当項目を予習しておくこと。その際には、各項目を学習する際に前提とされる基礎事項を理解していることを確認し、もし理解が不十分な基礎事項がある場合には、まずそれらを必ず振り返って学習・理解した上で予習と受講に臨むこと。また、講義と演習の受講後に復習も行うこと。",
        "gradingGuidelines": "演習（70%）とレポート課題提出（30%）により評価する。",
        "textbook": "指定しない",
        "referenceMaterials": "「よくわかる電子回路の基礎」電気書院堀桂太郎著ISBN978-4-485-30054-1「わかりやすい電子回路」コロナ社篠田庄司監修和泉勲編著宇田川弘著田丸雅夫著ISBN978-4-339-00781-7「電子回路シミュレータLTspice入門編」ＣＱ出版社神崎康宏著ISBN978-4-7898-3631-9",
        "courseSchedule": "第1回：導入（電気回路と電子回路、アナログ回路とデジタル回路）第2回：増幅回路（バイポーラトランジスタ、ＦＥＴ（電界効果トランジスタ））第3回：オペアンプの基礎第4回：オペアンプ増幅回路第5回：オペアンプフィルタ回路第6回：オペアンプ応用回路第7回：これまでのまとめと復習第8回：ＲＣ発振回路第9回：ＬＣ発振回路第10回：変調と復調第11回：振幅変調・復調回路第12回：周波数変調・復調回路第13回：電源回路第14回：まとめ",
        "courseDataUpdatedAt": "2024/01/08"
    },
    "updateAt": "2024/12/02"
}