{
    "lectureCode": "K6059",
    "courseName": "電気数学I",
    "lecturer": [
        "高木茂行(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０２"
    ],
    "courceDetails": {
        "courseOverview": "電気数学は、電気回路、発変電工学、送電システムからなるグリーンエネルギーおよびそれら関連分野を学ぶ上で基礎となる重要な科目である。電気数学では、電気回路、交流理論、波形解析、電磁気学の習得に必要な数学を電気数学Ⅰ及び電気数学Ⅱを通して修得する。本講義では先ず、行列と行列の演算及び行列を使った連立一次方程式の解法を学ぶ。続いて、電気数学の基礎となる三角関数、指数関数、対数関数について学び、複素数を使った交流の表記について理解する。さらに、これらの関数を使った微分・積分の具体的な計算方法について体得する。2年次前期の電気数学Ⅱで必要な数学基礎と、電気電子工学で使われる数学スキルを体得することが本講義の目的である。",
        "outcomesMeasuredBy": "電気数学で必要とされる以下の内容を修得する。(1)行列の演算、行列式、逆行列の計算ができる。(2)行列を使って連立一次方程式、回路方程式の解法できる。(3)三角関数、指数関数、対数関数の演算ができる。(4)複素数とフェーザの理解と演算ができる。(5)各種関数の微分と合成関数の微分、積の微分、商の微分、逆関数の微分ができる。(6)多変数関数の偏微分が求められる。(7)各種関数の積分と部分積分、置換積分の計算ができる。(8)定積分の計算と定積分を使った面積、平均値の計算ができる。",
        "learningOutcomes": "論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・授業の最初で、電気電子工学で、各単元の電気数学がどのように使われるかを説明し、学習の目的を明確化する。・授業の前半では、定義、基本公式、解き方、例題の順に40～50分で説明する。・後半の時間で、演習問題を解き、数学の理解を深める。・授業に先出ち予習の資料をアップする。従業終了後に、講義内容、演習問題の解答をアップする。",
        "notices": "・講義と演習を続けて行うので、予習行って聴講のポイントを決めておき、講義の時間に演習に必要な基本事項を修得する。",
        "preparatoryStudy": "・1年前期の線形代数、微分積分Ⅰ、電気回路Ⅰを受講・理解すること。・予習：授業の前に概要をまとめた予習資料をMoodleにアップする。その中に、講義で予定しているテキストのページも明記しておくので、予習資料を参考に、テキストを読み、事前に予習しておくこと。・復習：授業終了後に、講義と演習問題・回答の資料をMoodleにアップする。講義資料を見ながらテキストを読み、演習問題をもう一度解いて、授業の復習をしておくこと。",
        "gradingGuidelines": "・電気数学演習で、講義内容の演習を行う。演習後、解答および演習についての解説を行いフィードバックする。・中間試験については、解答及び解答に関する解説を行うとともに、成績を各自にフィードバックする。・中間試験（40%)および期末試験の結果（60%）の合計で成績を評価する。",
        "textbook": "これなら解ける電気数学著者髙木茂行、美井野優出版社コロナ社",
        "referenceMaterials": "・金原粲：”専門基礎ライブラリー電気数学”，実教出版・葛谷幹夫：”実用電気系学生のための基礎数学”，コロナ社",
        "courseSchedule": "第1回：2行2列の行列（演算・行列式）第2回：2行2列の行列（行列を使った1次方程式の解法）第3回：3行3列の行列（演算・行列式）第4回：3行3列の行列（行列を使った1次方程式の解法）第5回：三角関数の定義・定理と加法定理第6回：逆三角関数と正弦波第7回：指数関数と対数関数第8回：複素数第9回：中間演習第10回：複素数とフェーザ第11回：各種関数の微分第12回：多変数関数と偏微分第13回：不定積分第14回：敵積分と面積、平均値",
        "courseDataUpdatedAt": "2024\/01\/12"
    },
    "updateAt": "2024\/09\/13"
}