{
    "lectureCode": "K605304",
    "courseName": "創成課題[4]",
    "lecturer": [
        "関根謙一郎(片柳研究所)",
        "高木茂行(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月2",
        "金2"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟２０３"
    ],
    "courceDetails": {
        "courseOverview": "創成課題では、所属する卒業課題の指導教員の指導のもとに、研究課題を明らかにするための文献調査、卒業研究に必要な準備学習、およびそれらの討論会、成果発表会などを行う。課題の内容については研究室の中で提示され、必要に応じて学生間の共同作業となる「ものづくり」「解決策の発見」「実験検証による証明」などに取り組む。さらに、卒業課題に継続すること視野に入れて、基本技術や取組方法を学ぶ。また、分野ごとの研究に加え、業界・企業研究、自己分析を通じて社会人基礎力を醸成する。",
        "outcomesMeasuredBy": "卒業課題着手に向け、与えられた課題・条件、または、自らが設定した課題・条件に対し、論理的な思考能力を駆使して知恵とアイデアを出し、自分自身の解を見出すことができる分析・評価能力、問題解決力を身につける。それにより、実学に基づく専門能力の基礎を固め、具体的な研究テーマ決定後ただちに当該分野における調査・検証に着手できるようになる。また、企業研究と自己分析を行うことで、自分に適した職種や企業の選択ができるようになる。討論会や発表会などのグループワークを通じて他者との相互理解に基づく的確なコミュニケーションが図れるようになる。【実学に基づく専門能力、コミュニケーション能力、論理的な思考能力、分析・評価能力】",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "卒業研究で配属となった研究室の各教員が実施する。",
        "notices": "創成課題は卒業研究の準備であるため、自らの課題発見・課題解決能力を身につけることを基本とし、討論や発表を重視している。そのため、毎回、必ず出席する努力が重要である。やむを得ない理由で欠席の場合、担当教員に理由書を提出すること。授業計画に授業進行のガイドラインを示すが、具体的な実施計画・内容は担当教員毎に異なる。本授業は、週2コマ開講される（月曜5限・金曜2限、予備日：水曜4限）。",
        "preparatoryStudy": "創成課題の配属が決定されたら、速やかに指導教員の指示を仰ぎ、指示された準備を行うようにすること。また、授業内での討論や発表のために、授業時間外での取り組みが必要である。",
        "gradingGuidelines": "日頃の課題への取り組み姿勢・成果、研究室毎に実施される討論会や発表会での内容、各種提出物によって総合的に評価する。",
        "textbook": "必要に応じて指示する。",
        "referenceMaterials": "必要に応じて指示する。",
        "courseSchedule": "第1回：オリエンテーション(合同：研究室テーマ紹介等)第2回：オリエンテーション(合同：創成課題実施概要等)第3回：創成課題企画立案(調査あるいは研究の企画立案など)第4回：創成課題企画検討(調査あるいは研究の方向決め)第5回～9回：企画に沿った調査、実験、ハードウェア・ソフトウェア作成、業界・企業研究調査など第10回：中間検討会(進捗状況報告、内容検討)第11回～13回：企画に沿った成果物作成、問題解決、検証実験、業界・企業研究など第14回：最終発表会",
        "courseDataUpdatedAt": "2024/01/17"
    },
    "updateAt": "2024/12/02"
}