{
    "lectureCode": "K605101",
    "courseName": "電気電子工学実験II",
    "lecturer": [
        "新海健(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "月3",
        "月4",
        "月5"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "電気電子工学実験Iに引き続き、電気電子工学の基本技術から応用技術の導入を習得する。これまでの要素技術を中心とした実験だけでなく、複合的なシステムを取り扱うことで総合的な電気電子工学技術への入門とし、実学に基づく専門能力育成の基礎とする。対象として、（Ａ）電力・機器と（Ｂ）音声信号処理の大テーマをとりあげる。電力・機器では、電力系統、電力機器、電力輸送技術、パワーエレクトロニクス、モータ制御、プラズマ利用技術に係る実験を行う。音声信号処理では、アナログ信号処理、アナログ回路の実装、デジタル信号処理、シンセサイザーに係る実験を行う。複数のテーマで実験を行い、原理、法則、実験方法、計測方法、分析方法、レポートの作成方法について学び、論理的な思考力や分析・評価能力を身につける。また、コミュニケーションや問題解決力の育成を意図し、実験はグループワークで行う。",
        "outcomesMeasuredBy": "電気電子工学実験Iに引き続き、電気電子工学の基本技術から応用技術の導入を習得する。複合的なシステムを取り扱うことで総合的な電気電子工学技術への入門とし、実学に基づく専門能力育成の基礎とする。複数のテーマで実験を行い、原理、法則、実験方法、計測方法、分析方法、レポートの作成方法について学び、論理的な思考力や分析・評価能力を身につける。また、コミュニケーション能力や問題解決力の育成を意図し、実験はグループワークで行う。具体的には以下を到達目標とする。・電気や機械の危険を十分理解し安全に実験を進めることができる。・実験テキストに基づいてグループで分担して実験を進めることができる。・高電圧や大電流の測定器を正しく扱うことができる。・システム全体の挙動を分析評価することができる。・アナログ処理とデジタル処理の特徴を説明することができる。・半田付けも用いて簡単なアナログ回路実装ができる。・実験レポートを単独でまとめることができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力問題解決力",
        "teachingMethod": "グループで実験を行う。",
        "notices": "各実験前のガイダンスを良く聞き、安全には十分注意すること。このため、遅刻は認めない。実験レポートは期限までに提出すること。内容上不十分なレポートについては修正・再提出などの指示がありこれを満たしたレポートのみ正式に受理する。なお、第1回から第14回までの実験項目実施順序はグループ毎に異なるため、掲示等に注意すること。",
        "preparatoryStudy": "配布される各実験テキストの予習と復習を十分すること。",
        "gradingGuidelines": "実験レポートの提出と内容（60%）、実験中の質疑応答の内容（20%）、グループへの貢献度（20%）を基準に総合的に評価する。",
        "textbook": "テキストを事前に紙または電子媒体で配布する。",
        "referenceMaterials": "テーマ毎にガイダンス時に紹介する。",
        "courseSchedule": "第1回：（Ａ）電力・機器の実験概要と安全第2回：（Ａ）変圧器・ワイヤレス給電第3回：（Ａ）高電圧・大電流第4回：（Ａ）プラズマ第5回：（Ａ）パワーエレクトロニクス第6回：（Ａ）モータードライブ第7回：（Ａ）電力系統第8回：（Ｂ）音声信号処理のガイダンス第9回：（Ｂ）信号とフーリエ変換第10回：（Ｂ）フィルタと周波数第11回：（Ｂ）オペアンプによる音の増幅第12回：（Ｂ）AD変換、サンプリング定理第13回：（Ｂ）シンセサイザー第14回：（Ｂ）音声信号処理まとめ",
        "courseDataUpdatedAt": "2025/01/07"
    },
    "updateAt": "2025/03/21"
}