{
    "lectureCode": "K606601",
    "courseName": "制御工学",
    "lecturer": [
        "高木茂行(工学部電気電子工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "水"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０３"
    ],
    "courceDetails": {
        "courseOverview": "自動車、鉄道、バス、タクシーなどのモビリティでは自動運転に注目が集まっている。制御は対象とするものの振る舞いを望ましものにする操作である。自動運転は制御の集大成である。制御工学は、自動運転、半導体のプロセスコントロール、電力制御などあらゆる分野でキーテクノロジーとなっている。これまでは主に機械工学で取り上げらてきたが、制御に関するハードウェアはPLC、FPGA、1チップマイコン、A/D-D/A変換器と電気電子工学に関連する技術が多い。また、電気自動車や鉄道のモータコンロール、スマート―トグリッドのエネルギーコントロールなど電気電子工学部分野での重要性が高まっている。この講義では、制御の基礎となる伝達関数、ブロック線図、制御の安定といった制御の基礎を前半で学び、後半では実際の制御を通して、制御工学を習得する。",
        "outcomesMeasuredBy": "以下の項目について習得する。・システムと伝達関数・ブロック線図・システムの時間及び周波数応答・システムの安定性・実際の制御系として、PLCによるシーケンス制御、１チップマイコンによるPID制御、PCとA/D変換器によるフィードバック制御",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "・授業の基本的な進め方は、35分の講義後に15分の演習問題を行うとうアクティブラーニング形式で実施し、100分間に2回の講義と演習を行う。・電気機器が実際に使われている適用例を示し、それぞれの電気機器の具体的イメージを説明する。・電気機器の動作原理を説明し、等価回路の抽出ついて説明する。・講義時間内で簡単な演習を行い、動作原理、等価回路についての理解を深める。・講義中に行う演習では、PCを使用する。",
        "notices": "・1年前期の電気数学、微分積分Ⅰ・Ⅱを受講・理解しておくこと。・制御工学は電気電子工学の広い分野と関係しているので、半導体応用、電気電子回路、エネルギー工学に興味がある学生にも有益な専門能力が得れる",
        "preparatoryStudy": "・予習：授業の前に概要をまとめた予習資料をMoodleにアップする。その中に、講義で予定しているテキストのページも明記しておくので、予習資料を参考に、テキストを読み、事前に予習しておくこと。・復習：授業終了後に、講義と演習問題・解答の資料をMoodleにアップする。講義資料を見ながらテキストを読み、演習問題をもう一度解いて、授業の復習をしておくこと。",
        "gradingGuidelines": "・講義中に毎回行う演習と中間演習（50％）と期末試験（50％）の合計で成績を評価する。・毎回行う演習は講義時間内に解答と演習の解説についてフィードバックする。同じく中間演習では、終了後に解答と演習の解説をフィードバックする。",
        "textbook": "教科書は使用しない。",
        "referenceMaterials": "横山修一，濱根洋人、小野垣仁：”基礎と実践制御工学入門”，コロナ社太田有三：”制御工学”，オーム社岩井善太、石飛光章、川崎義則：”制御工学”",
        "courseSchedule": "第1回：制御とは第2回：ラプラス変換第3回：ラプラス変換演習第4回：システムと伝達関数第5回：ブロック線図第6回：ブロック線図と実際の制御（１）第7回：システムの時間応答第8回：中間演習第9回：システムの周波数応答第10回：システムの安定性第11回：実際の制御（２）シーケンス制御第12回：実際の制御（３）フィードバック制御第13回：実際の制御（４）PID制御第14回：システムの設計第15回：",
        "courseDataUpdatedAt": "2025/01/07"
    },
    "updateAt": "2025/03/21"
}