{
    "lectureCode": "L10101",
    "courseName": "リベラルアーツ特論[デジタルメディアの社会心理学]",
    "lecturer": [
        "鈴木万希枝(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟３０１"
    ],
    "courceDetails": {
        "courseOverview": "本講義は、さまざまな分野の多様な視点を学ぶ機会として少人数クラスで開講される「リベラルアーツ特論」の一つで、デジタルメディアと人々とのかかわり合いに対して人文科学の一分野である社会心理学からアプローチするものである。XやYouTube、Instagramをはじめとしたソーシャルメディア、デジタルゲームなどのデジタルメディアは、インタラクティブ性、没入感・臨場感、社会的相互作用といった点でテレビなどの伝統的メディアとは大きく異なる。そのためにエンターテーンメントから得る楽しみや他者との社会的相互作用、情報の拡散などにおいて、新たな現象が生じてきている。そこで、本講義では自己、社会的アイデンティティ、ステレオタイプといった社会心理学のキーワードを軸に個々人のデジタルメディア経験を読み解き、デジタルメディアの可能性と課題について考察を深める。その際、近年注目されるようになったポジティブ・メディア心理学の知見も紹介し、メディアのネガティブな影響だけでなく、ポジティブな影響についても積極的に検討してゆく。",
        "outcomesMeasuredBy": "リベラルアーツとは、古代ギリシャ・ローマ時代に起源をもち、人間の発想や思考を深めるための学問の総称である。近年では、現代社会の複雑に絡み合う社会的課題に取り組むために不可欠な「現代社会の教養」として重要視されるようになってきた。本講義でも、大きな時流を捉えて洞察力を高める、ただ一つの正解はない問題と向き合うための発想力を鍛えることを目指す。「デジタルメディアの社会心理学」では特に、急速に変化してゆくデジタルメディアが社会の中で生み出してゆく様々な可能性や新たに発現する社会的課題について、社会心理学的視点から自分なりに考察する力を養うことを目標とする。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義で各テーマに関連する社会心理学の概念や理論を学修したのち、それらの概念や理論を用いて各自が自らの経験や考え、あるいは今起きている社会の諸現象について自分なりの説明・考察を試みる。また、少人数で展開する「リベラルアーツ特論」の特性を活かし、ディスカッションによってデジタルメディアが人々に及ぼす影響や可能性について理解を深めてゆく。授業終盤では、最も関心のあるテーマを一つ選び、それまでの各自の説明・考察やディスカッションを踏まえて発展させ、最終発表を実施する。課題提出にはMoodleを利用する。ノートPC等、Moodleを利用できる環境を準備してくること",
        "notices": "・定員15名・知識習得にとどまらず、課題やディスカッションによって自分なりの思考を深める授業である。仮想現実やエンターテインメントのもつ可能性、ソーシャルメディアの影響などに興味があり、積極的に参加する学生を歓迎する・2年次前期開講「社会心理」を履修していることが望ましい・履修人数によって授業方法や授業計画は柔軟に変更する可能性がある",
        "preparatoryStudy": "予習：各講義回のテーマについて参考書や授業スライドを読んでおく。また、常日頃からデジタルメディアにかかわる社会的な現象に関心をもち、授業テーマに関連する資料や書籍を読むこと（100分程度）。復習：毎授業後に授業スライドや参考文献をもとに授業内容を振り返り、理解を深める。その上で、ディスカッションや最終発表に備えて授業で得た知識と自らの経験や社会現象を結びつけること（100分程度）。",
        "gradingGuidelines": "提出課題50%、授業への積極的な参加（ディスカッションでの発言、最終発表での質問など）10%、最終発表40%100点満点中60点以上が単位認定条件提出課題や最終発表に対するフィードバックは講義内で随時行う",
        "textbook": "指定しない",
        "referenceMaterials": "A.レイニーほか著，李監訳，ポジティブメディア心理学入門，新曜社，2023池田健一ほか著，社会心理学補訂版，有斐閣，2019",
        "courseSchedule": "第1回：イントロダクション第2回：デジタルメディアがもつポジティブな力（１）第3回：デジタルメディアがもつポジティブな力（２）第4回：ファン活・推し活とウェルビーイング（１）第5回：ファン活・推し活とウェルビーイング（２）第6回：デジタル空間における自己と他者（１）第7回：デジタル空間における自己と他者（２）第8回：メディア表象とステレオタイプ（１）第9回：メディア表象とステレオタイプ（２）第10回：デジタルメディアと世論形成（１）第11回：デジタルメディアと世論形成（２）第12回：最終発表準備第13回：最終発表第14回：最終発表",
        "courseDataUpdatedAt": "2025/01/07"
    },
    "updateAt": "2025/03/21"
}