{
    "lectureCode": "L10103",
    "courseName": "リベラルアーツ特論[楽器の物理と時々宇宙]",
    "lecturer": [
        "藤澤幸太郎(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟３０２"
    ],
    "courceDetails": {
        "courseOverview": "古代ギリシャ・ローマ世界に端を発し、総合的な知の錬成を目指したリベラルアーツは、中世のヨーロッパでは文法、修辞、論理の三科と、数学、音楽、幾何、天文の四科を合わせた自由七科として体系化された。自由七科の理念は近代以降の大学でも引き継がれ、現在の教養教育に至っている。本講義では、自由七科のうちの四科にあたる、数学、音楽、幾何、天文に焦点を当て、楽器や宇宙の物理を、数学や幾何を用いて学ぶ。具体的には、ギターやバイオリンなどの弦楽器、ピアノなどの鍵盤楽器、太鼓などの打楽器、フルート・クラリネット・サックスなどの木管楽器、トランペットなどの金管楽器の音が鳴る仕組みやその物理を扱い、音が鳴る仕組みを理解する事を目指す。また、時々宇宙物理も取り扱い、星の振動などに関しても学ぶ。講義では、楽器の音が鳴る仕組みや天体現象の解析や説明のために、高校までで学ぶ数学や物理、大学で学ぶ数学(線形代数、微分方程式)や物理(力学など)を使うが、その厳密な理解や予備知識は求めない。重要なのは、楽器や宇宙に関する理解を深めることであるので、数学や物理が未履修や苦手であっても問題ない。楽器の物理と時々宇宙を理解する気持ちや興味があることが最も大切である。音楽が好きだったり楽器の経験があったりすると何倍も面白くなると思うので、音楽や楽器への関心がある人を歓迎する。もちろん、数学や物理の知識があれば理解はより深まるので、楽器の物理を通じてしっかりと物理を勉強したい人も歓迎である。取り扱うトピックは、弦楽器・鍵盤楽器・打楽器・星・木管楽器・金管楽器などを考えているが、受講者の興味に合わせて変更していく予定である。",
        "outcomesMeasuredBy": "本講義では、以下の到達目標を設定する。1.弦楽器と鍵盤楽器に関して、その音が鳴る仕組みを理解して説明できる。2.打楽器に関して、その音が鳴る仕組みを理解して説明できる。3.木管楽器に関して、その音が鳴る仕組みを理解して説明できる。4.金管楽器に関して、その音が鳴る仕組みを理解して説明できる。5.そのほかの振動現象に関しても、理解を深める。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本講義では、主にスライドを用いる講義形式で進めていくが、楽器演奏や議論なども織り交ぜながら行う。また、簡単なプログラムを実行したり音声を再生したりするので、各自ノートPCを持参すること。",
        "notices": "講義に関する予備知識は特に問わない。これまで物理や数学を履修していなくても良いし、苦手であっても良い。講義では、専門用語や計算式などが出てくるので、教科書や授業資料をよく読んで復習し、興味があるものはさらに調べてみることも重要である。また、様々な楽器を取り扱うので、日頃から様々な楽器に興味を持って接してみる、可能であれば演奏してみることが理解の向上につながるはずである。積極的に色々な楽器に取り組んでみると良い。授業では楽器演奏や議論などを織り交ぜながら行うので、履修人数は25名までとする。",
        "preparatoryStudy": "予習：教科書や授業資料を利用し、専門用語や内容を確認しておくこと。復習：授業終了後は、もう一度教科書や授業資料を復習し、よく分からない部分をふりかえり理解を深めるようにすること。",
        "gradingGuidelines": "レポート課題（100%）で評価する。レポートはMoodleを通じてフィードバックを行う。",
        "textbook": "「音響入門シリーズA-5楽器の音」コロナ社日本音響学会編ISBN978-4-339-01311-5",
        "referenceMaterials": "「新版楽器の音響学」音楽之友社安藤由典ISBN978-4276123113「楽器の物理学」丸善出版N.H.フレッチャー(著),T.D.ロッシング(著),岸憲史(翻訳)ISBN978-4-621-06569-3「振動と波動」東京大学出版会吉岡大二郎ISBN978-4-13-062607-1「宇宙流体力学の基礎改訂版(宇宙物理学の基礎)」日本評論社福江純ほかISBN978-4-535-78985-2",
        "courseSchedule": "第1回：ガイダンス第2回：振動の基礎1第3回：振動の基礎2第4回：楽器の構造と発音機構第5回：弦楽器・鍵盤楽器・打楽器1第6回：弦楽器・鍵盤楽器・打楽器2第7回：弦楽器・鍵盤楽器・打楽器3第8回：星の振動第9回：木管楽器1:第10回：木管楽器2:第11回：金管楽器1第12回：金管楽器2第13回：様々な楽器と振動現象1第14回：様々な楽器と振動現象2",
        "courseDataUpdatedAt": "2025/01/21"
    },
    "updateAt": "2025/03/21"
}