{
    "lectureCode": "L20101",
    "courseName": "表象文化論[木1]BSES",
    "lecturer": [
        "関大聡(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "応用生物学部応用生物学科,工学部機械工学科,工学部電気電子工学科,工学部応用化学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ３０２"
    ],
    "courceDetails": {
        "courseOverview": "「この作品はフィクションです。」この種の注意書きは、今日あらゆるジャンルの作品（小説、ドラマ、アニメ、漫画、映画など）に見受けられます。そのメッセージはシンプルで、私たちはフィクション、つまり虚構の世界を、現実とは異なるもの、混同してはいけないものとして受け止め、鑑賞しているわけです。しかし、次のような疑問が浮かんできます。「そもそもフィクションとは何なのだろう？」「もしそれが現実と異なるものでしかないのなら、フィクションを鑑賞することには、どんな意味があるのだろう？」「それは現実や社会に対する私たちの関係に、どんな仕方で介入するのだろう？」……こうした問いに答えるのは決して簡単ではありません。この授業では、フィクションをめぐる自明性、つまり一見すると当たり前のように私たちの身の回りに存在するという性格を剥ぎ取って、以上のような問いに皆さんを導くことを目指すものです。日常的で当たり前の存在に思えるからこそ、フィクションとの関係を問い直すことは、個々の鑑賞体験の質にも影響を及ぼします。講義の前半では「フィクション論」と呼ばれる学問分野の基本的な問題構成を学びます。フィクションの存在論的ステータス（フィクションとはどのような存在なのか）や、その機能（私たちの認知、想像、共感、道徳性にどう働きかけるか）を、さまざまな立場を紹介しながら考えます。抽象的な議論も多いですが、自分の鑑賞体験に結び付けて考えれば具体的に理解することは可能です。後半では、フィクション作品を通して現実を理解する可能性について、具体的な作品（映像含む）を取り上げながら考えていきます。フィクションはしばしば、政治、植民地、人種差別、ジェンダーなど、現実で起きている事柄、社会問題、政治的課題について問いかけます。現実世界を「フィクションを通して」理解することには、どんな可能性と限界があるのでしょうか。こうした諸点の検討からフィクションとの付き合い方を考えていきましょう。",
        "outcomesMeasuredBy": "前半ではフィクション論やそれに関係する学際的なアプローチを扱うことで、フィクションへの多角的な視点、論理的な思考方法を学びます。後半に扱うのは文学作品ですが、その映画版も併用します。いわゆる古典の地位を得た作品を扱うため、大学生の国際的教養として、基礎的な読み方、見方をぜひ身につけてください。また、これらの作品は、古典であると同時に、政治やセクシュアリティ、人種など、現代的な課題を扱った作品でもあります。そうした作品を自主的に読み解くことで分析・評価能力を養うことも、本講義の重要な目標になります。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "基本的に講義形式で進めます。それを踏まえて復習や文章の読解を行い、Moodleを用い隔週で課題を提出してください。学期中の課題に対するフィードバックは授業の冒頭に振り返りとして行います。",
        "notices": "履修の前提条件などは特にありません。授業時の文献紹介に応じて、積極的に読書や鑑賞体験を深めることを強く推奨します。",
        "preparatoryStudy": "予習：授業後半には具体的な作品を扱うため、早いうちから小説またはその映画版を事前鑑賞することを求めます（映像の場合各作品120分程度）。復習：隔週で授業内容の理解、作品の解釈を求めるミニペーパーの提出が課されます（目安60～90分程度）。",
        "gradingGuidelines": "学期中に隔週で課される提出課題（ミニペーパー）（40%）と期末レポート（60%）により総合的に評価し、全体の六割以上を合格（単位認定）とします。ミニペーパーでは、授業内容の理解および授業中に説明したテクストの読解を求めます。これらの課題は、Moodleで提出してもらい、授業内またはMoodleを通してフィードバックを行います。",
        "textbook": "指定なし。",
        "referenceMaterials": "フィクション論の概要については、以下の書が参考になります。ジャン＝マリー・シェフェール『なぜフィクションか？ごっこ遊びからバーチャルリアリティまで』久保昭博訳、2019年、慶応義塾大学出版会後半に扱う作品とその映像版は以下です。アルベール・カミュ『異邦人』／映画『異邦人』（ルキノ・ヴィスコンティ監督）ジョージ・オーウェル『動物農場』／アニメ映画『動物農場』（ハラス＆バチェラー監督）アニー・エルノー『嫉妬／事件』／映画『あのこと』（オードレイ・ディヴァン監督）リチャード・ライト『ネイティヴ・サン／映画『ネイティヴ・サン』ラッシード・ジョンソン監督）",
        "courseSchedule": "第1回：フィクションとは何か？ショート・イントロダクション第2回：フィクションはどのように考えられてきたのか――プラトンから現代まで第3回：フィクションは私たちに何をもたらすのか――認知科学的アプローチ第4回：想像力と共感力――フィクションのモラルについて第5回：科学とフィクション――仮説形成からサイエンス・フィクションまで第6回：歴史とフィクション――歴史小説から修正主義まで第7回：日常化するフィクション――フェイク・ニュースとフィクション第8回：中間まとめと後半へのイントロダクション第9回：表象の政治性――フィクションは世界のどんな「鏡」か第10回：民主主義の寓話（ジョージ・オーウェルの『動物農場』）第11回：植民地主義を読む（アルベール・カミュの『異邦人』）第12回：人種差別を描く／語る（リチャード・ライト『ネイティヴ・サン』）第13回：ジェンダーと自伝・日記（アニー・エルノー『事件』）第14回：講義のまとめ：フィクションとノン・フィクション――境界線を考える",
        "courseDataUpdatedAt": "2024/01/31"
    },
    "updateAt": "2024/12/09"
}