{
    "lectureCode": "L20202",
    "courseName": "音楽文化論[木2]CSMS",
    "lecturer": [
        "大山昌彦(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "メディア学部メディア学科,コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ３０３"
    ],
    "courceDetails": {
        "courseOverview": "現在、私たちはさまざまな音楽に囲まれて生活しています。さまざまな音楽は「身近」でありながらも，作られた時代や場所を考えると，実は「遠い」存在であったりします．音楽は「作る／作られる」だけでなく「伝えられる」社会的な作用によって「身近」になっているといえるでしょう。この授業では，西洋における音楽文化を例に，作られ伝えられるプロセスの変化を，歴史的に検討することで，みなさんの「楽しい」文化的生活の経験から，現代文化ヘの理解を深めることを目的としています。西洋に注目する理由は、世界の音楽文化は程度の差はあれ、西洋の音楽文化に少なからず影響を受けているためです。主に文化人類学的な視点を用いて西洋を相対化しながら，非西洋も含めた広汎な現代の音楽文化の成り立ちを，「テクノロジー」，「制度」，「美学」という3つの側面に注目して授業を進めていきます。",
        "outcomesMeasuredBy": "音楽文化の特徴を、3つの側面から理解し説明できること。多様な音楽のあり方を、好き嫌いを超えて理解・評価できること。自分の音楽経験を見つめ直し、現代文化への理解を深めること。",
        "learningOutcomes": "国際的な教養コミュニケーション能力論理的な思考力",
        "teachingMethod": "講義を中心に行います。必要に応じて音声・映像資料を鑑賞することもあります。なお、授業で使用する資料（穴埋めになっています）は、Moodle上の授業ページで授業前にアップロードします。また、授業に集中してもらうために、電子機器の使用のルールを設けます。SNSなど授業とは無関係な利用は厳禁とします。詳細は初回の授業で説明します。受講する場合は、このルールを厳守して下さい。",
        "notices": "受講者数制限をする場合があります。第1回では、授業の進め方その他注意事項を説明します。",
        "preparatoryStudy": "予習：毎回の講義で提示された次回のキーワードの内容を調べます。その際分からない言葉などがあればその都度調べ、自分の言葉で説明できるように準備して下さい。復習：授業の冒頭で出した「問い」に対して自分なりの答えを書いて下さい。特にキーワードは、調べた内容を授業の内容を踏まえて修正をしてみましょう。自分の好きな音楽の歴史や文化的背景を調べてまとめておくと良いです。",
        "gradingGuidelines": "小テスト（20％）レポート（2回）（30％）と期末試験（50％）で採点し、合計60％未満を不可とします。授業で示した事象と概念を正確に理解し、レポートなどで表現できるようにしましょう。小テストおよび課題のフィードバックは､講義中に行う予定です。加点要件は授業中もしくは授業後の質問や意見です。積極的に授業に参加しましょう。",
        "textbook": "指定しません。",
        "referenceMaterials": "主なものは以下の通りです。細川周平,990,『レコードの美学』,勁草書房増田聡・谷口文和2005『音楽未来形』,洋泉社東谷護編著,2004,『ポピュラー音楽へのまなざし』,勁草書房大山昌彦ら著，2016，『ミュージク・メディア』，コロナ社永冨真梨ら著，2023，『クリティカル・ワードポピュラー音楽』，フィルムアート社、など。",
        "courseSchedule": "第1回：授業の概要と履修に関する説明第2回：楽譜の発展と著作権の登場（1）第3回：楽譜の発展と著作権の登場（2）第4回：楽譜の発展と著作権の登場（3）第5回：音と複製技術の諸相と音楽文化の変化（1）第6回：音と複製技術の諸相と音楽文化の変化（2）第7回：音と複製技術の諸相と音楽文化の変化（3）第8回：音と複製技術の諸相と音楽文化の変化（4）第9回：音と複製技術の諸相と音楽文化の変化（5）第10回：現代音楽文化における生産と消費（1）第11回：現代音楽文化における生産と消費（2）第12回：現代音楽文化における生産と消費（3）第13回：現代音楽文化における生産と消費（4）第14回：まとめ",
        "courseDataUpdatedAt": "2024\/02\/23"
    },
    "updateAt": "2024\/09\/13"
}