{
    "lectureCode": "L20401",
    "courseName": "哲学[木1]CSES",
    "lecturer": [
        "山中健義(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科,工学部機械工学科,工学部電気電子工学科,工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ４０２"
    ],
    "courceDetails": {
        "courseOverview": "この授業では、西洋哲学史における代表的な哲学者たちを取り上げ、彼らの根本的な問い、問いへのアプローチの仕方、解決策などを紹介しながら、哲学の基本的な考え方や思想内容を学ぶとともに、授業全体を通して哲学とはどのような学問なのかを考えていく。具体的には4名の哲学者を取り上げ、内容毎に資料を配布し、資料内容に沿った解説を行う。資料は主に平易な文章で書かれた初学者向けの入門書・解説書等を用いる。また、内容に関連する哲学作品や哲学書の翻訳等も配布する。授業ではとくに、哲学者たちの学説や概念をただ羅列するだけの単なる内容紹介に終始するのではなく、哲学者たちの思考の道筋をたどり、それを追体験しながら受講者自身が「自ら考える」ことを実践することを目指す。これらを通じて、哲学とはどのようなものかを体験し、哲学への理解を深めてもらうことがこの授業の狙いである。",
        "outcomesMeasuredBy": "西洋哲学史における各哲学者の基本思想とその哲学的思考の道程、ならびに本当の意味での哲学を理解すること、そしてあらゆる物事について自ら根源的に考える哲学的思考力を養うことを目標とする。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "パワーポイントによる講義形式。事前に配布する資料の内容に沿って解説していく。配布資料はMoodleから各自でダウンロードしておくこと（紙媒体での資料配布は行わない）。またリアクションペーパーの提出を複数回求める予定である。授業ではMoodleを使った参加型の問いかけを行うこともある。ノートPC必携。",
        "notices": "履修希望者は必ず初回の授業に出席すること。授業中の私語は厳禁。予備知識は必要ないが、哲学の性質上、抽象的な議論も多いため、高い集中力と粘り強い思考力が求められる。具体例なども交えたできるだけ分かりやすい解説を行うが、授業内容を理解するためには毎回きちんと出席し、授業時間外も含めて、何とか理解しようという積極的な取り組みが必要となることを留意したうえで履修すること。",
        "preparatoryStudy": "予習：配布資料を事前に熟読しておく。（60～90分程度）復習：配布資料、ノートやメモなどを見直しながら授業内容をよく振り返る。そのうえで配布資料をもう一度じっくりと読み直し、理解を深める。（90～120分程度）",
        "gradingGuidelines": "成績は期末試験（80点）とリアクションペーパー（20点）の合計点で評価する。100点満点中60点以上で単位認定とする。リアクションペーパーについては授業内で全体に対するフィードバックを行う。",
        "textbook": "指定しない。その都度資料を配布する。",
        "referenceMaterials": "納富信留『プラトンとの哲学－対話篇をよむ』岩波書店、2015年津崎良典『デカルトの憂鬱－マイナスの感情を確実に乗り越える方法』扶桑社、2018年御子柴善之『自分で考える勇気―カント哲学入門』岩波書店、2015年池田喬『ハイデガー『存在と時間』を解き明かす』NHK出版、2021年その他、授業内で適宜紹介していく。",
        "courseSchedule": "第1回：ガイダンス、イントロダクション第2回：ソクラテス（1）：「哲学」という「生き方」第3回：ソクラテス（2）：「対話」の哲学第4回：ソクラテス（3）：魂への配慮第5回：デカルト（1）：コギトへの「旅」第6回：デカルト（2）：絶対に疑えないもの・コギト命題第7回：デカルト（3）：デカルトの「懐疑」第8回：カント（1）：コペルニクス的転回第9回：カント（2）：「普遍性」の問題第10回：カント（3）：「認識に対象が従う」の意味第11回：ハイデッガー（1）：「存在への問い」とは何か第12回：ハイデッガー（2）：「世界内存在」について①第13回：ハイデッガー（3）：「世界内存在」について②第14回：まとめ",
        "courseDataUpdatedAt": "2025/01/07"
    },
    "updateAt": "2025/03/21"
}