{
    "lectureCode": "L20502",
    "courseName": "心理学[木2]BSMSES",
    "lecturer": [
        "沼田真美(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "応用生物学部応用生物学科,工学部機械工学科,工学部電気電子工学科,工学部応用化学科,メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ４０３"
    ],
    "courceDetails": {
        "courseOverview": "心理学には，こころのメカニズムの解明を目指す基礎的な側面と，心理学の知識や方法を用いて実生活に役立てようとする応用的側面とがあります。研究対象や方法によって，学習心理学，社会心理学，臨床心理学等のさまざまな領域に分類されています。このように，心理学は多様な側面をもつ学問です。この授業では，心理学全般の基本的知見と理論とを概観します。講義を通して，心理学がどのような学問であるかについての理解を得ることが目的です。",
        "outcomesMeasuredBy": "(1)心理学の全体像を理解し，説明できるようになること(2)心理学の主要な領域の特徴を理解し，説明できるようになること(3)授業で学んだ知識から人を理解し，日常生活に活かせるようになること",
        "learningOutcomes": "国際的な教養コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "授業では，講義を中心とし，実際に心理学の研究で用いられている心理テストや簡単な実験・調査を用いて心理学に対する理解を促すよう，分かりやすい授業を心がけます。Moodleを用いて，講義の質問や疑問について訊ねられる機会を設けます。翌週冒頭にて匿名にて回答を紹介・解説を予定しています。学生自らの主体的な学び（アクティブラーニング）を促します。※レジュメ等の資料配布および課題提出先はMoodle上を予定しているため、毎回PC持参を推奨します（初回授業で説明）",
        "notices": "大学生に求められる行動を遵守するように求めています。具体的には，以下の通りです。講義への積極的な参加を求めます。(1)講義中の私語厳禁(2)講義に関係ない理由での携帯電話・スマートフォンの利用不可(3)理由のない遅刻や欠席は厳粛に対処",
        "preparatoryStudy": "授業中に伝えられることはごく一部なので，参考図書等で知識を補ってください。予習・復習に関して、Moodle上の配布資料を参考にしてください（必要時間数は、予習・復習時間を合わせて授業時間と同等程度です）",
        "gradingGuidelines": "成績は，小課題の評価分（40％）と学期末試験の評価分（60％）に基づき、総合的に判断の上、100点満点中60点以上で単位取得となります。試験では，心理学の基礎知識，特に専門用語について問います。詳細は初回授業で説明します。",
        "textbook": "指定しない",
        "referenceMaterials": "はじめて出会う心理学改訂版有斐閣アルマISBN:9784641123458カラー版徹底図解心理学―生活と社会に役立つ心理学の知識新星出版社ISBN:9784405106758心理学検定基本キーワード集日本心理学諸学会連合検定局実務教育出版ISBN:9784788960831",
        "courseSchedule": "第1回：心理学とは心理学の全体像・多様な心理学の領域と心理学の歴史第2回：行動と学習の心理学学習の理論・学習される行動・学習のしくみ・条件づけと人間行動第3回：知覚と認知の心理学知覚の理論・メタ認知・錯覚を体験してみよう第4回：記憶の心理学記憶の理論・記憶のしくみ・実験を体験してみよう第5回：感情と動機づけの心理学感情の理論・感情の分類・動機づけ第6回：パーソナリティの心理学パーソナリティの理論と分類・パーソナリティを測定してみよう第7回：社会の中の心理学１社会的スキル・社会的影響第8回：社会の中の心理学2他者による心理的影響・応諾獲得方略第9回：社会の中の心理学3同調行動・服従とは第10回：集団の中の心理学集団の理論・集団内で起こる現象・リーダーシップを測定してみよう第11回：発達心理学１発達の理論・遺伝か環境か第12回：発達心理学2生涯発達・母子関係・愛着理論第13回：ストレスとメンタルヘルスストレスを乗り越えるために第14回：カウンセリングと心理療法心の病について・心理療法の基本的な考え方",
        "courseDataUpdatedAt": "2025/03/18"
    },
    "updateAt": "2025/03/21"
}