{
    "lectureCode": "L20502",
    "courseName": "心理学[月2]",
    "lecturer": [
        "高濱祥子(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義実験棟４０３"
    ],
    "courceDetails": {
        "courseOverview": "「心理学」の授業では、私たちの心の働きを科学的に明らかにしようとする学問としての心理学の考え方を認識しながら、自己理解および他者理解を深めるための人間理解の基礎的な考え方を身につけていきます。具体的には、(1)人間とは何か、心の働きとは何かということを考えながら、「科学としての心理学」の位置づけを認識します。(2)臨床心理学(ストレス、カウンセリング、性格)、発達心理学(発達理論、発達段階ごとの心の働き)における基礎知識を学び、心と行動の多様性について理解を深めます。(3)実験心理学(感覚・知覚、認知、記憶、学習、思考)における基礎知識を通して、心と行動の一般的法則を学びます。(4)心理学が辿ってきた歴史的な流れを振り返り、現在の心理学・未来への展望と周辺の学問領域との関わりを、具体的な事例に基づいて考ながら、社会における心理学の役割について認識します。",
        "outcomesMeasuredBy": "心理学は、人文科学・社会科学・自然科学分野の学問領域と相互に影響しあい、人々の生活(社会)との結びつきの中で発展しています。このような広い視野を持つことによって、「国際的な教養」としての心理学を理解しましょう。科学の一領域である心理学における知見、およびその発見に至る過程を理解することによって、「論理的な思考力」を養います。また、心の働きを測定するための心理学の研究方法(実験、調査、検査など)を学ぶことで「分析・評価能力」を培います。さらに、私たち自身の心の働きを理解することによって、社会の一員として暮らすための「コミュニケーション能力」を養い、自己理解と他者理解に役立てます。これらを通して、心理学的視点に立脚する「問題解決力」の重要性を認識し、理解を深めます。",
        "learningOutcomes": "国際的な教養コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義形式で授業を行います。また、各授業回の終わりに、リアクション・ペーパーの提出を求めます。授業回によっては、授業内容確認課題を実施したり、復習課題を出題することもあります。授業内容に関する質問や疑問は、授業前後に直接受けます。ノートPCなど、Moodleを利用できる環境を準備してください。",
        "notices": "著作権や倫理的観点から、授業に関連する資料をWebページやSNS等に掲載することはお控えください。",
        "preparatoryStudy": "予習として、各授業回の配布資料に目を通しておいてください(例:30分)。復習時に各授業回の配布資料およびメモを確認のうえ復習課題を行い、提出してください(例:90分)。予習と復習の時間配分を目安としてお示ししていますように、復習を重視することをお勧めします。",
        "gradingGuidelines": "成績評価は、リアクション・ペーパーと授業内容確認課題(15%)、復習課題(25%)、期末試験(60%)とします。単位認定条件は、100点満点中60点以上です。課題および期末試験に対するフィードバックは、授業内またはMoodleを通じて行います。",
        "textbook": "指定しません。授業資料を配布します。",
        "referenceMaterials": "授業中に適宜紹介します。深く学びたい方には、心理学・心理学概論に関する書籍(例:サトウ・渡邊著『心理学・入門改訂版』有斐閣アルマ、長谷川ら著『はじめて出会う心理学第3版』有斐閣アルマ、武藤ら著『心理学新版』有斐閣)、心理学に関する事典・辞典をお勧めします(例:『誠信心理学辞典新版』、『有斐閣現代心理学辞典』)。",
        "courseSchedule": "第1回：科学的心理学とは(心理学とは、心理学の対象と範囲、心理学の周辺領域など)第2回：心の適応と臨床(心の健康とストレス、カウンセリングとはなど)第3回：性格(1)(性格とは、性格に関する研究の歴史、性格の理論など)第4回：性格(2)(健康と性格、性格のアセスメントなど)第5回：発達(1)(遺伝・環境論争、ピアジェの認知発達理論、エリクソンの心理社会的発達理論など)第6回：発達(2)(発達段階ごとの心の働きの特徴、発達障害児・者および高齢者とその支援など)第7回：感覚と知覚(色を見るしくみ、錯視など)第8回：認知(1)(文脈効果、カクテルパーティ効果、視覚探索など)第9回：認知(2)(記憶の時間的過程、日常記憶、問題解決など)第10回：学習(学習とは、レスポンデント条件づけ、オペラント条件づけ、観察学習など)第11回：動機づけと情動(内発的動機づけ、欲求不満とその解消、情動と表情など)第12回：脳と心(脳の働きを知る方法、脳の機能と障害など)第13回：心理学の歴史・現在・未来と心を測ること(心理学の歴史、心理学の今後の展望、心理学測定法など)第14回：自然科学領域と心理学の関わり(メディアと心理学、食品と心理学、化粧と心理学、人工知能と心理学、サステイナブル工学と心理学など)",
        "courseDataUpdatedAt": "2024/02/23"
    },
    "updateAt": "2024/08/07"
}