{
    "lectureCode": "L20702",
    "courseName": "歴史学[木2]BSMSES",
    "lecturer": [
        "井上直子(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "応用生物学部応用生物学科,工学部機械工学科,工学部電気電子工学科,工学部応用化学科,メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ５０２"
    ],
    "courceDetails": {
        "courseOverview": "この授業は、歴史学の考え方を学ぶことを目的としています。学校や塾、博物館、メディア、エンタメなどさまざまな場面で、私たちは過去の出来事に触れ、「歴史」として捉えます。そこで私たちは過去についてどのように捉え考えるでしょうか。この授業では、これまでのみなさんの「歴史」の学びを捉え直し、過去について考察・分析する方法論について考えていきます。具体的には、教科書で取り上げられるようなトピックがこれまで日本においていかに研究されてきたか、その視点と方法の変遷をたどります。ここでは、どんなトピックが取り上げられてこなかったのか、という問いとそれへの格闘も含みます。それにより、新資料の発見にとどまらず、歴史を分析する視角も相俟って歴史研究が進んできたことを確認し、私たちの歴史の捉え方、考え方について考えを深めていきます。そのときどきの社会状況にも影響を受けながら私たちは歴史を見出し振り返っていることに気づくでしょう。この授業を通して、歴史学の捉え方・考え方に触れ、多角的に歴史、そして現代社会を読み解く力を磨き合えることを期待します。",
        "outcomesMeasuredBy": "・歴史学のなかで培われてきた考え方、方法論を理解することができる。・歴史学の考え方についておさえることで、歴史と社会について相対化し考えることができる。歴史学的な観点から過去、そして現代社会を捉えることができる。・歴史学の考え方もふまえ、過去、そして現代社会について、自分なりに考察することができる。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "授業は講義形式です。授業ではコメントペーパーを提出していただきます。授業中に、一部となってしまいますが紹介しますので、コメントペーパーを通して受講生の皆さんと意見交流をし、学びを深めていきましょう。ノートPCは使用しません。",
        "notices": "私語厳禁。",
        "preparatoryStudy": "・予習：各回のテーマと質問について、自分なりに考え、関連する本・論文を調べ読みましょう。事前配布資料があればそれを読み、考えをまとめてきましょう。・復習：提出したコメントペーパーと質問に対する答えを振り返り、授業資料や参考文献・論文をもとに各回のテーマをまとめ直しましょう。関連するテーマの文献・論文を読み、理解と自身の考えを深めましょう。",
        "gradingGuidelines": "上記「到達目標」３点の達成度を以下の方法で評価します。コメントペーパー40%期末テスト60%授業内でフィードバックを行ないます。",
        "textbook": "指定なし。",
        "referenceMaterials": "永原慶二『20世紀日本の歴史学』（吉川弘文館、2003年）成田龍一『近現代日本史と歴史学』（中公新書、2012年）ソニア・Ｏ・ローズ著、長谷川貴彦・兼子歩訳『ジェンダー史とは何か』（法政大学出版局、2017年）小田中直樹『歴史学のトリセツ』（筑摩書房〔ちくまプリマ―新書〕、2022年）ほか、各回の授業資料に記載します。授業資料は授業時間中に配布します。",
        "courseSchedule": "第1回：ガイダンス／資料とはなにか：どのように過去の出来事を知るの？第2回：日本史の教科書を見比べる：私たちはどう歴史を学んできたか？第3回：戦後歴史学と民衆史：“歴史学の考え方”にも歴史がある！第4回：くらしの歴史、技術の歴史：「わざ」の歴史を知るには？第5回：郷土史と地方史、そして地域史：なぜ地域の歴史が大事なの？第6回：大学の地・八王子から考える：身近な場所の歴史を知ろう！第7回：農村と都市：なぜその地域の歴史を知りたいの？第8回：女性史と地域女性史：資料が少ないと歴史は書けない？第9回：言語論的転回と歴史学：なにを歴史・資料とみなしてきたの？第10回：男性史とジェンダー史：ジェンダー史って女性の歴史じゃないの？第11回：セクシュアリティの歴史：「個人的なこと」に歴史ってあるの？第12回：グローバル・ヒストリー：地球規模で歴史と社会を考えるには？第13回：まとめ①歴史学の考え方とは第14回：まとめ②みなさんのコメントペーパーから歴史学の考え方を学ぶ",
        "courseDataUpdatedAt": "2025/03/18"
    },
    "updateAt": "2025/03/21"
}