{
    "lectureCode": "L20801",
    "courseName": "文化人類学[木1]CSES",
    "lecturer": [
        "斎藤みほ(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科,工学部機械工学科,工学部電気電子工学科,工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ４０３"
    ],
    "courceDetails": {
        "courseOverview": "文化人類学は、地球に生きる様々な「他者」を文化と社会の側面から理解することを目指す学問である。その最大の特徴は、フィールドワーク（参与観察）という手法に基づきながら、異なる文化や社会について経験的かつ実証的に考え、民族誌（エスノグラフィー）を書くことにある。この作業は同時に、私たちが生きる社会の支配的な価値観を相対化することだけでなく、人間の普遍性を考えることを意味する。本講義では、全14回の講義を通して、人間の普遍性と多様性の双方を視野に入れた文化人類学的な「ものの見方」を身につけることを目指す。この授業は講義科目である。フィードバックは必要に応じて適宜授業内等で行う。",
        "outcomesMeasuredBy": "この科目は、文化人類学の基礎的な知識を身につけることが目標である。・文化概念と文化相対主義について説明できるようになる。・身の回りのことがらに関して文化と多様性という視点から分析できるようになる。・自らの社会や文化を相対的にとらえる視点を得る。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "授業でノートPCは使用しませんが、各自授業内容のノートを取るのにノートPCを使用してもらうのは自由です。基本、講義形式で行いますが、数名でグループワークをする回もあります。",
        "notices": "自身の専攻領域と文化人類学との接点を常に意識し、積極的に授業に取り組むことができる学生の参加を望みます。私語は厳禁とします。",
        "preparatoryStudy": "授業中に指示する文献を参考に、自ら進んで理解を深めていくことが求められます（毎回予習・復習合わせて4時間程度）。小テストでは、授業で説明した内容についての理解度を問うことになるので、毎回の授業で学んだ内容を復習しておく必要があります。",
        "gradingGuidelines": "授業への積極性(授業内での発言回数、コメントペーパーの提出）30％小テスト①40％小テスト②40％を総合して評価する。Moodleなどを通じてフィードバックを行います。",
        "textbook": "指定しない。毎回、こちらで作成した資料を基に授業を行います。グループワーク用として、下記の書籍を用意してください。第11回の授業にて使用予定のため、それまでに購入、各自読了しておくこと。・二文字屋脩編著『トーキョーサバイバー』（うつつ堂、2022年）",
        "referenceMaterials": "購入は必須ではありませんが、以下の参考文献を読んでおくとさらに理解が深まります。◇綾部恒雄・桑山敬己（編）『よくわかる文化人類学』［第2版］ミネルヴァ書房、2010年。◇川口幸大『ようこそ文化人類学へ』昭和堂、2017年。その他、授業中に適宜指示します。",
        "courseSchedule": "第1回：オリエンテーション：講義の目的と授業方針の説明第2回：文化と文化相対主義：相対的にものを見るとは？第3回：文化人類学という学問①：文化人類学はどこから始まったか？第4回：文化人類学という学問②：文化人類学はどのように発展したか？第5回：家族：父と母は本当に「父」と「母」なのか？第6回：日本の「家族」：家族のつながりはどこで証明されるのか？第7回：婚姻：なぜ私たちは結婚するのか？第8回：儀礼：なぜ私たちは「挨拶」をするのか？第9回：観光と文化：観光地で見る風景、食べ物はホンモノか？第10回：フィールドワークと民族誌：人類学者はどうやって調査しているのか？第11回：グループワーク：『トーキョーサバイバー』に見るフィールドワークと人類学の視点第12回：人種とエスニシティ：本当に人類は違う「種」を持つのか？第13回：日本におけるエスニックマイノリティ：ドキュメンタリー映画『HAFU』第14回：まとめと復習",
        "courseDataUpdatedAt": "2025/03/18"
    },
    "updateAt": "2025/03/21"
}