{
    "lectureCode": "L20902",
    "courseName": "社会心理[木1]CSES",
    "lecturer": [
        "鈴木万希枝(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科,工学部機械工学科,工学部電気電子工学科,工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ４０３"
    ],
    "courceDetails": {
        "courseOverview": "人は、なぜか見栄を張ってしまったり、差別的な見方をしてしまったり、他の人たちの意見に流されてしまったりするものです。一方で、自らの危険を顧みずに誰かを助けたり、仲間と協力しあって物事を達成する喜びを味わいます。そうした私たちの日常的な行動や心の動きは、人がきわめて社会的な存在であることと深く関係しています。本講義では、社会心理学の諸理論や基礎的概念を習得することによって、社会の中で人間がどのような行動をとるのか、どのような心の動きが起こるのか、その背後にある法則性を理解することを目指します。",
        "outcomesMeasuredBy": "社会心理学の基礎的な概念や理論を理解し、自分自身や他者の振る舞いに対する考察力を養います。さらに、紛争や偏見・差別といった社会問題、フェイクニュースやリスク・コミュニケーションといった今日的課題についての理解を深め、自分なりの考えをもつことを目標とします。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "各テーマについて講義を中心におこないます。いくつかのテーマにおいては、講義に先立って体験を尋ねたり、小調査を実施しながら進めます。すべての課題提出はMoodleを利用します。ノートPC等、Moodleを利用できる環境を準備してくること。",
        "notices": "・講義の中で扱う各テーマについて能動的に学び、自分の考えを表明する姿勢を求めます。・授業冒頭に小テストを実施する予定です。遅刻をすると小テストを受けられませんので特に注意して下さい。",
        "preparatoryStudy": "予習：各講義回のテーマについて、参考書や授業スライドを予め読んでおく。また、常日頃からニュース報道などに積極的に接し、今社会で何が起こっているのかについて知識をもって臨むこと（120分程度）復習：毎授業後に授業内容を振り返り、しっかり理解した上で受講レポートを提出すること（100分程度）",
        "gradingGuidelines": "提出課題（小テスト、ミニレポート、受講レポート）（40%）、期末試験（60%）によって評価します。100点満点中60点以上が単位認定条件です。課題に対するフィードバックは講義内、またはMoodleを通じて行います。",
        "textbook": "指定しません",
        "referenceMaterials": "池田謙一ほか著，社会心理学補訂版，有斐閣，2019J.R.スミス\u0026S.アレクサンダー著，樋口・藤島監訳，社会心理学再入門ーブレークスルーを生んだ12の研究，新曜社，2017北村・浦ほか著，展望現代の社会心理学１〜３，誠信書房，2010",
        "courseSchedule": "第1回：イントロダクションー社会心理学とは第2回：自己第3回：感情第4回：態度と説得第5回：対人関係第6回：攻撃行動第7回：リスク認知とコミュニケーション第8回：ステレオタイプ第9回：集団間の関係第10回：同調と逸脱第11回：流言第12回：世論第13回：ソーシャルネットワーク第14回：まとめ",
        "courseDataUpdatedAt": "2024\/02\/23"
    },
    "updateAt": "2024\/09\/13"
}