{
    "lectureCode": "L21201",
    "courseName": "日本文化論[木1]CSES",
    "lecturer": [
        "神子島健(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科,工学部機械工学科,工学部電気電子工学科,工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "日本文化と聞いて、あなたは何を思い浮かべるだろうか。この授業では、日本文化について、講義とテクストの読解を通して、次のことを考えてみたい。①文化とはそもそもどのようなもので、私たちが現在考えている文化とは、どんな歴史的特徴があるのか。②「日本」ということばが何を表してきたのか、「日本」という特徴を際立たせる「他者」（外国など）がどのように想定されてきたのか、ということをふまえつつ、③外国から「日本」がどう語られてきたのか、④「日本」らしさを示すとされる文化や「日本」というアイデンティティを考える際に特徴的なものをいくつか取り上げて、日本文化とは何かを考えていく。キーワードとしては、近代化、稲作、仏教と神道、死生観、浮世絵、建築、マンガなどが挙げられる。社会学や民俗学、歴史学などの知見を参照しつつ、「日本文化」という枠組みを客観的に理解することを目指す。幅広い時空間にわたるテーマを取り上げ、その情報を整理するため、一定の抽象的な概念を理解する努力が求められる。教科書を中心に、日本文化に関する指定されたテクストを、時にじっくり、時にあるていどの分量、読むことが求められる。グローバル化する時代の中で、「日本」とは何かを問い直すことは、知的にスリリングな作業である。知的好奇心を持った学生の参加（履修）を期待している。",
        "outcomesMeasuredBy": "・「国際的な教養」「日本」という枠組みが歴史的にどう形成されてきたかを理解し、国際的な視点で「日本文化」を考えることができる。・「論理的な思考力」人文・社会科学的な知を通して「日本文化」を論理的に考えることができる。・「分析・評価能力」現代の文化事象を多角的に捉える分析的な能力を身につける。・日本文化についての理論や知識をふまえ、関連のテクストを読み解くことができる。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "授業内では主に基本的な内容に関する講義、映像の視聴と解説を行う。それをふまえて復習や文章の読解など行う。課題はすべてmoodle上で提出する。①通常課題：2週間に1回提出。講義内容の理解を問うものと、授業内で説明したテクスト（教科書を含む）を読解する課題が組み合わせてある。②リサーチ課題：設定されたテーマに対してリサーチを行い、授業期間内に提出する課題。③最終課題：通常課題を深める形で実施。課題のふり返りと解説は随時講義内で行う。教科書として指定した『日本人はなぜキツネにだまされなくなったのか』は、日本文化論の一般的な教科書ではない。「教科書で学ぶ」のではなく、講義と教科書（やほかのテクスト）を通して全体として日本文化論を学ぶ流れになっているので、必ず購入すること。講義と準備学習両方をしっかりと行うことが求められる。予習・復習、授業内でPCを使用する。",
        "notices": "「授業方法」と「準備学習」の項目をよく読んでおくこと。履修の前提条件などは特にない。",
        "preparatoryStudy": "講義をふまえ、指定されてきたテクストを読んで、それについての課題をやっていることを前提とする。基本的なところから解説はするが、「読んでいないからついていけない」というのは問題外なので、しっかり準備学習を行うこと。予習：メディアでの日本文化についてのトピックに目を配り、あるいは、映画やアニメを通して描かれる日本文化などにも注意しておくこと。博物館などに積極的に行くことを推奨（120分程度）復習：授業のふり返り、課題実施、指定されたテクスト、参考文献の講読など（120分程度）",
        "gradingGuidelines": "通常課題（2週間に1回提出）50％リサーチ課題20％最終課題30％課題については、授業内およびmoodleでフィードバックを行う。",
        "textbook": "内山節『日本人はなぜキツネにだまされなくなったのか』講談社現代新書、2007年",
        "referenceMaterials": "全体に関わるもののみ紹介する。個別テーマについては随時紹介する。・日文研大衆文化研究プロジェクト編『日本大衆文化史』KADOKAWA、2020年（「日本大衆文化」について、最新の研究をふまえた通史）・伊藤亜人『日本社会の周縁性』青灯社、2019年（東アジアの中の日本社会の特質を、特に朝鮮半島との比較の中で論じたもの）・赤坂憲雄『柳田国男を読む』ちくま学芸文庫、2013年（「民俗学」における「日本」という枠組みについての論考）・宮崎克己『ジャポニスム流行としての「日本」』講談社現代新書、2018年（幕末から明治期において、日本文化がヨーロッパ文化に与えた影響）",
        "courseSchedule": "第1回：イントロダクション第2回：文化の定義について第3回：伝統の創造第4回：日本文化へのアプローチ第5回：高度成長期の社会・文化変容第6回：伝統建築～法隆寺第7回：日本の多様性をどう考えるか？第8回：民俗学について第9回：魂のゆくえという問題第10回：災害と文化第11回：「ジャパン」イメージ第12回：民話の変容第13回：絵のイマジネーション第14回：まとめ",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/12/09"
}