{
    "lectureCode": "L21401",
    "courseName": "日本語リテラシー[月2]",
    "lecturer": [
        "神子島健(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義棟Ａ３０２"
    ],
    "courceDetails": {
        "courseOverview": "大学では、自分でテーマを探し、それについて様々な文献を調べ、それを言葉で説明するという学びが求められる。それは、自分で調べたことや考えたことを第三者に客観的に伝える、という作業である。この授業は、大学で学んでいくための日本語能力の基礎を身に着けることを目指す。もちろんこれは、社会に出るときにも必要な能力である。この授業は主に、高校まであまり文章を書いたことがなかった学生や、読み書きに苦手意識を持っている学生が、特に書く技術を磨く目的で行われる。得意だという学生の受講を禁止するわけではないが、苦手な学生のレベルを想定している。この授業では主に、1．他者に伝えることの練習、2．書くことを意識して「読む」、3．読み手を意識して「書く」という作業を中心に行う。そのための正確な表現についての解説は随時行っていく。前提を共有していない他者に「伝える」という作業が、書くことの基礎になる。準備段階で、ペアもしくはグループで、ディスカッションや口頭説明を頻繁に行う。そのうえで、少なくとも2回まとまった文章を書く。最終的には、自分でテーマを設定し、調べたデータにもとづいたレポートの執筆を目指す。",
        "outcomesMeasuredBy": "この授業では大学で学んでいくにあたって、最低限の日本語運用能力（主に読む、書く）を身に着けることを目指す。テーマに沿って、信頼できるソースにもとづいた情報か否かを判断して収集し、適切にまとめて位置付けることも含む。目指すべき具体的な能力は、以下の3点。1．「論理的な思考力」前提を共有していない他者に対して、客観的な説明をするための思考2．「分析・評価能力」社会的なテーマについて書かれたテクストを正確に読み取り、関連したデータを調べ、データを適切に文章内に位置付ける能力3．「コミュニケーション能力」一定の専門性のある情報を第三者が理解できるように伝える言語運用能力、および基礎的な文章作法を理解し、自分で調べたことを適切にまとめてレポートを書くことができる。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "言葉遣いや文章に関する講義をしたうえで、書くことを意識した文章読解の訓練、間違えやすい語いや言い回しについての練習問題、実際に文章を書くための課題など、様々なことを行う。受け身での講義だけではなく、文章を書き慣れていない学生が一から書く訓練として、2回まとまった文章を書いて提出することになる。順を追って説明し、少しずつステップをふんで書き進める。その分、毎回の積み重ねが重要となるので、欠席は極力しないように。口頭で相手に伝えるというのも、前提のすり合わせをし、わかりやすく説明するという「書く準備」になる。テーマ設定についてのディスカッションや、相手の文章の改善案を提示するなど、アクティブラーニング型のグループワークを複数回実施する。また、ことばで表現することに慣れる授業として、教科書のポイントをまとめたり、論拠を示したうえでの授業の感想を書いたりなどの小課題も随時課す（講義内で指示する）。授業内でも予習復習でもPCを用いる。",
        "notices": "文章をきっちり書く練習をしたことがない学生、もしくは文章を書くことが苦手な学生向けを想定した授業である。よって、履修の条件のようなものはない。母語（ここでは日本語を想定）で「書く」ことは、しっかりとトレーニングすれば、最低限のことはできるようになるものである。しかし逆に言うと積極的に書いてみなければ、上達しない。就活のエントリーシートや卒論、社会に出てからも企業内でのレポートなど、書くことは様々な場で必須となる。そのための訓練の機会と考えてもらいたい。自分でやってみる、書いてみる意思がなければ上達はしないので、そのつもりで授業に臨むこと。「習うより慣れよ」である。毎回の積み重ねが重要であり、特にグループワークは講義や読書で補えないため、欠席は極力しないようにすること。外国語として日本語を学んでいる学生の履修も可能だが、大学で学んでいる内容について日本語のネイティブと一緒に積極的に会話できるレベルが求められる（不安がある場合は事前に相談すること）。",
        "preparatoryStudy": "到達目標に達するために、順を追って授業を進め、それに合わせた予習復習がある。授業での指示とmoodleをよく確認すること。基本をおさえた上で、「自分で考えて書く」ことができるようによく考えること。復習：授業課題の実施（教科書の課題、ワークシートの完成、ふり返り課題の執筆など）120分程度予習：参考文献の講読、エッセイ・レポート課題のリサーチ、執筆、約120分程度",
        "gradingGuidelines": "最終レポート（40％）エッセイ課題（20％）授業ごとの課題や授業への積極的な参加（40％）最終レポートは、意義のある問いが設定できているか、問いに対して適切な論拠をあげて論証・考察ができているか、正確かつ他者に伝わる日本語表現ができているか、レポートの作法が守れているか、が判断基準となる。課題に対するフィードバックは講義内で適宜行なうが、執筆した課題について、大きな問題がある場合を中心に、メールかmoodleで個別にフィードバックする予定である。",
        "textbook": "山口裕之『コピペと言われないレポートの書き方教室――３つのステップ』新曜社、2013年1200円＋税ISBN978-4-7885-1345-7レポート執筆のプロセスを説明する際に使う。今後レポートを書く際に、手元に置いておくと役に立つ本なので、購入するように。",
        "referenceMaterials": "全体に関わるもののみ紹介する。個別テーマについては随時紹介する。・小笠原喜康、片岡則夫『中高生からの論文入門』講談社現代新書、2019年（基本的なところからレポートの書き方を説明している）・前田安正『マジ文章書けないんだけど~朝日新聞ベテラン校閲記者が教える一生モノの文章術~』大和書房、2017年（わかりやすい文および文章を書くヒントが色々出ている）・滝浦真人『日本語リテラシー』放送大学教育振興会、2016年（日本語の特性や、論理的な表現を学ぶための教科書）・名古屋隆彦『質問する、問い返す主体的に学ぶということ』岩波ジュニア新書、2017年（レポート等のベースになる、「考えること」や日本の教育のあり方について）",
        "courseSchedule": "第1回：イントロダクション第2回：文と文章第3回：エッセイを書くための準備第4回：エッセイを書く・読む第5回：文を直す、文章を直す第6回：「コピペ」について考える第7回：引用と出典第8回：レポートのテーマ設定第9回：表現の工夫第10回：問いを立てる第11回：レポートの組み立て第12回：パラグラフの考え方第13回：レポート執筆時の注意点第14回：レポート完成に向けて",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/08/07"
}