{
    "lectureCode": "L30302",
    "courseName": "経済学[木2]BSMSES",
    "lecturer": [
        "中嶌剛(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "応用生物学部応用生物学科,工学部機械工学科,工学部電気電子工学科,工学部応用化学科,メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ５０３"
    ],
    "courceDetails": {
        "courseOverview": "本講義では、ミクロ経済学およびマクロ経済学の基礎を学び、経済学の基本的な考え方を用いて経済活動について理解を深め、現実の経済を捉える上で必要最低限の知識にしぼって説明します。また、現在の日本社会や世界経済が抱える問題を経済学的見地から包括的に俯瞰していきます。具体的には、構造不況、格差拡大、少子高齢化、ウクライナの問題などを取り上げ、問題の根源やその解決方法について経済学的なアプローチで説明します。",
        "outcomesMeasuredBy": "様々な市場における「価格」がどのように決定されるかについて、経済学の基本的な概念を使って説明できるようになることを目指します。また、経済活動に不可欠な貨幣（お金）がどのような機能を持ち、その発行者である政府が経済社会においてどのような役割を果たしているかについて的確に理解し、経済政策に関する自らの意見を、経済学の基本的な概念を使って述べられるようになることを目指します。",
        "learningOutcomes": "論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "パワーポイントと配布資料を組み合わせた講義形式で行ないます（ノートPC必携）。",
        "notices": "単なる知識やノウハウの習得にとどまらず、経済理論の対立の背景にある「前提」（人間観や世界観）の違いを理解することで、問題解決のために理論を適切に用いることができる「応用力」が身につきます。本講義では、そうした応用力を養う場として、質疑応答やディスカッションの時間も相応に確保したいと思います。そうした機会を有効に活用するためには、毎回の予習・復習を十分に行うことが求められます。",
        "preparatoryStudy": "予習：下記参考書の該当箇所を読むなどして、次回講義のテーマとなる内容や、その中で用いられているキーワードについて、自分なりに調べておくこと（120分程度）。なお、第1回は予習不要です。復習：講義資料や参考書を読み返すこと。特に興味をひかれたテーマについては、講義中に紹介された文献なども使って自分なりに掘り下げてみること（120分程度）。予習・復習の補完として、経済問題について報道・解説した記事や番組などに可能な限り日々接し、疑問点をまとめたり、学習したことを応用して自分なりの解決策を考えたりしてみましょう。そこで生じた疑問点などについて、講義中に質問いただいても結構です。",
        "gradingGuidelines": "毎回の授業終了時に提出する理解度確認小テストを実施します。なお、成績評価は期末試験（60％未満を不可）で行います。期末試験のうち20～30％程度は、単に知識を問うのではなく、特定の経済・社会問題について自分なりの解決策を考案するなどの、記述・論述式の設問とする予定です。また、ニュース検定（時事問題）等の検定試験の推奨しており、検定合格は加点対象となりますので、積極的に学びの機会を生かしてほしい。",
        "textbook": "指定教科書はなし",
        "referenceMaterials": "①ティモシー・テイラー『スタンフォード大学で一番人気の経済学入門（ミクロ編・マクロ編）』かんき出版、2013年。②髙橋洋一『たった1つの図でわかる！【図解】新・経済学入門』あさ出版、2023年（2016年刊行の旧版でも可）。③N・グレゴリー・マンキュー『マンキュー入門経済学（第3版）』東洋経済新報社、2019年。",
        "courseSchedule": "第1回：イントロダクション：なぜ経済学を学ぶのか第2回：モノの値段はどのように決まるのか①：需要供給曲線の基本第3回：モノの値段はどのように決まるのか②：需要供給曲線の応用と限界第4回：どのように利潤を最大化すればよいか：企業行動の分析第5回：ミクロ経済学の基本：市場の機能と価格メカニズム第6回：寡占市場・ゲーム理論第7回：マクロ経済学の基本：三面等価の原則、物価指数第8回：経済統計を理解しよう：GDP、失業率、賃金第9回：マクロ経済主体の行動第10回：通貨と財政の仕組み①：財政政策第11回：通貨と財政の仕組み②：金融政策第12回：お金について考えよう：銀行預金の仕組みと金融市場の役割第13回：なぜ日本は長期停滞しているのか第14回：まとめ：新しい経済学の潮流",
        "courseDataUpdatedAt": "2025/03/18"
    },
    "updateAt": "2025/03/21"
}