{
    "lectureCode": "L30301",
    "courseName": "経済と社会[月1]",
    "lecturer": [
        "板井広明(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０２"
    ],
    "courceDetails": {
        "courseOverview": "経済学の理論の基本概念や枠組み、歴史を学び、現実の経済や社会がどう認識・分析されるのかを講じます。国際的な自由貿易の利益を論じた比較優位の理論が日常の労働の現場でも意義ある理論であることなど、これらの概念を習得することを通じて、国際的な教養を身に着け、論理的な思考力や分析・評価能力、問題解決能力を鍛え、日常生活と経済社会とが繋がっていることを学ぶことで、あるべき経済のあり方などについても考えたいと思います。",
        "outcomesMeasuredBy": "一国経済にとどまらず、グローバルな経済を視野に入れて、市場や政府の役割を捉えることができ、価格や賃金水準の決定メカニズムについて、経済学の理論的な概念から説明することができることを目指します。また現実の諸事象だけでなく、あるべき経済やあるべき豊かさといった規範的な問題も取り扱うので、経済社会の進むべき方向性について自分の意見をもつことを目標とします。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "パワーポイントを使った講義形式で行ない、理論内容を理解するのに助けとなる映像資料を適宜用いる予定です。",
        "notices": "履修に際しては、毎回の予習・復習を重視します。毎回、重要な概念について例を用いて補足・説明を行なうので、しっかりとノートをとり、授業で紹介した文献などにあたることが要求されます。",
        "preparatoryStudy": "予習：毎回の講義で提示された次回のキーワードの内容を、事典や書籍を通じて調べておくことが求められます。復習：毎回の講義で取り扱った重要な概念を自分の言葉で要約してみましょう。さらに疑問点は、自分で調べ、次回の授業の際に質問してみてください。普段から社会的関心を持ち、新聞やニュースに接し、現代社会に対する問題意識を自分なりにもって欲しいと思います。",
        "gradingGuidelines": "期末試験（80％）と不定期のリアクションペーパー（20％）で採点し、合計60％未満を不可とします。リアクションペーパーについては、実施後の回の冒頭でフィードバックを行なう。授業で示した事象と概念を正確に理解しておくようにしてください。",
        "textbook": "指定しない",
        "referenceMaterials": "ティモシー・テイラー『スタンフォード大学で一番人気の経済学入門』かんき出版、2013年。R・セイラー＆C・サンスティーン『NUDGE実践行動経済学完全版』日経BP、2022年。伊藤元重『ビジネス・エコノミクス第2版』日本経済新聞出版、2021年。吉本佳生『出社が楽しい経済学』日本放送出版協会、2009年。",
        "courseSchedule": "第1回：イントロダクション第2回：自由な市場と分業：なぜ就活で職業選択に迷うことになるのか。第3回：国際貿易と比較優位：労働者は誰とでも取り替え可能な存在なのか。第4回：価格決定のメカニズムと機械費用：授業をサボるとどんな費用がかかるのか。第5回：価格差別とフェミニスト政治経済学：女子会割は男子差別なのか。第6回：ネットワーク外部性と割引現在価値：1００万円を今もらうのと1０年後にもらうのとではどちらが得か。第7回：インセンティブとナッジ：強制ではなく、人々に良いことをさせる方法。第8回：モラルハザードとスラッジ：なぜ役所の手続きは面倒なことが多いのか。第9回：共有地の悲劇と環境問題：スーパーに並ぶ鯖はなぜノルウェー産なのか。第10回：グローバル化と食：消費の倫理性とは。第11回：サンクコストと逆選択：悪質業者が蔓延る理由とは。第12回：失業と福祉：健康で文化的な最低限度の生活の保障の歴史。第13回：租税と政府支出：税の正義とは何か。第14回：まとめ",
        "courseDataUpdatedAt": "2024\/01\/08"
    },
    "updateAt": "2024\/09\/13"
}