{
    "lectureCode": "L30401",
    "courseName": "社会学[木1]CSES",
    "lecturer": [
        "中島敏博(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科,工学部機械工学科,工学部電気電子工学科,工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "この授業は私たちが見ている世界を「社会学」という視点で捉えるとことを学びます。各授業では多様化する社会学の視点ごとにキーワードを設定し、身近な話題を通じて捉え方について理解していきます。受講生が所属する専門とは違う、人と人が関わりあうことで共通する、異なる、変化する考え方や価値観について学び、所属している専門に対する応用につながる基盤を作ります。",
        "outcomesMeasuredBy": "1.社会学の視点から事象を捉える「論理的思考力」を身に着ける2.社会学という世界共通の教養を学び「国際的な教養」を身に着ける3.社会学による価値の捉え方を学び新たな角度からの「分析・評価能力」を身に着ける以上を評価します。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "毎回テーマに沿ったエピソードを用意し、社会学で定義されるキーワードを通じてエピソードの捉え方を学びます。授業中にオンラインツールを通じて意見を表明し、理解を促すとともに、授業ごとにリアクションペーパーを通じて理解を測ります。授業中にMoodleを通じて質問や課題提出を求めます。ノートPCを必ず持参ください。",
        "notices": "必ずMoodleなどでオンライン回答を作成できるようにノートPCを持ち込む事。暗記することよりも考え方に重点を置いた授業になります。一部はグループワークを実施します。周囲の受講生数名と対話して理解を深める学習を行います。",
        "preparatoryStudy": "毎回の学習テーマやキーワードはMoodleを通じてお知らせします。配布される授業資料と併せて事前に読み込んでください。特にキーワードは調べておくと授業への理解が深まります。（60分程度）授業後は学習したテーマやキーワードについて、自分の経験や知識から物語として話題にできるように理解を深めてください（60分程度）。",
        "gradingGuidelines": "リアクションペーパーなど授業への参加度（50％）とレポート（50％）で評価します。100点満点中60点で合格とします。いずれの課題も授業中にフィードバックします。",
        "textbook": "特に使用しません",
        "referenceMaterials": "田中正人（編著）『社会学用語図鑑』プレジデント社、2019年",
        "courseSchedule": "第1回社会学の始まり社会学者、基本理論第2回身近なヒトとの関り自分、家族、友人第3回人が集まることコミュニティ、公共、地域第4回集まるための知恵ルール、宗教、民族第5回常識を作る教育、メディア、合意形成第6回差ができる事階級、格差、貧困第7回違いを理解するジェンダー、人種、世代間ギャップ第8回まちを作る都市、農村、文化第9回課題を解決する環境、ボランティア、NPO第10回世界とつながるマクロ社会学、仕組み、国際的分業第11回合理的な社会グローバル化、監視社会、フリーライダー第12回文化的な社会文化資本、サブカル、他人指向第13回学んだことへの理解グループワーク、最終レポート説明第14回社会学に求められている視点変化の激しい社会に向けて",
        "courseDataUpdatedAt": "2025/01/22"
    },
    "updateAt": "2025/03/21"
}