{
    "lectureCode": "L30602",
    "courseName": "現代社会論[木2]BSMSES",
    "lecturer": [
        "大山昌彦(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "応用生物学部応用生物学科,工学部機械工学科,工学部電気電子工学科,工学部応用化学科,メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ５０２"
    ],
    "courceDetails": {
        "courseOverview": "私たちは変化の激しい時代を生きています。それは「自由」なるものが社会を構成する原理となった近代以降にはじまっています。「自由」なるものの拡大は、人々の生き方を変え、さまざまな可能性を追求することを可能にしたといえますが、その反面激しい変化と今日の不安定な状況を生み出しています。この授業では、近代から今日まで人々がどのように社会や共同性を作り上げて来たのかを、文化に注目して考えます。そのプロセスを理解し、現代社会の成り立ちを説明できるようになることを目的としています。そしてこの授業で学んだことを通じて、今後の社会がどうあるべきか、そして自分がどう参加するべきかを考えるきっかけをつかんでください。",
        "outcomesMeasuredBy": "近代から現代にいたる歴史的変化を社会学や文化理論にもとづいて理解することから「国際的な教養」を身につけ、そして現代社会を理解する基礎的な概念を理解すること、さらに、基礎概念を応用して現実の社会現象を読み解くことを通じて「論理的な思考力」を身につけることを目標にします。",
        "learningOutcomes": "国際的な教養論理的な思考力",
        "teachingMethod": "講義を中心に行います。必要に応じて音声・映像資料を鑑賞することもあります。なお、授業で使用する資料（穴埋めになっています）は、Moodle上の授業ページで授業前にアップロードします。また、授業に集中してもらうために、電子機器の使用のルールを設けます。SNSなど授業とは無関係な利用は厳禁とします。詳細は初回の授業で説明します。受講する場合は、このルールを厳守して下さい。",
        "notices": "受講者数制限をする場合があります。第1回では、授業の進め方その他注意事項を説明します。",
        "preparatoryStudy": "予習：毎回の講義で提示された次回のキーワードの内容を調べます。その際分からない言葉などがあればその都度調べ、自分の言葉で説明できるように準備して下さい。復習：際授業の冒頭で出した「問い」に対して自分の答えを書いて下さい。特にキーワードは、調べた内容を授業の内容を踏まえて修正をしてみましょう。高校時の世界史、現代社会の内容を復習しておくと、より授業の内容を理解できます。また日頃から社会的関心を持ち、新聞やニュースに接し、現代社会に対する問題意識を自分なりにもって授業に臨んで欲しいと思います。",
        "gradingGuidelines": "小テスト（20％）とレポート（2回）（30％）と期末試験（50％）で採点し、合計60％未満を不可とします。授業で示した事象と概念を正確に理解し、レポートなどで表現できるようにしましょう。小テストの成績および解説はMoodleで試験終了後に履修生がそれぞれ確認します。課題のフィードバックは講義中に行う予定です。加点要件は授業中の意見もしくは授業後の質問です。積極的に授業に参加しましょう。",
        "textbook": "指定しません。",
        "referenceMaterials": "主なものは以下の通りです。小林正幸，2018，『教養としての現代社会入門』，風塵社．バウマン，ジグムント，2000，『リキッド・モダニティ』，世界思想社．ギデンズ，アンソニー，2009，『社会学（第5版）』，而立書房．",
        "courseSchedule": "第1回：授業の概要と履修に関する説明第2回：近代社会の誕生：市民革命と国民国家第3回：近代社会の誕生：産業革命と資本主義の発達第4回：工業化の進展と大衆社会：大量生産と大量消費第5回：工業化の進展と大衆社会：マスメディアの発達第6回：工業化の進展と大衆社会：大衆文化を考える第7回：工業化の進展と大衆社会：福祉国家と豊かな社会第8回：細分化する社会：消費社会と若者文化第9回：細分化する社会：消費社会と対抗文化第10回：細分化する社会：脱工業化社会と産業構造の変化第11回：流動化する社会：新自由主義と格差の拡大第12回：流動化する社会：日本における流動化の諸相第13回：流動化する社会：流動化と現在のコミュニティ第14回：まとめ",
        "courseDataUpdatedAt": "2024\/02\/23"
    },
    "updateAt": "2024\/09\/13"
}