{
    "lectureCode": "L30701",
    "courseName": "地域共生論[前期金2]",
    "lecturer": [
        "神子島健(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "人は一人では生きていけない。例えば蛇口をひねれば水道から水が出てくるのも、ダムを造った人たち、水道網を管理している人たちがいるからである。人が生きていくための制度が洗練されればされるほど、私たちはそれを当たり前のものとしてその意味を考えなくなってしまう。同時に、そうした制度やその不具合で不利益を受ける人（例えばダム建設のため立ち退いた人たち）がいることも、「知らない」で済ませられてしまうのだ。人が一人では生きていけないということは、共生のための支え合いが行われてきたし、今後も必要だということを意味する。しかし今の日本の支え合いの仕組みの多くは、高度経済成長期という、人口増と経済成長の時期に作られたものがベースであり、時代に合わなくなってきている。これは多くの先進諸国に共通するグローバルな課題でもある。こうした時代に生きる大学生のみなさんにとって、「共に生きる」とは何を意味するのだろうか。この授業では、現代における「共生」のあり方を、支え合いの公的な制度をふまえつつ、そこではカバーしきれない課題について地域の人々が模索している試みなどを通して考えていく。少子高齢化、貧困、障害者、エネルギーと気候変動、災害対策など、共生のための課題は様々に存在するが、こうした課題は人々が生活する地域において具体的に現れる。この授業では、現代における「地域での共生」という、答えのまだ存在しない課題について、講義とワーク（授業課題）を通して考えていく。",
        "outcomesMeasuredBy": "・「国際的な教養」グローバルな課題としての共生と持続可能な社会のための試みについて学ぶ・「コミュニケーション能力」自分にとっての共生の意味を、他者の意見を参考にしながらとらえ返し、他者に伝わるように言語化する・「論理的な思考力」「分析・評価能力」現代社会の構造をふまえ、なぜ課題が発生するかを論理的に思考し、その課題の位置づけや改善の可能性についての分析力を磨く・「問題解決力」共生のための多様な活動の中から自分が深い関心を持つものを見つけだし、生活の場の視点から改善案を考える力を磨く",
        "learningOutcomes": "国際的な教養コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "以下の流れをベースにしつつ、全体に関する講義を補足する。(1)テーマ講義①ゲスト講師による講義：地域社会の現状や課題について理解を深める→テーマの基礎的な理解を確認する課題の提出(2)テーマ講義②講義①を補足する講義を行ったうえで、自分の地元などでテーマとなる社会課題について行われていることについて、授業内でアクティブラーニング形式のワークやリサーチを行う→ワークとリサーチをふまえた課題の提出",
        "notices": "この科目は、テーマごとに2週ずつの講義が１つのセットとして行われる。片方を休むと、もう一方も理解が深まらないので、極力欠席をしないようにすること。",
        "preparatoryStudy": "この科目は、各テーマについて知識を深め、現代社会における共生という答えのない問いについて考えていく。自分なりに「問い」を持ち、それをふまえた一定量のリサーチに加え、各テーマについて根拠をもって「自分はどう考えるか？」という作業が求められる。テーマ講義①復習：ふり返り課題（60分程度）予習：テーマについて深めるリサーチ、他のテーマのリサーチ（最終レポート課題の準備を含む）（180分程度）テーマ講義②復習：リサーチ課題（120分程度）予習：テーマについて深めるリサーチ、他のテーマのリサーチ（最終レポート課題の準備を含む）（120分程度）",
        "gradingGuidelines": "各回の授業課題50％最終レポート50％課題については、授業内およびmoodleでフィードバックを行う。",
        "textbook": "なし",
        "referenceMaterials": "江原由美子監修、一般社団法人神奈川人権センター編集発行『新・21世紀の人権知っているようで知らない差別と人権の話』日本評論社、2021年広岡守穂『社会が変わるとはどういうことか』有信堂高文社、2019年キム・ジヘ『差別はたいてい悪意のない人がする:見えない排除に気づくための10章』大月書店、2019年マシュー・ボルトン『社会はこうやって変える！コミュニティ・オーガナイジング入門』法律文化社、2020年このほか、ゲスト講師のテーマ等に合わせて適宜指示する。",
        "courseSchedule": "テーマは現段階の案である。ゲスト講師の都合で、内容や順番が変わることがあるので注意すること。第1回：ガイダンス第2回：地域共生社会について第3回：地域エネルギー①第4回：地域エネルギー②第5回：障害者福祉①第6回：障害者福祉②第7回：災害と復興①第8回：災害と復興②第9回：中間ふり返りと最終レポートについて第10回：貧困①第11回：貧困②第12回：ジェンダー①第13回：ジェンダー②第14回：まとめ",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}