{
    "lectureCode": "L31101",
    "courseName": "グローバル社会論[水4]",
    "lecturer": [
        "大山昌彦(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水4"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "西洋はその強大な軍事力を背景に、近代的な政治経済システムや思想に関して全世界的な影響を与え席捲し、現在のグローバル社会をつくりだしてきました。その過程で、「民族」「人種」という自己と他者を分類する枠組は西洋の支配とそれに基づくグローバルな秩序を作り出すことに貢献しました。この自己と他者とを分類する枠組は、われわれにとって「揺るぎない真実」として、変化が激しい近代以降人々を統合する一方で、グローバル社会においてはさまざまな軋轢を生み出しています。この授業では、西洋近代が生み出した人間の認識とその背景を批判的に検討することを通じて、それがもたらすグローバルな諸問題の基本構造を理解し説明できることを目的としています。授業で学んだことをグローバル社会に生きるみなさんが「他者」とよりよい関係性を構築し共生していくためのビジョンへとつなげてもらいたいと思います。",
        "outcomesMeasuredBy": "グローバルな視点から近代から現代にいたる歴史的変化を文化人類学や社会学の知見にもとづいて理解すること、近代西洋で「自己」と「他者」が構築される過程を理解することで「国際的な教養」を身につけ、さらに、それらを通じて、グローバル社会で頻発する民族問題や移民問題など他者との軋轢や衝突の問題に対して批判的かつ論理的に説明することで「分析・評価能力」と「論理的な思考力」とを身につけ、レポートなどで表現することで「コミュニケーション能力」を身につけること目標にします。",
        "learningOutcomes": "国際的な教養コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "オンライン（オンディマンド）で行います。必要に応じてスライドのリンクから音声・映像資料を鑑賞することもあります。なお、授業で使用する資料（穴埋めになっています）はMoodle上の授業ページにて事前に、講義映像は授業開始時に公開します。",
        "notices": "受講者数制限をする場合があります。受講や小テストの期限を守り、ため込まないように注意して下さい。",
        "preparatoryStudy": "予習：毎回の講義で提示された次回のキーワードを調べその内容をまとめます。その際分からない言葉などがあればその都度調べ、自分の言葉で説明できるように準備して下さい。復習：授業の冒頭で出した「問い」に対して自分の答えを書いて下さい。特にキーワードは、調べた内容を授業の内容を踏まえて修正をしてみましょう。高校時の世界史、現代社会の内容を復習しておくと、より授業の内容を理解できます。また日頃からグローバルな経済や政治動向に関心を持ち、新聞やニュース（特にNHKBS『国際報道2024』はお勧めです。NHK総合でも再放送があります）に接し、自分の生活に対してグローバルな視野で問題意識をもって授業に臨んで欲しいと思います。",
        "gradingGuidelines": "小テスト（20％）と小レポート（30％）と期末試験（50％）で採点し、合計60％未満を不可とします。授業で示した事象と概念を正確に理解し、レポートなどで表現できるようにしましょう。小テストの成績および解説はMoodleで試験終了後に履修生がそれぞれ確認します。課題のフィードバックは講義中に行う予定です。加点要件は授業後の質問や意見です。積極的に授業に参加しましょう。",
        "textbook": "指定しません。",
        "referenceMaterials": "主なものは以下の通りです。ヘンリー，スチュアート，2002，『民族幻想論』，解放出版社．西川長夫，2001，『国境の超え方』，平凡社．梶田孝道編992『国際社会学』名古屋大学出版会ギデンズ，アンソニー，2009，『社会学（第5版）』，而立書房．コーエン，ロビン他，2003，『グローバル・ソシオロジー〈1〉，〈2〉』，平凡社．その他は授業中に紹介します。",
        "courseSchedule": "第1回：授業の概要と履修に関する説明第2回：「人種」の創造（1）：西洋的「自己／他者像」としての「人種」第3回：「人種」の創造（2）：科学と「人種」第4回：「民族」の創造（1）：国民国家の形成第5回：「民族」の創造（2）：「歴史」とナショナリズム第6回：植民地支配による「人種」と「民族」（1）：バリと観光第7回：植民地支配による「人種」と「民族」（2）：ルワンダにおける民族虐殺第8回：日本における民族：日本人論から考える第9回：グローバル社会と移民（1）：移民統合の歴史第10回：グローバル社会と移民（2）：移民の現在第11回：グローバル社会と移民（3）：対立するエスニック・グループ第12回：グローバルな不平等（1）：グローバル経済と格差の拡大第13回：グローバルな不平等（2）：開発国における労働問題第14回：まとめ",
        "courseDataUpdatedAt": "2024/01/26"
    },
    "updateAt": "2024/08/07"
}