{
    "lectureCode": "L31202",
    "courseName": "情報法[木4]",
    "lecturer": [
        "中村伊知郎(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木4"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義棟Ｄ３０１"
    ],
    "courceDetails": {
        "courseOverview": "今日、「情報」が我々国民生活に多大な影響を与えることに関しては、多言を要しないであろう。特に、00年前後から急速に拡大したインターネットの社会インフラ化は、我々の生活様式、さらには価値感までも変容させ得る巨大な潮流となっている。我々が様々なメディアから情報を得て「現実社会」を生きる存在であるとすれば、ここに情報を適切にコントロールする一般的な必要性が認められよう。そして、現実社会が「法治主義」原理に支配されていることからすれば、情報の適切なコントロールは、技術的側面からのみならず、「法的側面」からもなされる必要がある。「情報法」は、このような価値に基づいてなされる、情報に関する法的諸問題を扱う法学の一分野である。本講では、「表現の自由」等の憲法的価値、「知的財産法」「電波政策」などの伝統的な分野に加え、「仮想通貨」「AI」「自動運転」という最新の動向についても、時間が許す限り、取り上げる予定である。",
        "outcomesMeasuredBy": "本講の到達目標は、以下の2点とする。①「情報法」に関する基礎的知識を取得することにより、法律面からの「論理的な思考力」や「分析・評価能力」、そして法的な議論に参加をすることができる「コミュニケーション能力」を得ること。②「国際的な教養」を得るための前提として、条約などの「国際法」に関する基礎知識を得ること。",
        "learningOutcomes": "国際的な教養コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "講義資料は事前にPDFファイルとしてMoodleに公開をするので、ダウンロードあるいは印刷をして準備をすること。また、講義中にネットを利用したリーガルリサーチを行うため「ノートPC必携」とする。",
        "notices": "初回の授業の際に注意事項についての説明を行う。",
        "preparatoryStudy": "準備学習として、「復習」として、講義中に講師が強調した部分について「自分の言葉」で理解しておくこと(90分程度)、また「予習」として、事前にMoodleから講義資料をダウンロードし通読しておくことが(30分程度)、それぞれ必要となる。",
        "gradingGuidelines": "課題レポートの点数(50%)と期末試験の点数(50%)によって評価し、70点以上を単位認定の目安とする。課題レポートについては、提出状況に応じて2回ないし3回実施し、また講義中にフィードバックを行う。",
        "textbook": "指定なし。",
        "referenceMaterials": "・米丸恒治『18歳からはじめる情報法(From18)』法律文化社,2017年・林紘一郎『情報法のリーガルマインド』頸草書房,2017年",
        "courseSchedule": "第1回：ガイダンス／「情報法」の概要／情報法・総論1第2回：法学的知識の確認1第3回：法学的知識の確認2／情報法・総論2第4回：憲法の「情報法」としての側面／知的財産法・総論1第5回：知的財産法・総論2／知的財産高等裁判所第6回：知的財産法・著作権法1第7回：知的財産法・著作権法2第8回：知的財産法・著作権法3第9回：知的財産法・特許法1第10回：知的財産法・特許法2第11回：サイバーセキュリティ基本法第12回：「サイバー犯罪」に関する法制度第13回：個人情報保護法第14回「情報法」全体の復習",
        "courseDataUpdatedAt": "2024\/02\/23"
    },
    "updateAt": "2024\/08\/07"
}