{
    "lectureCode": "L31302",
    "courseName": "欧米社会文化論[木2]",
    "lecturer": [
        "橘由布季(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義棟Ａ２０２"
    ],
    "courceDetails": {
        "courseOverview": "こんにちの日本社会において、ヨーロッパ諸国やアメリカ合衆国の文化は非常に馴染みのある存在です。衣食住や外来語のみならず、文学・舞台芸術・映画などの諸芸術を考えれば枚挙に暇がありません。国内で制作販売されている漫画やゲーム作品を見ても、欧米文化由来の様々な観念・キャラクターが取り入れられていることに気がつきます。そのような観念・キャラクターの源である文化や社会を理解しようとするとき、その手段として、特定のモチーフ自体を調べることのみならず、芸術作品を鑑賞することも挙げられるでしょう。1つの芸術作品をよく鑑賞すると、特定のモチーフに加えて、宗教的価値観や、作品そのものが作られた時代的背景も見えてきます。また、その芸術作品が「過去のどのような作品を踏まえているのか」、「どのような素養をもつ作家によって生み出されたのか」といった観点も欠かせません。本講義では、まず欧米文化における基礎的な概念を知ることから始めます。その後、文学作品や映画を出発点として、欧米の歴史・社会を概観します。また、いくつかの具体的な文学モチーフに注目し、それらが時代ごとにどのような作品として表れているのかも比較します。",
        "outcomesMeasuredBy": "欧米文化の基礎をなす世界観や考え方の理解を目指します。本講義の目的は、ただ単に欧米文化に関する知識を詰め込むことに留まりません。ヨーロッパの歴史・社会・文化を学ぶことを出発点として、西洋と東洋、現在と過去を相対化させることで、日本が将来直面するであろう多文化共生社会を生きる上での指針を学び、国際的な教養、論理的な思考力、分析・評価能力を養うことを目的とします。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "パワーポイント資料を用いた対面授業を行います。パワーポイントを含め、授業で用いる文献資料は、都度Moodleにアップロードします。また、視聴覚資料(動画サイト、CDやDVD)を鑑賞する場合もあります。教室のプロジェクターに映されるパワーポイント資料や文献を手元でも閲覧したい場合は、ノートPCの持参を推奨します。",
        "notices": "授業開始前に出席登録を行ってください。また、出席していない学生は成績評価の対象になりませんので、注意してください。",
        "preparatoryStudy": "特定の時代に注目する授業の前には、該当する欧米史上のおおまかな出来事を予習する。(60分程度)シラバスや授業資料で挙げられた文学・映像作品の中で、興味のある作品を読んだり鑑賞する。(60分程度)",
        "gradingGuidelines": "授業ごとのリアクションペーパー提出（GoogleFormsにて/60％）、および期末試験（テーマ選択式の論述/40％）で評価します。合格は6割以上です。リアクションペーパーは、次週の授業冒頭でフィードバックを行います。",
        "textbook": "指定の教科書はありません。",
        "referenceMaterials": "『もういちど読む山川世界史』(山川出版社、2009)『ビジュアル大世界史』(ナショナルジオグラフィック社ほか、2007)『新共同訳聖書』(日本聖書協会、2003)ヤーコップ・グリム＋ヴィルヘルム・グリム(野村泫訳)『完訳グリム童話集』全7巻(ちくま文庫、2006)ゲーテ(粂川麻里生訳)『ファウスト』(作品社、2022)フケー(識名章喜訳)『水の精』(光文社古典新訳文庫、2016)ブラム・ストーカー(唐戸信嘉訳)『ドラキュラ』(光文社古典新訳文庫、2023)等々〈視聴覚資料〉ムルナウ『吸血鬼ノスフェラートゥ恐怖の交響曲』(紀伊國屋書店)ムルナウ『ファウスト』(紀伊國屋書店)デヴィッド・ハンド『白雪姫』(ブエナ・ビスタほか)ジョン・マスカー＋ロン・クレメンツ『リトルマーメイド』(ハピネットほか)等々",
        "courseSchedule": "第1回：ガイダンス―本授業の流れ、成績や試験について、参考書の紹介第2回：キリスト教の世界観―旧約聖書と新約聖書第3回：四大元素(しだいげんそ)と精霊―地・水・火・風第4回：ヨーロッパにおけるおとぎ話―バジーレ、ペロー、グリムを例に第5回：芸術と〈メランコリー/憂鬱〉―古代ギリシア医学から19世紀ロマン主義まで第6回：変遷する文学モチーフ①―ファウスト伝説第7回：変遷する文学モチーフ②―ウンディーネ伝説第8回：視覚における大変化―写真と映画第9回：ゴシック・リバイバル―19世紀イギリスにおける怪奇小説第10回：文学の映画化①―ゲーテの戯曲『ファウスト』概観第11回：文学の映画化②―ゲーテ『ファウスト』の映画への受容第12回：文学の映画化③―グリム童話とディズニー・アニメーション第13回：プロパガンダ映画―映画の政治利用第14回：後期まとめ―映像鑑賞",
        "courseDataUpdatedAt": "2025/03/04"
    },
    "updateAt": "2025/03/21"
}