{
    "lectureCode": "L40101",
    "courseName": "物理の世界[月1]",
    "lecturer": [
        "須田拓馬(教養学環)",
        "青山哲也(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ４０２"
    ],
    "courceDetails": {
        "courseOverview": "物理とは「ものの理（ことわり）」である。近現代の物理学は実験事実をもとに、それらをよく説明するものの見方を探してゆくというプロセスで発展してきた。この授業ではそうした物理学の歴史を意識しつつ、物理の面白さや考え方に触れ、大学生の教養としての物理の知識を身につけることを目的とする。",
        "outcomesMeasuredBy": "身の回りの基本的な自然現象を物理学的な視点から論理的に理解できるよう、基礎知識および論理的思考力を涵養する。また、自然や社会、技術の背景にある物理の世界について興味をもち論理的に考察する力を付ける。",
        "learningOutcomes": "国際的な教養論理的な思考力",
        "teachingMethod": "スライドを用いた講義を中心に授業を進める。スライドは講義資料として配布する。簡単な物理実験を行うアクティブラーニングを取り入れる。説明および解説はなるべくやさしく行い、理解を助けるために身の回りの具体例を取り上げて説明する。授業の課題提出をMoodle経由で行うのでノートPC必携である。",
        "notices": "演習を行うことにより、理解を深めるとともに理解度をチェックする。授業内容をよく理解し、授業資料やノートを常に整理しておくこと。",
        "preparatoryStudy": "日常、新聞やニュースなどに出てくる「物理」に関する用語、記事内容に興味を持ち、授業で扱うトピックに関連したキーワードをインターネットなどで調べて予習する(120分)。また、授業で配布された資料を利用して復習を行う(120分)。",
        "gradingGuidelines": "定期試験は実施しない。授業の中で実施する小課題や小レポート演習課題の結果（教員により実施するものは異なる）などで評価を決める。評価の割合は青山1、須田2の割合とする、つまり青山100点満点、須田200点満点とし、両者を合計して3で割った値を授業評価の得点とし、60点以上で合格とする。青山担当分については要点確認テスト(100%)によって評価を行う。須田担当分については第8回および第13回で行う実験演習(各40%)および確認テスト(20%)によって評価を行う。課題や演習の解説は授業内で行う。普段の授業態度も考慮する。なお、演習課題は試験とは異なり再実施はしない。なお、実験演習については次の回での解説と総括を通じてフィードバックを行う。要点確認テスト（青山）、確認テスト（須田）の提出数が少ない（欠席が多い）場合は、演習課題も含めた総合評価が合格基準を満たしてもX評価とする。",
        "textbook": "教科書の指定はない。",
        "referenceMaterials": "「新・単位がわかると物理がわかる」和田純夫・大上雅史・根本和昭（ペレ出版）「なるほど虚数」村上雅人（海鳴社）「教養としての物理学入門」笠利彦弥、藤城武彦（講談社）「第5版基礎物理学」原康夫（学術図書出版社）",
        "courseSchedule": "第1回:科学と疑似科学：科学とは何か。（須田）第2回:単位の定義の変遷：科学は変化していることを知る（青山）第3回:数値と単位で物理量：数値と単位をセットで取り扱うことの大切さを知る（青山）第4回:自然単位系：人間の都合を取り除き、自然法則の本質を探る（青山）第5回:虚数と科学:虚数が便利な道具であることを知る（青山）第6回:光と液晶表示：色と波長、偏光を学び表示への応用を知る（青山）第7回:自然界の4つの力と重力：この世界には4種の力しかない。（須田）第8回:振り子の実験：ひもと硬貨で月までの距離を測定する。（須田）第9回:天文学における重力：実験の復習、ブラックホールと重力波（須田）第10回:電磁気学：電磁誘導と渦電流（須田）第11回:波動：振動と音波（須田）第12回:量子力学：ミクロの世界の物理学（須田）第13回:分光実験：さまざまな光のスペクトル（須田）第14回:相対性理論：アインシュタインの相対性理論（須田）",
        "courseDataUpdatedAt": "2024/01/21"
    },
    "updateAt": "2024/08/07"
}