{
    "lectureCode": "L40202",
    "courseName": "化学の世界[月2]",
    "lecturer": [
        "岡本瑞穂(応用生物学部応用生物学科)",
        "渡辺秀夫(兼任講師)",
        "杉本岩雄(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ３０３"
    ],
    "courceDetails": {
        "courseOverview": "私たちの日常を支えている物質を構成している原子・分子の本質を知り、新しい元素の発見の道筋をたどる。また、身の回りの物質や化学製品がどのように開発され、機能するのかを理解し、その多様性に触れる。さらに、化学物質が環境へおよぼす影響から、持続的な社会発展を実現するための方法を考究できるようにする。1.原子・分子とその集合体として物質は階層的にとらえられ、水分子をつうじて各階層が生み出す多様な形態と性質を学習する。また、新しい元素の発見にも触れ、有用元素の探求の道筋をたどる。身の回りの物質の中で「化学」が生み出したプラスチックを取り上げ、その構造や機能に加え、環境への負荷とその改善、再生への取り組みなどを多角的に理解する。2.ナノ世界の造形美に触れ、分子の素顔に迫る。原子や分子に属する電子の状態を量子論より理解し、ミクロ粒子の本質を知る。アプリによる分子シミュレーションを行い、簡単な分子の安定性や最適構造を評価し、大気分子の光吸収が引き起こす環境問題を理解する。3.食に係わる物質を取り上げ、その機能がどのようにして生まれるのかを理解する。また、コロナ禍がもたらした生活スタイルの変化を化学の目を通して探る。分子模型を利用したグループワークでは、身近な分子である水や糖をとりあげ、分子が織りなす分子ネットワークや分子が有する複雑な立体構造の理解を深め、分子やその集合体である物質の性質や機能を知る端緒とする。",
        "outcomesMeasuredBy": "原子や分子の本質を理解して、物質がどのように構成され、その性質や機能はどのように生まれるのかを、体系的に説明できるようになる。また、身のまわりの化学物質の特徴を理解し、それらの安全かつ効率的な利用や環境負荷の低減など、グローバルな化学的課題を介して国際的な教養を高める。さらに、元素の周期表に込められた量子の世界のルールを知り、論理的な思考力を養う。",
        "learningOutcomes": "国際的な教養論理的な思考力",
        "teachingMethod": "ノートPCは全ての回で必携とする。第1-5回は渡辺、第6-9回は杉本、第10-14回は岡本が担当する。3名の教員の初回（第1，第6，第10回）は、各教員から授業の進め方の説明がある。質問や疑問などは、授業時間中に積極的に聞くようにしてほしい。第8回と第9回は、体験型授業として分子モデリング（分子シミュレーション）をアクティブラーニングの形態で実施する。さらに、第12回～第14回はグループワークを行う。",
        "notices": "各回授業関連資料や課題がMoodleにあがっているので、内容をしっかり理解して、予習や復習に役立ててほしい。理解の確認を小テストで実施するので、必ず指定された期間内に受験を済ませること。また、各回に出席確認があるので、指定時間内に出席登録を必ず済ませること。授業の回数が進むにしたがい、理解が深まるよう構成されている。関連性をもって、各回の内容が用意されているので、予習・復習に心がけること。",
        "preparatoryStudy": "元素の周期表に親しみ、元素のグループ化とそれらの特徴を調べておいてほしい（予習120分）。また、身の回りの化学物質について、その機能はどのように生まれ、環境中でどう変化していくのか、物質の一生を理解する力をつけておいてほしい（予習120分）。新聞やニュースなどのメデイアで取り上げられる「化学」に関する記事には積極的に目を通すよう心がけてほしい。各回の内容は前回までのものをベースに展開されるので、十分な復習を心がけること（復習120分）。",
        "gradingGuidelines": "3名の教員の課す小テストを基に総合的に評価する。ただし、授業回による評価の偏りは無く、各回の課題の評価点は等しいものとする。14回の合計を100％とし、評価を行う。また、授業中の質疑応答や、発展課題に積極的（前向き）に取り組んだ姿勢は考慮し、加点を行う。",
        "textbook": "特に指定しない。授業で必要な資料はMoodleから閲覧およびダウンロードすること。",
        "referenceMaterials": "馬場政昭・廣田襄「化学がめざすもの」京大出版会佐藤健太郎「世界史を変えた新材料」新潮選書佐藤健太郎「炭素文明論」新潮選書桜井弘「元素118の新知識」講談社ブルーバックス松浦壮「量子とはなんだろう」講談社ブルーバックスE.Scerri（著）・渡辺正（訳）「周期表」丸善サイエンスパレット村上洋一「「スピン」とは何か」講談社ブルーバックス佐藤健太郎「すごい分子」講談社ブルーバックス西原寛・中田宗隆「教養の化学生命・環境・エネルギー」東京化学同人",
        "courseSchedule": "第1回：ガイダンス・身の回りの化学①「プラスチック」-この授業では何をどう学修するのか知る。身近な化学物質の例としてプラスチックの化学構造・性質を理解する(渡辺)。第2回：身の回りの化学②「プラスチックと地球環境」-廃プラスチックの処理・リサイクルや海洋汚染の現状を知り、プラスチックの地球環境への影響を理解する（渡辺）。第3回：元素とは-物質を構成する最小単位である「元素」の周期表を理解するとともに、日本人が関わった新元素の発見への挑戦の系譜を学ぶことで、元素の理解を深める（渡辺）。第4回：分子とは-物質の振る舞いの単位となる「分子」の基礎について理解を深め、最も身近な水分子に着目し、その構造とそこから導き出せる性質を理解する(渡辺)。第5回：化合物とは-分子やイオンから構成される「化合物」の分類や構造および名称についての理解を深め、物質世界の多様さを知る(渡辺)。第6回：原子の本質-分子の造形美に触れ、それを構成する原子の本質を説明する量子論の基本概念を知る(杉本)。第7回：原子の結合形成-原子間結合の様式を量子論に基づく電子軌道の概念から理解し、安定な分子構造を定める方法を知る(杉本)。第8回：分子モデリングⅠ-量子論から構築された分子軌道計算により、簡単な分子の安定性評価から最適構造をデザインし、電気的相互作用力も評価する(杉本)。第9回：分子モデリングⅡ-光と分子の相互作用を分子軌道法により調べ、オゾン層破壊や温暖化などの環境問題を分子自体が有する本質的な性質より理解する(杉本)。第10回：食の化学Ⅰ-身近なものに使われている化学を、衣・食・住を通して観る(岡本)。第11回：食の化学Ⅱ-コロナ禍による衣・食・住の変化と、新しい生活スタイルを、化学の目線から探る(岡本)。第12回：グループワーク1-分子構造模型を用いた実習を通じて、水素結合による分子ネットワークの形成を水分子と氷との比較により実感する(岡本)。第13回：グループワーク2-分子モデル演習単糖類であるグルコースをとりあげ、分子式だけでは理解しにくい分子構造を分子モデル模型から学ぶ(岡本)。第14回：グループワーク３-分子モデル演習様々な化学構造式から分子モデル模型を用いて立体構造を作製し、化学構造を理解する(岡本)。",
        "courseDataUpdatedAt": "2025/03/04"
    },
    "updateAt": "2025/03/21"
}