{
    "lectureCode": "L40601",
    "courseName": "サステイナビリティ学入門[前期木4]",
    "lecturer": [
        "中村秀明(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木4"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "この宇宙は140億年ほど前に誕生し，私たちの住む地球は46億年前の太陽系の誕生と共に生まれたと考えられている．その約6億年後，地球には生命が誕生し，地球と生物との共進化によって生物多様性に満ち溢れた地球環境（地球の生態系）が形成されていった．即ち，地球環境はそこに出現した生物が地球の歴史と共に育んでできた賜物である．しかし，この尊い地球環境は，その後に出現した人間の活動によって不可逆的な影響を受け続けている．その大きな要因の一つが人間活動に必須のエネルギー需要であり，その多くが化石資源の消費によって賄われてきた．化石資源は太古の生物が約4億年もの時間をかけて太陽放射エネルギーと大気中の炭酸ガスを固定してできたものである．私たちは炭酸ガスの固定に要した時間の約100万倍もの速さで化石資源の多くを消費し，炭酸ガスを大気に戻そうとしている．このまま化石資源の消費を続ければ，いつ気候変動が起きても不思議ではない．地球環境が危機に瀕している今，人類はエネルギーの得方を化石エネルギーから再生可能エネルギーへと変換すべき時にきている．本講義では自然の成り立ちと自然界にあるエネルギーの利用方法について解説し，私達がこれまで通り地球に住み続けるために必要なサステイナビリティ学について考察する．",
        "outcomesMeasuredBy": "本講義では，持続可能な社会の実現に向けて，広く国際社会で活躍できる自然とエネルギーに関わる教養と，理工系大学の学生として相応しい科学的・論理的な考え方を修得することを目的としている．そして，このようにして修得した「国際的な教養」や科学的で「論理的な思考力」が，その後の豊かな日常生活を送るうえで活かされることが，本講義の到達目標である．",
        "learningOutcomes": "国際的な教養論理的な思考力",
        "teachingMethod": "本講義は対面式で実施し，定期試験を実施する．受講方法：1週間前を目安に毎回の講義配布資料（pptx）をmoodle上に提示するので，事前にダウンロードし，予習しておくこと．講義資料をパワーポイント形式にしているのは，各スライドの下にメモ入力欄がある為である．このメモ入力欄は講義中にメモをとるだけではなく、予習と復習の際にも活用してほしい．復習が終わった後で講義課題（受講投稿と確認テストまたは小テスト）に取り組むこと．ノートPCは必携である．ノートPCは講義資料のダウンロードや穴埋め，復習を兼ねた受講投稿や確認テスト（または小テスト）などに使用する．",
        "notices": "本講義では，物理・化学・生物に加え，地学の内容が含まれている．そのため，余裕があれば苦手科目に関わる「○○の世界」を受講するとよい．また，多くの学生が受講してこなかった「地学」に関わる内容については，基礎的な内容から解説する．第１回の講義には必ず出席すること．",
        "preparatoryStudy": "本講義では受講のための準備学修として，事前に各自が演習シートに取り組む．【準備学修：演習シート】本講義では計算を扱うことが多いため，予め，演習のためのテキストと演習シートを提示しておく．その資料の内容が理解できない場合には，学修支援センターへ行って理解を深めておくことが望ましい．演習シートは提出期限内に提出すること．提出期限後は解答例を配布するため，演習シートは受け取れない．各講義回については受講に際し，予習と復習を十分に行ってしてほしい（予習60分間・復習180分間程度）．【予習】1週間前を目安に毎回の講義配布資料（pptx）は配布するので，事前にダウンロードし，予習しておくこと．講義資料をパワーポイント形式にしているのは，各スライドの下にメモ入力欄がある為である．このメモ入力欄は講義中にメモをとるだけではなく、予習と復習の際にも活用してほしい．【復習】各回の講義内容を十分に復習したうえで，受講投稿と確認問題（任意）を行う．受講投稿への取り組みが不十分な場合には投稿回数に含まれないことがある．また，受講投稿を忘れた場合にはその分だけ減点される．日常生活や新聞，ニュースなどに出てくる講義関連の用語や記事の内容などにも興味を持ち，図書館やインターネットなどで調べるように心がけてほしい．",
        "gradingGuidelines": "定期試験，受講投稿，確認問題，演習シートの結果の総合点（100点満点）で評価する．その際の評価の割合は，定期試験：受講投稿：確認問題（または小テスト）：演習シート=６：２：１：１とする．単位認定は，総合点（100点満点）のうち，60点以上とする．但し，正当な理由がなく欠席した講義回の受講投稿と確認問題は採点されない．要件を満たした受講投稿が10回未満の場合には，総合点が60点以上であっても，原則として単位認定の要件を満たさないものとする．また，定期試験の結果が原因で総合点が60点未満の場合，定期試験の際の持ち込み用紙への書き込み（学修）の内容によっては単位が認定されることがある．尚，毎回の受講投稿にあるアンケートの回答結果についてはmoodle上でフィードバックするので，自身の回答と照らし合わせて次の講義の参考にするとよい．",
        "textbook": "指定しない",
        "referenceMaterials": "「新版エネルギーの科学」，安井伸郎著，三共出版，2009年（ISBN:978-4782705988），「未来を変える目標SDGsアイデアブック」，蟹江憲史他，紀伊國屋書店，2018年（ISBN:978-4877385132）",
        "courseSchedule": "第1回：科学I（ニュートン力学／相対性理論）第2回：科学II（熱力学／熱放射と電磁波）第3回：科学III（熱機関／発電関連技術）第4回：自然I（この宇宙の一生／太陽系の成り立ち）第5回：自然II（地球生態系の成り立ち：地球と生物の共進化）第6回：自然III（化石と化石資源の形成／化石エネルギー）第7回：エネルギーI（生態系における物質とエネルギーの循環／生体エネルギー）第8回：エネルギーII（再生可能エネルギー／バイオマスエネルギー）第9回：エネルギーIII（自然エネルギー／太陽放射エネルギー）第10回：エネルギーIV（原子核エネルギー／放射線）第11回：環境I（地球環境の状況：環境破壊と気候危機）第12回：環境II（地球環境の崩壊例:Unsustainability）第13回：環境III（地球環境の改善策I:SustainabilityI）第14回：環境IV（地球環境の改善策II:SustainabilityII・本講義のまとめ）",
        "courseDataUpdatedAt": "2024/01/29"
    },
    "updateAt": "2024/12/09"
}