{
    "lectureCode": "L50102",
    "courseName": "健康と科学[木2]BSMSES",
    "lecturer": [
        "藤平杏子(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "応用生物学部応用生物学科,メディア学部メディア学科,工学部機械工学科,工学部電気電子工学科,工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "メディアホール"
    ],
    "courceDetails": {
        "courseOverview": "本授業は「生涯にわたる健康づくり」を主要テーマとして学習する。特に、身体的、精神的、社会的健康を維持するための、「食事」「運動」「休養」「社会的参加」の4つの主要要素に注目し、それぞれが健康にどのように寄与するのかを具体的かつ体系的に学ぶ。加えて、ウェルビーイング（well-being）の概念について、心理学、社会学、生理学、行動科学の観点から学習し、自身や社会にとってウェルビーイングな状態を探求する。授業を通して、個人および集団レベルでの健康課題を特定するとともに、それに応じた解決策を設計・実行する能力を養うことを目的とする。",
        "outcomesMeasuredBy": "・本授業を通して、健康づくりの主要な概念、自身や社会にとってのウェルビーイングを理解する（国際的な教養）・科学的根拠に基づいた健康的な習慣を自身や他者に実践する方法を構築できる（論理的な思考力）・食事、運動、休養、社会的参加が身体的・精神的・社会的健康を支える役割を分析し、自身の生活習慣における改善点を特定できる（分析・評価能力）",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力",
        "teachingMethod": "授業形態は対面授業を基本とする。授業は対面形式を基本とし、1回あたりの授業時間（100分）を講義、事例研究、課題解決学習の三つに分け、知識の習得と実践を組み合わせて授業を進める。授業では、授業中にはワークシートやリアクションペーパーを活用して学生からの学習記録や意見を収集し、これに基づくフィードバックを随時行うことで、理解を深める。さらに、簡単なストレッチや健康的な食材の選び方の実演など、視覚的かつ実践的な学習が可能なデモンストレーションを取り入れ、理論を実生活に結びつけることを重視する。",
        "notices": "・毎回の授業ではノートPCを持参すること・公欠や電車遅延の届出に関しては、証明となる書類を担当教員もしくはSAへ提出すること・履修希望者が上限を超える場合は抽選を実施する",
        "preparatoryStudy": "事前に提示される準備学習課題に取り組み、授業に出席すること。毎回の授業では準備学習の内容を基に、課題解決学習を実施する。",
        "gradingGuidelines": "授業毎の課題と小テストを合計して50点、理解度チェックを合計50点として、合計60点以上を合格とする。課題に対するフィードバックは適宜、口頭もしくはMoodleにて行う。",
        "textbook": "授業時間中に必要に応じて資料を配布する。",
        "referenceMaterials": "1から学ぶスポーツ生理学：ナップ休養学基礎：メディカ出版佐々木敏のデータ栄養学のすすめ：女子栄養大学出版部",
        "courseSchedule": "第1回：ガイダンス第2回：健康の定義、日本と世界の健康問題第3回：Well-beingの概念と実践第4回：生活習慣病Ⅰ第5回：生活習慣病Ⅱ＆理解度チェック第6回：健康づくりのための食事Ⅰ第7回：健康づくりのための食事Ⅱ第8回：健康づくりのための運動Ⅰ第9回：健康づくりのための運動Ⅱ第10回：健康づくりのための休養Ⅰ第11回：健康づくりのための休養Ⅱ第12回：健康づくりのための社会参加第13回：ライフステージと健康第14回：授業のまとめ＆理解度チェック",
        "courseDataUpdatedAt": "2025/03/04"
    },
    "updateAt": "2025/03/21"
}