{
    "lectureCode": "L50325",
    "courseName": "ウェルネス実技II[火2ゴルフ]",
    "lecturer": [
        "岩田真一(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "実習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "ゴルフは、緑の芝生におおわれた広大なコースで、老若男女がプレーでき、健康、ウェルネスの維持・増進にも効果的で、かつ娯楽性の高いスポーツである。また、ゴルファーに必要なエチケット・マナーなどは日常の社会生活にも活用でき、このような特性を有するゴルフを学ぶことは大変意義深い。そこで本授業では、生涯スポーツとしてゴルフを楽しむための基礎的な知識および技術を習得することを目的として、グラウンドでゴルフボールを実際に打撃しながらスイングの基本を習得し、さらに模擬ラウンドを行うことでルール、マナーについても学び身につけていく。なお、授業計画は天候の影響や履修者のスキルレベルなどを考慮して若干変更することもある。",
        "outcomesMeasuredBy": "本授業では、ゴルフスイングの基本を理解し、安全かつ効率的に実践できるレベルに到達すること、および基本的なルールやマナーを理解し実践できるようになることを目標とする。①ゴルフの基本技術の理解、習得②ゴルフのルールやマナーの理解、習得",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "授業計画に示す内容と順序で，多目的グラウンドなどにおいて実技・実習を行う（雨天時など、体育館の空きスペースでの実施や教室で講義を行う場合がある）．技術を習得する過程において，教員が学生個々に見合った解決策やコツをフィードバックしながら授業を進めていく.授業参加の際には、スポーツウェアなどの運動に適した服装に着替える．また運動に適したシューズを使用する．ジーンズ，サンダルなどの通学時の私服での参加は認めない．なおゴルフ用具は揃っているが、ゴルフ用グローブは各自用意すること。",
        "notices": "①第1回目はアリーナにてガイダンスを実施する。ガイダンス時に種目選択を行うので、必ず参加すること。②希望者多数の場合は抽選とする。③更衣室での盗難防止のため、荷物は必ず教場まで持っていく。④欠席や遅刻の届出に関しては、証明となる書類を担当教員へ提出し、無断欠席とならないよう注意する。",
        "preparatoryStudy": "授業内で指導する基本的な身体の動かし方を繰り返し実践する。またスイングの基本をイメージしてシャドースイングを行う。",
        "gradingGuidelines": "次の観点別により評価する。満点は100点とし、その内訳は【参加・研究…30％、努力（関心・態度）…20％、技能…20％、応用・思考・判断…20％、協力性（関わり合い）…10％】、合計60％以上を合格とする。",
        "textbook": "指定しない.",
        "referenceMaterials": "市販されている関連書籍や関連雑誌、またはインターネットの関連サイトを参考にすること。",
        "courseSchedule": "第1回：ガイダンス（各種の説明），種目選択第2回：セットアップの基本（握り方、構え方など）、スイングの方法第3回：オンプレーン理論、クォーターショット、ハーフショット第4回：ハーフショット、スリークォーターショット第5回：フルショット①トップオブスイングからダウンスイング第6回：フルショット②インパクト、フォローからフィニッシュ第7回：フルショット③オンプレーンでのスイング第8回：アプローチショット①ピッチショット、チップショット第9回：アプローチショット②距離の打ち分け第10回：パター打ち方、距離の打ち分け、フック・スライス第11回：模擬ラウンド①ルールやマナーの理解・実践第12回：模擬ラウンド②ファストプレーの理解・実践第13回：模擬ラウンド③コースマネジメントの理解・実践第14回：模擬ラウンド④まとめ",
        "courseDataUpdatedAt": "2025/03/05"
    },
    "updateAt": "2025/03/21"
}