{
    "lectureCode": "L50344",
    "courseName": "ウェルネス実技II[金1バドミントン]",
    "lecturer": [
        "山本智貴(兼任講師)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "実習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "第1回は種目選択のガイダンスを実施する．第2回目以降は体育館３Fアリーナにて選択したバトミントン種目を行う．バトミントンは5gのシャトルを100gのラケットによって打球をし相手よりも先に相手コートにシャトルを落とすことを目指すスポーツである．この競技特性を踏まえ自己の技術向上とともに対戦相手やパートナーなど他者との関連の中でコミュニケーション能力，論理的な思考能力，問題解決力の育成を体現する．",
        "outcomesMeasuredBy": "バトミントンの基本的な技能およびルールを習得，発展させてゆきコミュニケーション能力，論理的な思考能力，問題解決力の育成を図る．また，自由発想に基づく基本的な各種ストロークを状況に応じて選択しプレーできる．",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "初回のガイダンスにおいて当該授業実施に関する説明を行い，2回目以降より実技を行う．授業前半では，1通りの基本技術の確認や習得を行い，後半はゲームの課題を中心に進める．併せてゲームの反省から技術の修正，個人やチームの課題をすることが望ましい．技術を習得する過程においては、教員が学生個々に見合った解決策、技術やコツをフィードバックしながら授業を進めていく．",
        "notices": "運動に適した服装（トレーニングウエアなどの運動着で，ジーンズなどの私服での参加は認めない）と屋内用のスポーツシューズを用意すること．また．安全の面からアクセサリー類は外すこと．①第1回目はアリーナにてガイダンスを実施します。ガイダンス時に種目選択を行いますので、必ず参加してください。②希望者多数の場合は抽選とします。③更衣室での盗難防止のため、荷物は必ず教場までお持ちください。④欠席や遅刻の届出に関しては、証明となる書類を担当教員へ提出し、無断欠席とならないようご注意ください。",
        "preparatoryStudy": "バトミントンの競技規則を理解する．日常生活において運動をすることを意識し，週1回の当該授業に臨む．",
        "gradingGuidelines": "次の観点別により評価する。満点は100点とし、その内訳は【参加・研究…30％、努力（関心・態度）…20％、技能…20％、応用・思考・判断…20％、協力性（関わり合い）…10％】、合計60％以上を合格とする。また，運動に適した服装でない者，欠席や遅刻は減点の対象とする。",
        "textbook": "指定しない",
        "referenceMaterials": "阿部一佳・阿部智子「わたしのバドミントン・ブック」てらぺいあ阿部一佳・渡辺雅弘「バドミントンの指導理論」日本バドミントン指導者連盟",
        "courseSchedule": "第1回：授業概要説明第2回：バトミントンの基本動作1第3回：バトミントンの基本動作2（ドライブ、クリア）第4回：バトミントンの基本動作3（ドロップ、ヘアピン）第5回：バトミントンの基本動作4（ロブ、スマッシュ、プッシュ）第6回：ゲームへの発展（ルールの理解）第7回：ゲームへの発展（シングル）第8回：ゲームへの発展（シングル）第9回：ゲームへの発展（ダブルス）第10回：ゲームへの展開（ラリー）第11回：ゲームを楽しむ1（シングル）第12回：ゲームを楽しむ2（シングル）第13回：ゲームを楽しむ3（ダブルス）第14回：ゲームを楽しむ4（ダブルス）",
        "courseDataUpdatedAt": "2025/01/06"
    },
    "updateAt": "2025/03/21"
}