{
    "lectureCode": "L50501",
    "courseName": "集中実技II[野外活動]",
    "lecturer": [
        "藤平杏子(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "実習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本授業は、自然環境に親しむ姿勢を養うとともに、他学生と協力し、チームで課題に取り組む体験を通じてコミュニケーション能力と協働スキルを育成することを目的とする。座学では、野外活動の基礎知識（安全管理、装備、環境保護など）とSDGsの目標に関連する環境課題や社会課題について学ぶ。3泊4日の野外実習では、ネイチャーウォーキング、野外炊事、自然観察、ナイトハイクなどを通じて自然環境の現状を体感し、チームでの協働作業や課題解決に取り組む。これらの体験を通じて、自然との共生を考える力、持続可能な未来に向けた行動力、そして他者と協力して成果を生み出すスキルを身につける。",
        "outcomesMeasuredBy": "・異なる専門分野を学ぶ学生同士で協力し、意見交換や役割分担を通じて、円滑なコミュニケーションを図る能力を身につける（コミュニケーション能力）・自然環境に関する現場での観察や活動中に収集した情報（例えば、気候条件、地形、植生）をもとに、課題の背景を分析し、原因と解決策を論理的に導き出す力を養う。また、その考えをチームメンバーに分かりやすく伝え、議論を通じて考察を深める能力を育成する（論理的な思考力）・自然環境や野外活動の場で直面する具体的な課題（例：限られた資源での食事準備、廃棄物の適切な処理、環境に配慮したルート選択など）に対して、SDGsの視点を取り入れて解決策を提案する力を養う。さらに、グループ内で協力して解決策を実行し、その結果を振り返りながら、次の課題に向けた改善策を考えるプロセスを経験することで、実践的な問題解決スキルを身につける（問題解決能力）",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "現時点では、大学での事前授業（2日程度）を実施したのち、夏季休業中（8月～9月上旬）に関東近郊で野外実習（3泊もしくは4泊）を実施予定である。事前授業では野外活動における基礎知識の講義、グループづくりとチームビルディング、野外活動の計画立てを行う。野外実習では個人及びグループで自然体験活動（ネイチャーウォーキング、野外炊事等）を実施する。1日毎に行動目標の作成と個人及びグループで活動の振り返りを行い、個々にフィードバックを行う。実習中の経験やデータを基に因果関係を分析し、活動内容を論理的に整理する力を養う。",
        "notices": "・集中実技に要する諸費用（宿泊費・昼食代・交通費等）は、履修者の負担とする・全学部共通の実技授業となるため、履修可能な人数の上限を設け、希望者が多い場合には抽選で決定する。希望者が極端に少ない場合には、集中実技を「当該年度のみ中止する」などの対応をする場合もある・募集の掲示を６月頃に学内掲示板・学生ポータルにて行う。受講希望者は実習説明会（ガイダンス）に必ず出席し、実施概要・履修方法等の具体的な情報を入手すること・受講者は学内で行われる事前授業（2日程度）に必ず出席し、野外活動の基礎知識や安全管理について学習すること・事前授業を無断で欠席した者は履修不可とする",
        "preparatoryStudy": "授業に参加する前に、野外活動やSDGsに関する基礎知識を学習しておくこと。具体的には、活動で必要な装備や安全管理の方法を調べ、自分用の装備リストを作成する。さらに、活動予定地の自然環境やリスクを予習し、体調を整えるとともに、チームで円滑に活動するためのコミュニケーションスキルを学ぶ。これらを通じて、実習に備えた万全な準備を整える。",
        "gradingGuidelines": "事前授業の受講状況、現地実習での取り組み、課題達成度等を総合的に評価する。具体的には、①事前授業への参加と知識の習得度（30％）、②野外実習への取り組み姿勢、マナー・協調性、安全配慮等（50％）、③レポート（20％）、計100％（100点満点）とし、60点以上を合格とする。",
        "textbook": "授業時間中に必要に応じて資料を配布する。",
        "referenceMaterials": "なし。授業時間中に必要に応じて資料を配布する。",
        "courseSchedule": "第1回：ガイダンス：授業のテーマや到達目標及び授業方法の説明第2回：事前授業１：野外活動の基礎知識（用語、SDGs）に関する講義第3回：事前授業２：野外活動の安全管理に関する講義第4回：事前授業３：グループづくりとチームビルディング第5回：事前授業４：野外活動の計画立て第6回：野外実習：移動、集合、開講式、アイスブレイク（初日）第7回：野外実習：自然体験活動第8回：野外実習：自然体験活動第9回：野外実習：自然体験活動（グループアクティビティ①）第10回：野外実習：自然体験活動（グループアクティビティ②）第11回：野外実習：自然体験活動（グループアクティビティ③）第12回：野外実習：自然体験活動（グループアクティビティ④）、振り返り第13回：野外実習：拠点の後片付け、清掃、振り返り（最終日）第14回：野外実習：閉校式、現地撤収・移動、解散（最終日）",
        "courseDataUpdatedAt": "2025/01/27"
    },
    "updateAt": "2025/03/21"
}