{
    "lectureCode": "L50625",
    "courseName": "スポーツ実技I[金2トレーニング]",
    "lecturer": [
        "金指みの利(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "スポーツの実践によって、知的・身体的能力を育成することはもちろん、運動の楽しさを体感し、健康の保持・増進を図る。また、生涯にわたり、スポーツをライフサイクルの中に取り入れる基盤を築くことを主なねらいとする。併せて、クラスメイトと相互交流していく中で、社会性や協調性、コミュニケーション能力を身につける事も目的とする。私たちの身体は刻一刻と変化をし続けているが、意図して変えることのできる特性を持っている。その手法の一つとしてトレーニングがあり、トレーニングの目的は個人によって様々である。本授業では、トレーニングの実践を通して自身の身体を理解しながら、体力の向上と改善を、各自の目的とレベルに合わせて管理する事を目指す。",
        "outcomesMeasuredBy": "自重トレーニング、マシーンを利用したトレーニング、フリーウェイトトレーニング、有酸素運動の実践ができるようになった上で、自身の目的に合ったトレーニングを考え、実行し、評価（トレーニングによって身体がどう変化したかを考える）ができるようになる。併せて、この過程では論理的な思考力と問題解決力も得ることができるようになる。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "第1回目は全体ガイダンス、種目別ガイダンスをアリーナで実施する。第2回目からは体育館1階にあるトレーニングルーム(メディカルフィットネスセンター：MFC)にて行なう。着替えは更衣室を利用し、貴重品は携帯して各自が管理をすること。【実技授業時の流れ】①トレーニングについての講義、説明②ストレッチ③筋力トレーニング（自重、マシーン、フリーウェイト）④有酸素トレーニング⑤クールダウン以上を基本の流れとするが、各自の目的に沿って内容を組みなおしていく。毎授業でその日の①身体状況②各自のトレーニング内容③目的達成度の評価等の実践記録をつけてもらう。なお、各自の目的に合ったトレーニングを実践する際には効果の得られる姿勢や方法を個々にフィードバックしながら進めていく。",
        "notices": "・初回授業で行われる「全体ガイダンス＋種目別ガイダンス」には必ず出席すること。・運動に適した服装（トレーニングウエアなどの運動着で、ジーンズなどの私服での参加は認めない）とスポーツシューズを用意すること（シューズを忘れた場合は参加できる内容に制限が出る）。・第1回目のガイダンスにて種目選択を行うので必ず参加のこと（第1回目のガイダンスに欠席のものは、希望する種目を選択できないことがある）。・担当教員の許可を得ないで履修登録のみを完了することは認めない。",
        "preparatoryStudy": "トレーニングはまず、今の自身の身体を知ることから始まる。今の運動習慣や生活習慣を思い返し、どんな身体が自分の理想なのか、漠然とでいいので考えてみる事。",
        "gradingGuidelines": "次の観点別により評価する。満点は100点とし、その内訳は【参加意欲…30％、取り組み（意欲･関心･態度）…20％、技能…20％、応用・思考・判断…20％、協調性（関わり合い）…10％】、合計60％以上を合格とする。",
        "textbook": "必要に応じて資料(プリント)を配布する",
        "referenceMaterials": "「新版図解スポーツトレーニングの基礎理論」西東社2018横浜市スポーツ医科学センター編集",
        "courseSchedule": "第1回：全体共通・種目別ガイダンス＊平服でよい第2回：身体組成の評価1（自身の身体特性を理解する）第3回：トレーニングの原理原則第4回：運動に効果的な心拍数第5回：各種マシーンの使用方法1第6回：各種マシーンの使用方法2第7回：ダンベル（フリーウェイト）を使用したトレーニングの実践第8回：ストレッチの実践第9回：自重トレーニングの実践第10回：トレーニングメニューの制作と実践1第11回：トレーニングメニューの制作と実践2第12回：トレーニングメニューの制作と実践3第13回：トレーニングメニューの制作と実践4第14回：身体組成評価2（トレーニング前の結果と比較分析する）まとめ",
        "courseDataUpdatedAt": "2024/02/28"
    },
    "updateAt": "2024/12/09"
}