{
    "lectureCode": "L50616",
    "courseName": "スポーツ実技I[金1バレーボール]",
    "lecturer": [
        "山本智貴(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "実技科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "バレーボールはチームで協力し合い，ひとつのボールを規定回数内で相手よりも先に相手コートにボールを落とすことを目指すスポーツである．この特性を踏まえ自己の技能向上とともに他者との関連の中で論理的な思考力や問題解決力を養い社会的意識と態度を育み，スポーツの本質である楽しむことを体現する．",
        "outcomesMeasuredBy": "バレーボールの基本的な技能およびルールを習得し，これを発展させながら他者との関係の中で自分自身の技能向上及びコミュニケーション能力の向上を図る．自由発想に基づくレシーブ，トス，スパイクといった基本的な技術を状況に応じて選択し，チームコミュニケーションを図りながらプレーできる．",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "第1回は種目選択のガイダンスを実施する．第2回目以降は体育館３Fアリーナにて選択したバレーボール種目を行う．技術を取得する過程においては、教員が学生個々に見合った解決策やコツをフィードバックしながら授業を進めていく．授業の前半では、一通りの基本技術の確認や習得を行い，後半はゲームを中心に進める．併せて，ゲームの反省から技術を修正したり，チーム課題を解決していくことを実践していく．",
        "notices": "運動に適した服装（トレーニングウエアなどの運動着で，ジーンズなどの私服での参加は認めない）と屋内用のスポーツシューズを用意すること．また．安全の面からアクセサリー類は外すこと．更衣室での盗難事故を防ぐため，荷物を必ず教場まで持っていくこと．初回授業で行われる「全体ガイダンス＋種目別ガイダンス」には必ず出席すること．感染防止対策に関する注意事項が記載されているので，Moodleの授業コースを必ず確認すること．感染防止対策が不備な学生は授業に参加できない．",
        "preparatoryStudy": "バレーボールの競技規則を理解する。日常生活において運動を意識して行動し、週一回の当該授業に臨む。",
        "gradingGuidelines": "次の観点別により評価する。満点は100点とし，その内訳は【参加意欲…30％，取り組み（意欲･関心･態度）…20％，技能…20％，応用・思考・判断…20％，協調性（関わり合い）…10％】，合計60％以上を合格とする。また，運動に適した服装でない者，欠席や遅刻は減点の対象とする。",
        "textbook": "指定しない",
        "referenceMaterials": "日本バレーボール学会「バレーボール百科事典」日本文化出版ムック",
        "courseSchedule": "第1回：授業概要説明第2回：ボールを用いた軽運動（ボールキャッチ、スロー）第3回：基本技術の取得（アンダーパス、オーバーパス）第4回：基本技術の習得（レシーブ、サーブカット）第5回：基本技術の取得（アタック）第6回：ゲームへの発展（レシーブからのトス、アタック）第7回：ゲームへの発展（サーブカットからのトス、アタック）第8回：ゲームへの発展（ミニゲーム）第9回：ゲームを楽しむ（審判を行いゲームをコントロールする）第10回：ゲームへの展開4第11回：ゲームを楽しむ2（リーグ戦）第12回：ゲームを楽しむ3（リーグ戦）第13回：ゲームを楽しむ4（リーグ戦）第14回：ゲーム,まとめ",
        "courseDataUpdatedAt": "2024/03/05"
    },
    "updateAt": "2024/12/09"
}