{
    "lectureCode": "L50622",
    "courseName": "スポーツ実技I[金2バドミントン]",
    "lecturer": [
        "植松雄太(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "生涯にわたってスポーツに親しむことは、より健康的で充実した日々を過ごすために重要な要素になる。本授業は、バドミントンを題材とし、スポーツが持つ魅力に触れることで、生涯にわたりスポーツに親しむための土台を作ることを目的とする。バドミントンの基本技術を修得するとともに、シングルスやダブルスなどのゲームを通してバドミントンというスポーツの楽しさや難しさを実感することをねらいとする。バドミントンはサッカーや野球などのチームスポーツとは異なり、より良いプレーをするためには個人技術の向上が特に必要になる。技術の向上を図らなければ、ゲームとして成立しないという特徴を持っている。技術向上にはどのような練習が必要か、自身の課題を抽出して改善を図る作業を繰り返すことで、論理的な思考力や問題解決力が養われる。さらに、本授業ではシングルスやダブルスなどの個人戦に加え、団体戦も実施する予定である。団体戦を実施することで、個人戦では経験することができないチームとしての時間を共有することができる。この中で、チームをより良い方向へ導くためにはどのような働きかけが必要かを考え、実践することでコミュニケーション能力の向上に繋げてもらいたい。様々な形式、グループでのゲームが中心となるが、バドミントンを題材としてスポーツの楽しさを学生間で共有できることが望ましい。",
        "outcomesMeasuredBy": "1参加意欲:遅刻や欠席をすることなく、体調管理をし意欲的に参加できる。2取り組み:周囲に良い影響を与えられるような意欲・態度で臨むことができ、課題を主体的に解決できる。3技能:自身が持っている技能を把握し、より良いプレーのためにどのような技能が必要になるかを考え、技能を向上できる。4思考判断:いま何が必要になるのか、何が求められているのかを常に判断し、解決するための方法を論理的に思考することができる。5協調性:より良いプレーに必要なコミュニケーション、集団での活動を円滑に進めるためのコミュニケーションをそれぞれ理解し、協調性をもって良い雰囲気づくりができる。",
        "learningOutcomes": "コミュニケーション能力",
        "teachingMethod": "実技13回(対面)、ガイダンスとしての講義1回(対面)を実施する。第1回目の授業では種目選択ガイダンスを実施する。教室は掲示を確認すること。第2回目以降の実技は体育館アリーナで実施する。実技の授業では、様々な技能や経験を持った学生間でグループワークをし、学生が主体的にバドミントンを学修する。技術を習得する過程においては、教員が学生個々に見合った解決策やコツをフィードバックしながら授業を進めていく。",
        "notices": "運動に適した服装(トレーニングウエアなどの運動着で、ジーンズなどの私服での参加は認めない)とスポーツシューズを用意すること。用具は一式揃っているが、自分の用具を持っていれば持参してもよい。更衣室での盗難事故を防ぐため、荷物を必ずロッカーに入れるか実施場所に持っていくこと。第1回目のガイダンスにて種目選択を行うので必ず参加のこと。(第1回目のガイダンスに欠席の学生は、希望する種目を選択できないことがある)。担当教員の許可を得ないで履修登録のみを完了することは認めない。感染防止対策に関する注意事項が掲載されているので、Moodleの授業コースを必ず確認すること。感染防止対策が不備な学生は授業に参加できない。",
        "preparatoryStudy": "種目の歴史、ルール、技術等の知識を調べたり、実際のプレー映像を観察しておくと良い。また、授業内で良いパフォーマンスを発揮するために、普段から規則正しい生活をおくることが望ましい。授業後は実践した内容を振り返り、達成できたことと課題を確認し、理解を深める。",
        "gradingGuidelines": "次の観点別により評価する。満点は100点とし、その内訳は【参加意欲...30%、取り組み(意欲・関心・態度)...20%、技能...20%、応用・思考・判断...20%、協調性(関わり合い)...10%】、合計60%以上を合格とする。また，運動に適した服装でない者，欠席や遅刻は減点の対象とする。",
        "textbook": "指定しない",
        "referenceMaterials": "インターネットや市販の書籍等で紹介されている技術等を参考にすること。",
        "courseSchedule": "第1回：全体共通・種目別ガイダンス、履修上の連絡と諸注意第2回：個人技術の習得1(シャトルに慣れる、サーブ、ロブ、ドライブ)第3回：個人技術の習得2(クリアー、プッシュ、ドロップ、ミニラリー)第4回：個人技術の習得3(スマッシュ)第5回：半面シングルス1(ラリーの継続、リーグ戦)第6回：シングルス1(リーグ戦)第7回：シングルス2(トーナメント戦)第8回：シングルス3(振り返りのゲーム)第9回：ダブルス1(リーグ戦)第10回：ダブルス2(トーナメント戦)第11回：ダブルス3(振り返りのゲーム)第12回：団体戦1(学生によるゲーム運営)第13回：団体戦2(学生によるゲーム運営)第14回：団体戦3(学生によるゲーム運営)",
        "courseDataUpdatedAt": "2024\/02\/28"
    },
    "updateAt": "2024\/08\/07"
}