{
    "lectureCode": "L50721",
    "courseName": "スポーツ実技II[金2ボディコンディショニング]",
    "lecturer": [
        "藤平杏子(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "実習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本授業は、ピラティスを基盤としたエクササイズを中心に、ウォーキングやジョギングなどの全身運動を取り入れながら、学生が自分自身の身体を深く理解し、体のコンディショニングを整える力を養うことを目的とする。エクササイズ初心者から参加し易いよう、ピラティスの基礎理論と姿勢（アライメント）の確認から開始する。その後、体幹・下半身・上半身に焦点を当てた実技を展開し、ピラティスボール、バランスボール、ストレッチバンドといったツールを活用してエクササイズを展開する。ウォーキングおよびジョギングの授業では、心拍数の計測を行いながら、自身の心地よいペースで歩く・走るスキルを体得する。これらの活動を通して、学生が個々の身体の状況を論理的に分析し、それに基づいて適切なエクササイズを選択・調整する力を養うことを目指す。",
        "outcomesMeasuredBy": "・授業内での相互コミュニケーションを通じて協調性や社会性を育み、マナーやエチケットを実践する。授業の振り返りを共有し、自己と他者を理解しながら、多様性を尊重した協力的な態度でコミュニケーション能力を高めることを目指す（コミュニケーション能力）・自分の身体の状態を的確に分析し、ピラティスやツールを用いたエクササイズの理論を理解して、具体的な改善策を論理的に考える力を身につける（論理的な思考力）・授業を通じて得た知識と技術を基に、自身の姿勢や身体の癖などの課題を発見し、適切なエクササイズや方法を選択・実践する力を育成する（問題解決力）",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "理論講義と実技演習を組み合わせ、ボディコンディショニングを体系的に学ぶ。前半はピラティスの基礎理論やエクササイズを通じて、姿勢の改善と身体調整を実践する。後半ではウォーキングやジョギングなどの動作を取り入れ、全身運動のスキルを強化する。ピラティスボール、バランスボール、ストレッチバンドといったツールを活用し、多様な動きに対応できる身体を養成する。毎回の授業後にリフレクションを実施し、各自の課題を共有しながら、主体的にコンディショニングを学ぶ姿勢を促す。",
        "notices": "①第1回目はアリーナにてガイダンスを実施します。ガイダンス時に種目選択を行いますので、必ず参加してください②希望者多数の場合は抽選とします③更衣室での盗難防止のため、荷物は必ず教場までお持ちください④欠席や遅刻の届出に関しては、証明となる書類を担当教員へ提出し、無断欠席とならないようご注意ください⑥安全のため、必ず運動に適した服装で参加してください（運動着やピラーティスウェアで行うこと。ジーンズなどの私服での受講は認めない）。ウォーキングやジョギングは屋外で実施するため、ランニングシューズを準備してください⑦体調不良の場合は必ず担当教員に報告および相談してください⑧天候によっては授業内容を変更する可能性があります",
        "preparatoryStudy": "実技を実施するために、各自体調を整えること（具体的には朝食の摂取、水分の摂取、必要な睡眠時間を確保するなど）。",
        "gradingGuidelines": "次の観点別により評価する。満点は100点とし、その内訳は【参加・研究…30％、努力（関心・態度）…20％、技能…20％、応用・思考・判断…20％、協力性（関わり合い）…10％】、合計60％以上を合格とする。課題に対するフィードバックは授業時に口頭で行うほか、必要に応じてMoodleにて行う。",
        "textbook": "特に指定しない",
        "referenceMaterials": "実践ピラーティス：ガイアブックス",
        "courseSchedule": "第1回：ガイダンス（必ず出席すること）第2回：ピラティスの基礎と姿勢（アライメント）チェック第3回：全身の静的ストレッチと動的ストレッチの基礎第4回：体幹トレーニング:安定性の向上第5回：ピラティスボールを使ったエクササイズ第6回：下半身トレーニング:姿勢を支える力第7回：バランスボールをを使ったエクササイズ第8回：ウォーキング:正しいフォームと効率的な歩行第9回：ジョギング入門:負担の少ない走り方と心地よいペースの体得第10回：上半身トレーニング:姿勢を整える力第11回：ストレッチバンドを使用したエクササイズ第12回：全身フロー①と姿勢（アライメント）チェック第13回：全身フロー②と姿勢（アライメント）チェック第14回：まとめ",
        "courseDataUpdatedAt": "2025/03/05"
    },
    "updateAt": "2025/03/21"
}