{
    "lectureCode": "L50724",
    "courseName": "スポーツ実技II[金2卓球]",
    "lecturer": [
        "八幡光哉(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本授業では、スポーツ活動を通して、健康の保持増進に必要な体力の向上。また生涯にわたり、スポーツを楽しむ為に、スポーツ種目の選択肢を広げ、自発的・主体的にスポーツを行うことのできる能力を育成することとし、①仲間と協力し、競い合い、認め合うコミュニケーション能力②セオリーを理解したうえで、各場面・各相手でどのようなプレーをするべきか導き出す、論理的な思考力③勝利に向けて何が必要かを考え、問題点を洗い出し、練習しそれを修正・改善していく、問題解決力上記3点を養うことをねらいとし、授業を展開していくものである。スポーツという文化を自分の生活の一部に定着させることは、体力の向上はもちろん、日常生活における楽しみや仲間が増え、継続することにより健康で生き生きとした社会生活を営むことができる。スポーツを楽しみ、大いに体を動かし、スポーツの魅力を発見・再確認してもらいたい。卓球種目においては、各打法、サービス、レシーブなどのさまざまな技術を習得、ルール及び戦術理解を通して、卓球独自の魅力を見出しすことで、ネット型球技の特性を理解し、主体的に試合を進めてもらいたい。",
        "outcomesMeasuredBy": "ある程度の速さでリズミカルに返球できる基礎技術を習得し「運動の楽しさ」を体験すること。また、ダブルスを用いて「仲間と協力」し個人競技では体験できないチームワークを体験する。対戦相手とダブルスでの相棒からスポーツにおける他者の存在を感じ取り、卓球を通じて他者の大切さを学ぶ。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "実技１3回（対面）、ガイダンス1回の計14回の授業にておこなう。初心者と経験者とが均等に含まれた練習グループを結成して、グループを中心に技術の向上やコミニケーションを図る。ゲームを行い、反省・修正を行っていく。技術を習得する過程においては、教員が学生個々に見合った解決策、技術やコツをフィードバックしながら授業を進めていく。",
        "notices": "・運動に適した服装(トレーニングウエア、ジャージなどの運動服)、室内用運動靴を用意すること。ジーンズなどの私服での参加は欠席扱いとする・用具は一式揃っているが、自分の用具を持っていれば持参してもよい・更衣室での盗難事故を防ぐため、荷物を必ず教場まで持っていくこと・初回授業で行われる「全体ガイダンス＋種目別ガイダンス」には必ず出席すること・感染防止対策に関する注意事項が掲載されているので、Moodleの授業コースを必ず確認すること・感染防止対策が不備な学生は授業に参加できない・講義日は原則、オンラインで講義するが、同日、他科目で対面授業が予定されている学生には専用教室を確保しているので、そこで講義を受講することができる",
        "preparatoryStudy": "【予習】指導された運動技術と戦略を頭の中でイメージし，その動作を覚えてくる。【復習】各回の授業で良くできたところ，修正・改善すべきところを把握し，とくに修正・改善すべきクセや動作については，動きの感覚づくり・体力づくりを意識し，日頃から大学や自宅で対策，実践すること。",
        "gradingGuidelines": "次の観点別により評価する。満点は100点とし，その内訳は【参加意欲…30％，取り組み（意欲･関心･態度）…20％，技能…20％，応用・思考・判断…20％，協調性（関わり合い）…10％】，合計60％以上を合格とする。",
        "textbook": "指定しない",
        "referenceMaterials": "新星出版社「スポーツ・ステップアップDVDシリーズ卓球パーフェクトマスター」",
        "courseSchedule": "第1回：全体共通・種目別ガイダンス第2回：実技「卓球基礎①」道具に親しむ第3回：実技「卓球基礎②」フォアハンド、ラリー第4回：実技「卓球基礎③」バックハンド、ラリー第5回：実技「卓球基礎④」サーブ、シングルスゲーム第6回：実技「卓球発展①」スマッシュ、シングルスゲーム第7回：実技「卓球発展②」ダブルスラリー第8回：実技「卓球発展③」ダブルスゲーム第9回：実技「卓球発展④」ダブルスゲーム第10回：実技「卓球応用①」団体戦チーム編成、テストゲーム第11回：実技「卓球応用②」団体戦チーム錬成、テストゲーム第12回：実技「卓球応用③」団体リーグ戦、練習第13回：実技「卓球応用④」団体リーグ戦、練習第14回：実技「卓球まとめ」団体リーグ戦",
        "courseDataUpdatedAt": "2024/02/28"
    },
    "updateAt": "2024/08/07"
}