{
    "lectureCode": "L50814",
    "courseName": "スポーツ実技III[火1テニス・バレー・バドミントン]",
    "lecturer": [
        "後藤肇(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "実習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "スポーツ環境は楽しい一方で、怪我や事故の発生、運動後の体力の低下にともなう疾患の可能性等、危険と隣り合わせの非常に危険な環境でもあるため、リスク回避のための新しい形態の授業運営が求められている。本学のみならず、大学教育機関の授業は、多角的かつ安全な授業展開を実践するため、これまで以上に教員・学生が協力・創意工夫をしなくてはならない。したがって、危険な状況を回避のためにも、規律を守りながら、皆が安全に運動学習を行なう環境を維持していく。スポーツの実践と理論学習によって、知的・身体的能力を育成することはもちろん、運動の楽しさを体感し、健康の維持・増進と健康意識への指向性の向上を図り、中学・高校、大学１年次に経験してきた一般的な球技スポーツから一歩前進し、レクリエーション的要素を含む新たなスポーツに積極的に挑戦する意識を高めていく。その中で、過去に培った運動経験を頼りに、新しい運動技術の習得と問題解決に向けた方法を体験・体得し、生涯にわたりスポーツをライフサイクルの中に取り入れることを主な狙いとする。尚、本学のスポーツ実技においては、「コミュニケーション能力」「論理的な思考力」「問題解決力」の育成を共通のテーマとして開講している。これら３つの側面について、意識化できたことを行動化できること、分かるをできるに変換できることを重視して授業を展開していく。",
        "outcomesMeasuredBy": "ラリーテニス、レクリエーション・バレーボール、バドミントンという素晴らしいスポーツの力を借りることを通じて、練習課題に真剣に取り組む姿勢や、ルールや規律（規範）を遵守した上で楽しさを追求していくことの重要性を学んでいく。また、スポーツ実技の環境は、運動そのものが最適なアクティブ・ラーニングの機会となっている。スポーツを通じて、上記、授業概要にも示した「コミュニケーション能力」「理論的な思考力」「問題解決力」を体得していく。ウォームアップやスキルアップ練習、ゲームを通して、たくさんの仲間と相互的に関わり、他者を尊重しながら、スポーツ環境をマネジメントすることの大切さと方法論を学ぶことを到達目標とする。オンライン授業が実施された際には、「実践性をともなった理論」を学習し、スポーツ実践の環境の中で社会的・身体的な自己効力感を獲得する機会として欲しい。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "第１回目の授業は、実技授業とオンライン授業に関するガイダンス(オリエンテーション授業）を実施する。授業の展開方法や、履修上の注意事項について説明を行なうので、必ず出席・受講すること。第２回目の授業以降は、ラリーテニス、レクリエーション・バレーボール、バドミントンの３種目の実技を実践するとともに、教員サイドの体調不良等、やむを得ない状況が生じた場合にはオンライン形式授業による理論学習を行う。計１２～１３回の実技授業では、スキルアップのための練習課題や運動のポイントをフィードバックしながら実技を進めていく。また、授業を円滑に進めるに、リスク回避のためのローカル・ルール採用、履修学生の自主的・協力的な姿勢による危険回避や準備・片づけ等が必要になってくる。尚、オンライン授業が行われた際は、教室受講と自宅受講のいずれかの形式を選択して受講することとなる。オンライン授業を受講できる環境を確保するように努めて欲しい。上述のとおり、原則的にガイダンス授業１回、実技実践１３回を軸に授業を展開するが、感染症拡大を含む諸条件の変化に対応することを理解して欲しい。",
        "notices": "・第１回目はアリーナにてガイダンスを実施し、種目選択も行うので、必ず参加すること。希望者多数の場合は抽選となる。・実技に際しては、更衣室での盗難防止のため、荷物は必ず教場まで持参すること。・欠席や遅刻の届出に関しては、証明となる書類を担当教員へ提出し、無断欠席とならないよう注意すること。。・ガイダンスの内容を十分に把握し、主任教員・担当教員の注意事項を守って実技・講義に参加できること。実技に際しては、担当教員の声掛けに快く反応し、特に危険回避のための注意を受け入れること（無反応を装う等の行為は絶対にやめて下さい）。尚、本授業ではこれまでにも経験したことのあるスポーツが中心となるため、レクリエーションスポーツの中では運動量も多く、遊戯感覚だけで運動しないということを理解の上、履修のこと。・運動に適した服装（トレーニングウェア等）、屋内専用の運動シューズを必ず着用のこと。・マスクの着用に関しては自己の判断を尊重する。必要に応じてマスクの着用、手洗い、用具等の消毒協力をすること。・身体の不調や身体的基礎疾患、精神的疾患、傷害等がある場合は、必ず事前に担当教員に報告・連絡・相談すること。実技中・実技終了後の体調不良等についても、伝達を怠らないこと。運動が危険であると判断した際は、授業マネジメントに努めることで出席とする。・運動中は、他者を傷つける可能性のあるピアス等の装飾品等を絶対に外すこと（特にバレーボールの際）。・自分専用のペットボトル等を準備し、こまめに適度な水分（塩分）補給に努めるなど、自らリスク回避に努めること。・ウォームアップを怠る、教員の指示を無視する行動、身勝手な行動やルールを逸脱した行動、非協力的な行動は、他の履修生の円滑な対人関係や授業進行の妨げになるので絶対に慎むこと。尚、一部の仲の良い関係性だけを許容した授業展開はせず、練習相手を変え、履修者の皆が分け隔てなく相互に関わることを原則とする。・運動後は、体力が低下するとともに感染リスクが高まるので、ウィルス感染の回避に努め、クーリングダウンの時間が保てない場合は、早い段階でケアを行い、帰宅後も心身の疲労回復に努めること。",
        "preparatoryStudy": "初回ガイダンスの内容を再確認してから授業に参加すること。第２回目の授業で学習したウォーミングアップ（動→静→動のストレッチング）を実践することを通じ、心身の準備を常に行うこと。各授業回とも、前回の授業内容を復習し、練習課題に取り組むこと。",
        "gradingGuidelines": "・次の観点別により評価する。満点は100点とし、その内訳は【参加・研究…30％、努力（関心・態度）…20％、技能…20％、応用・思考・判断…20％、協力性（関わり合い）…10％】、合計60％以上を合格とする。",
        "textbook": "指定しない。授業で配布する資料とオンライン授業の資料を参照のこと。",
        "referenceMaterials": "健康・スポーツの心理学青木高大田壽城監修落合優編著建帛社",
        "courseSchedule": "第1回:全体共通・種目別ガイダンス（オリエンテーション授業）注意事項と授業の概要の説明・徹底第2回:ラリーテニスの実践（１）基本技術編ウォーミングアップ（動→静→動のストレッチング）の学習・実践第3回:ラリーテニスの実践（２）応用技術編ゲーム実施の方策とルールの学習実技シークェンスの確認第4回:レクリエーション・バレーボールの実践（１）基礎技術編基本技術の習得とゲーム実施法第5回:レクリエーション・バレーボールの実践（２）応用技術編コミュニケーションと基本戦術の理解第6回:６人制バレーボールの実践（１）基礎技術編基本技術の習得とゲーム実施方法＜※要検討＞第7回:６人制バレーボールの実践（２）応用技術編ラリー継続のための防御と攻撃のためのコンビネーション第8回:６人制バレーボールの実践（３）自主マネジメント編実技環境とゲームとマネジメント＜※要検討＞第9回:バドミントンの実践（１）基礎技術編基本技術の習得とゲーム実施方法（６つのシャトルのフライト）第10回:バドミントンの実践（２）応用技術編コミュニケーションと基本戦術の理解（フットワークの積極的活用）第11回:バドミントンの実践（３）総合技術編ポジショニング＆コートスペースとフォーメーション＆ローテーション第12回:バドミントンの実践（４）自主マネジメント編ゲーム・マネジメントと相互協力第13回:バドミントンの実践（５）自主マネジメント編実技環境（スポーツを楽しむ環境）のトータル・マネジメント第14回:ネット型競技によるスポーツ大会～チーム別対抗戦～(※状況に応じてオンライン授業を実施）",
        "courseDataUpdatedAt": "2025/02/26"
    },
    "updateAt": "2025/03/21"
}