{
    "lectureCode": "L50911",
    "courseName": "スポーツ実技IV[火1ゴルフ]",
    "lecturer": [
        "佐久間裕司(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "スポーツの実践によって，知的・身体的能力を育成することはもちろん，運動の楽しさを体感し，健康の保持・増進を図る。これまで学校体育で経験してきた一般的な球技や個人スポーツから一歩前進し，レクリェーション的な要素を含む新たなスポーツに積極的に挑戦してみよう。その中で，過去に培った運動経験を頼りに，新たな運動技術の習得と問題解決力の構築に向けた論理的な思考力を開拓し，生涯にわたり，スポーツをライフサイクルの中に取り入れる基盤を築くことを主なねらいとする。併せて，コミュニケーション能力、社会性や協調性も身につける。ゴルフは，楽しく，しかも健康的であり，将来における社交上の親交，および，自分を自制する心やフェアプレーの精神が養われ，礼儀（エチケット）や行儀（マナー）を身につけられるスポーツである。その結果として，他者への思いやりも養われる。現代のストレス社会を行き抜くための，言わば精神的サプリメントをたっぷりと摂り入れることが，生涯に渡って健康で健全な生活を手に入れるカギになるものと確信している。",
        "outcomesMeasuredBy": "●参加意欲…遅刻や欠席がなく，良好な体調で授業にいきいきと参加することができる。●取り組み（意欲･関心･態度）…自らが主体的に自らの問題解決，課題解決に最善を尽くすことができる。●技能…ゲームを楽しめる最低限の技能(ショット)を身につけ，ショットの結果から反省･攻略･実践すること(フィードバック)ができる。●思考判断…ゲームを通して自己の課題を発見し，解決するための方策を論理的な思考で工夫することができる。また，安全配慮も含め，行動を先取りすることができる。●協調性（関わり合い）…普段接する機会が少ない仲間と積極的なコミュニケーションの下，協力的･協調的な態度で臨み，マナー・エチケット等の社会的行動様式を仲間と共に構築することができる。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "授業は基本的に対面で実施するが，天候やコロナ感染状況によってその都度，講義に変えて実施することもある。第1回目の授業は体育館アリーナまたは指定教室にて種目選択とガイダンス（全体共通と種目別）を実施する。第2回目以降の実技概要はMoodle内の授業トピックで周知するので事前に確認しておくこと。教場は通常，多目的グランドで行うが，雨天の場合には，体育館１F玄関に設置のホワイトボードに集合場所を指示する。※多目的グランドとは正門を正面に見て車道ロータリーの左側にあるグランドのこと。先ずはボールを前に飛ばすことができなければ何も始まらない。日常の動きのイメージからゴルフスイングを形づくり，１つ１つ基本を習得し，ボールを打てるようにする。その過程においては，教員が学生個々に見合った解決策をフィードバックしながら授業を進めていく。なお，ボールを飛ばす秘訣は力ではなく，正しい軌道とタイミングであり，力まないで遠くに飛ばすことが理想である。一方，技術の習得のみならず，ゴルフを生涯に渡って楽しむきっかけづくりとし，周囲に気を配ることのできる態度、社会性を身につけることも重要な目的と考えている。",
        "notices": "初回ガイダンスには必ず出席し，授業に必要な情報を集めること。特に，感染防止対策に関する注意事項はガイダンスでも扱うが，Moodleにも掲載しているので，必ず一読し，実行すること。感染防止対策に不備がある学生は授業に参加できない。実技が講義に変更される場合は，指定の教室にて対面講義となるが，ノートPCを持参，授業資料を取得し，閲覧しながら理論学修に参加すること。実技は運動に適した服装（トレーニングウエアなどの運動着で，ジーンズなどの私服での参加は認めない）とスポーツシューズを用意すること。用具は一式揃っているが，自分の用具を持っていれば持参してもよい。更衣室での盗難事故を防ぐため，荷物は必ず教場まで持っていくこと。雨天の場合には，体育館入口のホワイトボードに集合場所を指示する。その際，屋内用の運動シューズも用意すること。学期の初回ガイダンスに欠席した者は，希望する種目を選択できないことがある。",
        "preparatoryStudy": "［予習］正しいスイング技術を頭の中で繰り返しイメージし，その動作を体得する。［復習］各回の授業で良くできたところ，修正・改善すべきところを把握し，とくに修正・改善すべきクセや動作については，動きの感覚づくり・体力づくりを意識し，日頃から大学や自宅で対策，実践すること。",
        "gradingGuidelines": "次の観点別により評価する。満点は100点とし，その内訳は【参加意欲…30％，取り組み（意欲･関心･態度）…20％，技能…20％，応用・思考判断…20％，協調性（関わり合い）…10％】，合計60％以上を合格とする。欠席が多い場合は不合格となる。なお，欠席や遅刻をした理由を証明できる者は，証明書(写しでよい)の空白部分に事由が生じた当日の月日・時限・学籍番号・氏名を記入の上，学期中に担当教員に提出すること。運動やレポート等の課題に対するフィードバックは授業内で口頭で、またはMoodleかメールにて全体または個別に行う。",
        "textbook": "特に指定しない。",
        "referenceMaterials": "市販されている関連書籍や関連雑誌、またはインターネットの関連サイトを参考にすること。",
        "courseSchedule": "第1回：種目選択，全体共通・種目別ガイダンス(履修上の準備物，諸注意など)第2回：ゴルフ基礎１，身体の使い方，クラブを握る・構える，ハーフショット第3回：ゴルフ基礎２，前回の復習，日常動作とゴルフスィング，ハーフショット第4回：ゴルフ基礎３，ハーフスィングからフルスィング，テイクバック，アドレス第5回：ゴルフ基本１，補助動作（ワッグルほか），スィングプレーン，ダウンスィング第6回：ゴルフ基本２，目標を狙う(方向と距離感の確認)第7回：ゴルフ基本３，移動しながらショットする，模擬コース体験第8回：ゴルフ発展１，方向と距離合わせ，ミニコース実践１第9回：ゴルフ発展２，ミニコース実践２第10回：ゴルフ発展３，中間まとめ(各自の弱点修正，基本の確認)第11回：ゴルフ応用１，ボールに慣れる１，距離合わせとアプローチ第12回：ゴルフ応用２，ボールに慣れる２，距離感と方向性，模擬コース体験第13回：ゴルフ応用３，ミニコース実践３第14回：ゴルフまとめ，ミニコース実践４",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}