{
    "lectureCode": "L50912",
    "courseName": "スポーツ実技IV[火1フィットネス総合]",
    "lecturer": [
        "金指みの利(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "日々の健康維持の為に運動は必要不可欠である。運動継続に必要な「楽しい、気持ちがいい」「効果がある」「安全（怪我をしにくい）」等の要素を体感し、知識を学びながら、日常生活の中でも継続できるようになる事を目標とする。本授業では、ヨガ、ストレッチや自重トレーニング等のマットエクササイズ、有酸素運動（ウォーキング、ダンス、エアロビクス）を行う。これらの種目を通して、体を動かすことの気持ちよさを味わいながら、自身の身体のコンディションに気づき、メンテナンスをしていく論理的な思考力を身に着ける事を目指す。また、簡単そうに見える動きでも、ポイントを深く意識する事で思い通りに身体が動かなくなることを、授業の中で体感する事もあるだろう。教員のアドバイスや自身の身体と向き合うことによって問題解決力も得てほしい。加えて、グループで行うトレーニングにおいては、他者との関わりの中でコミュニケーション能力も育みたい。",
        "outcomesMeasuredBy": "ヨガ、マットエクササイズ、有酸素運動の実践を通し、体を動かす気持ちよさ、達成感を感じることができるようにする。また、授業概要の通り、コミュニケーション能力、論理的な思考力、問題解決力を得られるようにする。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "第1回目は全体ガイダンス、種目選択ガイダンスをアリーナにて実施する。第2回目からの対面授業は体育館1階柔道場にて行う。着替えは更衣室を利用し、貴重品は携帯して各自が管理をすること。【授業の流れ】ストレッチ→筋力トレーニング→有酸素運動→クールダウン以上の流れを基本とする。【講義授業時の流れ】①講義②実技の実践③課題以上の流れを基本とする。なお、技術を習得する過程においては、教員が学生個々に見合った解決策やコツをフィードバックしながら授業を進めていく。ウォークラリーの実施時にスマホを使用する。",
        "notices": "・初回授業で行われる「全体ガイダンス＋種目別ガイダンス」には必ず出席すること。尚、このガイダンスでの注意事項と、種目別のオリエンテーションでの授業の内容を把握し、他の受講生や授業自体に迷惑がかからないよう、十分に納得して受講すること。※担当教員の許可を得ないで履修登録のみを完了することは認めない。・運動に適した服装（トレーニングウエアなどの運動着で行うこと。ジーンズなどの私服での参加は認めない。）・アクセサリー等の着用は不可。・実技前日の睡眠、実技中の水分・塩分の補給など、安全面には特に留意して授業に参加すること。また、具合が悪い場合や体調に違和感を覚えた際には、無理をせずに必ず担当教員に報告・相談をすること。",
        "preparatoryStudy": "本授業は今の自身の身体を知ることから始まる。今の運動習慣や生活習慣を思い返し、どんな身体が自分の理想なのか、自分にとっての健康とは何なのか漠然とでいいので考えてみる事。また、体調管理に留意する事。特に前日からの睡眠をしっかり確保し、食事を整え、授業に参加する事。",
        "gradingGuidelines": "次の観点別により評価する。満点は100点とし、その内訳は【参加意欲…30％、取り組み（意欲・関心・態度）…20％、技能…20％、応用・思考・判断…20％、協調性（関わり合い）…10％】、合計60％以上を合格とする。また、運動に適した服装でない者、欠席や遅刻は減点の対象とする。",
        "textbook": "必要に応じて授業内でプリントを配布する。",
        "referenceMaterials": "市販されている関連書籍や関連雑誌、またはインターネットの関連サイトを参考にすること。",
        "courseSchedule": "第1回：全体共通・種目別ガイダンス＊平服でよい第2回：全身のモニタリング、基本ポジションのチェック第3回：ストレッチの行い方、エアロビック・エクササイズ①第4回：上半身のストレッチ、エアロビック・エクササイズ②第5回：下半身のストレッチ、エアロビック・エクササイズ③第6回：体幹トレーニング①、エアロビック・エクササイズ④第7回：体幹トレーニング②、エアロビック・エクササイズ⑤第8回：エアロビック・エクササイズまとめ第9回：ウォークラリー①第10回：ウォークラリー②第11回：ウォークラリー③第12回：ダンス①第13回：ダンス②第14回：ダンス③",
        "courseDataUpdatedAt": "2023/12/27"
    },
    "updateAt": "2024/12/09"
}