{
    "lectureCode": "L50915",
    "courseName": "スポーツ実技IV[火1屋外レクCフライングディスク・ソフトラクロス]",
    "lecturer": [
        "岩田真一(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "屋外レクCで実施するスポーツ種目は，フライングディスク（ディスクゴルフやアルティメットなど）とソフトラクロスである.この授業ではこれまでの学校体育で経験してきた一般的な球技系種目などを基礎として，レクリエーション的な要素を含む新たなスポーツに積極的に挑戦する．その取り組みの中で，過去に培った運動経験をたよりに，新たな運動技術を習得したり（問題解決力），技術や戦術に関して論理的に理解し遂行したりする（論理的な思考力）．また，クラスメイトやチームメイトと相互交流していく中で，社会性や協調性などの重要性を学ぶ（コミュニケーション能力）．さらに健康の保持・増進を意識して，生涯にわたりスポーツをライフサイクルの中に取り入れ実践していくことの重要性を学ぶ（問題解決力・論理的な思考力）．",
        "outcomesMeasuredBy": "あまり経験したことのないスポーツ種目に取り組むことになるが，半期の授業を通して，基礎的な技術や戦術を理解・習得して試合ができるようになることを目指す．また生涯スポーツの実践の基礎を築き，その過程で上記の問題解決力，論理的な思考力，コミュニケーション能力を育成することを目標とする．",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "第１回目はガイダンスを実施する．この科目のねらいや評価方法の説明，屋外レクCの具体的な内容の説明などを行う．第２回目以降は，授業計画に示す内容と順序で，屋外（多目的グラウンド，陸上競技場やテニスコート）において実技・実習を行う（雨天時など、教室で講義を行う場合がある）．なお，技術や戦術を習得する過程においては，教員が学生個々に見合った解決策やコツをフィードバックしながら授業を進めていく.",
        "notices": "スポーツウエアなどの運動に適した服装に着替えて参加する．また運動に適したシューズを使用する．ジーンズ，サンダルなどの通学時の私服での参加は認めない．なおスポーツ用具は一式揃っている．",
        "preparatoryStudy": "各種目の歴史・ルール・運動技術などの基礎知識を下記参考書欄に示した資料等で調べて学習してほしい．また，授業開講後に指導する柔軟性トレーニングを毎日10分間程度取り組み習慣化してほしい．",
        "gradingGuidelines": "次の観点別により評価する．満点は100点とし，その内訳は【参加意欲…30％，取り組み（意欲･関心･態度）…20％，技能…20％，応用･思考･判断…20％，協調性（関わり合い）…10％】で，合計60点以上を合格とする．",
        "textbook": "指定しない.",
        "referenceMaterials": "長野県体育センター公式WEBサイト＜ニュースポーツ用具一覧･概要とルール＞アルティメット，ソフトラクロス，ディスクゴルフ，ドッヂビー，フライングディスクの各欄を参照https:\/\/www.pref.nagano.lg.jp\/taiikucenter\/gyomu\/kashidashi\/newsports.html",
        "courseSchedule": "第1回：ガイダンス（各種の説明），種目選択第2回：フライングディスクの技術練習1，ディスクゴルフ1（ソフトラクロスの技術練習を実施する場合あり）第3回：フライングディスクの技術練習2，ディスクゴルフ2（ソフトラクロスの技術練習を実施する場合あり）第4回：アルティメットの戦術練習（フリスビーorドッヂビー）第5回：アルティメットのゲーム1（フリスビーorドッヂビー）第6回：アルティメットのゲーム2（フリスビーorドッヂビー）第7回：アルティメットのゲーム3（フリスビーorドッヂビー）第8回：ソフトラクロスの技術練習（ペア中心）1（ドッヂビーを使ったディスクドッヂを実施する場合あり）第9回：ソフトラクロスの技術練習（ペア中心）2（ドッヂビーを使ったディスクドッヂを実施する場合あり）第10回：ソフトラクロスの技術練習（4名程度のグループ），ゲーム1第11回：ソフトラクロスの戦術練習，ゲーム2第12回：ソフトラクロスのゲーム3第13回：ソフトラクロスのゲーム4第14回：ソフトラクロスのゲーム5",
        "courseDataUpdatedAt": "2024\/01\/08"
    },
    "updateAt": "2024\/08\/07"
}