{
    "lectureCode": "L50936",
    "courseName": "スポーツ実技IV[火3テニス]",
    "lecturer": [
        "佐久間裕司(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "実技科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "スポーツの魅力は運動による目的の達成感，運動そのものの爽快感にあるが，ウェルネス実技ではこの過程の中で多くの仲間をつくり，幅広いコミュニケーション能力を磨き，スポーツの更なる魅力に触れる事が目標の１つである。最終的には生涯スポーツの実現に向けた出発点となること，運動のし方や楽しさを追求できる態度を育成することをねらいとする。この授業では硬式テニスを扱う。テニスはラケットを介して打球を操り，相手のリズムを崩し，弱点を攻撃，相手から受けるプレッシャーをセルフコントロールしながら克服し，所期の目標を達成するところにおもしろさを秘める。よって，それを皆で体験してみたい。そのためには，グランドストローク，サーブ，ネットプレーなどの基本技術の善し悪しがカギとなる。授業はゲームを中心に進めるが，ゲームから生じた個々の反省点を改善する問題解決力の構築，論理的な思考力の開拓は後々のスポーツ活動を支える基盤となる。とにかく楽しい雰囲気の中で，諸君がテニスを生涯の友にできれば最高である。",
        "outcomesMeasuredBy": "●参加意欲…遅刻や欠席がなく，良好な体調で授業にいきいきと参加することができる。●取り組み（意欲･関心･態度）…自らが主体的に自らの問題解決，課題解決に最善を尽くすことができる。また，与えられた役割を最後まで責任もってやり遂げることができる。●技能…ゲームを楽しめる最低限の技能(グランドストローク，サーブ)を身につけ，ゲームの結果から反省･攻略･実践すること(フィードバック)ができる。また，ゲームの審判ができる。●思考判断…ゲームを通して自己の課題を発見し，解決するための方策を論理的な思考で工夫することができる。また，安全配慮も含め，行動を先取りすることができる。●協調性（関わり合い）…普段接する機会が少ない仲間と積極的なコミュニケーションの下，協力的･協調的な態度で臨み，マナー・エチケット等の社会的行動様式を仲間と共に構築することができる。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "授業は基本的に対面で実施するが，天候やコロナ感染状況によってその都度，講義に変えて実施することもある。第1回目の授業は体育館アリーナまたは指定教室にて種目選択とガイダンス（全体共通と種目別）を実施する。第2回目以降の実技概要はMoodle内の授業トピックで周知するので事前に確認しておくこと。教場は通常，テニスコートで行うが，雨天の場合には，体育館１F玄関に設置のホワイトボードに集合場所を指示する。授業は能力別に４つのグループに分け，それぞれのグループに学修目標が与えられる。初心者と初級者は主に技術を習得し，テニスができるようにすること。中級者と上級者においては，ゲームの結果から自己の弱点を強化するとともに，応用や発展的な課題に挑戦し，テニスの楽しさや難しさを初心者や初級者に共有してもらう任務も含まれる。なお，テニスに有効な技術を学修する過程においては，教員が学生個々に見合った解決策やコツをフィードバックしながら授業を進めていく。",
        "notices": "初回ガイダンスには必ず出席し，授業に必要な情報を集めること。特に，感染防止対策に関する注意事項はガイダンスでも扱うが，Moodleにも掲載しているので，必ず一読し，実行すること。感染防止対策に不備がある学生は授業に参加できない。実技が講義に変更される場合は，指定の教室にて対面講義となるが，ノートPCを持参，授業資料を取得し，閲覧しながら理論学修に参加すること。実技は運動に適した服装（トレーニングウエアなどの運動着で，ジーンズなどの私服での参加は認めない）とスポーツ用シューズを着用すること。テニス用具は一式揃っているが，自分の用具を持っていれば持参してよい。更衣室での盗難事故を防ぐため，荷物を必ず教場まで持っていくこと。欠席や遅刻の届出はその証明となる書類を担当教員に提示して，無断欠席にならないよう注意すること。",
        "preparatoryStudy": "［予習］指導された正しい運動技術を頭の中で繰り返しイメージし，その動作を覚えてくる。［復習］各回の授業で良くできたところ，修正・改善すべきところを把握し，とくに修正・改善すべきクセや動作については，動きの感覚づくり・体力づくりを意識し，日頃から大学や自宅で対策，実践すること。",
        "gradingGuidelines": "次の観点別により評価する。満点は100点とし，その内訳は【参加意欲…30％，取り組み（意欲･関心･態度）…20％，技能…20％，応用・思考判断…20％，協調性（関わり合い）…10％】，合計60％以上を合格とする。なお，欠席や遅刻をした理由を証明できる者は，証明書(写しでよい)の空白部分に事由が生じた当日の月日・時限・学籍番号・氏名を記入の上，学期中に担当教員に提出すること。運動やレポート等の課題に対するフィードバックは授業内で口頭で、またはMoodleかメールにて全体または個別に行う。",
        "textbook": "特に指定しない。",
        "referenceMaterials": "市販されている関連書籍や関連雑誌、またはインターネットの関連サイトを参考にすること。",
        "courseSchedule": "第1回：種目選択，全体共通・種目別ガイダンス(履修上の準備物，諸注意など)第2回：初心者(1-1)…ボールの弾みに慣れる，経験者(1-1)…身体慣らしとグループ練習①第3回：初心者(1-2)…グランドストローク，経験者(1-2)…グループ練習②第4回：初心者(1-3)…ルールと審判に慣れる，経験者(1-3)…グループ練習③，ミニゲームと反省練習第5回：初心者(1-4)…サーブと実際のゲーム，経験者(1-4)…グループ練習④，ミニゲームと反省練習第6回：初心者(2-1)…サーブとダブルスゲーム①，経験者(2-1)…ダブルスリーグ①，分習第7回：初心者(2-2)…サーブとダブルスゲーム②，経験者(2-2)…ダブルスリーグ②，分習第8回：初心者(2-3)…サーブとダブルスゲーム③，経験者(2-3)…ダブルスリーグ③，分習第9回：初心者(3-1)…ダブルスリーグ①，経験者(2-4)…ダブルスリーグ④，分習第10回：初心者(3-2)…ダブルスリーグ②，経験者(2-5)…ダブルスゲーム⑤，分習第11回：初心者(3-3)…ダブルスリーグ③，経験者(2-6)…ダブルスゲーム⑥，分習第12回：初心者(3-4)…ダブルスリーグ④，経験者(3-1)…ダブルス・シングルスゲーム①第13回：初心者(3-5)…ダブルスリーグ⑤，経験者(3-2)…ダブルス・シングルスゲーム②第14回：初心者(3-6)…ダブルスリーグ⑥，経験者(3-3)…ダブルス・シングルスゲーム③",
        "courseDataUpdatedAt": "2025/03/05"
    },
    "updateAt": "2025/03/21"
}