{
    "lectureCode": "L604E24",
    "courseName": "EnglishRWII[4]電電",
    "lecturer": [
        "石塚美佳(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "工学部電気電子工学科",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "講義実験棟３０２"
    ],
    "courceDetails": {
        "courseOverview": "EnglishRWIと目的は同じであるが、将来的な英語使用に備えるために、さらに高いレベルのリーディング力、ライティング力の習得に重点をおいた授業を行う。社会・文化的教養ある内容の英文を読む。パラグラフリーディングなどのリーディングスキルを用いながら、内容について理解できる力を向上させる。読みとった内容についてよく理解し、ペアまたはグループで意見交換する機会を持つ。ライティングは、EnglishRWIで学んだパラグラフライティングを4段落構成のエッセイライティングに発展させ、自分の意見を分かりやすく、かつ説得力のある文章で表現することを目指す。",
        "outcomesMeasuredBy": "１．語彙力を強化する。２．社会・文化・国際問題などに関わる様々な内容の英文を精読・速読（パラグラフリーディング）を用いて理解できる。３．読みとった内容について、批判的思考を用いて評価し、自分の意見を平易な文で表現できる。４．パラグラフライティングをエッセイライティングに発展させ、自分の意見を分かりやすく、かつ説得力のある文章で表現できる。",
        "learningOutcomes": "国際的な教養コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "授業は教科書の各unitを1.5回の授業にわたって進めていく。英文に付随する問題は、個人で解く場合もあるが、ペアやグループでディスカッションしながら確認し、トピックについて批評的に考え、意見交換する場合もある。ライティングセクションでは、自分の考えや意見を英語で表現できるように、パラグラフライティングの基礎を学んだ上で、ライティング活動を行うが、各担当者によって取り組み方が異なるので、各担当者の指示に従うこと。テキストに付随しているEnglishCentralの活用についても、各担当者の指示に従うこと。小テストや予習・復習課題、タスクへのフィードバックはGoogleClassroomやMoodle上および授業中に随時行う。ノートPCは指示のある時のみ使用するが、毎回の授業に持ってくること。",
        "notices": "＊授業は全回出席が基本である。＊授業には必ず予習をしてのぞむこと。＊毎回の授業には必ず教科書を持参すること。ノートPCの使用、辞書についての詳細（オンライン辞書の使用等）については、各担当者からの指示に従うこと。＊課題の提出の遅延、未提出は減点の対象となる。必ず提出期限を守ること。＊個人での取り組み、ペア、グループワークに前向きに取り組むこと。＊疑問点については遠慮せずに質問し、わからないままにしないこと。",
        "preparatoryStudy": "予習・復習を十分行う（60分程度）。新しい語彙や表現などは辞書で確認しておく。予習確認テストを行うので十分に取り組んで準備しておく。各Unit冒頭のWarm-upは予習として吹き出しに自分の意見とその理由を書き、グループディスカッションの準備をしておく。また、WordsinFocusに取り組んでおく。また、各WritingセクションのWritingTipsの練習問題は予習として取り組むこと。テキストに付随しているEnglishCentralは復習として取り組み、単語学習や音読の練習に活用する。その他、前の週の授業内やメール、Moodle、GoogleClassroomで指示を出すので指示に従って準備してくること。",
        "gradingGuidelines": "「授業参加姿勢(30%)」「課題点(30％)」「到達度チェック(40％)」を総合的に評価する。合格点は60％とする。授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。",
        "textbook": "NorikoNakanishi,NicholasMusty,ShokoOtake,TamShuetYing,\u0026MaryEllis;GlobalPerspectives1,Seibido;ISBN978-4-7919-7284-5;2,750円（税込）",
        "referenceMaterials": "授業内で適宜紹介する。",
        "courseSchedule": "第1回：オリエンテーション（前期のふりかえり）、Unit7①第2回：Unit7②第3回：Unit7②＆Unit8①第4回：Unit8②第5回：Unit9①第6回：Unit9②\u0026Writing第7回：Writing第8回：到達度確認チェック(1)\u0026Unit10①第9回：Unit10②第10回：Unit11①第11回：Unit11②\u0026Unit12①第12回：Unit12②第13回：Writing第14回：到達度確認チェック(2)、前期のまとめ",
        "courseDataUpdatedAt": "2024\/02\/23"
    },
    "updateAt": "2024\/08\/07"
}