{
    "lectureCode": "L605B07",
    "courseName": "IntegratedEnglishI[7]BS電電応化",
    "lecturer": [
        "石塚美佳(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "応用生物学部,工学部電気電子工学科,工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "講義実験棟３０４"
    ],
    "courceDetails": {
        "courseOverview": "１年次の学習を総合して、より高度な英語の運用能力の向上をめざす。英語ネイティブスピーカーによるCommunicationskillsの向上、学際的な内容を扱うAcademicEnglish、グローバル時代の国際理解に必要な文化と社会に関する知識の修得をめざすCulturalStudies、TOEICやビジネス英語を扱うBusiness/TOEICなどを通じて、学生の興味・関心や進路に即したより高度な英語力の修得をめざす。この授業では洋楽を教材にして英語力の向上を目指す。英語の歌を聴いてそのまま歌詞がわかるようになりたい、上手に英語の歌を歌ってみたい、と思う人は少なくないが、実際には難しい。音がつながったり（連結）、別の音と繋がって音が変化したり（同化）、弱くなって聞こえなくなったり（弱化）するからである。また、文法の省略された形が用いられて意味を取りにくくなることも一因である。この授業では、英語の音楽を用いて、音の特徴や文法に注目しながら、英語への理解を深めることを目的とする。また、アーティストや彼らの社会的・文化的背景にも着目し、それに関する自分の意見を英語で表現する機会を設ける。Pre-intermediateレベル（TOEIC400-500レベル）への到達を目指して授業を行う。発音やリズムを声に出して練習するため、人前で発音・発声するのが苦手な人は履修をお勧めしないが、歌うことに興味がある人には履修を勧める。この科目は前・後期続けて履修することをすすめる。",
        "outcomesMeasuredBy": "１．語彙力を強化する。２．具体的な事象に関して自らの考えを加えながら説明できる。３．批評的思考（クリティカルシンキング）によって、分析・評価ができる。４．グローバル時代に必要な国際的な教養を身につける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業は教科書のunitに沿って進めていく。予習してきたunitで扱われる語彙を確認した後、リスニングのポイントをおさえながら聞き取り問題に取り組む。歌詞の翻訳を通して英文法の復習を行う。応用としてTOEIC形式のリスニング問題に取り組む。アーティストや曲に関する英文を読み、内容理解を確認した後、さらにペアやグループで内容についての意見交換を行う。意見交換後はGoogleChatを用いてクラス全体で意見を共有する。小テストや課題のフィードバックは授業内に行う。また、PCを使用する際は、授業内で指示する。",
        "notices": "・授業は全回出席が基本である。・授業中に小テスト受験、歌の視聴、必要な情報検索を行うため、PCは毎回持参すること。・イヤホン（ワイヤレス、有線両方可）を持参すること（PCと接続できるように）。・オンライン辞書の使用は認めるが、翻訳ソフトを辞書代わりに使うことは禁じる。・授業には必ず予習をしてのぞむこと（予習確認として語彙・文法の小テストを実施）。・ほぼ毎回課題を出す。課題の提出の遅延、未提出は減点の対象になる。必ず提出期限を守ること。・１週間に１度のリスニングトレーニングでは、リスニング力の飛躍的向上はのぞめない。日常から英語の音、リズムに触れることによって慣れてくるので、授業外でも意識しながら英語の歌を聞くこと・歌うことを心がける。・わからないことは遠慮せずに質問すること。",
        "preparatoryStudy": "予習・復習を十分行うこと。各Unitの最初に設けられているWarm-upならびにGrammarPointは予習課題として取り組んでくること。小テストを実施して予習を確認するので、しっかり意味を調べて覚え、問題を解いてくること（約30分）。授業の進度によって課題を出すので指示に従って準備してくること（約30分）。",
        "gradingGuidelines": "「授業参加姿勢(30%)」「課題点(30％)」「到達度チェック(40％)」を総合的に評価する。合格点は60％とする。授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。",
        "textbook": "角山照彦&SimonCapper;EnglishwithHitSongsポップスで学ぶ総合英語;成美堂;ISBN:978-4-7919-3086-9;\\2,100＋税",
        "referenceMaterials": "授業内で適宜紹介する。",
        "courseSchedule": "第1回：導入・英語の音声とリズムについて第2回：Unit1第3回：Unit1第4回：Unit2第5回：Unit2第6回：Unit3第7回：Unit3第8回：到達度確認チェック①・Unit4第9回：Unit4第10回：Unit5第11回：Unit5第12回：Unit6第13回：Unit6第14回：Unit7・到達度確認チェック②",
        "courseDataUpdatedAt": "2024/01/25"
    },
    "updateAt": "2024/12/09"
}