{
    "lectureCode": "L605B03",
    "courseName": "IntegratedEnglishI[3]BS電電応化",
    "lecturer": [
        "本田亮(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "応用生物学部,工学部電気電子工学科,工学部応用化学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ１０４"
    ],
    "courceDetails": {
        "courseOverview": "１年次の学習を総合して、より高度な英語の運用能力の向上をめざす。英語ネイティブスピーカーによるCommunicationskillsの向上、学際的な内容を扱うAcademicEnglish、グローバル時代の国際理解に必要な文化と社会に関する知識の修得をめざすCulturalStudies、TOEICやビジネス英語扱うBusiness\/TOEICなどを通じて、学生の興味・関心や進路に即したより高度な英語力の修得をめざす。この授業は、Grammar(文法)がテーマである。基本的な英文法の復習をしたうえで、実際に読む・書く・聞く・話すの様々な活動を通して、それらの文法を定着することをねらいとする。ここでの「定着」とは、労力をあまり使わなくともまた時間をあまりかけなくとも、英語を理解したり産出したりできる状態のことで、授業では文法項目の解説だけでなく様々な練習を行うため、積極的な参加が求められる。使用する教科書のタイトルには「Writing」とあるが、書く以外の活動も多く行う。TOEICテスト400～500点程度の者、もしくは400～500点程度を目標とする者を対象とする。なお、この科目は前後期とも同一のテキストを使用する予定なので、同じ担当者の授業を継続して履修することをすすめる。",
        "outcomesMeasuredBy": "１．語彙力を強化する。２．具体的な事象に関して自らの考えを加えながら説明できる。３．批評的思考（クリティカルシンキング）によって、分析・評価ができる。４．グローバル時代に必要な国際的な教養を身につける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "毎回の授業ではUnitを１つずつ進めることを基本とする。「授業概要」に示したようにこの授業は文法の「定着」を目指すため、文法事項の解説や演習・解答解説を行ったのち、学んだ英語を練習するための時間を多く取る。練習の過程では英語を口から出して練習したり、ペアワーク等を通して「アクティブに」学習することが多くなるので、積極的に参加してほしい。前期の授業では、文法学習に加えて、文法使用の練習のために「タスク」といわれる学習スタイルも採用する予定である。課題や小テストへのフィードバックは授業内で随時行う。ノートPCを使用する際は指示する。",
        "notices": "・授業には、全回出席することが基本である。事前にわかっている欠席については、メールにて連絡すること。・授業には、事前に指示された予習をして参加すること。・教科書の他、例文の豊富な英和辞書・和英辞書を必ず持参すること。紙辞書でも電子辞書でもかまわない。高校生の頃に使っていたものがあればそれでよい。(Googleなどの検索エンジンや無料辞書サイトでは大学での英語学習には不十分なので、どうしてもノートPCやタブレット端末で辞書の代用をしたい場合は有料の辞書をダウンロードすること。)",
        "preparatoryStudy": "授業の予習復習を十分に行ってから参加することを求める。なお、授業内では簡単な小テストを行うことを予定している。週に１度程度の授業のみでは、十分な英語力を身に付けることは困難なので、各自で自習に励んだり、授業内では不明点を積極的に質問したりしてください。",
        "gradingGuidelines": "「授業参加姿勢(30%)」「課題点(30％)」「到達度チェック(40％)」を総合的に評価する。合格点は60％とする。授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。",
        "textbook": "奥田隆一\u0026AnthonyAllan著;WritingPoints!BasicGrammarforBetterWriting文法を活かす英文ライティング入門;Kinseido;ISBN978-4-7647-3939-0;1,900円(+税)",
        "referenceMaterials": "授業内で必要に応じて提示する。",
        "courseSchedule": "第1回：Introduction第2回：Unit1第3回：Unit2第4回：Unit3第5回：Unit4第6回：Unit5第7回：Review1第8回：Unit6第9回：Unit7第10回：Unit8第11回：Unit9第12回：Unit10第13回：Review2第14回：Comprehensioncheck",
        "courseDataUpdatedAt": "2024\/01\/28"
    },
    "updateAt": "2024\/08\/07"
}