{
    "lectureCode": "L606M04",
    "courseName": "IntegratedEnglishII[4]MS火1",
    "lecturer": [
        "大内田優子(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "メディア学部メディア学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "講義棟Ａ３０１"
    ],
    "courceDetails": {
        "courseOverview": "IntegratedEnglishIの内容をレベルアップし、より実践的な英語力の向上を目的とする。IntegratedEnglishIと同様に、学生の興味・関心や進路に即した内容を学習することを通じて英語の4技能のスキルアップや国際的教養、ビジネス英語のさらなる修得をめざす。本講座はFictionをテーマにしている。授業の英語レベルは、TOEIC400-500レベル到達を目標とする。前後期通じての履修を勧める。",
        "outcomesMeasuredBy": "１．語彙力を強化する。２．具体的な事象に関して自らの考えを加えながら説明できる。３．批評的思考（クリティカルシンキング）によって、分析・評価ができる。４．グローバル時代に必要な国際的な教養力を身につける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本・詩・歌詞など様々な創作作品に触れて分析し、比較文学・作品の映像化・翻訳・翻案の問題点とその将来像を探る試みを行う。歌詞をディクテーションして音の変化を学び、発音のしくみを理解してから、実際に音読トレーニングを行うことで、リスニング力向上を目指す。15秒から4分半のCMに始まり、4行4連ずつのソング英語の歌詞、90分から4時間の映画のストーリーに込められた、小さい、もしくは緻密な、あるいは壮大な物語に、視聴者がなぜ惹きつけられるのか例を持ち出し合ってグループ・ディスカッションを行う。PCの使用については、教員の指示がある時のみ持参する。なお、演習問題の解説等フィードバックは授業中に随時行う。",
        "notices": "＊授業予定や内容確認でMoodleを毎週使用するので、随時チェックする。",
        "preparatoryStudy": "Moodle掲載資料のうち、授業で指示された課題を提出（以下の例を参照）（アメリカ・イギリス・カナダ・オーストラリア英語を聴きとる映画音楽Dictation）（セリフ英語と字幕日本語の「直訳ではない組み合わせ」を探すMovieListening）（映画化作品の原作に触れ「変わるもの・変わらないもの」を探す比較学習）（「カンヌライオンズ」「クリオ賞」等の国際広告祭受賞作品を使用したプレゼン準備）文化的背景の比較約60分の準備学習ができるプリントを配布する。",
        "gradingGuidelines": "「授業参加姿勢(30%)」「課題点(30％)」「到達度チェック(40％)」を総合的に評価する。合格点は60％とする。授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。",
        "textbook": "プリントを使用。（１）授業冒頭：Listeningプリント（２）授業中盤：映画に関する各テーマを扱うプリント（３）授業後半：Speakingプリント",
        "referenceMaterials": "適宜指示する。",
        "courseSchedule": "第1回：ガイダンス（授業の進め方、成績評価についての説明）第2回：映画音楽のディクテーション第3回：ニュースのシャドウィング第4回：Fictionとは第2回：Fictionにおけるアメリカ研究第3回：映画化された米文学１第4回：映画化された米文学２第5回：Fictionにおけるイギリス研究第6回：映画化された英文学１第7回：映画化された英文学２第8回：セリフと字幕の考察第9回：翻訳と翻案第10回：ドラマ・スタディーズ第11回：コマーシャル・スタディーズ第12回：理解度チェック第13回：到達度チェック第14回：復習と応用・総括",
        "courseDataUpdatedAt": "2024\/01\/27"
    },
    "updateAt": "2024\/09\/13"
}