{
    "lectureCode": "L6100101",
    "courseName": "海外語学研修I[オーストラリア]2024年夏実施",
    "lecturer": [
        "ブロックルバンク(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "グローバル化が加速的に進む現代では、国境に関係なく誰もがグローバルな社会に属していると言える。そのため、グローバル社会を理解し、世界中で多くの人が使用する英語を話すことが、より一層重要になってきている。本やインターネットで知識を得ることもできるが、実際に現地に行き、じかにその国の人々や文化に触れることは、今後の人生における貴重な経験になるとともに、さまざまな「発見」や「気づき」を得る機会となる。この研修では、オーストラリア（ゴールドコースト）でホームステイをしながら、現地の語学学校で英語を集中的に学ぶ。",
        "outcomesMeasuredBy": "・自信をもって、英語で自分の考えを伝える。・自己管理能力を高める。・ホームスティを通して、他国の文化に触れる。・他国の学生と交流し、コミュニケーション力を高める。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・１日約５時間の授業を週に５日（月～金）学ぶ。・月曜日～木曜日の授業は多国籍の学生がいるミックスクラスで受講予定。金曜日のみ、工科大生専用クラスで集中的な学修に取り組む。・講師はすべてベテランの英語ネイティブスピーカー。・読む、書く、聞く、話す、語彙力、プレゼンテーション能力を集中的に学ぶ。",
        "notices": "・研修前に、参加方法などを説明するオリエンテーションを実施するので必ず参加すること。・事前・事後授業も実施。現地に行く前に様々なことを学ぶ機会なので、必ず出席すること（対面かZoomで実施）。・海外語学研修２単位認定。ただし、成績評価に反映されるのは次の学期になるので要注意。（夏実施→2024年度後期に単位付与）・渡航費などについてガイダンス、募集説明会で説明する。",
        "preparatoryStudy": "・研修先の国に関する知識をしっかり頭に入れてから参加するとよい。事前授業でも、オーストラリア（ゴールドコースト）について調査・学習する機会を設ける。・英語を多聴して、リスニング力を鍛えておくこと。・普段からできるだけ英語を口にして、英会話力のブラッシュアップを心がけておくこと。",
        "gradingGuidelines": "事前・事後授業（のべ４日間）への参加取り組み状況、事前授業での調査と発表、語学学校での評価、現地での生活態度、帰国後の研修レポート作成と事後授業での発表等をもとに評価する。単位認定の詳細は学部ごとに異なるので、自分が所属するキャンパスの学務課で確認すること。なお課題のフィードバックは事前・事後授業内およびGoogleClassroom上で随時行う。",
        "textbook": "教科書を購入する必要はない。現地の講師より教材が配付される。ただし、筆記用具、電子辞書、ノートPCは持参すること。",
        "referenceMaterials": "特になし。",
        "courseSchedule": "第1回：オリエンテーション[1]（参加者対象説明会）パスポートの取得、旅行保険の加入、その他重要連絡事項第2回：事前授業①（事前調査内容の発表、異文化コミュニケーションについてのレクチャー）第3回：事前授業②（出発の案内、語学研修の準備・行程の最終確認）第4回～第14回：現地での語学研修＆ホームステイ第15回：事後授業（レポート作成と成果発表）",
        "courseDataUpdatedAt": "2024/01/17"
    },
    "updateAt": "2024/08/07"
}