{
    "lectureCode": "L61202",
    "courseName": "中国語I[水3陸]",
    "lecturer": [
        "陸薇(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "講義棟Ａ２０２"
    ],
    "courceDetails": {
        "courseOverview": "本授業の目的は以下のとおりである。１．中国語の知識を学び、コミュニケーション力をつける。真の実践的中国語応用力を修得するために、語彙や文法などの知識を学ぶと同時に、コミュニケーション力・問題解決力を中心とする応用力重視の教室活動を行うようにする。２．中国という国や文化についての総合的理解を深める。「国際人」としての感覚を養成するため、異文化理解力を深める教育を目指す。そのため、言語知識だけではなく、中国の文化-中国の歴史、政治、経済、生活、中国人の衣、食、住、中国人の考え方などについても理解するような教育を行う。本授業は中国語を初めて学ぶ学生を対象とする。中国語Iでは特に発音に重点をおき、耳と口の徹底的なトレーニングを通して、中国語の音声を聞き分け、また発音できるようにする。同時に、会話力を身につけるために、教室ではできるだけ中国語の使用環境を作り、重要表現や基本文型を覚えるために、寸劇やグループ会話等を随時行う。使用教材は本学学生の授業日数を考慮して作られたポイント明瞭、ドリル豊富なテキストである。また、学習、復習用の映像や音声教材も用意しているので、自宅学習も充実していきたいと考えている。",
        "outcomesMeasuredBy": "本授業は、本学のディプロマポリシーで定める6つの能力「国際的な教養」、「実学に基づく専門能力」、「コミュニケーション能力」、「論理的な思考力」、「分析・評価能力」、「問題解決力」のうち、特に「国際的な教養」、「コミュニケーション能力」、「問題解決力」を重点的に修得を目指す。中国語の学習においては具体的に１）中国語の発音（声調、母音、子音、変調など）をマスターする。２）挨拶と簡単な日常会話を覚える。３）語学とともに中国という国と中国人の知識を少しずつ身に着けていく。",
        "learningOutcomes": "国際的な教養コミュニケーション能力問題解決力",
        "teachingMethod": "本授業は反転授業形式で行う。授業の前には、WEBページから課ごとに作られた授業映像を見て学習したうえ、学修レポートを書き、そして理解度をチェックするための小テストを受けること。授業中、ノートパソコンを使い、課ごとに小テストの結果や課題の確認、質疑応答などを行う。教室では、事前学習で学んだ知識を応用して練習中心に授業を進める。きるだけ中国語の使用環境を作り、重要表現や基本文型を覚えるために、寸劇やグループ会話、タスク活動等のアクティブラーニング形式で毎回の授業を行う。また、中国の文化に触れるために、各学期において、「文化に触れる」授業を設ける。主な内容としては映像や写真などを使用し、中国の現状を知ってもらったり、中国の生活習慣、食文化、京劇、映画などを紹介したりする。具体的には、中国語Iでは、まずは発音を特訓する。その上で発音の基本を勉強しながら、初級文法とともに語彙を増やしていく。中国語は漢字を使用するため、一見簡単そうだが、中国で使用されている漢字は日本語と異なる点が多く、あなどれない。こうした点も随時授業で取り上げていく。",
        "notices": "授業は会話中心であるため、授業中、積極的に会話練習に参加してほしい。また出席も語学を続ける上で重要なことなので、極力欠席を避けてほしい。",
        "preparatoryStudy": "授業の前に、必ずWEBページから授業映像を見て学習したうえ、学修レポートを書き、そして理解度をチェックするための小テストを受けておいてください。",
        "gradingGuidelines": "期末試験結果、学修レポート、小テスト結果、定着度確認のための課題の結果などを総合評価する。具体的には、期末試験を60%、学修レポート、小テスト、提出課題を40%で評価し、100点満点中60点以上で単位認定とする。学修内容の定着のため、レポート、小テスト、提出課題に対するフィードバックは授業内で行い、期末試験のフィードバックはMoodleなどを通じて行う。",
        "textbook": "『しゃべっていいとも中国語中西君と一緒に中国へ行こう』陳淑梅劉光赤著朝日出版社",
        "referenceMaterials": "『中日辞典』小学館／講談社",
        "courseSchedule": "第1回：ガイダンス中国語についての概説第１課「こんにちは」発音その１声調第2回：第２課「また明日」発音その２母音、複母音第3回：第３課「ありがとう」発音その３子音第4回：第４課「おひさしぶり」発音その４子音２鼻音第5回：第５課「出迎える」（前）単語ポイント本文姓名の言い方第6回：第５課（後）ドリル寸劇第7回：第６課「歓迎パーティー」（前）単語ポイント本文動詞“是”第8回：第６課（後）ドリル寸劇第9回：中国文化講義第10回：第７課「タクシーに乗る」（前）単語ポイント本文基本語順第11回：第７課（後）ドリル寸劇第12回：第８課「宿泊する」（前）単語ポイント本文存在文第13回：第８課（後）ドリル寸劇第14回：総復習",
        "courseDataUpdatedAt": "2024/02/23"
    },
    "updateAt": "2024/08/07"
}