{
    "lectureCode": "L61306",
    "courseName": "中国語II[金2陳]",
    "lecturer": [
        "陳淑梅(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ１０３"
    ],
    "courceDetails": {
        "courseOverview": "本授業の目的は以下のとおりである。１．中国語の知識を学び、コミュニケーション力をつける。真の実践的中国語応用力を修得するために、語彙や文法などの知識を学ぶと同時に、コミュニケーション力・問題解決力を中心とする応用力重視の教室活動を行うようにする。２．中国という国や文化についての総合的理解を深める。「国際人」としての感覚を養成するため、異文化理解力を深める教育を目指す。そのため、言語知識だけではなく、中国の文化-中国の歴史、政治、経済、生活、中国人の衣、食、住、中国人の考え方などについても理解するような教育を行う。本授業では中国語Iで中国語を半期学んだ学生を対象とする。発音のトレーニングに続き、基本文法や文型を学び、並行して常用単語や日常会話を覚え、初歩的なコミュニケーション能力を身につける。寸劇や小グループでの会話練習を通して積極的に自分の言葉で自分の意志を表現できるように訓練する。中国旅行をテーマに、空港からホテルへ移動する、買い物をする、タクシーに乗る、レストランで食事をする、家庭を訪問する、などの場面を映像教材を参考にしながら、中国人とのコミュニケーションを疑似体験する。",
        "outcomesMeasuredBy": "本授業は、本学のディプロマポリシーで定める6つの能力「国際的な教養」、「実学に基づく専門能力」、「コミュニケーション能力」、「論理的な思考力」、「分析・評価能力」、「問題解決力」のうち、特に「国際的な教養」、「コミュニケーション能力」、「問題解決力」を重点的に修得を目指す。中国語の学習においては具体的に１）中国語の発音、特に声調をさらに安定していく。２）道を尋ねたり、買い物をしたり、レストランでの注文などの技能をマスターする。３）日本語を一語一語中国語に翻訳できるだけではなく、自分の言いたいことを中国語で自由に言えるように、つまり中国語で発想できるように訓練していく。４）友人とのおしゃべりなど、話題作りの練習を通して、コミュニケーション力を身につける。",
        "learningOutcomes": "国際的な教養コミュニケーション能力問題解決力",
        "teachingMethod": "本授業は反転授業形式で行う。授業の前には、WEBページから課ごとに作られた授業映像を見て学習したうえ、学修レポートを書き、そして理解度をチェックするための小テストを受けること。授業中、ノートパソコンを使い、課ごとに小テストの結果や課題の確認、質疑応答などを行う。教室では、事前学習で学んだ知識を応用して練習中心に授業を進める。できるだけ中国語の使用環境を作り、重要表現や基本文型を覚えるために、寸劇やグループ会話、タスク活動等のアクティブラーニング形式で毎回の授業を行う。また、中国の文化に触れるために、各学期において、「文化に触れる」授業を設ける。主な内容としては映像や写真などを使用し、中国の現状を知ってもらったり、中国の生活習慣、食文化、京劇、映画などを紹介したりする。中国語IIの授業においては、発音を定着させるとともに、文法を勉強しながら、実際の場面で活用できるように会話練習を行う。授業中の中国語会話を通じてコミュニケーション能力を身につけていく。",
        "notices": "原則として、「中国語I」の単位を修得していることを履修の条件とするが、初回の授業で「中国語Ⅱ」を履修できるかどうかのレベル等を確認して判断する。授業は会話中心であるため、授業中、積極的に会話練習に参加してほしい。また出席も語学を続ける上で重要なことなので、極力欠席しないでほしい。",
        "preparatoryStudy": "授業の前に、必ずWEBページから課ごとに作られた授業映像を見て学習したうえ、学修レポートを書き、そして理解度をチェックするための小テストを受けておいてください。",
        "gradingGuidelines": "期末試験結果、学修レポート、小テスト結果、定着度確認のための課題の結果などを総合評価する。具体的には、期末試験を60%、学修レポート、小テスト、提出課題を40%で評価し、100点満点中60点以上で単位認定とする。学修内容の定着のため、レポート、小テスト、提出課題に対するフィードバックは授業内で行い、期末試験のフィードバックはMoodleなどを通じて行う。",
        "textbook": "『しゃべっていいとも中国語中西君と一緒に中国へ行こう』陳淑梅劉光赤著朝日出版社",
        "referenceMaterials": "『中日辞典』小学館／講談社",
        "courseSchedule": "第1回：ガイダンス前期復習第2回：第９課「道を尋ねる」(前)語句ポイント本文第3回：第９課（後）ドリル寸劇第4回：第10課ショッピングをする(前)語句ポイント本文第5回：第10課（後）ドリル寸劇第6回：第11課「おしゃべりをする」(前)語句ポイント本文第7回：第11課(後)ドリル寸劇第8回：第12課「料理を注文する」(前)語句ポイント本文第9回：第12課（後)ドリル寸劇第10回：第13課「サッカーのチケットを買う」(前)語句ポイント本文第11回：第13課（後)ドリル寸劇第12回：第14課「マッサージをする」(前)語句ポイント本文第13回：第14課（後)ドリル寸劇第14回：総復習",
        "courseDataUpdatedAt": "2024/02/23"
    },
    "updateAt": "2024/08/07"
}