{
    "lectureCode": "L61601",
    "courseName": "PracticalEnglishI[再1]",
    "lecturer": [
        "日比野千佳(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水4"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ１０３"
    ],
    "courceDetails": {
        "courseOverview": "PracticalEnglishIの再履修者のための授業。英語に触れる機会を増やし、やり取りを行うことによって、英語のコミュニケーション能力を向上させる（英語のインプット／アウトプットの増強）。身近な話題に関する語彙力を養い、自分の考えを英語で表現できるように、様々なペアワークやグループワークによるタスクに取り組むことによってリスニング力、スピーキング力を向上させる。コミュニケーションを通して、指導者のもつ異なる文化的・社会的背景に触れ、関心をもち、英語を共通語として使用するグローバルな社会での考え方や振る舞い方についても学ぶ。",
        "outcomesMeasuredBy": "本科目では、本学のラーニング・アウトカムズのうち・国際的な教養・コミュニケーション能力・問題解決力の習得を目指し、以下を到達目標とする。１．英語を用いてコミュニケーションをとることに対して臆せずに、自分の意志や意見を伝えようという態度をもつ。２．相手の話していることが聞き取れない場合でも、躊躇せずに聞き返したり、わからないという意思表示ができる。３．グローバルな社会において、異なる文化や生活習慣、考え方に関心をもち、多様性を尊重できる。",
        "learningOutcomes": "国際的な教養コミュニケーション能力問題解決力",
        "teachingMethod": "リスニングとスピーキング、特に簡単な日常会話にフォーカスした教科書を用い、教科書を中心に、随時別途に用意した資料などを用いながら聴解練習と話す練習をする。身の回りの基本的な情報（仕事、学校、余暇など）についての文を理解し、ビデオ教材などを用いてさまざまな英語圏文化に触れる。教科書にはいろいろなタイプの聴解練習問題だけでなく、語彙を増やす練習や会話の練習もある。ペアワークやグループワークでこういった練習問題に挑戦し、リスニングとスピーキングの力を伸ばしたい。なお、小テストや演習問題の解説等フィードバックは授業中に行う。",
        "notices": "１．全回出席は前提である。２．毎時間、必ず教科書を持参すること。３．授業中の携帯電話の使用は、教員の指示がある場合に限ります。指示のない場合、たとえ辞書機能であっても禁止する。４．練習問題の解答作成をPC上で行うので、各自PCを持参すること。５．授業態度の悪い学生（居眠り、スマホの使用、授業とは関係のない作業をする等）は評価を大きく下げる。６．問題解決をグループで協力し積極的に取り組む姿勢を大事にしている。",
        "preparatoryStudy": "授業の前に教材に目を通し、新しい語彙や表現（自分の知らない語彙や表現）の意味を調べておく。授業の後には、授業で学んだ語彙や表現を日常のコンテクストでどう使うかを、家でもう一度教材に目を通して確認する。",
        "gradingGuidelines": "「授業参加姿勢（30％）」「課題点（30％）」「到達度チェック（40％）」を基準にして総合的に評価する。合格点は６０％とする。授業参加姿勢とは積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。",
        "textbook": "AlexGraham-Marrその他著;CommunicationSpotlight3rdEdition:StarterClassroomTexts(withcode);ABAXELTPublishing；ISBN978-1-78547-077-6;2900円(＋税）",
        "referenceMaterials": "必要に応じて授業内で指示する。",
        "courseSchedule": "第1回：オリエンテーション第2回：Unit1第3回：Unit1第4回：Unit2第5回：Unit2第6回：Unit3第7回：Unit3第8回：まとめ＆到達度チェック（Unit1・Unit2・Unit3）第9回：Unit4第10回：Unit4第11回：Unit5第12回：Unit5第13回：Unit6第14回：まとめ＆到達度チェック（Unit4・Unit5・Unit6)",
        "courseDataUpdatedAt": "2024/02/28"
    },
    "updateAt": "2024/12/09"
}