{
    "lectureCode": "L61702",
    "courseName": "PracticalEnglishII[再2]",
    "lecturer": [
        "カイC(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水5"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ１０２"
    ],
    "courceDetails": {
        "courseOverview": "PracticalEnglishⅡの再履修者のための授業。将来的な英語使用に備えるために、さらに高いレベルのスピーキング力とリスニング力の習得に重点をおいた授業を行う。会話のトピックを日常的なものから社会的なものにも広げ、よりスムーズに話せるようレベルに応じて指導する。また、リアルタイムで使われている英語を多聴し、ナチュラル・スピードで話の要点を理解できるようにする。実践的なスピーキングとリスニングの練習を通じて語彙力を高め、英語の流暢さと正確さをバランスよく養う。",
        "outcomesMeasuredBy": "本科目では、本学のラーニング・アウトカムズのうち・国際的な教養・コミュニケーション能力・問題解決力の習得を目指し、以下を到達目標とする。１．PracticalEnglishIに引き続き、英語を用いてコミュニケーションをとることに対して臆せずに、自分の意志や意見を伝えようという態度をもつ。２．相手の話していることが聞き取れない場合でも、躊躇せずに聞き返したり、わからないという意思表示ができる。３．グローバルな社会において、異なる文化や生活習慣、考え方に関心をもち、多様性を尊重できる。４．多少の複雑な内容については、これまでの経験や知識を駆使して想像力を働かせて理解する姿勢を身につける。自分の表現したいことを論理的に、相手にわかりやすくプレゼンテーションできる。",
        "learningOutcomes": "国際的な教養コミュニケーション能力問題解決力",
        "teachingMethod": "コミュニケーションにフォーカスした教科書を用い、教科書を中心に、随時別途に用意した資料などを使って聴解練習をすることで、身の回りの基本的な情報(仕事・学校・余暇など）について文や表現を理解する。教科書にはいろいろなタイプの聴解練習問題だけでなく、語彙を増やす練習や会話の練習もある。ペアワークやグループワークで、こういった練習問題に挑戦して、なじみのある話題については単純なやりとりができるコミュニケーション能力を身につけたい。さらに、リスニングとスピーキングを中心に、読む、書く方面の力も伸ばしたい。なお、小テストや演習問題の解説等フィードバックは授業中に行う。",
        "notices": "１．全回出席は前提である。２．毎時間、必ず教科書を持参すること。３．授業中の携帯電話の使用は、教員の指示がある場合に限ります。指示のない場合、たとえ辞書機能であっても禁止する。４．練習問題の解答作成をPC上で行うので、各自PCを持参すること。５．授業態度の悪い学生（居眠り、スマホの使用、授業とは関係のない作業をする等）は評価を大きく下げる。６．問題解決をグループで協力し積極的に取り組む姿勢を大事にしている。",
        "preparatoryStudy": "授業の前に必ず教材に目を通し、新しい語彙や表現（自分の知らない語彙や表現）の意味を調べておく。授業の後には、授業で学んだ語彙や表現を日常のコンテクストでどう使うかを、家でもう一度教材に目を通して確認する。",
        "gradingGuidelines": "「授業参加姿勢30％」「課題点30％」「到達度チェック40％」を基準にして総合的に評価する。合格点は６０％とする。授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。",
        "textbook": "AlexGraham-Marrその他著;CommunicationSpotlight3rdEdition:StarterClassroomTexts(withcode);ABAXELTPublishing；ISBN978-1-78547-077-6;2900円(＋税）",
        "referenceMaterials": "必要に応じて授業内で指示する。",
        "courseSchedule": "第1回：オリエンテーション第2回：Unit7第3回：Unit7第4回：Unit8第5回：Unit8第6回：Unit9第7回：Unit9第8回：まとめ＆到達度チェック（Unit7・Unit8・Unit9)第9回：Unit10第10回：Unit10第11回：Unit11第12回：Unit11第13回：Unit12第14回：まとめ＆到達度チェック（Unit10・Unit11・Unit12)",
        "courseDataUpdatedAt": "2024\/01\/25"
    },
    "updateAt": "2024\/08\/07"
}