{
    "lectureCode": "L621B05",
    "courseName": "IntegratedEnglishIV[5]BS電電応化",
    "lecturer": [
        "本田亮(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "応用生物学部応用生物学科,工学部電気電子工学科,工学部応用化学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ１０４"
    ],
    "courceDetails": {
        "courseOverview": "授業形態はIntegratedEnglishⅢに準じるが、内容はより程度を高めたものになり、ビジネスや大学院での学びなど実践を想定したより高度な運用能力の習得や、世界の様々な社会と文化をより深く理解するための知識の習得を目指す。また、将来、自発的に英語が学習できるような方法論と動機づけも与える。この授業のテーマはTV&Filmで、英米を中心とした英語圏の映画を通して、その社会の文化を捉える。授業では映画そのものを視聴するほか、一場面のアテレコをしたり、関連する英文や歌などを学んだりすることを通して、英語そのものとそれを使用する人々や社会の文化的な知識を獲得する。英語学習の目標の一つとして、日本語字幕なしで洋画を視聴できるようになりたい、と考えている人も多いかもしれないが、実際には「英語音声・日本語字幕」や「英語音声・英語字幕」の映画を理解するだけでも大変である。(またそれだけでも当然学びも多い)。本授業でも基本的には字幕に頼りながら映画を見ることになるので、その中から使える英語表現を少しずつ頭に蓄えていってほしい。授業では、扱った映画に関連する洋書や別の映画を紹介するようにする。生涯にわたって英語を学ぶための方法を映画の視聴という方法を通して伝えていきたい。TOEICテスト500～600点程度の者、もしくは500～600点程度を目標とする者を対象とする。なお、この科目は前後期とも同一のテキストを使用する予定なので、同じ担当者の授業を継続して履修することをすすめる。",
        "outcomesMeasuredBy": "１．語彙力を強化する。２．具体的、抽象的な事柄に関して自らの考えを論理的に組み立て、述べたり書いたりできる。３．批評的思考（クリティカルシンキング）によって、分析・評価ができる。４．グローバル時代に必要な国際的な教養を身につける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "およそ３回の授業で、１つの映画を取り上げる。数回の授業に分けて１本の映画を見ながら、出てきた英語を確認したり、映画の批評や関係する内容の英文を読んだり、映画をテーマとして英語で話したりする。映画中の歌が有名な場合は、歌を取り上げて扱うこともある。これらの活動にはグループで協力して取り組む場合もある。授業では映画を「英語音声・日本語字幕」または「英語音声・英語字幕」で見る。吹替版ではなく字幕で映画を見ることに慣れてほしい。映画ごとに簡単な課題や小テストなどを設定する予定なので、しっかりと取り組むこと。課題や小テストへのフィードバックは授業内で随時行う。ノートPCを使用する際は指示する。",
        "notices": "・授業には、全回出席することが基本である。特に複数回の授業で１本の映画を見るので、欠席するとストーリーが抜けてしまう。事前にわかっている欠席については、メールにて連絡すること。・課題が出たときは、必ず取り組んでから次の授業に臨むこと。・教科書の他、例文の豊富な英和辞書・和英辞書を必ず持参すること。紙辞書でも電子辞書でもかまわない。高校生の頃に使っていたものがあればそれでよい。(Googleなどの検索エンジンや無料辞書サイトでは大学での英語学習には不十分なので、どうしてもノートPCやタブレット端末で辞書の代用をしたい場合は有料の辞書をダウンロードすること。)",
        "preparatoryStudy": "本授業は、課題が出た場合を除いて予習することは難しいため、授業の復習を十分に行うことを求める。なお、授業内では簡単な小テストを行うことを予定している。授業内では不明点を積極的に質問してください。",
        "gradingGuidelines": "「授業参加姿勢(30%)」「課題点(30％)」「到達度チェック(40％)」を総合的に評価する。合格点は60％とする。授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。",
        "textbook": "JosephTabolt&KojiMorinaga著;OurTime,OurLives,OurMovies;Kinseido;ISBN978-4-7647-4044-0;1,900円(+税)",
        "referenceMaterials": "授業内で必要に応じて提示する。",
        "courseSchedule": "第1回：ファンタジーを通して知るイギリス文化『ハリーポッターシリーズ(HarryPotter)』①第2回：ファンタジーを通して知るイギリス文化『ハリーポッターシリーズ(HarryPotter)』②第3回：ファンタジーを通して知るイギリス文化『ハリーポッターシリーズ(HarryPotter)』③第4回：ファンタジーを通して知るイギリス文化『ハリーポッターシリーズ(HarryPotter)』④第5回：ファンタジーを通して知るイギリス文化『ハリーポッターシリーズ(HarryPotter)』⑤第6回：ファンタジーを通して知るイギリス文化『ハリーポッターシリーズ(HarryPotter)』⑥第7回：女性のキャリアと恋『プラダを着た悪魔(TheDevilWearsPrada)』①第8回：女性のキャリアと恋『プラダを着た悪魔(TheDevilWearsPrada)』②第9回：女性のキャリアと恋『プラダを着た悪魔(TheDevilWearsPrada)』③第10回：女性のキャリアと恋『プラダを着た悪魔(TheDevilWearsPrada)』④第11回：他者と共に生きること『E.T.-TheExtra-Terrestrial』①第12回：他者と共に生きること『E.T.-TheExtra-Terrestrial』②第13回：他者と共に生きること『E.T.-TheExtra-Terrestrial』③第14回：到達度チェック、小レポート作成・提出",
        "courseDataUpdatedAt": "2024/01/28"
    },
    "updateAt": "2024/12/09"
}