{
    "lectureCode": "L62201",
    "courseName": "フランス語I[火3]",
    "lecturer": [
        "増田ユリ子(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "講義棟Ａ３０４"
    ],
    "courceDetails": {
        "courseOverview": "本授業は、本学のディプロマポリシーで定める6つの能力「国際的な教養」、「実学に基づく専門能力」、「コミュニケーション能力」、「論理的な思考」、「分析・評価能力」、「問題解決力」のうち、特に「国際的な教養」、「コミュニケーション能力」、「問題解決力」を重点的に修得を目指します。フランス語の世界にようこそ！新しい言葉をはじめることで、きっとみなさんの世界が広がることでしょう。未知の言語をはじめるにあたって何よりも大切なのは、その言葉や、その言葉の背景になる文化を好きになることです。動画つきの教材で、楽しみながら国際的な教養を身につけていきましょう。基礎的な文法知識の習得と並行して、「話す」「聴く」の練習にも力を入れます。グループワークを通して、コミュニケーション能力を高めます。簡単な文であればポイントは聞き取れるよう、そして、きっちりとした発音でとりあえず発話できるように、みなさんを導いていきます。",
        "outcomesMeasuredBy": "以下の点を目標とします。文法：英語と似ている点、違った点を意識しながら、文の基本的な要素を学んでいく。問題解決力が必要とされる。発音：フランス語では一対一となる「スペル→発音」の関係を母音についておさえる。口頭表現：あいさつから始め、日常的な表現を少しずつ増やしていく。",
        "learningOutcomes": "国際的な教養コミュニケーション能力問題解決力",
        "teachingMethod": "教科書の主人公はパリに住む中学生PierreとHugo。夏休みにふたりで南仏に旅に出かけ、先々でいろいろな人に出会います。彼らのdialogueが、第2回目以降の授業のベースになります。毎回、ポイントに注目しながら同じ動画を3回見ます。2回目は、発話の間隔が空いているので、そこでみなさんがリピート。3回目は、発話をすぐに追いかけて真似していきます。このウォームアップが終わったら、教科書の文法事項を学び、補助プリントも含めた練習問題や口頭練習で、知識の定着をはかります。PCは特に必要ありません。",
        "notices": "しっかり出席してください。初修外国語は、一度でも休むとわからなくなります。出席したら、積極的に声を出し、ペアでの会話練習に参加してください。",
        "preparatoryStudy": "予習は「話す」「聴く」中心に：Moodleに載せる動画を見てください。復習は「読み」「書き」中心に：授業中に解いた問題、とくに間違えたところをしっかり復習。",
        "gradingGuidelines": "小テスト＋音読課題＋授業参加度50％、理解度チェック50％（詳細は担当教員に確認のこと）合格最低ラインは60点です。小テスト・課題のフィードバックは授業内で行います。理解度チェックのフィードバックはMoodle上で、全員に向けて掲示します。",
        "textbook": "白水社DVDつき教科書『ピエールとユゴー』（三訂版、緑の表紙）。https://www.hakusuisha.co.jp/smp/book/b383106.htmlhttps://youtu.be/80e-2oB1diY?list=PLhtXxMWkXH6LWU5yDo8zPiEkShpa7Whl_すでにフランス語を履修した人から、練習問題の答えが書きこまれた教科書を譲られると、あなた自身の勉強になりません。そこで節約しないで「自分の」教科書を入手してほしい。",
        "referenceMaterials": "特に必要ありません。電子辞書にフランス語がついている場合はそれを使ってください。",
        "courseSchedule": "第1回：イントロダクションあいさつ、発音の入門第2回：Leçon1(1)「〜は〜です」その１（僕はフランス人です）第3回：Leçon1(2)「〜は〜です」その２（彼もフランス人です）第4回：Leçon1小テスト、Leçon2(1)名詞に「性別」がある!?（これはなに？）第5回：Leçon2(2)形容詞も「性別」に影響される!?!?（大きな黒いバッグだね）第6回：Leçon2(3)「〜は〜をもっている」（何を持っているの？）第7回：Leçon2小テスト、Leçon3(1)「〜は〜の〜です」（Hugo君のカバン）第8回：Leçon3(2)最大勢力の動詞グループ（探している、好きだ、話す、など）第9回：Leçon3(3)「〜ない」（切符が見つからない…）第10回：Leçon3(4)「〜は〜をもっていない「～がとても好きだ」（マカロン、好きですか？）第11回：Leçon3小テスト、Leçon4(1)「この・その・あの」（この列車は直通だ）第12回：Leçon4(2)「〜は〜をする、つくる」（買い物をします）第13回：Leçon4(3)「〜ですか？」の３パターン（日本語、話しますか？）総復習第14回：Leçon4小テスト、理解度チェック",
        "courseDataUpdatedAt": "2025/01/22"
    },
    "updateAt": "2025/03/21"
}