{
    "lectureCode": "L62303",
    "courseName": "フランス語II[木1]",
    "lecturer": [
        "増田ユリ子(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "講義棟Ａ２０１"
    ],
    "courceDetails": {
        "courseOverview": "本授業は、本学のディプロマポリシーで定める6つの能力「国際的な教養」、「実学に基づく専門能力」、「コミュニケーション能力」、「論理的な思考力」、「分析・評価能力」、「問題解決力」のうち、特に「国際的な教養」、「コミュニケーション能力」、「問題解決力」を重点的に修得を目指します。前期のフランス語Iの続きです。アンケートなどで出された皆さんの要望にこたえるべく、さらに効果的な授業を目指します。未知の言語を学ぶにあたって何よりも大切なのは、その言葉や、その言葉の背景になる文化を好きになることです。動画つきの教材で、楽しみながら国際的な教養を身につけていきましょう。基礎的な文法知識の習得と並行して、「話す」「聴く」の練習にも力を入れます。グループワークを通して、コミュニケーション能力を高めます。簡単な文であればポイントは聞き取れるよう、そして、きっちりとした発音でとりあえず発話できるように、みなさんを導いていきます。",
        "outcomesMeasuredBy": "以下を目標とします。文法：文の要素をさらに学び、フランス語の基礎をかためる。問題解決能力が必要となる。発音：独特の「鼻母音」をフランス語らしく発音する。口頭表現：日常的な表現の幅をさらに広げる。",
        "learningOutcomes": "国際的な教養コミュニケーション能力問題解決力",
        "teachingMethod": "教科書の主人公はパリに住む中学生PierreとHugo。夏休みにふたりで南仏に旅に出かけ、先々でいろいろな人に出会います。彼ら＋出会った相手のdialogueが、授業のベースになります。毎回、ポイントに注目しながら同じ動画を3回見ます。2回目は、発話の間隔が空いているので、そこでみなさんがリピート。3回目は、発話をすぐに追いかけて真似していきます。このウォームアップが終わったら、教科書の文法事項を学び、補助プリントも含めた練習問題や口頭練習で、知識の定着をはかります。",
        "notices": "「フランス語I」の単位を修得していることを履修の条件とします。しっかり出席し、居眠りの誘惑に打ち勝ち、それでも理解できない点は、ためらわず質問すること。",
        "preparatoryStudy": "予習は「話す」「聴く」中心に：各課を始める前にPierreたちのdialogueの解説を配布しますので、それを参照しながらdialogueを視聴しておく（添付DVDのほか、動画ストリーミングもあります）。復習は「読み」「書き」中心に：授業中に解いた問題、とくに間違えたところをしっかり復習。",
        "gradingGuidelines": "小テスト+音読課題+授業参加度40％、理解度チェック60％合格最低ラインは60点です。小テスト・課題のフィードバックは授業内で行います。最終回の理解度チェックのフィードバックはMoodle上で、全員に向けて掲示します。",
        "textbook": "白水社DVDつき教科書『ピエールとユゴー』（三訂版、緑の表紙）。すでにフランス語を履修した人から、練習問題の答えが書きこまれた教科書を譲られると、あなた自身の勉強になりません。そこで節約しないで「自分の」教科書を入手してほしい。",
        "referenceMaterials": "特に必要ありませんが、（『プチ・ロワイヤル仏和辞典』のような電子辞書ではなく）活字の辞書をもし購入する場合は、いつか自分でさらに発展した勉強を続けていくために、三省堂の『クラウン仏和辞典』、旺文社の『ロワイヤル仏和中辞典』、白水社の『Dico』などの中辞典を薦めます。",
        "courseSchedule": "第1回：フランス語Ⅰの復習第2回：Leçon5(1)「へ行く」（サルラへ列車で行きます）第3回：Leçon5(2)「から来る」（僕たちパリから来ています）第4回：Leçon5(3)「しろ」「しよう」「してください」（車に乗りなさい）第5回：Lecon5小テスト、Leçon6(1)「〜の～」（私の娘も15歳だ）第6回：Leçon6(2)主語でも目的語でもない人称代名詞!?（僕と一緒に来る？）第7回：Leçon6(3)「どの」「なんの」「どんな」（何色が好き？歳はいくつ？）第8回：Lecon6小テスト、Leçon7(1)数えられないものにも冠詞がつく!?（コーヒー飲む？）第9回：Leçon7(2)「欲しい」「したい」（のど、乾いた。水が飲みたい）第10回：Leçon7(3)第2勢力の動詞グループ（選ぶ、終わらせる、など）第11回：Lecon7小テスト、Leçon8(1)なにも指さないil（いま、何時ですか？いい天気）第12回：Leçon8(2)「わたしを」「あなたを」等（直接目的語）（彼女を手伝おう）第13回：Leçon8(3)「できる」「してもよい」「してもらえますか」（5時に来られる？）第14回：Leçon8小テスト、まとめと理解度チェック",
        "courseDataUpdatedAt": "2024/02/23"
    },
    "updateAt": "2024/12/09"
}