{
    "lectureCode": "L70313",
    "courseName": "データサイエンス入門[合B3]",
    "lecturer": [
        "亀井聡(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ４０２"
    ],
    "courceDetails": {
        "courseOverview": "情報通信技術の発展した今日では、ビジネスや医療、教育、行政などあらゆる分野において、誰でも簡単にデータを手にすることができる。「データサイエンス」とは、社会に溢れているデータから物事の実態や本質を引き出す学問である。収集したデータから有益な情報を得るためには、データを管理、加工、処理、分析するためのスキルが必要になるだけでなく、様々なデータ分析経験を積むことが必要になる。本講義では、データサイエンスへの入門として、統計学の初歩的な解説と演習を行うことに加え、自然科学、社会科学に関する事例の紹介および機械学習の入門的な概説を行う。以下に具体的な内容を述べる。まず、統計学の初歩的な事項として、データの整理とグラフによる可視化の方法、さらにデータの代表値、ばらつき、特徴、傾向等を調べる手法について解説を行う。また、自然科学における実験・観測データの数値的な処理や分析の方法、社会学におけるアンケート調査やヒアリング調査などの社会調査の意義と方法について、具体例を交えながら紹介する。それらに加え、機械学習の基本的なアルゴリズムについての概説を行う。講義は一方的な解説に留まらず、データ分析手法の習得を目的として、Excelを用いた実践的な演習を行う。",
        "outcomesMeasuredBy": "本授業は実学に基づく専門能力の下地となるものであり、以下の項目を授業の到達目標とする。1.データの種類を理解し、様々なグラフを読み取れるようになる2.データを特徴づける指標を理解する3.相関係数と因果関係の意味を理解する4.推定と検定の考え方を理解する5.自然科学における実験・観測や社会調査の理論と方法の概要を知る6.与えられた情報に対して、客観的なエビデンスから、批判的に物事を考える能力を身につける7.データに関する法律やAI社会における倫理について概要と基本原則を理解する。",
        "learningOutcomes": "国際的な教養論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "原則、スライドを用いて講義を進める。スライドは講義資料として配布する。説明および解説はなるべくやさしく行い、理解を助けるために身の回りの具体例を取り上げて説明する。授業では毎回Moodleによる小テスト行う。また、授業でエクセルを使用するため、ノートPCを持ってくること。",
        "notices": "(1)本講義では、１年生前期開講の「数学基礎」あるいは「数学概論」の内容を習得していることを前提とする。(2)高校の数学Iの内容（「データの分析」）を復習しながら学習することを勧める。(3)毎回小テストを行うので，そのつど復習をすることが必要である。",
        "preparatoryStudy": "授業中に実施した小テストの問題で誤った部分について、講義資料をよく読んだ上でもう一度解くこと(60分程度)。授業内容をよく復習しておくことは次回の予習にもなるので、特に復習を十分に行うこと(60分程度)。また、次回の授業までに、（授業中に）指示があった課題に積極的に取り組むこと(120分程度)。",
        "gradingGuidelines": "成績評価は、毎回の小テスト（30%）とエクセルを用いた演習（20%）と定期試験（50%）によって行う。各回の小テスト、演習については授業内で解説を行う予定である。",
        "textbook": "教科書は用いない。講義資料をMoodleにアップロードする。",
        "referenceMaterials": "第1回：ガイダンス：データサイエンスの光と影第2回：様々な領域のデータ（質的データと量的データ）とその取得法第3回：統計データの整理：統計資料および様々なグラフの解釈における留意事項第4回：量的データの代表値とばらつき：平均・中央値・最頻値、分散・標準偏差第5回：データのばらつき：正規分布、誤差と不確かさ第6回：質的調査の理論と方法（大山、オンデマンド）第7回：ビッグデータを用いたデータ解釈演習1、人工知能・機械学習概説1（亀井、オンデマンド）第8回：相関分析第9回：回帰分析第10回：データの法と倫理（村上、オンデマンド）第11回：ビッグデータを用いたデータ解釈演習2、人工知能・機械学習概説2（亀井、オンデマンド）第12回：推定第13回：検定第14回：データサイエンスの事例紹介（本学ゲスト講師、オンデマンド）",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/02\/23"
    },
    "updateAt": "2024\/09\/13"
}