{
    "lectureCode": "L803B08",
    "courseName": "アカデミックスキルズI[BS8]",
    "lecturer": [
        "杉平敦(兼任講師)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ１０１"
    ],
    "courceDetails": {
        "courseOverview": "この授業は、社会人基礎科目群の必修科目であり、大学で学ぶ上での基礎的スキルとしてのレポートライティングを身につけることを目標とする。大学生の学びには、与えられた課題をこなすだけでなく、いまの社会において重要なこと、乗り越えるべき課題を自分で調べ、主体的に考えていくことが求められる。そのための基礎的な方法であるアカデミックレポートを、実際に書くことを通して学ぶ。レポートを書くには、情報を吟味し、客観的な論拠にもとづいて、しっかりとした日本語で他者を説得する文章を書く、という作業が必要である。データベースの使い方など、広い意味での情報リテラシーの訓練と、書き言葉に慣れる（実際に書く）という訓練を、この授業を通して行う。自分（たち）で課題を設定し、その課題の解決策を探り、最終レポートの執筆につなげるという、課題解決型のアクティブラーニングを用いた授業である。テーマについてのディスカッションや、役割分担をしたうえでの調査など、グループワークも行う。",
        "outcomesMeasuredBy": "①「論理的な思考力」論理的で他者に伝わる正確な文章を書くスキルを身につけること②「分析・評価能力」論理的・批判的思考の訓練をすること、および社会事象や現代的な課題についての分析力を高めること③「コミュニケーション能力」他者との論理的な意見交換・討論ができるようになること④「問題解決力」調査を通じて、適切な問題を設定し、解決のアイデアを考える能力を身につけること",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "１）授業前半では、少人数のグループワークで基本的なテーマ設定を行い、そのテーマについてリサーチを行う。PBL（Project-BasedLearning）的手法にもとづくアクティブラーニングを採用し、総合的な学習能力や客観的な思考・判断力を身につけることをめざす。２）授業後半では、前半のグループで取り上げたテーマを個人で掘り下げて、問いを設定し、追加リサーチを行い、問いへの答えを出す。これをレポートの形でアウトプットする。３）レポート執筆のプロセスでピアチェック（学生による相互の文章チェック）を行う。他人の書いた文章を客観的に評価し、修正の提案をするという作業を行う。",
        "notices": "１）必修の演習科目であるので毎回必ず出席すること。２）クラスのメンバー同士で学び合い、高め合うことは、この授業において重要な意味を持つ。他者を尊重しつつ、学びを深めるために積極的な授業参加を期待する。３）他のグループのテーマについても情報収集を行い、知的な関心を広げるよう努めること。",
        "preparatoryStudy": "毎回60分ていど。特にプロジェクトが本格化してからはその準備が中心となる。【予習】テーマ設定に当たっての情報収集。テーマ決定後は自身が関心をもっている問題やリサーチするテーマについて、普段から新聞、雑誌、書籍などで情報を取得したり、話し合ったりする機会を意識して多く持つようにする。教科書を読み、プロジェクトの進行やレポート執筆の基本事項を確認。【復習】授業の進行状況に応じて、授業外でのリサーチやレポート執筆が必要となる（課題を含む）。必要な準備学習は様々である。次回までにやるべきこと、今後の大きなアウトプット（グループの発表など）に備えて準備するべきことなど、進行を自分たちでマネジメントして授業に臨むこと。",
        "gradingGuidelines": "期末テストは行わず、以下の3つの視点から評価を行う。・最終レポート（40％）・グループワーク（25％）・提出物（35％）ただし、最終レポートの提出がない場合は不合格とする。課題や発表に対して、授業内およびmoodle等でフィードバックを行う。",
        "textbook": "稲葉竹俊編『改訂プロジェクト学習で始めるアクティブラーニング入門』、コロナ社、2019．※改訂版なので購入の際に注意すること。",
        "referenceMaterials": "各教員の指示に従うこと",
        "courseSchedule": "第1回:レポート執筆やPBLについてのガイダンス第2回:グループの決定、テーマ決定に向けての調査第3回:テーマ決め、リサーチ第4回:テーマ説明（テーマ発表）とふり返り第5回:グループリサーチ第6回:グループリサーチの続き第7回:グループ発表第8回:ふり返り（グループ発表の続き）第9回:レポートについてのレクチャー、追加リサーチ第10回:レポート執筆①第11回:レポート執筆②第12回:レポート執筆③、ピアチェック第13回:レポート執筆④第14回:全体のピアチェック、まとめ",
        "courseDataUpdatedAt": "2024\/02\/23"
    },
    "updateAt": "2024\/08\/07"
}