{
    "lectureCode": "L804BC01",
    "courseName": "アカデミックスキルズII[BSCS1]",
    "lecturer": [
        "中島敏博(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水"
    ],
    "targetDepartment": "応用生物学部応用生物学科,コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "講義棟Ａ２０１"
    ],
    "courceDetails": {
        "courseOverview": "この授業は、社会人基礎科目群の必修科目であり、大学生にとっても、社会人になってからも必須の能力としての、リサーチの技術と、プレゼンテーションの技術を磨くことを主な狙いとする。リサーチは、単に情報を集めることではなく、情報ソースの信頼性を確かめ、他の情報との意味関連をふまえる作業が必要である。自らの考えを他者に“わかりやすく”伝えるプレゼンテーションには、一方的に話し手の意見を聞き手に伝達するのではなく、使う言葉の選択やトピックを話す順番など、聞き手の理解を促す工夫が必要である。クラスごとに取り組むテーマが異なり、そのテーマ内のサブテーマ（課題）をグループで設定し、その改善策や解決策を考えていく。授業形式はチーム作業が主体になる。そのアウトプットとして、段階的に3回のプレゼンテーションを行う。チームでのこうした協働プロセスを通して、プレゼンテーション自体に慣れ、他者と対話する力、意見をまとめる力などを身につけることをめざす。各クラスで扱うテーマが異なるため、各々の興味分野をもとに前期中にクラス分けを行うので注意すること。",
        "outcomesMeasuredBy": "①「コミュニケーション能力」他者との論理的な意見交換・討論ができるようになること、コミュニケーション能力を高めること（＝双方向の意見交換）、他者に効果的に伝えるプレゼンテーションのスキルを高めること。②「論理的な思考力」論理的・批判的思考の訓練をすること。③「分析・評価能力」社会事象や現代的な課題についての分析力を高めること。④「問題解決力」調査を通じて、適切な問題を設定し、解決のアイデアを考える能力を身につけること。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "１）クラスごとに別々の大テーマが設定し、グループワークで演習を進める。クラス内の各グループは、大テーマの枠内で個別のテーマを設定し、リサーチを行っていく。前期中に希望を取り、希望者多数のクラスは抽選でクラスを振り分ける。具体的なテーマと選抜方法についてはアカデミックスキルズⅠの授業内で告知する予定である。２）少人数グループによる問題発見解決型の学習（PBL：Project-BasedLearning）的手法にもとづくアクティブラーニングを採用し、総合的な学習能力や客観的な思考・判断力を身につけることをめざす。３）当科目のPBLは、グループ単位で特定テーマについて調査・発表・議論する学習である。４）発表方法はパワーポイントによる「プレゼンテーション（プレゼン）方式」とする。",
        "notices": "１）必修の演習科目であるので毎回必ず出席すること。２）グループでの調査や資料作成などは授業時間外での学習となるので、グループメンバー間での報告・連絡・相談を周到に行うこと。３）他のグループの発表についてもそのテーマに関しての準備学習を行って授業に参加すること。",
        "preparatoryStudy": "毎回60分ていど。特にプロジェクトが本格化してからはその準備が中心となる。【予習】テーマ設定に当たっての情報収集。テーマ決定後は自身が関心をもっている問題やリサーチするテーマについて、普段から新聞、雑誌、書籍などで情報を取得したり、話し合ったりする機会を意識して多く持つようにする。教科書を読み、プロジェクトの進行やレポート執筆の基本事項を確認。【復習】授業の進行状況に応じて、授業外でのリサーチやレポート執筆が必要となる（課題を含む）。必要な準備学習は様々である。次回までにやるべきこと、今後の大きなアウトプット（グループの発表など）に備えて準備するべきことなど、進行を自分たちでマネジメントして授業に臨むこと。",
        "gradingGuidelines": "期末テストは行わず、以下の３つの視点から評価を行う。・発表に対する評価（40％）・授業への参加姿勢に対する評価（25％）・提出物（35％）ただし、最終成果物と振り返りシートの提出がない場合は原則不合格とする。課題や発表に対して、授業内およびmoodle等でフィードバックを行う。",
        "textbook": "稲葉竹俊編『改訂プロジェクト学習で始めるアクティブラーニング入門』、コロナ社、2019．※改訂版なので購入の際に注意すること。",
        "referenceMaterials": "各教員の指示に従うこと。",
        "courseSchedule": "第1回:ガイダンス、各テーマについての説明第2回:グループ決定、チームビルディングワーク第3回:グループでのリサーチ第4回:テーマ決め、テーマの概要まとめ第5回:テーマ説明／発表、ふり返り第6回:プレゼンテーションに関するレクチャー、グループワーク（リサーチ・スライド作成）第7回:グループワーク（リサーチ、スライド作成）第8回:中間プレゼンテーション第9回:ふり返り（中間プレゼンテーションの残り）第10回:グループワーク（リサーチ、スライド作成）第11回:グループワーク（リサーチ、スライド作成）第12回:最終プレゼンテーション第13回:最終プレゼンテーション第14回:最終プレゼンテーション／ふり返り",
        "courseDataUpdatedAt": "2024/02/23"
    },
    "updateAt": "2024/08/07"
}