{
    "lectureCode": "L90302",
    "courseName": "地域連携実習I[登別]",
    "lecturer": [
        "中島敏博(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "実習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "この授業は対象となる地域課題の解決に向けた取り組みに参加することで学習する専門的な知見の応用力を高めるとともに、社会や地域に貢献するための力を養うための教育プログラムとなります。大学を離れた実践的な現場に関わることで、ラーニング・アウトカムズが定める学習成果に貢献します。特にコミュニケーション能力、問題解決能力を養い、実社会に役立つ人材としての能力向上を目指します。",
        "outcomesMeasuredBy": "1.解決困難な事象に対して、行動することで変化を促していく「問題解決能力」2.行動の結果を受け止め、変化したことへの「分析・評価能力」3.市民と対等に対話し、自らの経験を言葉として伝える「コミュニケーション能力」4.持続可能な社会を目標として、複雑で予測困難な状況に柔軟に対応し、解決に向けたステップを付けられる論理的な思考力以上を評価します。",
        "learningOutcomes": "コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "このプログラムはチームで課題に取り組みます。それぞれ連携団体や協力する市民とも取り組むため、多様な立場の方々との対話が多く展開されます。取り組むプロジェクトによって、設定される課題に対して解決する方法を議論し、次の履修学生への改善点・展開方法を提示し、協力いただく連携団体や市民の方々に成果を積み上げていく授業となります。その成果は関係団体への報告会のほか、報告書としてまとめて蓄積していきます。現地でオンラインツールを用いて成果をまとめ、プレゼンテーションを作成します。ノートPCを必ず持参ください。",
        "notices": "〇地域連携実習Ⅰは前期集中科目となります。〇履修者は10名を上限とします。希望者多数の場合は選抜します。〇事前学習と現地活動、事後学習のすべてに参加することが条件となります。〇現地でまち歩きやトレッキングなど長距離歩きます。〇現地活動は宿泊を伴う共同生活になります。〇5月中旬に予定される履修希望者説明会に参加してください。",
        "preparatoryStudy": "〇取り組む地域の総合計画、まち・ひと・しごと総合戦略などは各自ダウンロードする〇該当地域で配信されているブログ・動画などを見ておくことが望ましい〇他の地域で実施されている同様の取り組み事例も調べておくことが望ましい〇次の活動予定を必ず確認し、メンバーと作業や調査内容について綿密にイメージを作ること〇活動後は成果をノートなどにメモとして作成し、報告書に記載できるように記録すること（事前・事後を併せてに120分程度を充てること）",
        "gradingGuidelines": "〇プロジェクトへの貢献度（60％）〇報告会資料の完成度とプレゼンテーション技法（30％）〇報告書による学習への理解度（10％）〇授業中に適宜プロジェクトの進捗や整理状況の報告を求め、フィードバックしていく。",
        "textbook": "教科書の指定はありません",
        "referenceMaterials": "",
        "courseSchedule": "5月中旬履修希望者説明会6月履修者確定7月上旬履修者説明会8月上旬事前学習（2～3日間）9月上旬現地活動（10日間）9月中旬事後学習（1日）※実際の活動日程は履修希望者説明会で公表します",
        "courseDataUpdatedAt": "2025/01/22"
    },
    "updateAt": "2025/03/21"
}