{
    "lectureCode": "L90303",
    "courseName": "地域連携実習I[八王子学童保育]",
    "lecturer": [
        "神子島健(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "実習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "この授業は対象となる地域課題の解決に向けた取り組みに参加することで、学習する専門的な知見の応用力を高めるとともに、社会や地域に貢献するための力を養うための教育プログラムとなります。大学を離れた実践的な現場に関わることで、ラーニング・アウトカムズが定める学習成果に貢献します。特にコミュニケーション能力、問題解決能力を養い、実社会に役立つ人材としての能力向上を目指します。",
        "outcomesMeasuredBy": "1.解決困難な事象に対して、行動することで変化を促していく「問題解決能力」2.行動の結果を受け止め、変化したことへの「分析・評価能力」3.市民と対等に対話し、自らの経験を言葉として伝える「コミュニケーション能力」4.持続可能な社会を目標として、複雑で予測困難な状況に柔軟に対応し、解決に向けたステップを付けられる論理的な思考力以上を評価します。",
        "learningOutcomes": "コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "このプロジェクトでは、学童保育の支援を通して、子どもたちだけでなく、学童の職員、保護者など、多様な立場の方々と接する中で、子どもにとってよい放課後の居場所を作ることに関わっていきます。子どもと向き合うにはことばだけでなく、状況判断能力や非言語コミュニケーションの能力も必要とされます。また、プロジェクトメンバーと自身の経験を比較し、言語化することで、子どもと向き合うことへの考察を深めていきます。同時に、今日ますます重要となる子育て支援の現場の苦労を知ることで、少子高齢化社会の抱える具体的な課題を深く考えていきます。ふり返りをまとめた成果は関係団体への報告会のほか、報告書としてまとめて蓄積していきます。教室での授業時および準備学習にはノートPCを使用します。",
        "notices": "〇地域連携実習Ⅰは前期集中科目となります。〇履修者は10名を上限とします。希望者多数の場合は選抜します。〇事前学習と現地活動、事後学習のすべてに参加することが条件となります。〇活動では、子どもと遊ぶための動きやすい服装が求められます。〇5月ごろに予定される履修希望者説明会に参加してください。",
        "preparatoryStudy": "〇学童保育の運営に関わる厚生労働省および八王子市、比較のため自分の地元自治体などの資料・ウェブサイトの文献調査〇学童での活動のふりかえりその内容に関連した独自リサーチ〇学童を中心とした子育て支援に関する社会課題のニュース等のリサーチ（必要に応じて指示する）（120分）",
        "gradingGuidelines": "〇プロジェクトへの貢献度（50％）〇報告会資料の完成度とプレゼンテーション技法（30％）〇ブログ・報告書による学習への理解度（20％）60％以上で合格ただし、やむを得ない事情の欠席を除き、学童への活動への全参加を前提とするフィードバックは授業内で適宜行う",
        "textbook": "特になし",
        "referenceMaterials": "増山均『学童保育を哲学する』自治体問題研究所、2022年月刊『日本の学童ほいく』全国学童保育連絡協議会放課後児童クラブ運営指針（厚生労働省）ほか、必要に応じて指示します。",
        "courseSchedule": "5月中旬履修希望者説明会6月履修者確定7月上旬履修者説明会8月上旬事前学習（2日間）8月下旬～9月下旬学童での活動（7日間程度）中間振り返り（1日）※活動は夏季休暇中の平日8時間×5日程度、および、9月後半（土曜を含む数日）9月末か10月前半事後学習（1日）※学童でのイベントのスケジュールに合わせるため、日程は未確定です。実際の活動日程は履修者説明会で相談します。特に蒲田キャンパスの学生は、できる範囲で柔軟に対応します。",
        "courseDataUpdatedAt": "2025/03/04"
    },
    "updateAt": "2025/03/21"
}