{
    "lectureCode": "L90701",
    "courseName": "サービスラーニングI",
    "lecturer": [
        "神子島健(教養学環)",
        "中島敏博(教養学環)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水5"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "講義実験棟２０１"
    ],
    "courceDetails": {
        "courseOverview": "サービスラーニングⅠは、講義と八王子市内での社会貢献・ボランティア活動がセットになったユニークな授業である。講義は、社会貢献活動の現状、社会的スキル、市民性の概念、体験活動の振り返りを中心に展開され、地域社会における「助け合い」の概念や構造について学び、人と人との営みに存在する「共生」について考え、理解を深めていく内容となっている。社会活動に必要なコミュニケーション能力の基本から学んでいく。社会貢献・ボランティア活動は、授業の一環として八王子市内で地域住民主体の活動や行政の施設の活動サポートを体験していく。体験内容は、自治会活動の支援、公園における清掃活動、市民活動の支援や図書館の支援など多岐にわたる体験を予定している。学生の皆さんには、体験してみたい活動を選択して、受入先の方々とコミュニケーションをとり、社会的スキルの重要性と社会貢献のプロセスを肌で感じてもらう。授業終盤は、地域での体験をまとめて社会貢献活動に関する自分なりの考えを仲間とともにシェアしていく。そして、本授業を通じて、社会貢献という地域社会を支える活動の意義を発見し、社会の一員としての役割について考えていく。",
        "outcomesMeasuredBy": "・社会において活動するうえでの基礎的なコミュニケーション能力（社会的スキル）を身につける・地域における実際の社会貢献活動を通じて、他者との協働性、他者のニーズの把握、コミュニケーションスキルを身につける「コミュニケーション能力」・ボランティアの意義や社会におけるその構成と活動、市民性についての知識を習得し、社会課題について考察する「論理的な思考力」・地域課題に対する社会貢献活動への参加とふり返りを通して、課題の改善についての見通しを考える「問題解決力」・社会貢献・ボランティアという考えに対する価値観を考察し、社会の一員となる重要性について考えをまとめる",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "サービスラーニングを履修する学生は第1週の授業ガイダンスに出席し、授業の流れについて確認することが必要である。他の講義等と異なりサービスラーニングでは、12時間以上を八王子市内における地域社会での活動に参加・体験し、地域活動や社会課題に触れることが求められる。活動への参加や体験の前後には、ボランティア活動や地域社会についての講義がある。講義では、現代日本の地域社会の状況とそこでの活動の意義、地域で出会う多様な人たちと向き合う姿勢や協働について理解を深める。活動後は、活動や体験について考察し、仲間とともにディスカッションして自分なりの思考を深め、活動についての最終レポートをまとめる。",
        "notices": "履修希望者は必ず第1週のガイダンスに出席すること。※1活動参加にあたり保険（340円）加入を必須とする。詳細については授業内で説明する。※2緊急事態宣言等のやむを得ない事情によって活動が実施できない場合は、体験分の時間を講義・演習に当てる。その場合シラバスが変更になるので注意すること。12時間以上の地域社会活動への参加・体験は原則必須とする。（証明のある病欠、公共交通機関が発行する遅延届のある遅刻〔web上のものは受理しない〕、教員が認める特例は免除する。）講義に関する遅刻・欠席も、同様の書類等を必要とする。地域社会で体験・活動する上で求められること：•地域社会には多様な人がいて、価値観も多様であることを学ぶ•地域社会での活動において、状況に応じた行動をとる対応力を身につける•地域社会での活動と学習により社会への認識を深める",
        "preparatoryStudy": "〔予習〕講義をふまえつつ、参加する活動テーマについてあらかじめ調べておくこと。（60分程度）〔復習〕体験をふまえ、ふり返りの簡易的なメモを取り、レポートを作成に備える。ガイダンス用https:\/\/youtu.be\/mVeQW65qLEsインタビューhttps:\/\/youtu.be\/ReM50wVGAtgブログhttp:\/\/blog.la.teu.ac.jp\/blog\/cat24357957\/index.html",
        "gradingGuidelines": "成績評価の比率：2時間以上の活動参加・体験のメモ40％講義への積極的な参加0％最終レポート20％最終発表30％合計得点で60%以上を獲得した者を合格とする。フィードバックは講義内で随時行う。※2時間以上の活動参加がない場合は不合格とする。",
        "textbook": "特になし",
        "referenceMaterials": "必要に応じて授業内で指示する。",
        "courseSchedule": "第1回：ガイダンス（神子島・中島）第2回：活動準備／活動のわりふり（神子島・中島）第3回：ボランティアとは（神子島・中島）第4回：コミュニケーション・ワーク（神子島・中島）第5回：地域活動について（神子島・中島）第6回：市民性とは（神子島・中島）第7回：地域社会での活動（受け入れ先の指示に従うこと）第8回：地域社会での活動（受け入れ先の指示に従うこと）第9回：中間のふり返り（神子島・中島）第10回：地域社会での活動（受け入れ先の指示に従うこと）第11回：地域社会での活動（受け入れ先の指示に従うこと）第12回：レポート執筆および発表に向けて（神子島・中島）第13回：発表準備（神子島・中島）第14回：発表（神子島・中島）協力団体の方が聞きにくる場合があります※体験活動は、学期途中（前期は5月上旬～7月上旬）の土日に実施する（講義と並行する場合もある)。詳細はガイダンスで説明する。",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/08\/07"
}