{
    "lectureCode": "L9240202",
    "courseName": "サービスラーニングIV（国内短期派遣）",
    "lecturer": [
        "中島敏博(教養学環)",
        "大山昌彦(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "この授業は対象となる地域課題の解決に向けた取り組みに参加することで、学習する専門的な知見の応用力を高めるとともに、社会や地域に貢献するための力を養うための教育プログラムとなります。大学を離れた実践的な現場に関わることで、ラーニング・アウトカムズが定める学習成果に貢献します。サービスラーニングⅣは夏季休講期間に集中講義として開催します。事前学習・現地実習・事後学習で基本的に構成されています。事前学習（7・8月）と事後学習（9月）は八王子キャンパスで実施します。なお、4年生で卒業認定に関わる場合は履修することはできません。",
        "outcomesMeasuredBy": "1.持続可能な社会を目標として、複雑で予測困難な状況に柔軟に対応し、解決に向けたステップを付けられる「論理的な思考力」2.解決困難な事象に対して行動することで変化を促す「問題解決力」と行動力3.連携する団体や市民と協働し、同じ目標に向けて行動する協調性4.市民と対等に対話し、自らの経験を言葉として伝える「コミュニケーション能力」以上を評価します。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "北海道登別市および新潟県佐渡市の2つのプロジェクトがあります。それぞれ4泊5日（予定）の宿泊滞在を伴う実習として行います。いずれかのプロジェクトを選んで参加します。各プロジェクトはチーム（グループワーク）で課題に取り組みます。それぞれ連携団体や協力する市民とも取り組むため、多様な立場の方々との対話が多く展開されます。取り組むプロジェクトによって、設定される課題に対して解決する方法を議論し、次の履修学生への改善点・展開方法を提示し、協力いただく連携団体や市民の方々に成果を積み上げていく授業となります。その成果は関係団体への報告会のほか、報告書としてまとめて次年度以降に向けて蓄積していきます。",
        "notices": "5月に事前説明会を行う予定です。受け入れ先の都合もあり、各プロジェクトで10名を募集します。派遣時期は8月下旬から9月中旬まで予定しています。選抜方法についても事前説明会で話します。現地の滞在などで3万円程度、別途現地までの交通費が自己負担として生じます。必ず事前説明会で確認の上で履修してください。実際の派遣日や事前・事後学習などの詳細は履修者確定後の履修者説明会（7月予定）話す予定です。演習科目となりますので、事前・事後学習を含めてすべて参加することを求めます。遅刻は減点対象となります。やむを得ない欠席については教員に必ず連絡したうえで相談すること。",
        "preparatoryStudy": "（事前学習）該当地域のHPや観光情報、統計情報などを見てイメージをしてください。「総合計画」、「まち・ひと・しごと総合戦略」など手元に用意してください。また他の地域の取り組みなども調べておくと役立ちます。（60分程度）（事後学習）派遣後も現地からイベントやボランティアなど情報提供が見込まれます。関心を持って、可能であれば継続的に関わることを望みます。",
        "gradingGuidelines": "事前・事後学習を含めた形で以下の内容を評価します。プロジェクトへの貢献度（60％）報告会資料の完成度とプレゼンテーション技法（30％）報告書による学習への理解度（10％）※事前・事後学習を含めてすべて参加することが前提です。",
        "textbook": "特になし",
        "referenceMaterials": "プロジェクトごとに資料を指示します。",
        "courseSchedule": "第1回：ガイダンス（事前学習）第2回：地域課題とは（事前学習）第3回：活動テーマ学習（事前学習）第4回：オンライン交流（事前学習）第5回：活動テーマ学習（事前学習）第6回：活動計画の作成（事前学習）第7回：現地派遣によるプロジェクト実施第8回：現地派遣によるプロジェクト実施第9回：現地派遣によるプロジェクト実施第10回：現地派遣によるプロジェクト実施第11回：現地派遣によるプロジェクト実施第12回：現地派遣によるプロジェクト実施第13回：現地派遣によるプロジェクト実施第14回：活動の振り返り（事後学習）担当は登別市は中島が、佐渡市は大山となる予定",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/08\/07"
}