{
    "lectureCode": "L9240201",
    "courseName": "サービスラーニングIV（八王子）",
    "lecturer": [
        "神子島健(教養学環)",
        "佐藤宏樹(兼任講師)",
        "中島敏博(教養学環)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水4"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "講義実験棟３０１",
        "講義実験棟３０２"
    ],
    "courceDetails": {
        "courseOverview": "サービスラーニングⅣは、地域社会での活動・課題解決に学生が参加し、地域住民と共に実際に取り組む授業である。具体的にはリアルな地域課題やニーズを発見・観察する、仲間と共に地域課題の解決に取り組む、ニーズに対応するためにディスカッションを重ねるなど、実際の地域で起こっている様々な事象のプロセスにおいて対応力や応用力などの学修を目指す。また、学生は、地域課題や地域ニーズについて考えることを通じて、社会における共生の重要性についてふり返り、自分なりの共生のあり方について考察する。本授業では社会性や市民性の視点を取り入れ、学生の専門性を実社会で活かすため応用力や思考力の向上を目指す。社会性とは様々な人とともに活動するためのスキルであり、市民性とは既存の社会のあり方を批判的に認識し、社会の一員として他の人たちと支え合って生きていく市民としての自覚である。社会のニーズをとらえ、他者と協働する経験は、専門を活かす可能性も広げ、社会において創造性や自主性を発揮することにつながるのであり、そのための能力を磨く科目である。※サービスラーニングⅣを履修するには、地域共生論またはサービスラーニングⅠ・Ⅱの単位を事前に修得している事が望ましい。希望者多数の場合は、修得者を優先する。※感染症の流行によっては活動を中止して講義やグループワークで代替する場合がある。",
        "outcomesMeasuredBy": "•地域課題・地域ニーズの解決や対応に必要なリテラシー（知識や能力）を身につける•関わっている地域課題・地域ニーズをふまえ、地域社会での共生に必要なリテラシー（知識や能力）を身につける•共生のための支えあいの活動の意義を理解し、それに対して主体的に参加する•地域社会の一員として活動するために必要なマナーや姿勢を身につける•多様な意見や思いを尊重し、他者の考えや情報を多角的に捉える「論理的な思考力」を身に着けた上で、状況に応じたアウトプットができる「コミュニケーション能力」•地域社会での活動を支える一員としての主体性と行動力を身につける•直面している課題を改善するために協働の中で創造的な活動を行うことができる「問題解決力」",
        "learningOutcomes": "コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "活動場所によってスケジュールや授業の進め方が大きく異なるため、第一週の授業ガイダンス（水曜日4限）に必ず出席し、授業の流れについて確認することが必要である。サービスラーニングⅣでは、講義のほかに12～20時間程度を八王子市内・近隣地域において地域社会での活動に参加・体験し、地域課題を解決するための活動に参加することが求められる。講義では、活動の内容に関する基礎的概念について学び、地域で出会う多様な人たちと向き合う姿勢や協働について理解を深める。活動が一通り終了した後には、活動や体験について考察し、仲間とともにディスカッションして自分なりの思考を深める。授業の流れ：事前授業、地域社会での体験（講義が途中で入る場合もある）、事後授業の構成で授業が実施される。活動場所・活動内容とスケジュールについては、ガイダンスで説明する。※地域での体験は、受入先のスケジュールを考慮し、水曜4・5限または土日祝日に実施する。（活動場所により異なる）※学内での授業は全て水曜4限に実施する。",
        "notices": "活動受け入れ先の事情から履修可能人数が限られるため、希望者多数の場合選抜を実施する場合がある。履修希望者は必ず第1週のガイダンスに出席すること。活動参加にあたり保険（340円）加入を必須とする。詳細については授業内で説明する。地域社会での活動への参加・体験と授業への参加は原則必須とする。体調不良等で活動を欠席した場合、事情に応じて対応を決めるので、個別に相談すること。演習形式の授業であるため、講義も全出席が基本である。正式な理由のない欠席、遅延届のない遅刻は基本的に減点とする。地域での活動は地域の受入先と協議して行われる。そのため受入先のスケジュールに沿って、体験学習が実施される。体験学習は水曜4・5限または授業のない土日祝祭日になる。",
        "preparatoryStudy": "〔予習〕事前授業をふまえつつ、参加する活動テーマについてあらかじめ調べておくこと。（60分程度）〔復習〕体験をふまえ、ふり返りの簡易的なレポートを作成する。すでに履修した学生からの感想を参考として紹介するガイダンス用https://youtu.be/mVeQW65qLEsインタビューhttps://www.youtube.com/watch?v=EZ8Y-RrLuoYブログhttp://blog.la.teu.ac.jp/blog/cat24357958/index.html",
        "gradingGuidelines": "授業で求められる地域社会活動への参加・体験と事前・事後授業への参加は原則必須とする。活動への参加姿勢や、活動を踏まえた簡易的なレポート等50％最終発表30％内省レポート20％合計得点で60%以上を獲得した者を合格とする。事後授業で活動を振り返り、まとめ、総評を行う。フィードバックは講義内で随時行う。※原則、事前授業・事後授業・活動への全参加が必要となる。",
        "textbook": "特になし",
        "referenceMaterials": "参加する活動に関する記事・レポート・論文・書籍（授業内で指示する）",
        "courseSchedule": "第1回：ガイダンス第2回：事前授業（1）第3回：事前授業（2）第4回：地域社会での活動（受け入れ先の指示に従うこと）第5回：地域社会での活動（受け入れ先の指示に従うこと）第6回：地域社会での活動（受け入れ先の指示に従うこと）第7回：地域社会での活動（受け入れ先の指示に従うこと）第8回：地域社会での活動（受け入れ先の指示に従うこと）第9回：地域社会での活動（受け入れ先の指示に従うこと）第10回：地域社会での活動（受け入れ先の指示に従うこと）第11回：地域社会での活動（受け入れ先の指示に従うこと）第12回：事後授業（1）第13回：事後授業（2）第14回：事後授業（3)※実習場所に応じてそれぞれ神子島、佐藤、中島が担当する※地域社会での活動は水曜4・5限または土日祝祭日に実施される（例外もある）※活動のない週は基本的に水曜4限に授業を実施する。",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/08/07"
}