{
    "lectureCode": "GH1004",
    "courseName": "医療情報技術総論",
    "lecturer": [
        "苗村潔(医療保健学部臨床工学科)",
        "岡崎充宏(医療保健学部臨床検査学科)",
        "奥橋佑基(医療保健学部臨床検査学科)",
        "笠井亮佑(医療保健学部臨床工学科)",
        "水野元貴(医療保健学部臨床検査学科)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "Ｍ６１１多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "AI、IoT、ビッグデータ等、情報技術の進化に伴い、医療現場でも情報管理や情報収集が行われており、情報の活用範囲は飛躍的に増大している。本講義ではデータの関連付け、統計解析などの情報の活用や、セキュリティやネットワーク、電子カルテ等の情報管理について学ぶことで、情報技術の現状について理解し、今後の展開についても自ら検討できるように医療情報学の重要性を学ぶ。",
        "outcomesMeasuredBy": "多様な医療情報の収集や解析法を理解し、実践現場への活用法を修得する。情報技術の現状について理解し、今後の展開について検討できるよう医療情報学を学ぶ。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義と討論を中心に進める。授業内容の詳細は教員の指示に従う。オムニバス方式（全15回）。配布資料に基づく講義とともに、レポートや課題を課す。",
        "notices": "授業後は復習をすること。",
        "preparatoryStudy": "配布される資料をもとに事前学習すること。また、授業内容を復習し、内容の整理、確認をすること。",
        "gradingGuidelines": "受講中の討議への参加度として発表や質問回数による評価（40％）、理解度としてレポート及び課題（60％）により評価する。",
        "textbook": "特に指定しない。資料は教員側が授業前に準備し配信する。",
        "referenceMaterials": "特に指定しない。",
        "courseSchedule": "第1回：（岡崎）臨床検査分野における微生物検査システムについて学び、病原体の疫学的分析への活用事例を解説する。第2回：（岡崎）臨床検査分野における微生物検査システムについて学び、感染症患者情報との照合による病態解析への活用事例を解説する。第3回：（岡崎）医療関連施設におけるInfectionControlTeamに提示すべき病原体の個々の遺伝子情報を解説し、感染制御への活用を学ぶ。第4回：（岡崎）本邦における厚生労働省院内感染対策サーベイランスJANIS事業について学び、その活用事例を解説する。第5回：（岡崎）WHOやNIH等の世界が取り組むサーベイランス事業及び、グローバルな病原体の疫学的情報収集について学び、その活用事例を解説する。第6回：（水野）第7回：（奥橋）医療情報システム・臨床検査の現状と今後の展望について解説し、課題について考察する。第8回：（笠井）医療情報に関する基礎医学統計について学び、生体情報分析による感性工学への活用事例を解説する。第9回：（笠井）医療情報に関する基礎医学統計について学び、統計比較結果の読み方について解説する。第10回：（笠井）医療情報に関する基礎医学統計について学び、比較以外の統計結果の読み方について解説する。第11回：（苗村）ウェアラブル情報機器による心電図計測技術の現状について解説し、課題について考察する。第12回：（苗村）ウェアラブル情報機器による体動計測技術の現状について解説し、課題について考察する。第13回：（苗村）ウェアラブル情報機器による生体計測に伴う個人情報セキュリティの現状について解説し、課題について考察する。第14回：（苗村）超音波画像情報の治療への応用の現状について解説し、課題について考察する。第15回：（苗村）磁気共鳴イメージング（MRI）画像、X線CT画像情報の治療への応用の現状について解説し、課題について考察する。また科目の統括を行う。",
        "courseDataUpdatedAt": "2024/04/17"
    },
    "updateAt": "2024/05/29"
}