{
    "lectureCode": "GH1006",
    "courseName": "病態情報検査学",
    "lecturer": [
        "清水潤(医療保健学部リハビリテーション学科理学療法学専攻)",
        "佐々木聰(医療保健学部臨床検査学科)",
        "岡崎充宏(医療保健学部臨床検査学科)",
        "廣田雅子(医療保健学部臨床検査学科)",
        "奥橋佑基(医療保健学部臨床検査学科)",
        "水野元貴(医療保健学部臨床検査学科)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "医療技術学研究科修士課程臨床検査学専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "Ｍ６１１多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "検査情報を臨床現場で活用できる能力を養うことを目的とし、臨床所見や検査データをもとに各種疾患の病因・病態との関連を学ぶことで、論理的な思考力を身に着けると同時に、臨床ニーズに応え問題解決につながる能力（問題解決力）を修得する。本講義では信頼できる検査情報を得るための精度管理法について学ぶ。また様々な疾病に共通する病態生理、さらに代表的な疾患における特徴的な病態について学び、検査情報がどのように活用されているかについて症例を用いて紹介する。",
        "outcomesMeasuredBy": "臨床所見、検査データと病因・病態の関連性について理解することで、客観的観点から情報を評価できる論理的な思考力を身に着け、臨床所見、検査データについての分析・評価能力を養い、実学に基づく専門能力を身に着けることを目標にする。",
        "learningOutcomes": "論理的な思考力分析・評価能力",
        "teachingMethod": "講義及び課題に対する討論を行う。オムニバス方式（全15回）。",
        "notices": "討論には積極的に参加すること。",
        "preparatoryStudy": "配布される資料を基に事前学習すること。",
        "gradingGuidelines": "受講中の討議への参加態度（40％）、レポート等（60％）により総合的に評価する。",
        "textbook": "特に指定しない。資料は教員側が授業前に準備し配信する。",
        "referenceMaterials": "特に指定しない。",
        "courseSchedule": "第1回：（清水）脳末梢神経筋疾患の臨床検査をとおし臨床像把握を行う実際を解説する。第2回：（清水）脳末梢神経筋疾患の臨床検査結果を病態解明へつなげる方法を解説する。第3回：（佐々木）検査情報を活用するために必要となるデータの表現の仕方について解説する。検査データを得るための分析方法が明らかにしたい病態とどのように関連するかを考えるために、手法と検査目的との関連を論理立てて考えられるよう、学術論文等を通して因果関係を考察する。第4回：（佐々木）第3回に引き続き、検査結果と、明らかにすべき病態との関連を考察する。結果が意味する現象や、識別できる内容が何かを考えることができるよう、第3回の内容をふまえ、方法・結果と検査の目的について考察する。第5回：（佐々木）第３・４回で教材にした論文を素材として、結論がどのように導かれたか、また、その研究の意義がなぜそのように主張されるのかを考察する。第3～５回の総括として、適宜討論を行う。第6回：（佐々木）臨床検査データの判読基準と技術的信頼性の関連、及び臨床的有用性評価法について、クオリティマネジメントの観点から解説する。第7回：（佐々木）臨床検査データの判読基準と技術的信頼性の関連、及び臨床的有用性評価法について、分析技術の妥当性評価の観点から解説する。第8回：（廣田）血小板機能異常症について症例データをもとに病因・病態について解説する。第9回：（MT1）感染症の病態を把握する上で必要な検査について理解を深める。検査情報の活用方法の概要を紹介する。第10回：（MT1）感染症の病態を把握する上で必要な検査について理解を深める。特徴的な症例を提示しながら検査情報の活用方法を紹介する。第11回：（MT2）感染症の病態を把握する上で必要な検査について理解を深める。特徴的な症例を提示しながら検査情報の実用的な活用方法について検討・討議する。第12回：（廣田）貧血症について症例データをもとに病因・病態について解説する。第13回：（廣田）凝固異常症について症例データをもとに病因・病態について解説する。第14回：（廣田）造血器腫瘍について症例データをもとに病因・病態について解説する。第15回：（清水）全体の統括及び討論を行う。",
        "courseDataUpdatedAt": "2025/01/17"
    },
    "updateAt": "2025/03/21"
}