{
    "lectureCode": "GH2010",
    "courseName": "感染制御学演習",
    "lecturer": [
        "岡崎充宏(医療保健学部臨床検査学科)"
    ],
    "regularOrIntensive": "専門領域科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金3",
        "金4"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "Ｍ６１１多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "感染制御学は比較的新しい学問であるため、感染制御学特論で学んだ知識を基盤とし、国内外において発生した感染症事例について論文を精読・討議を通じて詳細に紐解く。医療関連感染及び市中感染における感染制御のアプローチを学ぶ。また、onehealthの概念に基づきヒト、動物、環境から感染制御をアプローチする最新の考え方を理解し、専門力や問題解決力を高めるとともに、高度な説明力が求められるチーム医療に不可欠なコミュニケーション力を養う。",
        "outcomesMeasuredBy": "①各種の病原体によるパンデミックについて調査し、その対策について論じることができる。②医療関連感染や市中感染における実行的な検査法を挙げることができる。③onehealthについてそれぞれの分野での研究報告をまとめ、その連携について説明できる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "基本的に対面にて講義・課題に対する討論を行う。リモート授業を数回ほど取り入れる予定である。",
        "notices": "学部で学んだ微生物学の復習を行っておくこと",
        "preparatoryStudy": "①配布される資料をもとに事前学習すること。②授業中の疑問点をまとめ、関連する文献等を利用し、次回授業までに解決しておくこと。",
        "gradingGuidelines": "受講中の討議への参加度として発表や質問回数による評価（40％）、理解度としてレポート及び課題（60％）により評価する。",
        "textbook": "随時指示する。資料は教員側が授業前に準備し配信する。",
        "referenceMaterials": "随時指示する。",
        "courseSchedule": "第1回：2015年に発令されたAMR対策について討論する。第2回：AMR対策の現状について調査し、問題点を抽出し、討論する。①第3回：AMR対策の現状について調査し、問題点を抽出し、討論する。②第4回：諸外国および本邦における検疫体制を調べ、有効な方法と問題点について討論する。①第5回：諸外国および本邦における検疫体制を調べ、有効な方法と問題点について討論する。②第6回：バイオハザードとバイオセフティーを学び、有効な方法と問題点について討論する。①第7回：バイオハザードとバイオセフティーを学び、有効な方法と問題点について討論する。②第8回：医療関連感染、市中感染および食品関連感染などの事例における感染制御の実践に役立つ検査法（PCR法やPFGE法など）についての有効性や改良点を討論する。①第9回：医療関連感染、市中感染および食品関連感染などの事例における感染制御の実践に役立つ検査法（PCR法やPFGE法など）についての有効性や改良点を討論する。②第10回：医療関連感染、市中感染および食品関連感染などの事例における感染制御の実践に役立つ検査法（PCR法やPFGE法など）についての有効性や改良点を討論する。③第11回：感染制御を行ううえで臨床検査の現場での問題点と改良点について討論する。①第12回：感染制御を行ううえで臨床検査の現場での問題点と改良点について討論する。②第13回：諸外国におけるonehealthの取り組みを調査し、その現状と問題点を討論する。①第14回：諸外国におけるonehealthの取り組みを調査し、その現状と問題点を討論する。①第15回：臨床現場および行政上のサーベイランスについて調査し、有効な方法と問題点について討論する。",
        "courseDataUpdatedAt": "2024/01/22"
    },
    "updateAt": "2024/05/29"
}