{
    "lectureCode": "GH2001",
    "courseName": "生理機能検査学特論",
    "lecturer": [
        "榎本みのり(医療保健学部臨床検査学科)"
    ],
    "regularOrIntensive": "専門領域科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "医療技術学研究科修士課程臨床検査学専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "Ｍ６１１多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "「生理機能検査学演習」に進むための基礎的な内容に関する講義を行う。その内容は、医療従事者が行うことができる代表的な生理機能検査の改良・発展につながる研究について概説する。生理機能検査を臓器別または方法論別に研究実施側から見た場合の視点で講義を行う。現時点での臓器別または方法論における各種課題に基づいて講義を行う。また、生理機能検査の研究において必要とされる、研究課題の見出し方、実際に行う研究実施の前・中・後の具体的な方法及び、研究成果の記録とまとめ等について教授する。",
        "outcomesMeasuredBy": "学術論文の検索方法および文献を絞り込む方法を身につけることができる。提示された課題に対し的確な文献検索で英語論文を収集し読解準備をすることを目標とする。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業は、Web上に展開されている文献検索手段を用い文献検索方法を学ぶ。さらにパワーポイントを用いて資料を提供する。鮮明な動画像の提示および文献検索をするのでノートPC必携とする。",
        "notices": "授業中は授業に専念し、私語は厳に慎むこと。スマホ等の使用は厳禁とする。また、安易な板書内容の撮影を禁止する。",
        "preparatoryStudy": "関連する資料などは事前に内容の確認をするとともに、一読しておくことを推奨する。",
        "gradingGuidelines": "課題への取り組みで評価する。",
        "textbook": "なし",
        "referenceMaterials": "",
        "courseSchedule": "第1回：生理機能検査に関連する研究を行うために必要な生理検査学的な解剖について説明する。第2回：生理機能検査に関連する研究を行うために必要な電気生理学について説明する。（榎本）第3回：生理機能検査に関連する研究を行うために必要な電気生理学について説明する。（榎本）第4回：生理機能検査に関連する研究を行うために必要な電気生理学について説明する。（榎本）第5回：生理機能検査に関連する研究を行うために必要な神経生理学について説明する。（榎本）第6回：生理機能検査に関連する研究を行うために必要な神経生理学について説明する。（榎本）第7回：生理機能検査に関連する研究を行うために必要な神経生理学について説明する。（榎本）第8回：生理機能検査に関連する研究を行うために必要な呼吸生理学について説明する。（榎本）第9回：生理機能検査に関連する研究を行うために必要な呼吸生理学について説明する。（榎本）第10回：各臓器に関連した生理機能検査の最新知見または最新検査方法（01）について説明する。（榎本）第11回：各臓器に関連した生理機能検査の最新知見または最新検査方法（02）について説明する。（榎本）第12回：各臓器に関連した生理機能検査の最新知見または最新検査方法（03）について説明する。（榎本）第13回：各臓器に関連した生理機能検査の最新知見または最新検査方法（04）について説明する。（榎本）第14回：生理機能検査学領域の文献検索法（01）を説明する。（榎本）第15回：生理機能検査学領域の文献検索法（02）を説明する。（榎本）",
        "courseDataUpdatedAt": "2025/01/23"
    },
    "updateAt": "2025/03/21"
}