{
    "lectureCode": "GH2009",
    "courseName": "感染制御学特論",
    "lecturer": [
        "岡崎充宏(医療保健学部臨床検査学科)"
    ],
    "regularOrIntensive": "専門領域科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "医療技術学研究科修士課程臨床検査学専攻",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "Ｍ２１９地域・在宅・精神実習室",
        "Ｍ３０１臨床検査実習室２",
        "Ｍ３０２臨床検査実習室３",
        "Ｍ３０３生理学実習室",
        "Ｍ３０６準備室",
        "Ｍ３０７臨床検査実習室４",
        "Ｍ３０８臨床検査実習室５",
        "Ｍ３０９試薬調整室２",
        "Ｍ３１０臨床検査実習室１",
        "Ｍ３１１試薬調整室１"
    ],
    "courceDetails": {
        "courseOverview": "感染制御学は、病原微生物の封じ込みを徹底するための戦略を探究する学問であり、感染症学や臨床微生物学等の領域とも密接に関連している。本講義では、感染症の病因における宿主と病原微生物との関連性及び病原微生物の拡散の機序とその挙動を監視するための方法を学び、これらを基盤に感染制御に資するための高度な専門的知識を養い、実践現場における問題解決につながる実践力及びそれらを後進に指導できる能力を修得する。",
        "outcomesMeasuredBy": "①細菌やウイルスなどによる感染症や病態について概説できる。②過去の感染症事例を学び、予防、診断、検査法を挙げることができる。③感染管理を行っていくうえで必要な法的要件を説明できる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "基本的に対面にて講義・課題に対する討論を行うが、リモート（zoom）による授業を数回取り入れる予定である。週に１回以上のミーティング・指導を行う。",
        "notices": "学部で学んだ微生物検査学の講義、実習の復習を行って置くこと",
        "preparatoryStudy": "①配布される資料をもとに事前学習すること。特に、用語の意味等を理解しておくこと。②授業中の疑問点をまとめ、関連する文献等を利用し、次回授業までに解決しておくこと。",
        "gradingGuidelines": "受講中の討議への参加度として発表や質問回数による評価（40％）、理解度としてレポート及び課題（60％）により評価する。",
        "textbook": "随時指示する。資料は教員側が授業前に準備し配信する。",
        "referenceMaterials": "随時指示する。",
        "courseSchedule": "第1回：細菌による感染症事例の病因、病態を討論する。①第2回：細菌による感染症事例の病因、病態を討論する。②第3回：細菌による感染症事例の病因、病態を討論する。③第4回：真菌による感染症事例の病因、病態を討論する。①第5回：真菌による感染症事例の病因、病態を討論する。②第6回：ウイルスによる感染症事例の病因、病態を討論する。①第7回：ウイルスによる感染症事例の病因、病態を討論する。②第8回：寄生虫による感染症事例の病因、病態を討論する。①第9回：寄生虫による感染症事例の病因、病態を討論する。②第10回：医療関連感染の感染制御に係る原因、対策、予防を学び、そのうえでの臨床検査技師の役割を討論する。①第11回：医療関連感染の感染制御に係る原因、対策、予防を学び、そのうえでの臨床検査技師の役割を討論する。②第12回：医療関連感染の感染制御に係る原因、対策、予防を学び、そのうえでの臨床検査技師の役割を討論する。③第13回：市中感染の事例をもとに感染制御に係る原因、対策、予防を学び、そのうえでの臨床検査技師の役割を討論する。第14回：食品衛生の事例をもとに感染制御に係る原因、対策、予防を学び、そのうえでの臨床検査技師の役割を討論する。第15回：感染症の歴史を学び、それを元に現代の感染制御における法的要件の経緯と実行をまとめる。",
        "courseDataUpdatedAt": "2025/01/17"
    },
    "updateAt": "2025/03/21"
}