{
    "lectureCode": "U1106",
    "courseName": "人体機能学",
    "lecturer": [
        "只野ちがや(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３０２１１教室"
    ],
    "courceDetails": {
        "courseOverview": "生理学はヒトのからだの仕組みや機能を知り、どのように調節されているかを明らかにする分野です。臨床において病態を理解したり、薬剤の作用を理解するための礎にもなります。この授業では、生命現象を理解するための基本的な知識を身につけた上で、生命を維持するために必須となる内臓系の機能について、血液、循環器、呼吸器、腎臓、消化と吸収、内分泌、生殖を、またヒトが環境に適応して活動する上で働く神経系の機能について運動機能、感覚機能、高次機能、脳機能などを扱います。これらの学修を通じて、看護の実践に必要な疾患の成り立ちの基礎を習得することを目標とします。",
        "outcomesMeasuredBy": "人体の恒常性がどのように維持されているかを理解し、今後学ぶ専門科目に必要な基礎知識を習得することです。具体的には、各臓器や器官の生理機能や調節機構について概要を説明できることを目指します。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "授業は教科書に沿って進めます。授業中はパワーポイントを使用して，教科書の図表を中心に説明を行います。なお、授業内に形成評価のための小テストをmoodle上で行います。",
        "notices": "授業用の資料は事前にmoodle上に掲載するので､授業開始までにダウンロードするなどして閲覧できるようにしておいてください。原則として紙での配付は行いません。また、連絡事項についてもmoodleで行いますので､常に確認してください。法定伝染病や忌引などの公欠に該当する場合は必ず早めに報告してください。報告がない場合は通常の欠席として扱います。質問や問い合わせはmoodleまたは､公開しているメールアドレスへ連絡をください。",
        "preparatoryStudy": "授業で扱う教科書の範囲は授業日ごとにmoodleに掲示します。必ず授業前に教科書の当該箇所を一読してきてください。なお、高校の生物、生物基礎の教科書には、細胞の機能や生体の恒常性、環境応答など生理学を学ぶ上で基礎となる事柄が載っています。簡潔で分かりやすく表現されているので､必要に応じて確認することをお勧めします。事前学修を行うことで授業の理解が大きく向上します。必ず行ってください。また、授業後に自身でノートを作ることは理解を深める上で役立ちます。是非､自分の言葉でまとめてみてください。",
        "gradingGuidelines": "期末試験（90％）と授業態度（10％）により評価します。小テストや出欠席は授業態度の一部として扱います。",
        "textbook": "系統看護学講座専門基礎分野解剖生理学医学書院",
        "referenceMaterials": "カラー図解人体の正常構造と機能（改訂第4版），坂井建雄,河原克雅総編集，日本医事新報社，2021ガイトン生理学原著13版，JohnE.Hall著，石川義弘他監訳，エルゼビア・ジャパン，2018",
        "courseSchedule": "第1回：生理学の基礎(人体とは、細胞・組織）第2回：機能からみた人体、体液とホメオスタシス、骨格筋第3回：栄養の消化と吸収第4回：呼吸1（呼吸運動、呼吸気量）第5回：呼吸2（ガス交換、肺の循環と血流、呼吸運動の調節）第6回：血液（血液の組成と機能、血液の凝固・血液型）第7回：循環系1（心臓の拍出機能）第8回：循環系2（血液の循環の調節）第9回：泌尿器系1（腎臓の機能）第10回：泌尿器系2（排尿の機能、体液の調節）第11回：神経系(中枢神経、末梢神経）第12回：感覚器系第13回：内分泌第14回：生殖第15回：総括、確認",
        "courseDataUpdatedAt": "2024\/03\/06"
    },
    "updateAt": "2024\/09\/12"
}