{
    "lectureCode": "U1206",
    "courseName": "社会経済学",
    "lecturer": [
        "尾玉剛士(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３０２１１教室"
    ],
    "courceDetails": {
        "courseOverview": "日本では、社会保障制度の一環として、公的な医療保険・介護保険が広く普及している。これらの制度のおかげで住民の医療・介護の費用負担が低く抑えられる一方、関係者は社会保障制度のルールに従って行動しなければならない。保健・医療・福祉に携わる者にも、サービスの受け手にも、社会保障制度を理解し、活用することが求められている。そこでこの授業では、社会保障とはなにか、なぜ必要とされてきたのかについて考えることから始め、現在の日本の医療・介護制度とそれらが直面している課題について解説していく。日本の置かれている状況の理解を深めるために、随時諸外国との比較を行う。取り組んでいく問いの例・日本の医療には一体どれくらいのお金がかかっているのだろうか。・日本の医療の質は高いのだろうか。・医療における平等は実現しているのだろうか。・看護師はどのような労働条件の下で働いているのだろうか。・介護保険とはどんな仕組みなのだろうか、等。",
        "outcomesMeasuredBy": "1.社会保障とはなにか、なぜ発達してきたのかを理解する。2.国際的な視野から、日本の医療保険や介護保険の特徴を理解する。3.社会保障が現在直面している課題と解決策について意見を形成する。以上の学びと課題の作成を通じて、医療・社会保障に関する「国際的な教養」、医療・社会保障制度の「分析・評価能力」、このような原因によってこのような結果がもたらされていると理解することができる「論理的な思考力」、問題に関して具体的な解決策を提案する「問題解決力」、自分の考えを他者が理解できるように適切に表現する「コミュニケーション能力」を養成する。",
        "learningOutcomes": "国際的な教養コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "印刷資料・映像資料に沿った講義を行うが、一方通行の授業にならないよう毎回小テストに取り組んでもらい、ユニークな解答や質問などを（氏名を伏せて）紹介するアクティブラーニング形式で授業を行う。ノートＰＣ使用せず。",
        "notices": "とくに履修を前提とする授業はない。この授業で日本の医療や社会保障の基本的な仕組みを理解してもらえれば幸いである。",
        "preparatoryStudy": "授業後に小テストに取り組み、その回の授業内容の理解を深めること。また、毎回配布資料のなかでキーポイントを整理するので、何が本質的な論点なのかよく復習しておくこと（以上、合計120分程度）。医療や介護に関する新聞記事やテレビのニュース、インターネットの記事などに目を通すように心がけると、授業の理解も深まり、相乗効果が期待される。",
        "gradingGuidelines": "授業終了時に提出する小テスト50％、期末試験50％。授業姿勢に問題がある場合、注意・減点する。小テストは毎回実施し、翌週の授業でフィードバックを行う。",
        "textbook": "指定しない。毎回参考文献を明記した講義資料を配布する。",
        "referenceMaterials": "椋野美智子、田中耕太郎『はじめての社会保障』有斐閣アルマ、最新版。池上直己『日本の医療と介護：歴史と構造、そして改革の方向性』日本経済新聞出版社、2017年。ブルーノ・パリエ『医療制度改革：先進国の実情とその課題』文庫クセジュ、2010年。その他、授業中に紹介。",
        "courseSchedule": "第1回:ガイダンス～なぜ社会保障を学ぶ必要があるのか？第2回:社会保障とはなにか？第3回:経済と社会の変化～低成長・少子高齢化・雇用と家族の変容第4回:日本の医療制度第5回:医療制度の国際比較①第6回:医療制度の国際比較②第7回:なぜ、どうやって医療制度を改革するのか？第8回:日本の医療制度改革第9回:医療費の財源問題第10回:介護保険①第11回:介護保険②第12回:出産に関する社会保障第13回:子育てに関する社会保障第14回:看護師の経済学第15回:総復習",
        "courseDataUpdatedAt": "2024/01/28"
    },
    "updateAt": "2024/12/09"
}