{
    "lectureCode": "U1209",
    "courseName": "疾病治療論II（外科系医学）",
    "lecturer": [
        "篠原一彦(医療保健学部臨床工学科)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１００３教室"
    ],
    "courceDetails": {
        "courseOverview": "看護師として必要な外科系疾患の病態生理、診断法、治療法の基礎と概要について理解することがこの講義の目的である。安全な外科手術を支える麻酔・無菌法・ME機器・外科栄養などの外科総論について学ぶ。ついで消化器一般外科・心臓血管外科・呼吸器外科・外傷外科・泌尿器科など外科系診療の概要を学ぶとともに、Interventionalradiologyや癌の集学的治療などのトピックスについても触れる。看護師として必要な外科系医学の基礎知識を学ぶとともに、供覧する診療現場の画像を通じて、臨地実習に臨む心構えを形成する一助として欲しい。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "看護師に必要な、外科系臨床医学の外科総論、外科系疾患の診断と治療、看護業務との関連性を理解することで、医療従事者・看護師としての専門能力、論理的な思考力、分析・評価能力、問題解決力を身につける。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "豊富な外科手術の映像などを供覧しつつ講義形式で実施する。",
        "notices": "手術などの動画や画像を供覧するので、単なる出席にとどまらず積極的な講義への参加が望ましい。",
        "preparatoryStudy": "講義概要に基づき指定した外科学に関する参考書で講義内容について予習するとともに、看護系のテキストなどで看護学と外科学との関連事項についても予習すること。",
        "gradingGuidelines": "授業参加態度、開講中に提出する課題ならびに期末に課題の一環として提出する試験を総合的に評価する。",
        "textbook": "特に指定することはしないが、講義内容や配布資料の内容に準じて、下記の参考書や内科系教科書、看護系の教科書を随時参照しながら、十分な予習復習につとめること。",
        "referenceMaterials": "ナースのための外科学（中外医学社）標準外科学（医学書院）コメディカルのための外科学総論・各論（医学出版社）",
        "courseSchedule": "第1回:外科学総論１：安全な外科手術を可能とした麻酔・無菌法・抗生物質などについて学修する。第2回:外科学総論２：今日の臨床外科手術を支える医療機器について臨床外科の立場から学修する。第3回:外科学総論３：手術前後の患者管理と外科侵襲学の概要について学修する。第4回:消化器外科１：消化管の外科的疾患の病態、術式、周術期管理の概要について学修する。第5回:消化器外科２：肝胆膵の外科的疾患の病態、術式、周術期管理の概要について学修する。第6回:心臓血管外科１：代表的な先天性心疾患の概要と手術術式について学修する。第7回:心臓血管外科２：後天性心疾患および血管外科の概要と術式について学修する。第8回:呼吸器外科：肺縦隔領域の代表的外科疾患の概要と術式、患者管理について学修する。第9回:乳腺外科：乳腺領域の外科疾患について学修する。第10回:泌尿器外科：看護師として知っておくべき泌尿器外科の概要について学修する。第11回:小児外科および腹部救急：小児外科および一般的な腹部救急疾患について学修する。第12回:脳神経外科・外傷外科：看護師として知っておくべき脳外科・外傷外科の概要について学修する。第13回:低侵襲治療概論：内視鏡手術やInterventionalradiologyについて学修する。第14回:癌の集学的治療：抗がん剤や放射線治療など癌治療の概要について学修する。第15回:移植外科：臓器移植の現状と課題について学修する。",
        "courseDataUpdatedAt": "2023/12/25"
    },
    "updateAt": "2024/12/09"
}