{
    "lectureCode": "U1208",
    "courseName": "疾病治療論I（内科系医学）",
    "lecturer": [
        "川又紀彦(医療保健学部臨床検査学科)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１００３教室"
    ],
    "courceDetails": {
        "courseOverview": "各臓器別の内科系疾患に関する授業を行う。その理解のために解剖学、生化学、生理学、薬理学などの基礎知識に関わる授業も含まれる。内科系疾患の基礎知識を得る事を目的とする。医療人として一生新しいことに出会い、その都度自分で解決していかねばならないことを踏まえ、不明な点を調べ、知識を深める方法などについても身につける。この科目は、専門職が講義を行う実践的科目である。",
        "outcomesMeasuredBy": "内科系臨床医学の知識を得る。国家試験合格レベルの知識を得ることを目標とする。自分で考え調べる方法を身につけ、実学に基づく専門能力、分析・評価能力をつける。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力",
        "teachingMethod": "配布するPDFとパワーポイントによる講義。事前に教科書の各項を予習することを勧める。事前には資料は配布しない。配布資料を他人（友人や後輩を含む）に譲渡したり・SNS等で公開することは禁止する。",
        "notices": "基礎科目の復習をふくめた予習とともに、自分でノートを作成し、各項目ごとにまとめ復習することが望ましい。時間毎に違うテーマとなるので、休むとその部分は知識を得られないことになる。覚えるのみでは理解できず、実際の場面での応用はきかない。講義を覚えるのでなく理解することが肝心である。",
        "preparatoryStudy": "解剖、生理学、病理学の復習が望ましい。その上に知識、理解を深めていくことが求められる。",
        "gradingGuidelines": "期末テストの成績で判断をする。期末テストの出題範囲・難易度・出題形式は看護師国家試験に準ずる。標準偏差値で40以上を合格とする。",
        "textbook": "なるほどなっとく内科学（南山堂）",
        "referenceMaterials": "成人看護学シリーズの内科医学書院イヤーノート内科・外科等編メディックメディコ",
        "courseSchedule": "第1回：総論・症候・バイタルサイン測定機器（体温・血圧・心拍数・呼吸数・Sp02)第2回：感染症（細菌感染・ウイルス感染・真菌感染・診断法・抗生剤・解熱剤）第3回：呼吸器疾患：呼吸器の解剖と構造、呼吸器系の検査（生理機能検査・画像検査・気管支鏡）呼吸器系の疾患（気管支喘息・肺気腫・慢性閉塞性肺疾患・肺梗塞・ロングフライト症候群・肺炎・肺がん・過換気症候群・睡眠時無呼吸症）、肺癌、酸素療法・人工呼吸器第4回：循環器疾患：心臓・大血管の構造と解剖、検査（心電図・胸部レントゲン・心エコー・心臓カテーテル・心臓CT）主な心・大血管の疾患（心不全・不整脈・虚血性心疾患・心筋疾患・弁膜症・先天性心疾患・大動脈瘤など）、冠動脈インターベンション・ペースメーカー・薬物療法、体外循環第5回：消化管疾患：消化管（食道・胃・小腸・大腸）の解剖と構造、検査（腹部レントゲン・CT・超音波・胃カメラ・大腸カメラ）、消化管の疾患（食道・胃・十二指腸・大腸疾患）、胃癌・大腸癌第6回：肝・胆・膵疾患：肝・胆・膵の構造と解剖、検査（血液検査・腹部エコー・ＣＴ・腹腔鏡・血管造影・肝生検）主な肝・胆・膵の疾患（急性肝炎・慢性肝炎・肝硬変・アルコール性肝障害・脂肪肝・急性\/慢性膵炎、胆石症）黄疸、肝臓癌・膵臓癌・胆のう癌・胆のうポリープ第7回：糖尿病・代謝性疾患：糖尿病の症状・診断法・合併症・治療法、高血糖・低血糖、高脂血症、痛風、肥満症\/メタボリック・シンドローム第8回：内分泌疾患：ホルモンの種類と機能、ホルモン器官の解剖と構造、検査（血液検査・超音波検査・画像検査など）主な内分泌の疾患（甲状腺機能亢進症（バセドー病）・甲状腺機能低下症（橋本病）副腎疾患（クッシング症候群・アジソン病・褐色細胞腫）など）第9回：腎・泌尿器疾患：腎・泌尿器の構造と解剖、検査（血液検査・尿検査・超音波・CT・レノグラム・生検・膀胱鏡）透析・輸液・酸塩基測定装置、腎・泌尿器系の主な疾患（原発性糸球体腎炎・続発性糸球体腎炎（糖尿病腎症・痛風腎）・腎盂腎炎、腎結石（尿路結石））第10回以降は備考を参照",
        "courseDataUpdatedAt": "2024\/03\/06"
    },
    "updateAt": "2024\/09\/12"
}