{
    "lectureCode": "U1212",
    "courseName": "疾病治療論V（精神医学）",
    "lecturer": [
        "中川和美(医療保健学部リハビリテーション学科作業療法学専攻)"
    ],
    "regularOrIntensive": "専門基礎科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３０２１１教室"
    ],
    "courceDetails": {
        "courseOverview": "主要な精神機能の障害の特徴について、精神医学独自の診断学や治療学を踏まえて学修する。これら精神医学、精神障害に関する基礎的知識を習得することで、精神看護を学ぶ基礎を固める。また、「こころ」のありようの多彩さを知り、精神障害の適切なイメージを持つことで、超高齢社会や共生社会において看護師として求められる、共感的な理解力や態度を身につけることを通じて、実学に基づく専門能力、論理的な思考力、分析・評価能力、問題解決力を養う。この科目は、実務経験を有する専門職（医師）が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "学修目標は以下の通りである。１．精神医学の鍵概念や精神科医療の歴史を理解し、診断学や治療学の特徴を説明できる。２．精神機能の症候学を理解し、各精神機能領域の症状や状態像を説明できる。３．主要な精神障害の病態、疫学、症状、経過、治療、予後に関する特徴を説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "授業計画に基づいて講義を行う。毎回リフレクションシートやドリル(moodle)を実施する。適宜レポート提出と小テストを行う。授業内でPCは用いない。",
        "notices": "Moodleに上げた資料の該当部分をあらかじめ学んできたことを前提に、講義を進めるので、毎回の授業の前後に予習と復習の時間を必ず確保すること。具体的な自主学習方法はガイダンスで提示する。授業内容が多いため、授業時間だけで理解することも、試験直前だけで試験準備することも非常に困難であることに留意すること。目に見えないこころの苦しみを扱うので、その苦痛を適切に理解できるよう、授業の冒頭から自身の受講態度を整え、集中して学修に取り組むこと。",
        "preparatoryStudy": "シラバスの授業計画やMoodle資料を参照して全体の流れを意識しながら、自分がその回の講義に何を修得しなければならないのかを認識した上で授業に臨むこと。具体的な予習方法はガイダンスで提示する。予習：Moodleで授業資料の確認、関連内容の自主学習（Web検索、関連図書読み込み等）（約60分）復習：Moodleで確認ドリル、提出課題の実施、ノートまとめ（約60分）",
        "gradingGuidelines": "レポートと小テスト(20%)および期末試験(80%)（持ち込み不可）によって評価する。Moodleの復習ドリルやレポートの実施率・提出率が低い場合は成績評価を減点する。",
        "textbook": "資料の内容を中心に講義を進めるため、教科書は特に指定しない。",
        "referenceMaterials": "授業において随時紹介する。",
        "courseSchedule": "第1回:「ガイダンス、精神医学概論（精神医学の鍵概念、精神医学・精神科医療の歴史、関わる領域、法制度など）」を理解する第２回:「精神症候学、診断学と障害分類、精神治療学」を理解する第３回:「主要な精神障害の特徴（１）：統合失調症」を理解する第４回:「主要な精神障害の特徴（２）：気分障害」を理解する第５回:「主要な精神障害の特徴（３）：神経症性障害とストレス関連障害、心身症（摂食障害）」を理解する第６回:「主要な精神障害の特徴（４）：アルコール関連精神障害」を理解する第７回:「主要な精神障害の特徴（５）：パーソナリティ障害、その他の精神障害」を理解する第８回:「まとめと展望、理解度確認」",
        "courseDataUpdatedAt": "2024/03/06"
    },
    "updateAt": "2024/05/29"
}