{
    "lectureCode": "W1102",
    "courseName": "看護学概論",
    "lecturer": [
        "岩波浩美(医療保健学部看護学科)",
        "安井大輔(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月",
        "月2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１７１４多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "看護学の主要概念である人間、健康、環境、看護について理解し、広い視野から看護について学ぶ。対象を全人的に捉えるために必要な知識を学ぶとともに、看護の機能と役割、対象となる人々の健康、生活、ライフサイクルについて学ぶ。保健・医療・福祉における看護の位置づけ、チーム医療における看護の役割について理解する。さらに、看護活動を展開するうえでの法的基盤、看護実践のための理論的根拠、倫理、看護を提供するプロセスについて学ぶ。本科目の受講を通し、「国際的な教養」、「実学に基づく専門能力」、「コミュニケーション能力」、「論理的な思考力」、「分析・評価能力」、「問題解決力」を養う。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "1.看護への関心を深め、看護の基本的構成概念を説明できる。2.看護活動の専門性と理論的根拠について説明できる。3.看護活動展開のための法的根拠と看護における倫理の重要性について説明できる。4.看護の変遷について理解し、今後の展望について考えることができる。5.保健・医療・福祉システムとしてのチーム医療における看護の役割について理解し、今後の課題について展望することができる。6.自己の看護観を言語化することができる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "看護学の本質を学び、看護の深さや奥深さをイメージし関心を高め、各領域への学習意欲を高めることを目標にしている本科目は、事前に課される課題、講義内での自己表現、他者意見で学んだ内容の統合・分析、授業後の学び、自己の振り返りを行う。",
        "notices": "(1)課せられた課題は、必ずまとめ、自分の意見を言える状態で授業に臨む。(2)授業においては、自ら考え、問をもつと共に、グループワークに積極的に参加する。(3)自らの考えや学んだ内容を、他者にわかりやすく述べることを心掛ける。(4)授業中に疑問に思ったことは質問したり、自身で探究することを含めて、問いを大切にする。(5)授業で紹介した文献については、積極的に読む。(6)健康管理に留意し、授業に参加する。",
        "preparatoryStudy": "シラバスを参考に事前学習をし、授業後は内容を復習すること。",
        "gradingGuidelines": "定期試験70％、課題レポート10％、プレゼンテーション10％、授業態度10％の総合評価とする。",
        "textbook": "茂野香おる他：系統的看護学講座専門分野Ⅰ基礎看護学[1]看護学概論，医学書院.フローレンス・ナイチンゲール(小玉香津子・尾田葉子訳)：看護覚え書き,日本看護協会出版会.",
        "referenceMaterials": "１.ミルトン・メイヤロフ（田村真訳)：ケアの本質－生きることの意味:ゆみる出版.２.ヴァージニア・ヘンダーソン（湯槇ます・小玉香津子訳)：看護の基本となるもの,日本看護協会出版会.３.看護者の基本的責務,日本看護協会.",
        "courseSchedule": "第1回：ガイダンス、看護への導入（１）看護とは、実践科学としての看護（安井）第2回:看護への導入（2）看護実践のための基準、看護の変遷（安井）第3回：看護の対象（１）統合体としての人間、個人、家族、コミュニティ、地域社会（安井）第4回：看護の対象（２）人間と健康、健康と環境、健康障害をもつ対象（安井）第5回：健康と病気における安寧（安井）第6回：ライフサイクルと健康（安井）第7回：看護実践のための理論の理解（１）看護理論の分類、看護理論の変遷（安井）第8回：看護実践のための理論の理解（２）様々な看護理論（安井）第9回：看護における倫理（１）看護倫理、倫理的課題への対応（安井）第10回：看護における倫理（２）事例検討（安井）第11回：看護の基本的役割（安井）第12回：看護過程（安井）第13回：看護における法的側面（安井）第14回：保健・医療・福祉システム（安井）第15回：看護の統合と今後の展望（安井）",
        "courseDataUpdatedAt": "2024\/01\/25"
    },
    "updateAt": "2024\/05\/29"
}