{
    "lectureCode": "W1102",
    "courseName": "看護学概論",
    "lecturer": [
        "岩波浩美(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月",
        "月2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "1年",
        "2年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "３１７１４多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "広い視野から看護と看護職について学び、看護学の中心概念である人間、健康、環境、看護への理解を深める。また、看護の対象となる人々を全人的に理解するために必要な生活、ライフサイクルのとらえ方を学ぶ。さらに、看護の機能、保健・医療・福祉における看護の位置づけ、チーム医療について学び、看護職者の役割への理解を深める。加えて、看護活動を展開するための法的基盤、看護実践の理論的根拠となる看護理論、方法論的根拠となる看護過程、さらに倫理について学ぶ。本科目は、専門科目の学習への導入として位置づけられる科目であり、看護学の各領域の学習の基盤となる知識、態度の修得を目指す。本科目は、基礎看護学実習の先行要件科目である。本科目は、看護の実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "1.看護への関心を深め、看護学の中心概念、看護の対象理解のための主要概念を、定義に基づき説明する。2.看護活動の専門性と理論的根拠を説明する。3.看護活動のための法的基盤と看護における倫理の重要性を説明する。4.看護および看護職の変遷と発展を理解し、今後の展望を検討する。5.保健・医療・福祉システムとしての看護の位置づけ、チーム医療について理解し、看護職者の役割拡大について展望する。6.自己の看護観を言語化する。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本科目は、看護の本質を学び、看護の奥深さ、看護の対象の幅広さをイメージしながら看護への関心を高め、看護学各領域への学習意欲を高めることを目指す。事前課題への取り組み、授業中の他者との意見交換、授業後の振り返りを通し、学習内容の統合、自己評価を行う。",
        "notices": "(1)事前事後課題には誠実に取り組み、自分の意見を言える状態で授業に臨む。(2)授業中は、自ら考え、問いをもつと共に、グループワークに積極的に参加し他者の意見からも学ぶ。(3)自らの考えや学んだ内容を、他者にわかりやすく述べることを心掛ける。(4)授業中に疑問に思ったことは、自分で調べたり質問したりして探究し、問いを大切にする。(5)紹介した文献は、授業中に扱っていない部分も積極的に閲読する。(6)健康管理に留意し、授業に参加する。",
        "preparatoryStudy": "シラバス、授業開始時に配布する授業計画を参考に、教科書の閲読により事前学習するとともに、毎回、授業内容を復習すること。",
        "gradingGuidelines": "定期試験70％、課題レポート20％、授業態度10％の総合評価とする。",
        "textbook": "・茂野香おる他：系統的看護学講座専門分野Ⅰ基礎看護学[1]看護学概論，医学書院.・フローレンス・ナイチンゲール(小玉香津子・尾田葉子訳)：看護覚え書き,日本看護協会出版会.・日本看護協会出版会：看護職の基本的責務2024年度版‐定義・概念/基本法/倫理，医学書院",
        "referenceMaterials": "・ミルトン・メイヤロフ（田村真訳)：ケアの本質－生きることの意味:ゆみる出版.・ヴァージニア・ヘンダーソン（湯槇ます・小玉香津子訳)：看護の基本となるもの,日本看護協会出版会.",
        "courseSchedule": "第1回：ガイダンス、看護学への導入第2回:看護とは（１）看護の定義、看護の変遷第3回：看護の対象の理解（１）人間と環境第4回：看護の対象の理解（２）健康と環境第5回：看護の提供者（１）職業としての看護の成立と発展第6回：看護の提供者（２）看護職者の発達と役割拡大第7回：看護を提供する仕組み（１）看護サービス提供の場と法的基盤第8回：看護を提供する仕組み（２）看護をめぐる制度と政策第9回：看護実践のための理論（１）看護理論の目的、機能第10回：看護実践のための理論（２）様々な看護理論第11回：看護実践のための方法論（看護過程）第12回：看護における倫理（１）看護倫理とは第13回：看護における倫理（２）倫理的課題を有する事例の検討第14回：保健・医療・福祉システム、チーム医療と看護第15回：看護の統合と今後の展望",
        "courseDataUpdatedAt": "2025/03/05"
    },
    "updateAt": "2025/03/21"
}