{
    "lectureCode": "W1207",
    "courseName": "高齢者看護学概論",
    "lecturer": [
        "安井大輔(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３０２１２教室"
    ],
    "courceDetails": {
        "courseOverview": "高齢者の特徴と加齢に伴う健康状態の変化についての理解を深め、高齢社会が直面する保健医療福祉の課題と看護師の役割について学修する。年齢を重ねた存在としての高齢者を、ライフサイクルや発達段階の視点から全人的に捉え、高齢者を取り巻く環境を理解し、幅広い高齢者観を持てるようにする。持てる力を発揮し、イキイキと生きる高齢者の健康な生活を促進するヘルスケアシステムの活用と看護実践について学ぶ。本科目の受講を通し、「実学に基づく専門能力」、「コミュニケーション能力」、「論理的な思考力」、「分析・評価能力」、「問題解決力」を養う。この科目は、医療介護現場において高齢者への看護に従事した実務経験を有する専門職が、大学で学ぶ高齢者看護の基本的な知識について解説する実践的科目である。",
        "outcomesMeasuredBy": "１．高齢者の特性・特徴を多面的に捉え、高齢者を理解する視点を説明できる。２．老年期にある人々の身体的・心理的・社会的な機能の変化について説明できる。３．高齢化の現状と諸問題、高齢者を取り巻く社会制度について説明できる。４．高齢者の倫理的課題と権利擁護について説明できる。５．高齢者看護の役割について考察し、その重要性を認識できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "１．学習の手引きに基づき教科書や配布資料を参考に視聴覚教材も含んだ講義を行います。２．体験型学習、グループワーク、課題発表等を含んだ授業を進めます。３．毎回、出席表を兼ねたリアクションペーパーを配布し、授業に対する感想・質問等を記載したのち、授業終了後までに提出を求めます。４．授業前日までにmoodle上の課題に取り組み、予習復習を行うことを通して授業への理解を深めましょう。",
        "notices": "１．各自が予習・事前課題の学修をしているという前提で授業が進みます。予習をして臨みましょう。２．予習を行い、moodle上の課題に取り組んでください。３．授業は個人ワーク・グループワーク・体験型授業を含む講義形式です。積極的・自主的な学習態度が求められます。４．課題については提出期限・提出方法を必ず守ってください（moodleで確認してください）。５．教科書は必携です。前回までの配布資料も持参してください。６．授業の配布資料はあくまでも参考資料です。授業で聞いた内容が資料に記載されていない場合は、自身でメモを取るようにしましょう。",
        "preparatoryStudy": "１.「看護学概論」「地域看護学」「保健医療福祉論」等の関連科目を復習してから授業に臨みましょう。２．moodle上の課題に必ず取り組みましょう。３．テキストには高齢者特有の用語やデータが記載されています。授業では説明できない部分もあるので事前にテキストを読んで予習するなど自己学習を行いましょう。",
        "gradingGuidelines": "●リアクションペーパー提出・課題提出(15％)●課題提出状況と内容（15％）●学期末テスト（70％）",
        "textbook": "1.堀内ふき(編集)：ナーシンググラフィカ老年看護学①：高齢者の健康と障害第7版,メディカ出版2.堀内ふき(編集)：ナーシンググラフィカ老年看護学②：高齢者看護の実践第7版,メディカ出版",
        "referenceMaterials": "1.真田弘美,正木治恵：老年看護学技術最後までその人らしく生きることを支援する,改訂第3版,南江堂,20202.正木治恵：老年看護学：第3版,財団法人放送大学教育振興会,20063.岩田充永：JJNSPECIAL急変予防＆対応ガイドマップ高齢者救急,医学書院,2016",
        "courseSchedule": "第1回4/7ガイダンス老年期にある人の特徴第2回4/14高齢者体験演習・グループワーク第3回4/21高齢者理解のために用いる理論やアプローチ方法第4回5/12高齢者看護の変遷,高齢者看護の専門性第5回5/19地域包括ケアシステムと多様な場所で生活する高齢者第6回5/26高齢者の生活と家族第7回6/2高齢者の生活に関する保健医療福祉制度第8回6/9高齢者への倫理的配慮と自尊心の保持",
        "courseDataUpdatedAt": "2025/03/05"
    },
    "updateAt": "2025/03/21"
}