{
    "lectureCode": "W1201",
    "courseName": "基礎看護技術III（診療の援助技術）",
    "lecturer": [
        "岩波浩美(医療保健学部看護学科)",
        "飯塚敏子(医療保健学部看護学科)",
        "宮首由美子(医療保健学部看護学科)",
        "繁永元樹(医療保健学部看護学科)",
        "安井大輔(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３１７０２看護実習室２",
        "３１７１４多目的実習室",
        "３１７１６看護実習室３"
    ],
    "courceDetails": {
        "courseOverview": "診療を受ける対象への基本的な援助技術について講義・演習により修得する。より臨床的に看護実践を行うための基盤となる技術習得を目指す。本科目の受講を通し、「実学に基づく専門能力」、「コミュニケーション能力」、「論理的な思考力」、「分析・評価能力」、「問題解決力」を養う。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "1.診療を受ける対象への安全・安楽な基本的援助を提供するための知識・技術・態度とは何か説明できる。2.感染予防を推進する技術における無菌操作に必要な知識・技術・態度について説明できる。3.感染予防を推進する技術における無菌操作について、必要な知識を活用し、実施・評価できる。4.検査・治療を安全かつ正確に行う技術に必要な知識・技術・態度について説明できる。5.検査・治療を安全かつ正確に行う技術について、必要な知識を活用し、実施・評価できる。6.与薬・輸血を安全かつ正確に行う技術に必要な知識・技術・態度について説明できる。7.与薬・輸血を安全かつ正確に行う技術について、必要な知識を活用し、実施・評価できる。8.排泄に障害のある対象への排泄の援助に必要な知識・技術・態度について説明できる。9.排泄に障害のある対象への排泄の援助について、必要な知識を活用し、実施・評価できる。10.食事・栄養に関する援助において、経管栄養の援助に必要な知識・技術・態度について説明できる。11.食事・栄養に関する援助において、経管栄養の援助について、必要な知識を活用し、実施・評価できる。12.呼吸を楽にする援助における痰を喀出させる方法と酸素療法の援助に必要な知識・技術・態度について説明できる。13.呼吸を楽にする援助における痰を喀出させる方法と酸素療法の援助について、必要な知識を活用し、実施・評価できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "診療を受ける対象者へ提供する基礎的な看護技術について、知識と技術の修得を目標とする。本科目では、感染の予防、薬物療法、検査の意義、排泄障害のある対象への援助と方法を中心に講義と演習を並行しながら展開する。授業では、知識だけでなく感性や思考を深められるよう、講義や演習を展開する。",
        "notices": "１．講義形式だけでなく、演習を取り入れた授業のため、積極的な講義への参加が必須となる。２．授業内容が連動して展開されること、演習が多い科目のため、遅刻・欠席がないように、健康管理をすること。３．演習では、事前学習が不十分な場合、身だしなみが整っていない場合に参加を認めないことがあるため、注意すること。４．本科目は基礎看護学実習の先行要件科目となる。",
        "preparatoryStudy": "関連した人体構造学、人体機能学などの既習科目の復習、視聴覚教材を閲覧、教科書や参考書をもとに自己学習を行った上で授業に臨む。また、限られた演習時間を充実した学習時間にするために、主体的に事前学習に取り組み、看護技術をイメージした上で演習に臨む。",
        "gradingGuidelines": "定期試験80％、課題レポート10％、授業態度10％の総合評価とする。",
        "textbook": "任和子他：系統看護学講座専門分野基礎看護学[2]基礎看護技術I，医学書院任和子他：系統看護学講座専門分野基礎看護学[3]基礎看護技術II，医学書院任和子他：根拠と事故防止から見た基礎・臨床看護技術，医学書院",
        "referenceMaterials": "深井喜代子編集：新体系看護学全書基礎看護学②基礎看護技術Ⅰ,メヂカルフレンド社.深井喜代子編集：新体系看護学全書基礎看護学③基礎看護技術Ⅱ,メヂカルフレンド社.",
        "courseSchedule": "第1回:ガイダンス、感染予防を推進する技術（講義）（安井）第2回:感染予防を推進する技術（演習）無菌操作、滅菌手袋、個人防護具（全教員）第3回:検査・治療を安全かつ正確に行う技術（講義）（宮首）第4回:検査・治療を安全かつ正確に行う技術（演習）採血（全教員）第5回:検査・治療を安全かつ正確に行う技術（演習）採血（全教員）第6回:与薬・輸血を安全かつ正確に行う技術１（講義）（宮首）第7回:与薬・輸血を安全かつ正確に行う技術（演習）皮下注射、筋肉内注射（全教員）第8回:与薬・輸血を安全かつ正確に行う技術２（講義）（宮首）第9回:与薬・輸血を安全かつ正確に行う技術（演習）点滴静脈内注射（全教員）第10回:食事・栄養摂取を促す技術（講義）経管栄養（安井）第11回:食事・栄養摂取を促す技術（演習）経管栄養（全教員）第12回:排泄に障害のある対象への排泄の援助（講義）（安井）第13回:排泄に障害のある対象への排泄の援助（演習）導尿、浣腸（全教員）第14回:呼吸を楽する技術（講義）（安井）第15回:呼吸を楽する技術（演習）酸素療法（全教員）",
        "courseDataUpdatedAt": "2024\/04\/18"
    },
    "updateAt": "2024\/05\/29"
}