{
    "lectureCode": "W1203",
    "courseName": "ヘルスアセスメント",
    "lecturer": [
        "岩波浩美(医療保健学部看護学科)",
        "飯塚敏子(医療保健学部看護学科)",
        "宮首由美子(医療保健学部看護学科)",
        "繁永元樹(医療保健学部看護学科)",
        "安井大輔(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１７０２看護実習室２",
        "３１７１４多目的実習室",
        "３１７１６看護実習室３"
    ],
    "courceDetails": {
        "courseOverview": "医療の高度化・重症化・複雑化に伴い、安全で高度な看護技術の必要性とその能力の獲得が強く望まれている。本技術は的確な看護判断と適切な看護実践の提供のための科学的根拠を提供する症状・生体機能管理技術の一つである『へルスアセスメントの概念と構成要素を理解し、アセスメントに必要な基本的知識・技術・態度』を習得する。本科目の受講を通し、「実学に基づく専門能力」、「コミュニケーション能力」、「論理的な思考力」、「分析・評価能力」、「問題解決力」を養う。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "１．ヘルスアセスメント・フィジカルアセスメントの意義・目的・技術の概要について記述できる。１）ヘルスアセスメント・フィジカルアセスメントの意義・目的を記述できる。２）フィジカルアセスメント技術（問診・視診・触診・聴診・打診）の概要を説明できる。３）ヘルスアセスメントにおける身体診査・心理的側面・社会的側面のアセスメントの概要を説明できる。２．対象者に対する倫理的配慮の必要性を説明でき、演習中に実施できる。３．全身状態を把握するために必要な健康歴聴取を5W1Hを活用し実施できる。４．人体構造の基礎的知識とフィジカルアセスメント技術をもとに、事例について系統的に状態把握する方法を考えることができる。５．事例についてフィジカルアセスメント技術を用いて情報収集し、アセスメントできる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "教科書、資料、視聴覚教材を基に事前学習に取り組み講義に参加する。講義形式だけでなく、グループでの演習を実施する。",
        "notices": "事前学習・講義・演習を通してヘルスアセスメントの能力を習得する。演習では講義をふまえ技術習得を行う。健康管理に留意し、本授業の欠席には十分注意する。\"演習では、事前学習が不十分な場合、身だしなみが整っていない場合に参加を認めないことがあるため、注意する。フィジカルアセスメントに必要なステート等の購入が必要である。本科目は基礎看護学実習の先行要件科目である。",
        "preparatoryStudy": "シラバスを参考に、予習、復習をする。",
        "gradingGuidelines": "定期試験80％、課題レポート10％、授業態度10％の総合評価とする。",
        "textbook": "茂野香おる他：系統看護学講座専門分野I基礎看護学[2]基礎看護技術I,医学書院．",
        "referenceMaterials": "松尾ミヨ子ほか編：ナーシング・グラフィカ基礎看護学(2)基礎看護技術Ⅰコミュニケーション／看護の展開／ヘルスアセスメント深井喜代子編集：新体系看護学全書基礎看護学②基礎看護技術Ⅰ,メヂカルフレンド社.関連科目のテキスト、参考書。授業内に提示する。",
        "courseSchedule": "第1回:授業ガイダンス、ヘルスアセスメントの概要：講義（安井）第2回:バイタルサイン・フィジカルイグザミネーション総論①：講義（安井）第3回:バイタルサイン・フィジカルイグザミネーション総論②：講義（安井）第4回:呼吸器系のフィジカルアセスメント：講義（安井）第5回:循環器系のフィジカルアセスメント：講義（安井）第6回:消化器系のフィジカルアセスメント：講義（安井）第7回:呼吸器・循環器・消化器系のアセスメント：演習（全教員）第8回:呼吸器・循環器・消化器系のアセスメント：演習（全教員）第9回:筋・骨格系および神経系のフィジカルアセスメント：講義（安井）第10回:頭頸部と感覚器のフィジカルアセスメント：講義（安井）第11回:心理・社会状態のアセスメント：講義（安井）第12回:事例演習（全教員）第13回:事例演習（全教員）第14回:試験（全教員）第15回:まとめ（全教員）（詳細は第一回授業時に提示する）",
        "courseDataUpdatedAt": "2024\/07\/05"
    },
    "updateAt": "2024\/09\/12"
}