{
    "lectureCode": "W1206",
    "courseName": "成人看護学概論",
    "lecturer": [
        "未定(所属なし)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "火4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３０２１２教室"
    ],
    "courceDetails": {
        "courseOverview": "成人期にある人々の特徴を身体的、心理的、社会的ならびに環境や生活者の視点から捉え、看護の対象となる人の理解を深めるとともに、成人看護が担う役割、課題について学ぶ。また、成人期にある人が健康を損なうことの意味、健康な状態から健康障害に至る対象の経験が連続的であることを理解したうえで、成人期にある人の健康状態に応じた看護の役割や方法、有用な理論を学修する。この科目は、成人看護学の実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "1.成人期にある人々のライフサイクル、発達課題について説明できる。2.成人期にある人々の健康が社会・環境・生活等によってどのような影響を受けるのかを説明できる。3.保健統計や我が国の今日的課題から成人期にある人の健康課題を説明できる。4.成人期にある人の健康状態に応じた看護の概要ならびに役割について説明できる。5.成人期にある人への看護に有用な理論の概要を説明できる。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1.授業計画に基づき、教科書、資料、視聴覚教材などを用いてすすめる。2.講義だけでなく適宜、反転授業、グループワークや全体討議などにより授業をすすめる。3.毎授業時、フィードバックシートに学びの要約・質問などを記入し提出する。",
        "notices": "1.本科目は成人看護の基礎となる。成人期にある人を生活者の視点で具体的に考えられるよう、日常の生活の営みを意識しながら学習に臨む。2.グループワークやディスカッション等、学生間での学びが深まるよう各々の役割を果たすとともに、自分の考えを言語化し他者に説明できるように参加する。3.既習の知識を踏まえて授業を行う。自己学習は必須であり計画的に予習・復習を行ったうえで参加する。4.テキストは購入することを強く推奨する。5.適宜学習の成果物について提出を求める。期限外に提出した成果物は原則として評価の対象外とする。",
        "preparatoryStudy": "1.シラバスを参照し、関連した既習知識の復習を行う。2.授業内容に関連したテキスト、資料等を予め精読する。",
        "gradingGuidelines": "1.筆記試験：80％2.課題提出：20％（課題の成果物に対し、ルーブリック評価を行う）課題等に対しては、最終授業で全体に対しフィードバックを行う。",
        "textbook": "安酸史子、鈴木純恵、吉田澄恵（編者）：ナーシング・グラフィカ成人看護学①成人看護学概論第5版、メディカ出版、2022．",
        "referenceMaterials": "講義時に適時紹介する。",
        "courseSchedule": "第1回：ガイダンス成人期にある人の特徴第2回：成人期にある人の生活と健康課題、成人保健第3回：成人期にある人および健康課題を持つ人を支援するための理論①第4回：成人期にある人および健康課題を持つ人を支援するための理論②第5回：成人期にある人および健康課題を持つ人を支援するための理論③第6回：成人期にある人に対する基本的な看護、役割第7回：成人看護における多職種連携、チーム医療と継続看護第8回：まとめとフィードバック",
        "courseDataUpdatedAt": "2025/03/05"
    },
    "updateAt": "2025/03/21"
}