{
    "lectureCode": "W1204",
    "courseName": "母性看護学概論",
    "lecturer": [
        "野澤美江子(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１７１４多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "母性看護学の基礎と、母性看護の対象をライフステージから捉えその対象に対する看護の方法論を学ぶ。さらに周産期にある対象を理解し方法論を学ぶ「母性看護学Ⅰ」「母性看護学Ⅱ」および母性看護の実践科目である「母性看護学実習」へと発展させる。具体的には、社会的ニーズに対応する母性看護を実践するために必要な学問的基盤の理解、母性看護の対象の身体的・心理社会的特徴、母性の健康を守る社会システムと看護の役割を学ぶ。さらに思春期、成熟期、更年期、老年期という女性のライフステージにおける対象の特性と健康課題/問題を理解し、リプロダクティブヘルスの視点から各時期における対象の健康の保持増進、健康逸脱の予防、健康への回復過程における看護の目的・方法を学ぶ。この科目は、医療現場において母性看護に従事した実務経験に基づき、大学で学ぶ基礎的な看護の知識や技術が実践場面でどのように活用されているかについて解説する実践的科目である。",
        "outcomesMeasuredBy": "1.母性とは、母性看護とは何か説明できる。2.母性看護を実践する上で基盤となる理論について説明できる。3.母子保健統計について社会の変化と関連させて説明できる。4.母性の健康を守る社会システムについて説明できる。5.ライフステージにある女性の特性と健康課題／問題を理解し、看護について考える。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1.授業計画に基づき、教科書及び授業で配布する資料、パワーポイントを用いて行うが、指名-回答-解説を中心にしたアクティブラーニング形式を取り入れて行う。2.毎回授業開始時に「リアクションシート」（出席表を兼ねる）を受け取り、考えたことや感じたこと等を記載して授業終了後に提出する。なお、遠隔授業の場合は、毎回授業終了時にmoodle上の「フィードバックシート」（出席表を兼ねる）に考えたことや感じたこと等を入力し、送信する。",
        "notices": "1.本科目は、3年次の領域別実習の先行要件となっている。2.学習には、基礎知識として1年次に履修した「看護学概論」などの知識が不可欠である。3.学習を進める上で、専門基礎科目の選択科目である「発達心理学」、必修科目である「家族社会学」も参考になる。4.ライフステージの健康問題については、後期の「疾病治療論Ⅲ」の履修時にさらに学習を深めてほしい。",
        "preparatoryStudy": "この科目は、母性看護学の基礎となるので確実に知識を身につけると共に、ライフステージ全般という広範囲な知識の習得が求められる。そのため、予習ではシラバスを参考に該当する教科書の箇所を一読したり、積極的に課題学習に取り組んでほしい。復習では、学習内容で不明な点を必ず調べるなど曖昧さを残さないことを心掛ける。",
        "gradingGuidelines": "課題（10％）、中間試験（45％）、期末試験（45％）最終授業で全体に対するフィードバックを行う。期末試験の再試験は中間テストとの合算で6割に満たなかった者を対象とし、再試験により合格した場合はC評価となる。",
        "textbook": "森恵美他編：系統看護学講座母性看護学概論（医学書院）",
        "referenceMaterials": "毎回の講義時に関連した参考書を紹介する。",
        "courseSchedule": "第1回：ガイダンス、母性とは、母性看護とは、母性看護の場と職種第2回：母性看護で用いられる理論：移行、役割、愛着、母子相互作用、セクシャリティ、リプロダクティブヘルス/ライツ第3回：母性看護を取り巻く社会の変遷（1）：母子保健統計から見た動向第4回：母性看護を取り巻く社会の変遷（2）：母性看護に関連する法律と制度第5回：母性看護の対象：性差、対象を取り巻く倫理的課題、妊娠の成立第6回：母性看護の役割：意思決定支援、親になる過程を促進する看護、不快症状に対する看護、悲嘆過程を支える看護第7回：中間試験、女性のライフステージと健康第8回：思春期女性の特性、思春期女性の健康課題／健康問題と看護（1）第9回：思春期女性の健康課題／健康問題と看護（2）第10回：成熟期女性の特性、成熟期女性の健康課題／健康問題と看護（1）第11回：成熟期女性の健康課題／健康問題と看護（2）第12回：成熟期女性の健康課題／健康問題と看護（3）第13回：更年期女性の特性第14回：更年期女性の健康課題／健康問題と看護第15回：老年期女性の特性、健康課題／健康問題と看護、まとめ",
        "courseDataUpdatedAt": "2024/01/27"
    },
    "updateAt": "2024/12/09"
}