{
    "lectureCode": "W1217",
    "courseName": "基礎看護学実習",
    "lecturer": [
        "岩波浩美(医療保健学部看護学科)",
        "飯塚敏子(医療保健学部看護学科)",
        "宮首由美子(医療保健学部看護学科)",
        "繁永元樹(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "看護の対象が療養し生活する場である臨床において、看護の役割・機能、療養環境の理解ならびに、看護過程を通して基礎的な看護実践能力を養う。具体的には、病院および病棟を授業の場とし、入院中の患者の療養環境、看護師の看護実践を観察し、既習の知識や求められる態度への理解を深める。また、入院中の患者を受け持ち、「基礎看護技術Ⅰ」「基礎看護技術Ⅱ」「基礎看護技術Ⅲ」「ヘルスアセスメント」を通して学修した看護共通技術、日常生活援助技術、診療補助技術ならびにヘルスアセスメントを実践するとともに、看護過程を展開し、多側面での対象理解、対象に応じた安全、安楽な看護援助の提供を試みる。これらの学修活動を通し、看護職としての倫理観を培い、内省するなかで自己課題を見出し、看護実践に必要な基礎的能力を身につける。本科目は、医療現場において実務経験を有する専門職が、その経験に基づいた実習を行う実践的科目である。",
        "outcomesMeasuredBy": "１．病院の構造とその機能、目的、多職種の役割と看護サービスについて知る。２．医療環境における看護の対象者を知る。３．看護師と行動を共にし、看護業務・看護ケアの見学を通し、看護の役割・機能を理解する。４．一人の患者を受け持ち、授業で学んだ看護過程の知識を実践に結び付ける。５．自己の看護の向上に向けて、看護の振り返りや自己洞察の重要性について理解する。６．実習を通して、医療チームの一員としての役割を知るとともに、看護師として必要な態度、マナーを身につける。７．医療安全の知識を基に、実習中に起こりうるインシデントを知り、リスクを回避する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "初めに、学内のオリエンテーションを通し、実習の目的・目標、学習活動、評価について、実習における倫理的配慮や安全管理なども含め学習する。実習では、少人数のグループを編成し、グループごとに担当教員が受け持ち指導する。実習時は、所定のユニホームを着用し、看護学生としての自覚をもった身だしなみ、ふるまいが求められる。身だしなみが整っていない場合に参加を認めない。",
        "notices": "学内のオリエンテーションは必ず参加すること。学内、病院実習とも、遅刻・欠席・早退がないよう、十分な健康管理、感染予防対策を心がける。実習開始までに「実習のてびき」をよく読み、特に次の点を十分理解しておく必要がある。実習記録には、患者の個人情報が記載されるため、紛失しないように厳重に管理する。また、実習中に知り得た情報は厳重に管理、保護し、患者のプライバシーについて守秘義務を遵守する。明確な目的を持ち、積極的に実習に臨むことにより今後の学修への示唆を多く得ることができる。",
        "preparatoryStudy": "実習とは、講義、演習を通し修得した知識を現実の状況に適用し、理解を深める授業である。本科目の学修には、人体構造学、人体機能学、人体構造機能学演習、病理病態学Ⅰ・Ⅱ、看護入門講座、看護学概論、基礎看護技術I・II・III、ヘルスアセスメント、看護過程、成人看護学概論、高齢者看護学概論の学修が土台となっているため、これら関連する講義や演習の内容を復習することが非常に重要である。",
        "gradingGuidelines": "看護の対象となる人の理解や看護師の役割の理解、看護過程の実践などをはじめとした実習目標到達度を中心に、事前学修を含めた実習に取り組む姿勢、最終レポートによって評価する。",
        "textbook": "指定しない。授業開始時に、「基礎看護学実習実習要項」を配布する。",
        "referenceMaterials": "準備学習の項に示した関連科目のテキストなどを活用する。また、適宜紹介する。",
        "courseSchedule": "第1回：実習オリエンテーション（全教員）第2回：病院オリエンテーション(全教員）第3回：病棟実習(全教員）第4回：病棟実習(全教員）第5回：病棟・学内実習（全教員）第6回：病棟実習（全教員）第7回：病棟実習（全教員）第8回：学内実習（全教員）第9回：病棟実習（全教員）第10回：学内実習（全教員）第11回：病棟実習（全教員）第12回：病棟実習（全教員）第13回：病棟実習（全教員）第14回：学内実習（全教員）第15回:実習のまとめ・カンファレンス（全教員）",
        "courseDataUpdatedAt": "2025/03/03"
    },
    "updateAt": "2025/03/21"
}