{
    "lectureCode": "W1218",
    "courseName": "公衆衛生看護学I",
    "lecturer": [
        "五十嵐千代(医療保健学部看護学科)",
        "一色喜保(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３０２０２教室"
    ],
    "courceDetails": {
        "courseOverview": "保健師は特定の個人や家族のみならず、集団を対象に活動する。ここでは、集団の構成メンバーの特定の人々に選択的に責任をもつのではなく、平等に責任をもつための手法として、対象集団に顕在している健康課題と潜在する健康課題を予測し、組織的に解決する方法論の基礎を学ぶ。この科目は、実務経験を有する指導者が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "一般教育目標(GIO)地域保健活動の展開に必要不可欠である地域診断について理解し、その手法を習得する。行動目標(SBO)1.地域保健活動の活動基盤となる地域診断とはどのようなものか、記述することができる。2.地域診断に活用できる理論モデルを記述することができる。3.地域診断の目的と対象、位置づけ、展開過程を述べることができる。4.地域の健康課題を構造化することができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義・演習",
        "notices": "保健師コースを希望する学生は必ず履修して下さい。集団の健康課題をとらえ、施策に反映させる方法論に関する科目で、4年次の公衆衛生看護学実習につながる基礎知識を学びます。看護師コースの学生にとっても、看護職に地域をとらえる視点を求められる昨今、4年次の地域包括支援センター実習に必要な演習を行います。主体的な参加を期待します。",
        "preparatoryStudy": "公衆衛生学（1年前期）、保健指導論（2年前期）、疫学の基礎・疫学の応用（2年後期）は、本科目の基礎となる講義なので、十分に復習して臨んでください。",
        "gradingGuidelines": "１．授業とグループワークへの参加状況20％２．地域診断演習発表40％３．課題レポート40％１～３を総合的に評価する。",
        "textbook": "標美奈子著者代表：標準保健師講座1公衆衛生看護学概論第5版医学書院中村裕美子著者代表：標準保健師講座2公衆衛生看護技術第3版医学書院佐伯和子編著，「地域アセスメントガイド」医歯薬出版",
        "referenceMaterials": "国民衛生の動向、厚生統計協会、最新版",
        "courseSchedule": "第1回：地域組織活動と看護職の役割、地域組織活動で用いられる理論(五十嵐)第2回：コミュニティ・アセスメントの目的と意義、展開方法(五十嵐)第3回：コミュニティ・アセスメントの展開演習1-①課題抽出と優先順位の検討（五十嵐、一色）第4回：コミュニティ・アセスメントの展開演習1-②課題の構造化（五十嵐、一色）第5回：コミュニティ・アセスメントの展開演習1-③解決に向けた対策の検討(五十嵐、一色)第6回：コミュニティ・アセスメントの展開演習1-④発表（五十嵐、一色）第7回：コミュニティ・アセスメントの実例：トップダウンとボトムアップ(一色)第8回：コミュニティ・アセスメント演習2-①(五十嵐、一色)第9回：コミュニティ・アセスメント演習2-②(五十嵐、一色)第10回：コミュニティ・アセスメント演習2-③(五十嵐、一色)第11回：コミュニティ・アセスメント演習2-④(五十嵐、一色)第12回：コミュニティ・アセスメント発表会(五十嵐、一色)第13回：コミュニティ・アセスメント発表会(五十嵐、一色)第14回：地域組織活動で活用できる理論コミュニティ・エンパワメント、コミュニティ開発（五十嵐）第15回：地域ケアシステムの構築とネットワーク化、まとめ(五十嵐)",
        "courseDataUpdatedAt": "2024\/03\/05"
    },
    "updateAt": "2024\/09\/12"
}