{
    "lectureCode": "W1211",
    "courseName": "小児看護学I（健康障害のある子どもと家族の支援）",
    "lecturer": [
        "白石裕子(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３０２１２教室"
    ],
    "courceDetails": {
        "courseOverview": "子どもの発達段階の理解に基づき、子どもに起こりやすい健康障がいの特徴や、それぞれに対する小児看護の実践について学ぶ。さらに病気や障がいなど、何らかの健康問題のある子どもとその家族の特徴と、それらに応じた看護の実際について学ぶ。また、健康を逸脱し医療を受ける子どもの最善の利益を保証するための小児看看護の役割についても学修する。この科目は実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "1．子どもの発育レベルに応じた生活援助に必要な内容を説明できる。2．健康障害が、子どもと家族に与える影響とそれに付随した生活の変化について説明できる。3．健康障害・闘病体験を通し、子どもと家族の反応や体験の意味付けについて説明できる。4．健康障害を抱えた子どもと家族の状況、生活の変化に即した看護介入について説明できる。5．健康障害を抱えた子どもと家族にとっての最善の利益に、小児看護が果たす役割を考察する。6．病気や障がいなど何らかの健康問題を抱えた子どもとその家族の特徴を述べることができる。7．子どもの病気や障がいが、家族の生活、子どもと発達や将来に与える影響について述べることができる。8．子どもの健康問題に応じた看護の必要性を、医学的根拠に基づいて判断することができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業計画に基づき、教科書及び授業で配布する資料、パワーポイントに沿って講義を行う。講義以外に、バズセッション、ワークショップなど参加型授業も取り入れる。また、成長発達を続ける子どもの理解を促すため、視聴覚教材を活用する。",
        "notices": "1.ヘルスアセスメントや小児看護学概論、既習関連科目(人体構造学、人体機能学、人体構造機能学演習、栄養代謝学、疾病治療論Ⅳなど)を踏まえて講義を行う。2.復習や課題に対する学修は不可欠であり、学生間の討議など主体的な参加が必要である。3.授業の中でバーチャル子育てを行う。",
        "preparatoryStudy": "1.シラバスを参考にして教科書を一読し、一人ひとりの目的意識を持って授業に臨んでください。2.基礎知識として1年次に履修した人体構造学・人体機能学および前期に履修した疾病治療論Ⅳ・小児看護学概論などの知識が不可欠です。予習・復習等の授業準備を確実にして臨んでください。",
        "gradingGuidelines": "課題レポート（15％）、中間試験（15%）、定期試験（70％）の成績を総合的に評価する。課題や試験のフィードバックはMoodle等を通して行う。",
        "textbook": "1.奈良間美穂他著：系統看護学講座小児看護学概論小児臨床看護総論小児看護学①（医学書院）2.奈良間美穂他著：系統看護学講座小児臨床看護各論小児看護学②（医学書院）",
        "referenceMaterials": "ナーシング・グラフィカ小児看護学(2)：小児看護技術第4版(MCメディカ出版）",
        "courseSchedule": "第1回：ガイダンス子どもの成長発達と小児医療・看護の役割（白石）第2回：子どもと安全、起こりやすい事故と外傷（白石）第3回：子ども虐待と小児看護の役割（白石）第4回：子どもの健康生活への支援、看護の実際1（白石）第5回：子どもの健康生活への支援、看護の実際2（白石）第6回：子どもの健康生活への支援、看護の実際3（白石）第7回：子どもの育ちと健康問題まとめと中間試験（小児領域教員全員）第8回：障がい児・健康障がいを持つ子どもの歯科保健（特別講師）第9回：小児看護の役割小児看護CNSの活動の実際（特別講師）第10回：乳児期-急性期の子どもと家族の看護1（呼吸器疾患）（白石）第11回：乳児期-急性期の子どもと家族の看護1（循環器疾患）（白石）第12回：幼児期-体動制限のある子どもと家族の看護（岸）第13回：幼児期-急性期～回復期の子どもと家族の看護（白石）第14回：学童期-急性期～慢性期の子どもと家族の看護（白石）第15回：思春期-慢性疾患の子どもと家族の看護（岸）",
        "courseDataUpdatedAt": "2024\/01\/26"
    },
    "updateAt": "2024\/05\/29"
}