{
    "lectureCode": "W1212",
    "courseName": "成人看護学I（周手術期・急性期）",
    "lecturer": [
        "西尾奈緒美(医療保健学部看護学科)",
        "折坂真理(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１０１６教室",
        "３１７０２看護実習室２",
        "３１７１４多目的実習室",
        "３１７１６看護実習室３"
    ],
    "courceDetails": {
        "courseOverview": "周術期・クリティカル期における侵襲的治療や検査をうける患者の身体面、心理面、社会面に及ぼす特徴と影響を理解し、生命の維持と健康回復に必要な看護支援方法について学習する。この科目は実務経験を有する専門職が、医療現場においてその経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "周術期・クリティカル期に特徴的な健康障害と看護についての専門的な知識・技術を習得する。1.急激な身体侵襲を受ける患者と家族の特徴について説明できる。2.疾病および加療に伴う身体の構造的・機能的変化が日常生活に及ぼす影響について理解できる。3.急性期にある患者とその家族の回復促進に向けた看護について説明できる。4.周手術期・クリティカルケア期にある対象者の看護を実践するためのチーム医療、多職種連携、社会資源の活用について理解できる。5.事例を通して、周術期の健康問題を有する患者の看護過程を展開し、看護問題を導くことができる。",
        "learningOutcomes": "実学に基づく専門能力問題解決力",
        "teachingMethod": "1.授業計画に基づき、教科書および配布資料を用いて行う。2.Moodle上にupした事前課題をもとに、「指名‐解答‐解説」を中心にしたアクティブラーニング形式を取り入れる。3.事例や看護場面から、看護理論を活用した対象理解と看護問題解決力をつけるため、ワークシートを用い、グループでのディスカッションを取り入れる。4.各回授業終了後は授業の感想、意見、質問などを「リアクションシート」（出席表を兼ねる）に記入し、授業内容の振り返りを行う。",
        "notices": "本科目は領域別実習の先行要件である。1.事例演習では、積極的かつ自主的に参加し、グループメンバーと協働しながら学習効果があがるよう、計画的にすすめること。2.授業時に配布する資料に加え、参考図書を用いて予習・復習を行う。3.課題の提出物については、期限を厳守すること。",
        "preparatoryStudy": "1.講義で活用する基礎的知識（1-2年前期に修得）を復習して授業に臨む。2.事前学習課題に取り組み、学習に必要な基礎知識を予習しておく。",
        "gradingGuidelines": "1.筆記試験60％（中間試験と定期試験の合計）2.課題40％（課題の提出物に対しルーブリック評価を行う）3.「１」「２」を総合的に評価する。但し、総合評価の対象は筆記試験で一定の水準に到達した場合である。",
        "textbook": "林直子、佐藤まゆみ：看護学テキストNiCE成人看護学急性期看護Ⅰ概論・周手術期看護改訂第４版、南江堂、2023.",
        "referenceMaterials": "大久保暢子：日常生活行動からみるヘルスアセスメント、日本看護協会出版会、2023.鎌倉やよい、深田順子：周術期の臨床判断を磨くⅠ第２版、医学書院、2023.深田順子、鎌倉やよい：周術期の臨床判断を磨くⅡ医学書院、2021.矢永勝彦、小路美喜子：系統看護学講座別巻臨床看護学概論、医学書院北島政樹、江川幸二：系統看護学講座別巻臨床外科看護学各論、医学書院",
        "courseSchedule": "第1回：ガイダンス、急性期看護概論（西尾）第2回：周手術期看護概論（西尾）第3回：周術期の看護（術前・術中）（西尾）第4回：周術期の看護（術後）（西尾）第5回：呼吸機能の再確立と周術期看護（西尾）第6回：運動機能の再確立と周術期看護（西尾）第7回：排泄機能の再確立と周術期看護①（西尾）第8回：理解度チェック（全教員）第9回：摂取機能の再確立と周術期の看護過程（全教員）第10回：循環機能の再確立と周術期看護（西尾）第11回：排泄機能の再確立と周術期看護②（西尾）第12回：脳神経機能の再確立と周術期看護（折坂）第13回：クリティカルケア救急医療・集中治療の現状と看護（西尾）第14回：クリティカルな健康状態の患者の看護①②（西尾）第15回：周術期・クリティカル期における看護のまとめ（西尾）",
        "courseDataUpdatedAt": "2024/03/05"
    },
    "updateAt": "2024/05/29"
}