{
    "lectureCode": "W1217",
    "courseName": "基礎看護学実習",
    "lecturer": [
        "岩波浩美(医療保健学部看護学科)",
        "飯塚敏子(医療保健学部看護学科)",
        "宮首由美子(医療保健学部看護学科)",
        "繁永元樹(医療保健学部看護学科)",
        "安井大輔(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "対象の療養の場である臨床において、看護の役割・機能、療養環境の理解ならびに、看護過程を通して基礎的な看護実践能力を養う。具体的には、既習の日常生活援助技術、診療補助技術ならびにヘルスアセスメントの実践を通して、多側面での対象理解、対象に応じた安全で安楽な看護援助を実践する。実践の中で看護職としての倫理観を培い、内省するなかで自己課題を見出し、看護実践に必要な基礎的能力を身につける。本科目の受講を通し、「実学に基づく専門能力」、「コミュニケーション能力」、「論理的な思考力」、「分析・評価能力」、「問題解決力」を養う。この科目は、医療現場において実務経験を有する専門職が、その経験に基づいた実習を行う実践的科目である。",
        "outcomesMeasuredBy": "１．対象のおかれている環境が理解できる。２．対象の日常生活援助の必要性を理解し、日常生活援助技術が実施できる。３．問題解決思考に基づき、対象の看護過程の展開ができる",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "学内でオリエンテーションを受けてから実習に臨む。オリエンテーションでは、実習の目的・目標・展開・評価、実習における倫理的配慮や安全管理などを含めた説明を行う。実習は少人数のグループを各担当教員が受け持ち指導する。服装は、ユニホームを着用し、看護学生としての自覚をもって実習を行うことが求められる。身だしなみが整っていない場合に参加を認めない。",
        "notices": "学内でのオリエンテーションは必ず参加すること。健康管理や感染症予防対策を行い、遅刻・欠席・早退がないように心がけることが必要である。実習記録は、患者や病棟の情報が記載されるため紛失しないように管理し、個人情報の守秘義務に努める。実習中に知り得た患者の個人情報情報は厳重に管理、保護し、患者のプライバシーについて守秘義務を遵守することが求められる。明確な目的を持ち、積極的に実習に臨むことにより今後の学修への示唆を多く得ることができる。",
        "preparatoryStudy": "人体構造学、人体機能学、人体構造機能学演習、病理病態学Ⅰ・Ⅱ、看護入門講座、看護学概論、基礎看護技術I・II・III、ヘルスアセスメント、看護過程、成人看護学概論、高齢者看護学概論の学修が土台となっているため、これら関連講義や演習内容について復習することが非常に重要である。",
        "gradingGuidelines": "看護の対象となる人の理解や看護師の役割の理解、看護過程の実践などをはじめとした実習目標到達度を中心に事前学修を含めた実習に取り組む姿勢、最終レポートによって評価する。",
        "textbook": "基礎看護学実習実習要項",
        "referenceMaterials": "準備学習で示した関連科目のテキスト類などは、適宜紹介する。",
        "courseSchedule": "第1回：実習オリエンテーション（全教員）第2回：病院オリエンテーション(全教員）第3回：病棟実習(全教員）第4回：病棟実習(全教員）第5回：病棟・学内実習（全教員）第6回：病棟実習（全教員）第7回：病棟実習（全教員）第8回：学内実習（全教員）第9回：病棟実習（全教員）第10回：学内実習（全教員）第11回：病棟実習（全教員）第12回：病棟実習（全教員）第13回：病棟実習（全教員）第14回：学内実習（全教員）第15回:実習のまとめ・カンファレンス（全教員）",
        "courseDataUpdatedAt": "2024/03/05"
    },
    "updateAt": "2024/05/29"
}