{
    "lectureCode": "W1221",
    "courseName": "成人看護学I[2021年以前]",
    "lecturer": [
        "岩月すみ江(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "2年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "慢性的な健康課題を有する人や終末期にある人とその家族の療養を支援するための看護の方法を学修する。慢性的な経過をたどり日常のなかで折り合いをつけながら生活調整が必要な人や機能障害を抱え生活の再構築が必要な人のセルフマネジメントについて学び、療養生活を支える看護の方法を学ぶ。また、人生の終末を迎える人とその家族がおかれた状況、全人的苦痛の理解とそれを緩和する看護の方法について理解を深める。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "1.病いの慢性性、成人期にある人が慢性疾患を病むことについて説明できる。2.慢性疾患を抱えて生活する人の健康障害の特徴とその療養生活について説明できる。3.慢性疾患を抱えて生活する人とその家族の生活調整および生活再構築を支援するための看護について説明できる。4.長期にわたり療養が必要な人のセルフマネジメントを促進する看護について説明できる。5.人生の終末を迎える人の苦痛について全人的に理解し、苦痛を緩和するための看護について理解できる。6.慢性期看護を実践するためのチーム医療、多職種連携、社会資源の活用について説明できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1.授業計画に基づき、教科書および配布資料を用いて行う。2.事例を通して、看護理論を活用した対象理解の方法ならびに関連図を用いた全体像のとらえ方を学ぶ。3.基本的に毎授業時、反転授業形式やディスカッション形式をとる。",
        "notices": "1.本科目は、3年次の領域別実習の先行要件である。2.成人看護学（急性期）に繋がる内容であり、主体的・積極的に参加する。3.プレゼンテーションやディスカッション等、学生自身の学びが深まるよう各々の役割を果たすとともに、自分の考えを言語化し他者に説明できる準備を整えて参加する。4.既修学修の復習、自己学習は必須であり計画的に予習・復習を行う。",
        "preparatoryStudy": "1.シラバスを参照し関連した既習知識の復習を行って授業に臨む。特に、「人体構造学」「人体機能学」「疾病治療論」などの専門期科目に関する授業は復習して授業に臨むこと。2.授業内容に関連したテキストを予め読んで参加する。3.各単元の準備学習は都度指示する。",
        "gradingGuidelines": "課題提出100％（単元毎60%、最終レポート40%）授業の単元ごとに、予習ならびに復習を兼ねた成果物を提出する。最終のレポートは、慢性期看護に関連した課題に取り組む。それぞれの成果物をルーブリック評価に基づき点数化する。",
        "textbook": "黒江百合子（編）：経過別成人看護学慢性期看護第2版、メジカルフレンド社、2021",
        "referenceMaterials": "・根拠がわかる疾患別看護過程改訂第2版、南江堂・藤崎郁：フィジカルアセスメント完全ガイド第2版、学研・三上れつ、小松万喜子（編）：ヘルスアセスメント、南江堂・任和子、細田公則：糖尿病・代謝・内分泌看護ケア関連図、中央法規・阿部俊子（監修）：エビデンスに基づく疾患別看護ケア関連図、中央法規その他講義中に適時紹介する",
        "courseSchedule": "第1回：ガイダンス慢性期看護概論呼吸機能障害（岩月）第2回：呼吸機能障害①（岩月）第3回：呼吸機能障害②（岩月）第4回：循環機能障害①（岩月）第5回：循環機能障害②（岩月）第6回：循環機能障害③（岩月）第7回～10回：慢性疾患を抱えて生活する人の全体像を捉える（岩月）第11回：代謝機能障害①（岩月）第12回：代謝機能障害②（岩月）第13回：脳機能障害①（岩月）第14回：脳機能障害②（岩月）第15回：自己免疫機能障害（岩月）第16回：まとめ中間フィードバック（岩月）第17回：内部調節機能障害①（岩月）第18回：内部調節機能障害②（岩月）第19回：栄養摂取・消化吸収機能障害①（岩月）第20回：栄養摂取・消化吸収機能障害②（岩月）第21回：がん看護総論（岩月）第22回：血液造血器機能障害化学療法（岩月）第23回：がん看護骨髄移植（岩月）第24回：がん看護放射線療法（岩月）第25回：難病（岩月）第26回：難病（岩月）第27回：緩和ケア（岩月）第28回：緩和ケア（岩月）第29回：終末期にある人の看護（岩月）第30回：まとめ・在宅移行支援（岩月）",
        "courseDataUpdatedAt": "2024\/03\/05"
    },
    "updateAt": "2024\/05\/29"
}