{
    "lectureCode": "W1306",
    "courseName": "高齢者看護学II（高齢者のアセスメントと看護の実際）",
    "lecturer": [
        "長坂奎英(医療保健学部看護学科)",
        "佐藤智子(医療保健学部看護学科)",
        "篠田巴留香(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３１７１４多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "健康障害や生活障害を有する高齢者への看護実践のために、観察アセスメントからケア実践評価に至る高齢者看護の看護過程を展開する方法を学修する。老年期に起こりやすい健康障害や生活障害、フレイル事例に関連づけたアセスメント、看護援助計画・立案の知識や技術を修得し、看護過程の展開方法を学修する。提示された事例を読み込み、多くの情報から看護に必要な事実を選び出し、部分的断片的な情報の意味を病態関連および生活機能を意識して捉え、対象である目の前のひとりの人を理解し、それぞれの人が持てる力を発揮し、健康的に生きていくための視点をもって看護の方向性を考える力を養う。",
        "outcomesMeasuredBy": "1.健康障害や生活障害を持つ高齢者の全体像をアセスメントする。2.アセスメントから個々の高齢者に合った問題と持てる力を抽出できる。3.個々の問題に適した看護目標の設定、持てる力に着目した看護計画の立案ができる。4.高齢者看護に有効かつその人の回復力を維持向上させるケア方法を説明できる。5.看護実践の評価方法について説明できる。6.加齢による生活機能障害に対する高齢者への援助技術を修得できる。7.老年期の健康障害と症状経過の特徴に応じた看護過程展開能力を修得できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1.教科書や配布資料を参考に、視聴覚教材も用いた講義を行う。2.対面授業、演習、グループワーク、課題発表により授業を進める。3.毎回の授業において、出欠表を兼ねたリアクションペーパーに、講義に対する感想・疑問・質問を記載し、講義終了後提出とする。4.毎回の授業で事前・事後課題を提示するので、提出期限および方法を守ること。5.教科書は必携してください。",
        "notices": "1.各自が予習・事前課題の学修をしている前提で授業が進みます。予習をして臨みましょう。2.講義およびMoodleで指示された課題に取り組みましょう。3.授業は個人およびグループワーク、演習を含む講義形式であり、積極的・自主的な学習態度が求められます。グループメンバーで取り組む事前課題もあるため、計画的に取り組んでください。4.課題いついては提出期限および方法を守ってください。5.教科書は必携です。前回までの配布資料は綴じて持参してください。6.授業の配布資料はあくまでも参考資料です。授業で聞いた内容が資料に記載されていない場合は、自身でメモを取るようにしましょう。",
        "preparatoryStudy": "1.高齢者看護学Ⅱおよび高齢者看護学実習ではV.ヘンダーソンの理論を用います。指定された教科書を繰り返し読みましょう。2.看護過程の展開の中で、病態関連図作成があります。教科書内にいくつかの病態関連図が掲載されているので目を通し、イメージしておきましょう。",
        "gradingGuidelines": "●リアクションペーパー提出、課題提出5%●課題提出状況および内容20%●学期末テスト65%",
        "textbook": "1.堀内ふき(編集)：ナーシング・グラフィカ老年看護学②高齢者看護の実践,第6版,メディカ出版.20232.亀井智子(編集)：根拠と事故防止からみた老年看護技術,第3版,医学書院,20223.秋葉公子,他（共著）：看護過程を使ったヘンダーソン看護論の実践,第5版,ヌーヴェルヒロカワ.2023",
        "referenceMaterials": "1.ヴァージニア・ヘンダーソン著：看護の基本となるもの,改訂版7刷,日本看護協会出版会2.江﨑フサ子,他：ヘンダーソンの基本的看護に関する看護問題リスト,第5版,ヌーヴェルヒロカワ.2023",
        "courseSchedule": "第1回(4\/11)：高齢者看護学(看護過程)ガイダンス第2回(4\/18)：ヘンダーソン看護論と高齢者看護学第3回(4\/25)：事例提示(事例紹介・病態理解・DVD視聴)第4回(5\/9)：情報分類第5回(5\/16)：アセスメント第6回(5\/23)：運動器疾患を有する高齢者の事例の考え方第7回(5\/30)：演習①ユマニチュードを用いたコミュニケーション第8回(6\/6)：全体像を描く①第9回(6\/13)：全体像を描く②第10回(6\/20)：問題の抽出・問題リスト作成第11回(6\/27)：看護目標・看護計画立案第12回(7\/4)：演習②高齢者のフィジカルアセスメント・検温・コミュニケーション第13回(7\/11)：グループワーク(発表資料作成)第14回(7\/18)：看護目標・計画・実施・評価のグループ発表第15回(7\/25)：高齢者看護学実習に向けてのまとめ・実習オリエンテーション",
        "courseDataUpdatedAt": "2024\/03\/05"
    },
    "updateAt": "2024\/05\/29"
}