{
    "lectureCode": "W1304",
    "courseName": "成人看護学II（生活調整・生活再構築）",
    "lecturer": [
        "岩月すみ江(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金3",
        "金4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１７０２看護実習室２",
        "３１７１４多目的実習室",
        "３１７１６看護実習室３",
        "３１８０１病棟模擬実習室"
    ],
    "courceDetails": {
        "courseOverview": "慢性的な健康問題を有する人や、終末期にある人とその家族への看護を学修する。具体的には、慢性的な経過をたどる疾患を抱え日常生活との折り合いをつけながら生活の調整を必要とする人および、機能障害を抱え生活の再構築を必要とする人のセルフマネジメントについて学び、その人らしい生活を支援する方法を学習する。また、人生の終末を迎える人とその家族がおかれた状況、全人的苦痛の理解とそれを緩和する看護の方法について理解を深める。この科目は、実務経験を有する専門職がその経験に基づいた講義・演習を行う実践的科目である。",
        "outcomesMeasuredBy": "１．病の慢性性と成人期にある人が慢性疾患を病むことの影響を説明できる。２．慢性疾患を抱えて生活する人の健康障害の特徴とその療養生活について説明できる。３．慢性疾患を抱えて生活する人とその家族の生活調整および生活の再構築を支援するための方法について説明できる。４．長期にわたり療養が必要な人のセルフマネジメントを促進する看護について説明できる。５．人生の終末を迎える人の苦痛について全人的に理解し、苦痛を緩和するための看護について説明できる。６．慢性期看護を実践するためのチーム医療、多職種連携、社会資源の活用について説明できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "１．授業計画に基づき、教科書および配付資料を用いてすすめる。２．事例を通して、看護理論を活用した対象理解の方法を理解する。３．関連図を用いて、対象の全体像の捉え看護過程を展開する。４．適時、グループワーク、演習ならびに学生によるプレゼンテーションを行う。",
        "notices": "１．本科目は3年次領域別実習の先行要件に含まれている。２．2年次に履修した成人看護学Ⅰに繋がっている科目であるため、適時、授業資料やテキストを持参する。３．グループワークや学生によるプレゼンテーション等、学生間での学び合いがなされるよう各々の役割を果たす。４．既修科目の復習、自己学習は必須であり授業計画にそって予習・復習を行う。５．3年次前期に開講する成人看護技術演習との共通事例があるため、関連する学習資料を持参する。６．各単元で提出を指示された成果物については、期限を厳守して提出する。期限外の提出は原則として受け付けない。",
        "preparatoryStudy": "１．基本的には授業計画の進行に合わせて適宜指示する。２．人体の構造や機能、疾病治療論等の専門基礎科目の復習は必須である。３．授業内容に関連したテキスト、資料に目を通した上で授業に参加する。資料は適時、科目のMoodleに提示する。４．対象の健康上の課題は連続している。そのため、成人看護学Ⅰならびに成人看護技術演習との関連を考えながら学習の準備を整えること。",
        "gradingGuidelines": "１．筆記試験70%（中間・期末試験合わせて）２．成果物30%（課題の成果物に対しルーブリック評価を行う）上記の１、２を総合的に評価する。また、全体に対するフィードバックを単元の区切り、中間・最終に行う。ただし、総合評価の対象となるのは筆記試験で一定の水準に達した者とする。",
        "textbook": "１．黒江ゆり子（編）：経過別成人看護学慢性期看護第2版、メジカルフレンド社、2021２．山本佳代子（監修）：成人看護学実習ワークブックメディカ出版、2023上記の１、２は必ず購入する。後期の実習においても役立つ内容となっている。",
        "referenceMaterials": "１．根拠がわかる疾患別看護過程改訂第2版、南江堂２．藤崎郁：フィジカルアセスメント完全ガイド第2版、学研３．三上れつ、小松万喜子（編）：ヘルスアセスメント、南江堂４．任和子、細田公則（著）：糖尿病・代謝・内分泌看護ケア関連図、中央法規５．阿部俊子（監修）：エビデンスに基づく疾患別看護ケア関連図、中央法規その他、講義中に紹介する。",
        "courseSchedule": "第1回：ガイダンス慢性期看護概論第2回：呼吸機能障害（COPD）を抱えて生活する人の看護第3回：関連図を用いた全体像の把握第4回：代謝機能障害（DM）を抱えて生活する人の看護第5回：看護過程の展開第6回：看護過程の展開第7回：循環機能障害（CHF）を抱えて生活する人の看護第8回：中間評価第9回：脳・神経機能に障害（CVD）を抱えて生活する人の看護第10回：内部調節機能障害（CKD）を抱えて生活する人の看護第11回：栄養摂取・消化吸収機能障害（LC）を抱えて生活する人の看護第12回：がん看護総論第13回：血液造血機能障害（AML）を抱えて生活する人の看護第14回：緩和ケアを必要とする人の看護第15回：終末期にある人の看護・まとめ",
        "courseDataUpdatedAt": "2024/01/29"
    },
    "updateAt": "2024/05/29"
}