{
    "lectureCode": "W1305",
    "courseName": "成人看護技術演習",
    "lecturer": [
        "折坂真理(医療保健学部看護学科)",
        "西尾奈緒美(医療保健学部看護学科)",
        "岩月すみ江(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１７０２看護実習室２",
        "３１７１４多目的実習室",
        "３１７１６看護実習室３",
        "３１８０１病棟模擬実習室"
    ],
    "courceDetails": {
        "courseOverview": "周手術期および慢性期にある対象者の健康レベルに応じた健康課題を理解し、適切な看護援助を実践するための看護技術を学修する。また、医療機器の使用に必要な基本的知識や安全な取り扱い方法について学修する。",
        "outcomesMeasuredBy": "１．手術を受ける患者の術前および術後のケア方法を理解し、患者の状況に応じた必要な看護技術を実施できる。２．輸液療法が必要な患者への看護技術を理解し実施できる。３．循環機能を評価する方法を理解し、心臓リハビリテーションにおける看護技術を実施できる。４．栄養・代謝機能障害のある患者に必要な看護技術を理解し、実施できる。５．呼吸機能障害のある患者に必要な看護技術を理解し、呼吸を整える看護技術を実施できる。６．病院施設で使用する医療機器の安全な取り扱い方法を理解できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "１，周手術期または慢性期の対象者に必要な看護ケアの技術演習を行う。２．演習ノート等、事前に提示する学習課題に沿って自己学習を行っていることを前提に演習を進める。",
        "notices": "１．本科目は3年次の領域別実習の先行要件である。２．成人看護学実習Ⅰ・Ⅱに直結する内容であるため、既習科目の復習や看護技術の復習など積極的な取り組みが必要となる。３．授業の理解を深めるためにも必ず事前学習課題に取り組んだうえで、演習に参加する。４．成人看護学Ⅱと共通の事例があるため、関連する学習資料を持参する。５．演習の実施日は不定期である。スケジュールを必ず確認し準備をして臨む。",
        "preparatoryStudy": "１．事前に演習内容を理解し、演習ノート等の事前学習課題に取り組んで演習に参加する。２．成人看護学Ⅰ・成人看護学Ⅱと関連付けて準備学習をする。",
        "gradingGuidelines": "１．筆記試験60％２．課題40％で総合的に評価する。＊定期試験において60点以上を満たしていない場合は再試験の対象となる。",
        "textbook": "任和子、井川順子（編）：根拠と事故防止からみた基礎・臨床看護技術、第3版、医学書院、2021山本佳代子（監修）：成人看護学実習ワークブックメディカ出版、2023",
        "referenceMaterials": "成人看護学Ⅰ、成人看護学Ⅱで使用した教科書、参考図書",
        "courseSchedule": "第1回：ガイダンス（折坂）第2回：呼吸を整える看護ケア（折坂）第3回：循環機能の評価および心臓リハビリテーションにおける看護ケア（折坂）第4回：栄養・代謝機能の自己管理が必要な患者の看護ケア（折坂）第5回：周手術期にある患者に必要な看護ケア①（術前：講義）（折坂）第6回：周手術期にある患者に必要な看護ケア②（術前：演習）（折坂）第7回：周手術期にある患者に必要な看護ケア③（術後：講義）（折坂）第8回：周手術期にある患者に必要な看護ケア④（術後：術後観察）（折坂）第9回：周手術期にある患者に必要な看護ケア⑤（術後：ドレーン管理）（折坂）第10回：周手術期にある患者に必要な看護ケア⑥（術後：ストーマ）（西尾）第11回：周手術期にある患者に必要な看護ケア⑦（術後：早期離床）（折坂）第12回：周手術期にある患者に必要な看護ケア⑧（術後：退院指導）（折坂）第13回：周手術期にある患者に必要な看護ケア⑨（術後：ケアの評価）（折坂）第14回：脳・神経系の観察および機能評価における看護ケア（岩月）第15回：輸液療法が必要な患者の看護ケア（折坂）",
        "courseDataUpdatedAt": "2024\/03\/05"
    },
    "updateAt": "2024\/09\/12"
}