{
    "lectureCode": "W1303",
    "courseName": "小児看護学II（健康障害のある子どもと家族のアセスメントと看護の実際）",
    "lecturer": [
        "白石裕子(医療保健学部看護学科)",
        "岸由香里(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火4"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３１７０２看護実習室２",
        "３１７１４多目的実習室",
        "３１７１６看護実習室３"
    ],
    "courceDetails": {
        "courseOverview": "事例を通して健康障がいを抱える子どもと家族への看護を実践するために必要な、看護過程の展開について学ぶ。また、小児看護特有の支援技術の実際につても学修する。さらに、疾患・健康障害を持った子どもとその家族を支える保健・医療・福祉・教育等様々な領域の社会資源との活用の意義や方法についても学ぶ。この科目は実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。",
        "outcomesMeasuredBy": "1．子どもの健康問題に応じた看護の実際について述べることができる。2．子どもの健康問題を解決するための社会資源とその活用方法を述べることができる。3．病気や障がいのある子どもの最善の利益を保証する看護・医療の在り方について考察することができる。4．発達段階を踏まえた小児看護特有の生活支援技術の実際について修得する。5．医療を受ける子どもと家族（特に母親）に必要な具体的な援助や看護過程の展開方法について事例を通してイメージできる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "授業計画に基づき、教科書および授業で配布する資料、パワーポイントに沿って講義を行う。講義以外に、バズセッション、ワークショップなど参加型授業も取り入れる。また、成長発達を続ける子どもの理解を促すため、視聴覚教材を活用する。さらに病棟実習を想定した技術演習、看護過程の展開も行う。",
        "notices": "1．小児看護学Ⅰの単位を取得していることが履修条件である。2．ヘルスアセスメントや小児看護学概論、小児看護学Ⅰ、既習関連科目（人体構造学、人体機能学、栄養代謝学など）を踏まえて講義を行う。復習は必須であり、学生間の討議など積極的な講義への参加が不可欠である。",
        "preparatoryStudy": "1．シラバスを参考にして教科書を一読し、一人ひとりが目的意識を持って授業に臨むことを期待する。2．基礎知識として1年次に履修した「人体構造学」、「人体機能学」、および2年次前期に履修した「疾病治療論Ⅳ」、「臨床看護学概論Ⅰ」、2年次後期に履修した「小児看護学Ⅰ」などの知識が不可欠である。予習・復習等の準備を確実にして臨むこと。3．技術演習前の事前課題にはきちんと取り組んで臨む。4．各領域の実習開始前には、技術の習得が確実なものになるように自己学習を繰り返す。",
        "gradingGuidelines": "実習前課題（10％）、技術演習前後課題（10％）、看護過程演習課題（10％）定期試験（70％）の成績を総合的に評価する。",
        "textbook": "1.奈良間美穂他著：系統看護学講座専門分野小児看護学[1]小児看護学概論小児臨床看護総論（医学書院）2.奈良間美穂他著：系統看護学講座専門分野小児看護学[2]小児臨床看護各論（医学書院）3.ナーシング・グラフィカ小児看護学２小児看護技術第5版(メディカ出版）",
        "referenceMaterials": "授業の中で適宜紹介する。",
        "courseSchedule": "第1回：ガイダンス医療を受ける子どもと家族の看護小児がんの子どもと家族の看護（白石）第2回：手術を受ける子どもと家族の看護（岸）第3回：救命処置が必要な子どもと家族の看護（白石）第4回：緩和ケア・終末期の子どもと家族の看護（白石）第5回：小児看護技術演習①（小児教員全員）第6回：小児看護技術演習②（小児教員全員）第7回：小児における看護過程の展開①（小児教員全員）第8回：小児における看護過程の展開②（小児教員全員）第9回：小児における看護過程の展開③（小児教員全員）第10回：小児における看護過程の展開④（小児教員全員）第11回：小児における看護過程の展開⑤（小児教員全員）第12回：ハイリスク新生児と家族の看護（特別講師）第13回：障がいを持つ子どもと家族の看護（特別講師）第14回：在宅小児医療と小児看護の役割（特別講師）第15回：まとめ小児看護学実習に向けて（小児教員全員）",
        "courseDataUpdatedAt": "2024\/03\/11"
    },
    "updateAt": "2024\/05\/29"
}