{
    "lectureCode": "W1306",
    "courseName": "高齢者看護学II（高齢者のアセスメントと看護の実際）",
    "lecturer": [
        "安井大輔(医療保健学部看護学科)",
        "佐藤智子(医療保健学部看護学科)",
        "篠田巴留香(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "３１７１４多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "健康障害や生活障害を持つ高齢者への看護実践のために、観察アセスメントからケア実践評価に至る高齢者看護の看護過程を展開する方法を学修する。老年期におこりやすい健康障害や生活障害、フレイル事例に関連付けたアセスメント、看護援助計画・立案の知識や技術を習得し、看護過程の展開方法を学修する。提示された事例を読み込み、多くの情報から看護に必要な事実を選び出し、部分的断片的な情報の意味を、病態関連および生活機能を意識して捉え、対象である目の前のひとりの人を理解し、それぞれの人が持てる力を発揮し、健康的に生きていくための視点をもって看護の方向性を考える力を養う。",
        "outcomesMeasuredBy": "1．健康障害や生活障害を持つ高齢者の全体像をアセスメントできる2．アセスメントから個々の高齢者に合った問題と持てる力を抽出できる3．個々の問題に適した看護目標の設定、持てる力に着目した看護計画の立案ができる4．高齢者看護に有効かつその人の回復力を維持向上させるケア方法を説明できる5．看護実践の評価方法について説明できる6．加齢による生活機能障害に対する高齢者への援助技術を習得できる7．老年期の健康障害と症状経過の特徴に応じた看護過程展開能力を習得できる●演習を通して高齢者看護学概論と高齢者看護学Ⅰで学んだ知識の統合を図る。配布資料や視聴覚教材を基にした講義と事例の看護過程を個人ワークとグループワークにより進める演習を併用し授業を進める",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1.教科書や配布資料を参考に、視聴覚教材も用いた講義を行う。2.対面授業、演習、グループワーク、課題発表により授業を進める。3.毎回の授業において、出欠表を兼ねたリアクションペーパーに、講義に対する感想・疑問・質問を記載し、講義終了後提出とする。4.毎回の授業で事前・事後課題を提示するので、提出期限および方法を守ること。5.教科書は必携してください。",
        "notices": "１．各自が予習・事前課題の学修をしているという前提で授業が進みます。予習をして臨みましょう。２．予習を行い、必ずmoodle上の課題に取り組み講義を受講してください。３．授業は個人およびグループワーク・演習を含む講義形式であり、積極的・自主的な学習態度が求められます。グループメンバーで取り組む事前課題もあるため、計画的に取り組んでください。４．課題については提出期限・提出方法を守ってください（後日提出は減点となります）。５．教科書は必携です。前回までの配布資料も綴じて持参してください。６．授業の配布資料はあくまでも参考資料です。授業で聞いた内容が資料に記載されていない場合は、自身でメモを取るように心がけましょう。",
        "preparatoryStudy": "１．moodle上の課題および講義中に提示された課題は必ずこなしましょう。２．テキストには高齢者特有の用語やデータが記載されています。授業では説明できない部分もあるので前提として予習を行い、授業当日に不明点を質問し解決してください。３．高齢者の病態を捉えるにあたっては、複数疾患を抱えていることに加え加齢による影響も考慮するため、基礎看護学および成人看護学で学んだ内容も復習しましょう。",
        "gradingGuidelines": "●リアクションペーパー提出・事前事後課題提出(15％)●課題提出状況と内容（10％）●学期末テスト（75％）",
        "textbook": "1.堀内ふき(編集)：ナーシンググラフィカ老年看護学①：高齢者の健康と障害第7版,メディカ出版2.堀内ふき(編集)：ナーシンググラフィカ老年看護学②：高齢者看護の実践第7版,メディカ出版",
        "referenceMaterials": "1.真田弘美,正木治恵：老年看護学技術最後までその人らしく生きることを支援する改訂第3版,南江堂,20202.正木治恵：老年看護学：第3版,財団法人放送大学教育振興会,20063.岩田充永：JJNSPECIAL急変予防＆対応ガイドマップ高齢者救急,医学書院,2016",
        "courseSchedule": "第1回高齢者看護学(看護過程)（事例紹介、DVD、病態理解/大腿骨骨折患者）第2回ヘンダーソン看護論と高齢者看護学、事例提示第3回事例提示→情報分類・アセスメント第4回情報分類→全体像を描く（病態関連図）第5回アセスメント→問題抽出・看護の方向性第6回運動器疾患を有する高齢者(事例)の考え方→目標・看護計画コミュニケーショングループワーク第7回演習①思いを捉えたケア提供(ユマニチュード/移動)第8回病態関連図を描く①→看護計画「検温」グループワーク第9回病態関連図を描く②→看護計画「移乗移送」グループワーク第10回問題リスト作成→看護計画「退院支援」「パンフレット作成」グループワーク第11回看護目標・看護計画立案方法→演習②移乗移送ユマニチュード第12回演習②高齢者のフィジカルアセスメント・バイタルサイン測定・コミュニケーション第13回グループワーク①(発表資料作成)第14回看護目標・計画・実施・評価の発表→グループワーク②（発表）第15回高齢者看護学実習に向けてのまとめ・実習オリエンテーション",
        "courseDataUpdatedAt": "2025/03/05"
    },
    "updateAt": "2025/03/21"
}