{
    "lectureCode": "W1307",
    "courseName": "精神看護学",
    "lecturer": [
        "妹尾弘子(医療保健学部看護学科)",
        "田辺大介(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金",
        "金2"
    ],
    "targetDepartment": "医療保健学部看護学科看護師コース",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "３１０１４教室",
        "３１０１６教室"
    ],
    "courceDetails": {
        "courseOverview": "精神症状や障害が生活に及ぼす影響を理解し、精神障害を持つ人への看護の目的と方法を学修する。具体的には事例を用いて精神障害を持つ人への看護過程の展開を学ぶ。さらに精神障害を持ちながら地域で暮らす人たちを支える社会資源について学ぶ。この科目は、実務経験を有する専門職が、その経験に基づいた講義を行う実践的科目である。また精神領域における論理的な思考力および問題解決能力等を向上させることを目指す。",
        "outcomesMeasuredBy": "１．精神障害を持つ人の症状や障害の特徴を説明できる２．精神障害を持つ人の症状や障害が生活に与える影響を説明できる３．精神障害を持つ人の状況に応じた看護の実際について説明できる",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "教科書、配布資料、視聴覚教材等を使用し、講義・演習を行う。主に視聴覚教材等を使用し、グループワークや発表会を行うなどアクティブラーニング形式で授業を実施する。適宜、レポート提出や小テストを行い学修状況を確認する。",
        "notices": "主体的・積極的に取り組むことを求める。",
        "preparatoryStudy": "教科書や参考書を用いて、講義や演習に関連する内容を予習しておくこと。これまでの講義や演習等の復習も行う。",
        "gradingGuidelines": "小テストと提出課題で40％、定期試験で60％評価する。",
        "textbook": "出口禎子他（2022）、ナーシンググラフィカ精神看護学２精神障害と看護の実践、メディカ出版",
        "referenceMaterials": "授業の中で紹介する",
        "courseSchedule": "第1回：精神障害者の看護の基本（妹尾）第2回：精神障害者の看護の基本（妹尾）第3回：統合失調症を持つ人への看護①（妹尾）第4回：統合失調症を持つ人への看護②（妹尾）第5回：統合失調症を持つ人への看護③（妹尾）第6回：統合失調症を持つ人への看護④（妹尾）第7回：気分障害を持つ人への看護①（妹尾）第8回：気分障害を持つ人への看護②（妹尾）第9回：気分障害を持つ人への看護③（妹尾）第10回：統合失調症および気分障害を持つ人への看護（妹尾）第11回：神経症性障害を持つ人の看護（妹尾）第12回：児童精神看護（田辺）第13回：精神科における治療と薬物療法に伴う看護（田辺）第14回：精神科におけるリスクマネジメント（田辺）第15回：精神障害とリハビリテーション①（妹尾）第16回：精神障害とリハビリテーション②（妹尾）第17回：看護過程演習①（全員）第18回：看護過程演習②（全員）第19回：看護過程演習③（全員）第20回：看護過程演習④（全員）第21回：看護過程演習⑤（全員）第22回：看護過程演習⑥（全員）第23回：看護過程演習⑦（全員）第24回：看護過程演習⑧（全員）第25回：当事者から学ぶ（外部講師）第26回：精神障害を持ちながら地域で生活する人と支援（外部講師）第27回：身体合併症をもつ人への看護（外部講師）第28回：リエゾン精神看護（外部講師）第29回：精神看護学実習オリエンテーション①（妹尾）第30回：精神看護学実習オリエンテーション②（妹尾）",
        "courseDataUpdatedAt": "2024\/03\/11"
    },
    "updateAt": "2024\/05\/29"
}