{
    "lectureCode": "W1315",
    "courseName": "高齢者看護学実習",
    "lecturer": [
        "安井大輔(医療保健学部看護学科)",
        "佐藤智子(医療保健学部看護学科)",
        "篠田巴留香(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本科目は1年次からの既習知識および2～3年次の「高齢者看護学概論」「高齢者看護学Ⅰ」「高齢者看護学Ⅱ」で学んだ知識と技術を用いて、高齢者看護を実際に実践する科目である。加齢に伴う変化や健康障害にある高齢者の特徴を理解し、よりよい生活支援に向けて必要な知識、技術、態度を修得する。さらに高齢者が療養する医療施設や高齢者福祉施設において、生活者としての高齢者および家族を対象に含め、看護実践力を高めるとともに看護の役割と機能、多職種連携とチーム医療を深く理解する。この科目は、医療現場において高齢者看護の実務経験の豊富な指導者の下で看護過程の展開を学ぶ、実践的科目である。",
        "outcomesMeasuredBy": "1.多様な価値観や人生観をふまえ、対象に尊重したかかわりができる。1)対象の生活史、価値観、心情を理解し、全体像としてとらえることができる。2)対象の意思決定に基づいた援助の重要性を理解できる。3)1)2)を統合して、援助的コミュニケーションが実施できる。2.回復過程にある対象に、根拠に基づいた看護を提供できる。1)入院に伴う対象の生活上の変化をふまえた情報を収集できる。2)対象の疾病の経過と健康障害の程度を説明できる。3)対象の疾病に対する検査および治療内容を説明できる。4)対象の生活機能をアセスメントすることができる。5)対象の生活機能の視点から、看護上の問題の抽出をすることができる。6)抽出した看護上の問題に基づき、看護計画を立案することができる。7)立案した看護計画に基づき、援助を実施できる。8)実施した援助を評価・修正することができる。3.対象の生活機能を支えるための専門職者の連携・協働を含めた看護の役割を説明できる。1)対象を取り巻く専門職種とその役割を説明できる。2)専門職種の中における看護の役割を説明できる。3)対象を中心とした援助を評価・修正することができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "実習は3週間構成です。1．第1週目（1日～5日）高齢者福祉施設（見学、コミュニケーション実施）2．第2週目～第3週目（6日～15日）医療機関実習(急性期一般病棟・地域包括ケア病棟・回復期リハビリテーション病棟・療養病棟など）1人～2人の高齢者を受け持ち、思いを捉え、持てる力を活かしたケアを考え、実践し評価する。3．学内実習：高齢者施設実習のまとめ（発表）、検温とコミュニケーションの演習、病態関連図の作成、記録の整理を行う。",
        "notices": "1．実習態度1）事前学習や技術の復習などを行い実習に臨む。2）高齢者の自尊心を傷つけない言葉と態度で臨む。2.実習生としての心構え・責務1）対象は高齢者であるため、感染対策を適切に行い対象者の安全を守る。2）高齢者の特性を考慮し、安全面に配慮して実習に臨む。3）事故防止、感染防止、守秘義務遵守、マナー、健康管理に関しては、実習要項を参照する。3．実習施設に応じた服装・身だしなみを整える。",
        "preparatoryStudy": "1.実習初日までに、指定された事前学習を行う。(詳細は高齢者看護学Ⅱ第15回の講義でオリエンテーションを行う際に説明します）2.高齢者看護学での講義資料、課題をファイリングし、実習に役立てる。",
        "gradingGuidelines": "高齢者看護学実習における目的・目標に照らし合わせ、実習への参加状況、実習記録、看護過程の展開、最終課題レポートを評価表に基づき総合的に判断し、評価する。",
        "textbook": "1.堀内ふき（編集）：ナーシング・グラフィカ老年看護学①高齢者の健康と障害,第7版,メディカ出版.20232.堀内ふき（編集）：ナーシング・グラフィカ老年看護学②高齢者看護の実践,第6版,メディカ出版.20233.亀井智子（編集）：根拠と事故防止からみた老年看護技術,第3版,医学書院.20224.秋葉公子,他：看護過程を使ったヘンダーソン看護論の実践,第5版,ヌーヴェルヒロカワ.2023",
        "referenceMaterials": "江﨑フサ子,他：ヘンダーソンの基本的看護に関する看護問題リスト,第5版,ヌーヴェルヒロカワ.2023",
        "courseSchedule": "第1日目～第4日目：高齢者福祉施設実習第5日目：学内実習（高齢者福祉施設実習グループ発表・演習）第6日目～第9日目：病院実習第10日目：学内実習（全体像・問題リスト・看護計画）第11日目～第14日目：病院実習第15日目：学内実習（実習のまとめ）全教員が全回担当",
        "courseDataUpdatedAt": "2025/01/17"
    },
    "updateAt": "2025/03/21"
}