{
    "lectureCode": "W1311",
    "courseName": "母性看護学実習",
    "lecturer": [
        "野澤美江子(医療保健学部看護学科)",
        "望月良美(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本科目は、1年次からの既習知識および２～3年次の「母性看護学概論」「母性看護学Ⅰ」「母性看護学Ⅱ」で学んだ知識と技術を用いて、母性看護を実際に実践する科目である。女性のライフサイクルにおいて性と生殖機能の最も顕著な妊娠・分娩期および産褥期にある女性と新生児、その家族を含めた対象への看護を展開する。この科目は、医療現場において実務経験の豊富な指導者の下で母性看護に関する実習を行う実践的科目である。",
        "outcomesMeasuredBy": "1.妊娠・分娩・産褥期にある女性および新生児とその家族の身体的、心理社会的特徴とその経過を理解できる。2.産褥・新生児期にある対象に、セルフケア能力に合わせ健康の保持増進の視点で看護過程を展開できる。3.妊娠・分娩・産褥期において、親役割獲得を促す母性看護の役割について述べることができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1.初日に、学内において教員からオリエンテーションを受け、面談を通して準備状況の確認を行う。2.技術演習では、母性看護技術演習課題をもとに、褥婦と新生児の観察の技術演習を行う。3.受持ち実習では、受持ち母子の情報収集をもとに看護計画を立案し、計画を実施・評価を行う。4.毎日のカンファレンスを行う他、中間カンファレンス、受持ち実習最終日に最終カンファレンス、実習まとめのカンファレンスを行う。5.実習中の学習は、定められた様式の実習記録にまとめる。",
        "notices": "1.母性看護学実習要項を熟読し、目的意識を持って臨む。2.これまでの演習・実習を通しての自己の課題を明確にして臨む。3.実習中は実習指導者・担当教員への報告・連絡・相談を密に取るように心がける。4.事故防止、感染防止、守秘義務、マナー、健康管理については、実習要項の「実習上の留意点」および「臨地実習のてびき」を参照する。",
        "preparatoryStudy": "1.「人体構造学」「人体機能学」「人体構造機能学演習」「疾病治療論Ⅲ」「母性看護学概論」「母性看護学1」「母性看護学Ⅱ」を復習しておく。2.実習開始までに、あらかじめ提示された事前課題に取り組み、実習中に活用できるように準備しておき、実習初日に提出する。",
        "gradingGuidelines": "母性看護学実習の目的・目標に沿って評価表を用いて評価し、実習への取り組み・態度、実習記録等を含めて総合的に判断する。",
        "textbook": "2023年度母性看護学実習要項各実習施設の母性看護学実習オリエンテーション資料森恵美他編：系統看護学講座母性看護学各論（医学書院）",
        "referenceMaterials": "下記に加えて、実習に関連した科目の教科書の他、実習ガイダンス時に紹介する。医療情報科学研究所編：病気がみえる（第4版）Vol.8産科（MEDICMEDIA）",
        "courseSchedule": "第1回：（月）オリエンテーション、個別面談、技術演習第2回：（火）受持ち実習第3回：（水）受持ち実習第4回：（木）受持ち実習第5回：（金）受持ち実習第6回：（月）中間カンファレンス、中間評価・面談、記録整理第7回：（火）受持ち実習第8回：（水）受持ち実習第9回：（木）受持ち実習、最終カンファレンス第10回：（金）実習まとめ、評価面接全教員が全回担当",
        "courseDataUpdatedAt": "2024\/03\/05"
    },
    "updateAt": "2024\/09\/12"
}