{
    "lectureCode": "W1312",
    "courseName": "小児看護学実習",
    "lecturer": [
        "白石裕子(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "健康段階の異なる子どもが生活する2つの施設（保育園、小児病棟）で実習を行う。成長･発達の過程にある子どもの特徴を理解し、病気や障がいがあること、治療を受けることや病院に入院することが、子ども自身や家族にどのような変化をもたらすのかを学ぶ。さらに子どもと家族が、いきいきと生活できるための看護職としての援助の方法を学ぶ。この科目は、医療現場において実務経験を有する専門職が、その経験に基づいた実習を行う実践的科目である。",
        "outcomesMeasuredBy": "1.子どもの日常生活を通して成長発達の特徴を説明できる。2.子どもとのコミュニケーションを通して、セルフケア能力について考察できる。3.施設や対象に応じた安全行動や感染予防行動をとることができる。4.子どもの発達段階に応じた日常生活援助場面を通して、自立を妨げない援助の在り方を考察し、指導を受けながら一部実施できる。5.入院治療が必要な子どもとその家族の看護上の問題に着目し、根拠に基づいた援助計画を立案・実施・評価できる。6.障がいをもつ子どもの生活と療育の実際、ならびに小児専門病院の機能と看護の専門性を知り、小児看護の知見を深め考察することができる。7.子どもと家族の援助の場面を通して、チームワークの必要性を理解し、自己のあり方を考察できる。8.子どもとその家族の最善の利益のために看護が果たす役割について考察し、一連の学修を通じて肯定的な子ども観を育成することができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "小児看護学実習は、保育園実習、病院実習、障がい児看護に関する学修を行う。具体的な実習方法については、実習要項に示す。",
        "notices": "1.実習全体を通し、健康管理をしっかり行い欠席、遅刻・早退等しないように臨む。2．学内での実習オリエンテーション内容を理解し、実習内容を理解した上で主体的に実習に臨む。3.保育園実習および病棟実習のローテーションは学生個々によって違うので、各自確認する。4.実習中は臨床指導者・担当教員への報告・連絡・相談を密にとるように心がける。5.事故防止、感染防止、守秘義務、マナーについては、実習要項の「実習上の留意点」についてを参照する。",
        "preparatoryStudy": "1.小児看護学実習要項を熟読し目的意識を持って臨む。2.関連科目である人体構造学、人体機能学、疾病治療論Ⅳ、小児看護学概論、小児看護学Ⅰ・小児看護学Ⅱなどの復習をして臨む。3.実習開始前迄に小児看護学の一連の授業で学修した援助技術を復習し、自信を持って臨めるよう準備をしてほしい。",
        "gradingGuidelines": "以下の点を総合して評価する。1.保育園実習の実践および記録2.病棟実習の看護実践および記録3.障がい児看護に関するレポート4.保育園・病棟実習・学内演習の参加5.最終レポート6.実習全体を通しての取り組み状況と取り組み態度",
        "textbook": "特にない。",
        "referenceMaterials": "実習に関連した科目の教科書の他、実習オリエンテーション時に紹介する。",
        "courseSchedule": "第1回:（月）オリエンテーション（全員）保育園現地オリが行われる園もある第2回:（火）保育園実習；健康な子どもの発達の理解（全員）第3回:（水）保育園実習；健康な子どもの発達の理解（全員）第4回:（木）保育園実習；健康管理、感染予防、健康教育（全員）第5回:（金）保育園実習のまとめ、障がい児看護に関する学修（全員）第6回:（月）小児病棟実習；1名の子どもを受け持ち、看護過程を展開（全員）第7回:（火）小児病棟実習；1名の子どもを受け持ち、看護過程を展開（全員）第8回:（水）小児病棟実習；1名の子どもを受け持ち、看護過程を展開（全員）第9回:（木）小児病棟実習；1名の子どもを受け持ち、看護過程を展開（全員）第10回:（金）実習まとめ評価面接（全員）",
        "courseDataUpdatedAt": "2024\/01\/26"
    },
    "updateAt": "2024\/05\/29"
}