{
    "lectureCode": "W1314",
    "courseName": "成人看護学実習II（慢性期・終末期）",
    "lecturer": [
        "岩月すみ江(医療保健学部看護学科)",
        "西尾奈緒美(医療保健学部看護学科)",
        "折坂真理(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "慢性期、終末期にあって病と共に生活する人とその家族を対象に、疾病や治療がおよぼす様々な影響や生活者の視点で捉えた身体的、心理的、社会的側面の統合的な理解をもとに、看護過程を展開する。また、根拠に基づいた看護を実践するための基礎的な知識と技術を習得する。援助にあたっては、対象の生活、価値、習慣を尊重し援助的人間関係の形成をめざすとともに、セルフケアを促進する様々な看護の方法や長期にわたる療養を支える援助を学修する。臨床の場における、多職種連携と看護の役割や継続看護について理解を深める。この科目は、医療現場において実務経験の豊富な指導者と担当教員の下でなされる実践的科目である。",
        "outcomesMeasuredBy": "1.対象者の病態、治療ならびに必要な看護を説明できる。2.疾患や治療が対象者（患者・家族）の生活にどのように影響を及ぼしているのか、また、その成り行きを説明できる。3.対象者のライフサイクル、発達課題を踏まえて多側面で対象を捉え、全人的に理解することができる。4.看護過程の展開を通して、対象者の健康状況に応じ根拠に基づいた安全で安楽な看護を実践できる。5.自らの看護実践を客観的に評価し、看護の継続性について考えることができる。6.実習を通じ、チーム医療や多職種連携の実際を学び看護職の役割について考えることができる。7.対象者と援助的人間関係を構築し、看護学生としてふさわしい態度・姿勢で学び医療者としての倫理観を培う。8.実習での学びの言語化を通して自己課題を明らかにし、段階的に自己成長できる力を身につける。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "臨地実習において、慢性期あるいは終末期にある対象者を受け持ち、看護過程を展開する。詳細は実習前オリエンテーションで説明する。",
        "notices": "1.先行要件を満たしていること。2.学内で実施する実習オリエンテーションには必ず出席し、実習の目的・目標を十分に理解して臨むこと。3.自己課題を明確にしたうえで、事前に学習準備（知識・技術）を整えて実習に臨むこと。4.履修上の注意ならびに詳細については、実習要項および臨地実習のてびきを熟読すること。",
        "preparatoryStudy": "1.これまでの学習ポートフォリオを作成する。2.本科目の実習目標とポートフォリオに照らし、自らの学習課題、実習目標を設定する。3.実習病院および、実習病棟の概要と特徴について学生自身で調べ、実習に臨む。4.既習の科目を復習して臨む。特に人体の構造と機能に関する科目、疾病の成り立ちに関する科目ならびに成人看護学に関連する科目を復習っする。5.実習前までに既習の援助技術を復習し、根拠をもって安全で安楽な援助が提供できるよう練習する。",
        "gradingGuidelines": "成人看護学実習Ⅱの目的・目標に沿って、ルーブリック評価をもちいて評価する。また、形成的評価面談、全プロセスでの実習への取り組み状況、成果物を総合的に判断し評価する。",
        "textbook": "指定しない",
        "referenceMaterials": "成人看護学概論、成人看護学Ⅰ、成人看護学Ⅱで使用した教科書・資料・参考図書等",
        "courseSchedule": "第1回：オリエンテーション、受け持ち患者選定第2回：看護過程の展開第3回：看護過程の展開第4回：形成評価、中間カンファレンス第5回：看護過程の展開第6回：看護過程の展開第7回：看護過程の展開第8回：看護過程の展開第9回：看護過程の展開第10回：実習の振り返り、成果物のまとめ・提出全教員が全回担当",
        "courseDataUpdatedAt": "2024/03/05"
    },
    "updateAt": "2024/05/29"
}