{
    "lectureCode": "W1313",
    "courseName": "成人看護学実習I（周手術期・急性期）",
    "lecturer": [
        "西尾奈緒美(医療保健学部看護学科)",
        "岩月すみ江(医療保健学部看護学科)",
        "折坂真理(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "急性疾患または、周手術期の成人期にある対象を受け持ち、疾病や治療がおよぼす様々な健康問題の解決に向けて必要な看護支援を実践できる知識と技術を習得する。また、対象を全人的に捉え、統合的な理解をもとに看護過程を展開する。急性期医療の理解については、病院の機能と役割を理解するとともに手術室、集中治療室、救急外来・病棟などの見学実習を通して看護の実際について学習する。この科目は、医療現場において実務経験の豊富な指導者と担当教員のもとでなされる実践的科目である。",
        "outcomesMeasuredBy": "1.対象の病態、治療およびそれらが対象者のライフサイクルに及ぼす影響について説明できる。2.健康問題を有する対象を全人的に捉え、看護過程を展開し、対象の健康問題を明らかにし、看護計画を立案できる。3.立案した看護計画を患者に対し安全、安楽、自立かつ根拠に基づいた看護を実践し、客観的に評価できる。4.手術室・集中治療室の構造や環境をについて理解し、重篤な状態にある対象に対する看護師の主な役割について説明できる。5.チーム医療における看護職の役割と責任について説明できる。6.医療チームの一員としてふさわしい行動をとり、主体的に学ぶことができる。7.対象の反応を捉え、援助的関係を構築できる。8.臨地実習を通して学習した内容を具体的かつ論理的に記述できる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "臨地実習において急性期または周手術期の患者を受け持ち、看護過程を展開する。また、看護支援については、実践を通して学ぶ。手術室、集中治療室、救急外来・病棟で急性期の治療を受ける看護の実際については、見学を通して学ぶ。具体的な内容については、実習前オリエンテーションで説明する。",
        "notices": "1.先行要件を満たしていること。2.実習オリエンテーションに必ず出席し、実習の目的・目標を十分に理解して臨む。3.実習期間中は、実習記録の記載をもとに日々の学びを整理したうえで実習に臨む。4.健康状態および生活習慣を整えて実習に臨む。",
        "preparatoryStudy": "1.学習ポートフォリオを作成し、自身の学習課題および実習目標を明確にする。2.実習施設、実習病棟の概要と特徴について事前学習をして実習に臨む。3.急性期・周手術期看護学の講義の復習、看護技術演習の練習をして実習に臨む。4.実習前は事前課題で自己学習する。",
        "gradingGuidelines": "看護実践、実習記録、カンファレンスの参加態度、実習への取り組み状況から総合的に評価する。",
        "textbook": "指定なし",
        "referenceMaterials": "成人看護学概論、成人看護学Ⅰ、成人看護学Ⅱで使用した教科書・講義資料・参考図書など",
        "courseSchedule": "第1回：学内オリエンテーション、受け持ち患者の選定第2回：看護過程の展開第3回：看護過程の展開第4回：中間カンファレンス、評価第5回：看護過程の展開第6回：看護過程の展開第7回：看護過程の展開第8回：看護過程の展開第9回：看護過程の展開、最終カンファレンス第10回：実習の振り返り、まとめ第11回：学内オリエンテーション第12回：見学実習（急性期医療を受ける患者の看護）第13回：見学実習（急性期医療を受ける患者の看護）第14回：実習のまとめ第15回：評価全教員が全回担当",
        "courseDataUpdatedAt": "2024/03/05"
    },
    "updateAt": "2024/05/29"
}