{
    "lectureCode": "W1323",
    "courseName": "母性・小児看護技術演習[2021年以前]",
    "lecturer": [
        "白石裕子(医療保健学部看護学科)",
        "野澤美江子(医療保健学部看護学科)",
        "望月良美(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部看護学科看護師コース",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "この科目は、実務経験を有する専門職がその経験に基づいた講義を行う実践的科目である。＜母性看護技術演習＞マタニティサイクル期における女性とその家族に対する看護援助の方法を学ぶ。具体的には、事例を通して各対象のニーズに応じたウェルネス志向の看護過程の展開方法を学ぶ。加えて、褥婦・新生児の観察と看護援助の方法について技術演習を通して学ぶ。＜小児看護技術演習＞入院している子どもの療養生活を支援していくために必要な看護援助や技術について学ぶ。小児看護における既習の知識を基に病気や障がいなど、何らかの健康問題を抱えた子どもとその家族の援助を行っていく上で必要な看護の展開について理解を深める。",
        "outcomesMeasuredBy": "＜母性看護技術演習＞1．産褥期の女性と新生児、その家族に対する看護過程の展開方法について事例を通してイメージできる。2．褥婦、新生児の観察と援助の方法が理解できる。＜小児看護技術演習＞1．発達段階を踏まえた小児看護特有の生活支援技術の実際について学ぶ。2．医療を受ける子どもと家族（特に母親）に必要な具体的な援助や看護過程の展開方法について事例を通してイメージできる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "褥婦・新生児および小児患者とその家族に対して必要な技術演習と事例を通した看護過程の展開を行う。演習は、母性看護技術演習と小児看護技術演習を組み合わせて進めていく。各技術演習は、「母性看護学Ⅰ」・「母性看護学Ⅱ」および「小児看護学Ⅰ」・「小児看護学Ⅱ」で学んだ内容をもとに展開する。また、事例はそれぞれの領域の看護学実習に直結するものを扱う。",
        "notices": "1．本科目は3年次の領域別実習の先行要件である。2．各領域の実習に直結する内容であるため、技術の修得に対して時間外も活用し積極的に取り組んでほしい。3．技術演習の際には、ユニフォームを着用し、頭髪、爪など身なりを整えて臨むこと。不適切な場合は、技術演習を行えないこともある。",
        "preparatoryStudy": "1．技術演習前の事前課題にきちんと取り組んで臨む。2．各領域の実習開始前には、技術の習得が確実なものになるように自己学習を繰り返す。",
        "gradingGuidelines": "＜母性看護技術演習＞課題による評価100%＜小児看護技術演習＞課題による評価100％＊本科目の単位修得は、母性看護技術演習および小児看護技術演習いずれも60点以上を満たしていることを条件とする。",
        "textbook": "＜母性看護技術演習＞荒木奈緒他編：ナーシング・グラフィカ母性看護学３母性看護技術第６版（メディカ出版）＜小児看護技術演習＞．基礎看護技術Ｉ-コミュニケーション／看護の展開／ヘルスアセスメント（メディカ出版）2．ナーシング・グラフィカ小児看護学２小児看護技術第５版(メディカ出版）",
        "referenceMaterials": "＜母性看護技術演習＞．根拠が分かる母性看護過程（南江堂）2．カラー写真で学ぶ周産期の看護技術（第3版）（医歯薬出版）3．新訂版写真でわかる母性看護学技術アドバンス（インターメディカ）4．ウェルネス看護診断にもとづく母性看護過程（第3版）（医歯薬出版）他講義時に紹介する。＜小児看護技術演習＞パーフェクト臨床実習ガイド小児看護（第2版）他、講義時に紹介する。",
        "courseSchedule": "第1回：ガイダンス：母性・小児技術演習を行うにあたって（白石、野澤）第2回：母性：ウェルネス志向の看護過程①（野澤、望月）第3回：母性：ウェルネス志向の看護過程②（全員）第4回：母性：ウェルネス志向の看護過程③（全員）第5回：母性：ウェルネス志向の看護過程④（全員）第6回：母性：ウェルネス志向の看護過程⑤（全員）第7回：母性：ウェルネス志向の看護過程⑥（全員）第8回：母性：褥婦・新生児のアセスメントと援助（全員）第9回：小児：小児における看護過程の展開①（白石）第10回：小児：小児における看護過程の展開②（全員）第11回：小児：小児における看護過程の展開③（全員）第12回：小児：小児における看護過程の展開④（全員）第13回：小児：小児における看護過程の展開⑤（全員）第14回：小児：フィジカルアセスメント：バイタルサイン測定、身体測定（全員）第15回：小児：ヘルスアセスメント：発達評価と問診（全員）",
        "courseDataUpdatedAt": "2024\/03\/11"
    },
    "updateAt": "2024\/09\/12"
}