{
    "lectureCode": "W1320",
    "courseName": "認知症ケア",
    "lecturer": [
        "長坂奎英(医療保健学部看護学科)",
        "佐藤智子(医療保健学部看護学科)",
        "篠田巴留香(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木5"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "３１７１４多目的実習室"
    ],
    "courceDetails": {
        "courseOverview": "認知症の類型および特性を理解し、認知症の人それぞれの健康と自尊心を維持できる生活を支援するための理論やケア方法について学ぶ。また、認知症の人を支える家族や介護者が抱える諸問題や課題を知り、社会資源の活用を理解することを通してQOLの維持向上に向けた看護介入を学修する。本科目の受講を通し、「認知症の正しい理解」、「コミュニケーション技法の習得」、「論理的な思考力」、「アセスメントに基づいたケア実践方法の工夫」等の知識技術を養う。この科目は、医療介護の現場において、認知症者への看護に従事した実務経験を有する専門職、看護管理者などが大学で学ぶべき認知症看護の基礎的な知識・技術について解説する実践的科目である。",
        "outcomesMeasuredBy": "1.認知症の病態と関連要因を説明できる。2.認知症を伴いながら生活する高齢者を理解し、エビデンスに基づいたかかわりやケアを説明できる。3.認知症者の思いを理解し、専門的なアプローチについて説明できる。4.認知症者の家族の支援について考え、説明できる。5.認知症を伴いながら生きることの困難を学び、認知症看護が担う役割を考察することができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1.学修の手引きに基づき、教科書や配布資料を参考に視聴覚教材を基にした講義を行う。2.体験型授業、グループワーク、課題発表により授業を進める。3.リアクションペーパーに授業の感想・質問などを記載し。授業終了後に提出する。4.授業当日までに事前課題を完了させ、授業後は復習を行い、反復学習により授業の理解を深める。",
        "notices": "1.予習復習を前提に授業を進めるので、必ず予習を行い授業に参加しましょう2.授業内容は、グループワークやクラス討議、体験型授業を含むため、積極的かつ自主的な学習態度で臨みましょう。3.課題の提出期限や提出方法は必ず守りましょう。4.指定されたテキストや資料は必ず持参しましょう。5.授業で配布された資料には必ず目を通し、個々にファイルで綴じてください。6.授業中は積極的にメモをしましょう。",
        "preparatoryStudy": "・認知症高齢者とその家族への理解を深めるため、教科書を読み、自身が考えたことをまとめておきましょう。",
        "gradingGuidelines": "試験70％課題20％リアクションペーパー0％",
        "textbook": "1.酒井郁子,鈴木みずえ著：パーソン・センタード・ケアでひらく認知症看護の扉.南江堂,2017",
        "referenceMaterials": "1.鈴木みずえ著:アセスメントフローで学ぶパーソン・センタード・ケアに基づく急性期病院の高齢者看護.日本看護協会出版会,20212.Dr.BereMiesen・矢吹知之著：わたしが私であるために－認知症の人がもつ不安，恐れ，そして安心－,ワールドプランニング.20223.藤川幸之助：満月の夜、母を施設に置いて,中央法規.2019",
        "courseSchedule": "第1回(4/11)：認知症ケア総論(長坂)第2回(4/18)：パーソン・センタード・ケア(長坂）第3回(4/25)：認知症者への基本的な対応、ICFの考え方、社会資源(篠田)第4回(5/9)：せん妄ケアと認知症ケア(佐藤)第5回(5/16)：急性期病院における認知症ケアと課題(外部講師)第6回(5/23)：在宅で暮らす認知症高齢者へのケア実践(外部講師)第7回(5/30)：認知症ケアを組織で実践する(外部講師)第8回(6/6)：試験",
        "courseDataUpdatedAt": "2024/03/05"
    },
    "updateAt": "2024/05/29"
}