{
    "lectureCode": "W1401",
    "courseName": "在宅看護学実習",
    "lecturer": [
        "大木正隆(医療保健学部看護学科)",
        "一色喜保(医療保健学部看護学科)",
        "浅海くるみ(医療保健学部看護学科)",
        "久長正美(医療保健学部看護学科)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "地域における様々な健康レベルにある人々の生活を支援するための看護活動を通して、地域包括ケアシステムのあり方を考える。訪問看護ステーション・地域包括支援センターを軸とした療養者・家族へのケアや健康な地域づくりにおける看護活動を通して、地域包括ケアシステム構築に向けて必要とされる法制度を含めた知識・態度さらに保健医療福祉サービスについて理解を深める。また本科目は看護の統合分野に位置づけられていることからも、在宅看護学分野のみならず既修の全看護分野の知識・技術を統合して学ぶことで地域包括ケアシステムのあり方を考える。この科目は、医療現場において実務経験を有する専門職が、その経験に基づいた実習を行う実践的科目である。",
        "outcomesMeasuredBy": "訪問看護ステーション１.看護提供の実際について、同行訪問を通して理解を深める。２.在宅療養者・家族の療養上の課題をアセスメントし、必要な看護援助の抽出ができる。３.訪問看護ステーションの機能と訪問看護師の役割について理解する。４.在宅療養者・家族の療養生活を支える多職種・多施設連携、社会資源の活用の実際から、地域包括ケアシステムのあり方を考える。地域包括支援センター１.施設利用者との関わりを通して対象の生活の概要を理解し、ヘルスニーズを考えることができる。２.支援事例を通して、地域包括ケアシステムに含まれる関係機関・関係職種との連携の意義・目的・方法について説明することができる。３.管轄エリアの地域特性に応じて展開されている地域包括ケアを理解した上で、医療機関と看護職の役割について考え、連携における課題について考えることができる。４.看護学生として、適切な態度で実習に臨み、自己の課題を明確にすることができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "訪問看護ステーションおよび地域包括支援センターにて実習を行う。具体的な実習の展開方法については、実習オリエンテーションの際に明示する。実習終了後に評価面接を実施し、実習での学びのプレゼンテーションとディスカッションを行う。",
        "notices": "履修に際しては先行要件を満たしていること。実習受け入れ施設では、日常業務の上に、学生のための実習指導をしてくれていることを忘れないこと。学生が遅刻したり、集合場所を間違えたりすれば業務を妨害することになる。健康管理をしっかり行い、欠席・遅刻をしないこと。地域住民と接する機会が多い他、利用者宅にあがり、療養者(児)とその家族に接することになる。服装、挨拶、自己紹介、立ち振る舞いなどの基本的マナー、そして看護学生としてのモラルを守ること。",
        "preparatoryStudy": "実習に向けて事前課題を課すため、指定された期限内に必ず提出すること。",
        "gradingGuidelines": "在宅看護学実習の目的・目標に基づき、実習への取り組み・態度、実習記録等を含む評価表に沿って評価する。また学習内容の定着のため、現場・学内でのカンファレンスを通して全体に対するフィードバックを行う。",
        "textbook": "これまでの講義で使用したもの。",
        "referenceMaterials": "第1回：初日学内オリエンテーション（全教員）第2回：1週目訪問看護ステーション実習、或は地域包括支援センター実習（全教員）第3回：2週目地域包括支援センター実習、或は訪問看護ステーション実習（全教員）第4回：最終日学内でのまとめ・カンファレンス（全教員）",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024/03/05"
    },
    "updateAt": "2024/05/29"
}