{
    "lectureCode": "W1404",
    "courseName": "災害看護学",
    "lecturer": [
        "野澤美江子(医療保健学部看護学科)",
        "石田千絵(兼任講師)",
        "三浦英恵(兼任講師)"
    ],
    "regularOrIntensive": "専門科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "医療保健学部",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "災害は、突然人々の生命、健康や生活を脅かし、地域社会に甚大な被害をもたらす。このような状況において、看護職は、他職種とかかわりながら、対象のおかれた環境を基盤に、災害が及ぼす健康や生活への影響を考えながら、個人や集団に働きかける活動を展開する役割を持つ。したがって、災害看護とは、災害が人々の健康と生活に及ぼす被害を最小限にする看護活動を指す。具体的には、平常時の災害への備え、災害急性期の活動に加え、中・長期に向けた災害復旧時や復興対策時の活動など、災害サイクルに応じた活動が含まれる。そこで、本授業では、災害から人々の生命、健康、生活を守るために必要な看護支援と看護の役割について学ぶ。さらに、災害前から中・長期にわたる看護支援活動に必要な知識、技術を理解し、災害看護支援者として看護実践を行える基礎的能力を養うための授業を展開する。",
        "outcomesMeasuredBy": "1.災害とは、災害医療とは、災害看護とは、を述べることができる。2.災害に関連する社会の対応や仕組み、災害の備えを説明できる。3.災害が人々の生命や生活に及ぼす影響と健康障害について説明できる。4.災害時における看護の実際を学び、看護が果たす役割について説明できる。5.災害時に必要な看護技術を学ぶ。",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1.授業計画に基づき、教科書及び授業で配布する資料を使って講義する。また、講義形式以外に事例に基づくグループワークを行ったり、災害時の支援をイメージするため、DVDなどの視聴覚教材を用いる。2.小テストを行い、知識の修得状況および自らの課題を確認する。3.毎回授業開始時に「リアクションシート」（出席表を兼ねる）を受け取り、感想等を記載して授業終了後に提出する。4.授業内で「上級救命講習」のカリキュラムも展開し、修了時には上級救命技能認定証を得ることができる。5.東京国際空港航空機事故消火救難総合訓練に参加し、災害への備えの実際を体験する。",
        "notices": "1.本科目は「看護の統合」科目であることから、基礎知識として3年次までに履修した科目の知識が不可欠であり、授業を通してそれらの知識を統合することを求める。したがって、授業にはその心づもりで臨んでほしい。2.演習では、メンバー間で協力しながらよりよい学修成果があがるよう計画的に進める。3.上級救命講習の出席および認定証の取得は必須である。",
        "preparatoryStudy": "災害看護に必要な知識や技術は幅広い。そこで、各回の内容に関連した既修得科目の資料、教科書を読んで授業に参加してほしい。",
        "gradingGuidelines": "講義への参加度、試験の成績を総合的に評価する。最終授業で全体に対するフィードバックを行う。なお、上級救命技能認定証の修得は評価の上で必須とする。",
        "textbook": "酒井明子他編（2023）.災害看護（改訂第4版），南江堂",
        "referenceMaterials": "講義時に紹介する。",
        "courseSchedule": "第1回：ガイダンス（野澤）、災害看護の基礎知識（三浦）第2回：災害発生時の社会の対応やしくみ、災害各期における看護活動（概論）（三浦）第3回：病院における災害看護（三浦）第4回：災害時に必要な技術：トリアージ（三浦）第5回：対象別にみた災害看護の実践：妊産婦、子ども、高齢者、疾患や障害を持つ人（三浦）第6回：地域における災害看護活動①：初期支援、避難所における看護（石田）第7回：地域における災害看護活動②：避難所支援に関わるゲーム（グループワーク）（石田）第8回：地域における災害看護活動③：中長期支援（石田）第9回：被災者および援助者のストレスとこころのケア（石田）第10回：上級救命講習（1）（野澤）第11回：上級救命講習（2）（野澤）第12回：上級救命講習（3）（野澤）第13回：上級救命講習（4）（野澤）第14回：災害への備え（野澤）第15回：東京国際空港航空機事故消火救難総合訓練（野澤）",
        "courseDataUpdatedAt": "2024\/03\/05"
    },
    "updateAt": "2024\/05\/29"
}