{
    "lectureCode": "K0003101",
    "courseName": "社会連携演習I[機]",
    "lecturer": [
        "大久保友雅(工学部機械工学科)",
        "余錦華(工学部機械工学科)",
        "三田俊裕(工学部機械工学科)",
        "関口暁宣(工学部機械工学科)",
        "古井光明(工学部機械工学科)",
        "高橋秀智(工学部機械工学科)",
        "福島E文彦(工学部機械工学科)",
        "上野祐樹(工学部機械工学科)",
        "禹珍碩(工学部機械工学科)",
        "野田龍介(工学部機械工学科)",
        "加藤太朗(工学部機械工学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "講義実験棟１０１",
        "講義実験棟１０２",
        "講義実験棟１０３",
        "講義実験棟１０４",
        "講義実験棟２０１",
        "講義実験棟２０２"
    ],
    "courceDetails": {
        "courseOverview": "工学部学生全員が学外でコーオプ実習を行うための準備として、一般企業において必要なコミュニケーションに不可欠な社会的教養を深めるとともに、課題解決に用いられる最も一般的なアプローチであるグループワークの手法をProjectBasedLearningにより習得する。社会人基礎力としての社会常識を高めるための第一歩は新聞（特に政治、経済などの時事問題）を読むことであり、まず身近な新聞記事等を題材にして、自ら興味のある社会的課題について調べ、その中で機械工学により解決が可能と思われる課題を設定し、その課題に取り組むためのグループワークを行う。また、課題の気付き・解決能力の向上が本演習の目的であるので、課題の設定おいては、必ずしも正解があるわけではない、また現時点では結論のわからない課題を設定することで構わないし、むしろその方が好ましい。",
        "outcomesMeasuredBy": "今後のコーオプ実習への取組に必要十分となる基礎的能力を身につける【コミュニケーション能力、論理的な思考力、分析・評価能力、問題解決力】。具体的には以下を到達目標とする。①課題の発見・設定力：（改善への）気付きを身に付ける。②課題の分析力：課題に対してその分析の切り口（視点）を見つける。③課題に対する考察力：分析の結果から一定の方向性、結論を見出す。④上記一連の結果のとりまとめ力：考察した内容を説明のために分かりやすく整理する。⑤プレゼンテーション力：取りまとめた内容を伝える力を養う。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "グループワークを中心に演習を進める。最初に各自で関心事項について提出し合い、それらについて意見交換し、グループで取り組めそうな課題に収束させて課題設定を行う。次に、グループ内で役割分担を決めて必要な調査・分析を進める。その過程で必要なそれぞれの調査・分析の進捗状況の確認や必要な情報・データの共有は各自が適宜PCを活用して行う。従って、演習授業においては各自が必要な情報やデータを全て共有しているとの前提でグループ討議を効率的に行い、設定した課題に対して理路整然とした一定の方向性または結論を出す。最終的には、その討議結果を適切に整理してまとめ、分かりやすいプレゼンテーション資料として仕上げることとする。また、各自のグループワークへの貢献度を評価するため、原則毎回、①１コマ毎の課題または目標、②グループワークの具体的内容、③その結果または成果、および④各自の貢献内容等をリポートとして課されることとなる。本授業の中心はグループワークであるため、グループメンバー間で必要な情報・データなどの共有が容易に行える必要があり、ノートPCは必携となる。",
        "notices": "本授業の目的は課題の気付き・解決能力の向上であるので、課題の設定おいては、必ずしも正解があるわけではない、また現時点では結論のわからない課題を設定することで構わないし、むしろその方が好ましい。その意味で、安易な方向（結論が見え透いている）に走って本当は興味のない課題設定は行なわないこと。また、同時に行われる「社会連携概論」は、本授業の課題設定および調査・分析作業の一助になると考えられ可能な限り有効に活用することが望まれる。",
        "preparatoryStudy": "各回の授業において、グループごとに検討する課題に関して、次回授業までに調査あるいは検討すべき事項が示されるので、各自がこれら事項について必要な調査等を行った上で結果をグループごとのフォルダにアップすること。(60分程度)また、同時に行われる「社会連携概論」は、本授業の課題設定および調査・分析作業の一助になると考えられ可能な限り有効に活用することが望まれる。",
        "gradingGuidelines": "成績は、グループ活動報告書40％，グループ活動に対する貢献度40％およびプレゼンテーション20％より評価する。",
        "textbook": "特になし。",
        "referenceMaterials": "日本経済新聞をはじめとする各種新聞や各種経済雑誌（東洋経済、エコノミスト、ダイヤモンドなど）",
        "courseSchedule": "第1回：ガイダンス（本演習の趣旨と今後の進め方のポイントの説明）［担当：戸井］第2回：グループワークの手法①（ブレインストーミングとKJ法の理解）［担当：外部講師］第3回：グループワークの手法①（ブレインストーミングとKJ法の実践）［担当：外部講師］第4回：課題発見•設定（社会的問題の抽出）［全教員］第5回：調査（社会的問題の根拠の調査）［全教員］第6回：課題分析（社会的問題の分析）［全教員］第7回：プレゼンテーション手法講義・演習［全教員］第8回：教員プレビュー（社会的な問題を論理的に発表する）［担当：全教員］第9回：議論組み立て①（技術的な課題に取り組む）［全教員］第10回：議論組み立て②（解決策・アイデアを導出する）［全教員］第11回：議論改善・修正（発表のストーリーをまとめる）［全教員］第12回：プレゼンテーション資料作成①［全教員］第13回：プレゼンテーション資料作成②、プレゼン練習［全教員］第14回：発表［全教員］",
        "courseDataUpdatedAt": "2024/02/06"
    },
    "updateAt": "2024/09/03"
}