{
    "lectureCode": "K502201",
    "courseName": "熱力学",
    "lecturer": [
        "野田龍介(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０３"
    ],
    "courceDetails": {
        "courseOverview": "熱力学は機械工学に限らず，エネルギー問題を考える上で不可欠な学問である．エネルギーの損失の多くは熱エネルギーという形態で生じることが多いため，その取扱いはこれからのサステイナブルな社会の形成のためには必須の学問と言える．熱力学では，温度，圧力，密度，エントロピーと言った状態量から，比熱，エンタルピー，自由エネルギーなど様々な物理量が現れ，その内のいくつかは実生活で直感的に実感することは困難なものも含まれる．そのため，本講義では，身近な物理現象を取り上げながら，工学に必要な熱力学基礎知識を身に着けると同時に，数学的に扱う手法を身に着ける．具体的には，温度と熱の違いから始まり，熱機関から仕事を得るということはどのようなことかを物質の三態や状態方程式を学びながら理解する．また，それらを応用するために必要なエネルギーサイクルやエントロピー等の概念を学修し，それらを数学的に取り扱う手法も学修する．更に，熱がどのように伝わるのか，ということについても伝熱工学の基礎を学ぶ．",
        "outcomesMeasuredBy": "本講義科目においては，本学の「６つのラーニングアウトカムズ」のうち・実学に基づく専門能力・論理的な思考力・分析・評価能力の育成・向上を目指す．具体的には以下を到達目標とする．・機械工学における熱力学の基本概念を説明できるようになる．・熱力学で取り扱う物理量についての定義，単位を説明できるようになる．・熱力学で学ぶ三つの法則を理解し，説明・計算できるようになる．・熱力学的な状態量，状態方程式の意味とその関係を理解し，説明・計算できるようになる．・エネルギーサイクル及びエネルギー効率の考え方を理解し，仕事とエネルギーについて計算できるようになる．・熱の伝わり方について説明・計算できるようになる．",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "基本的には教員が自作した資料と指定した教科書に沿って，プロジェクター，黒板等を用いて日本語で講義形式で授業を行う．但し，計算問題を題材とした個人演習や周囲の学生と教えあうグループワークでの学習も行う場合がある．また，出席確認やmoodleを用いた理解度チェックではPCを使うため，ノートPC必携とする．",
        "notices": "高校数学・物理の内容を良く復習しておくこと．講義中は指定が無い限りはノートPCは閉じておくこと．また，自筆のノートを取る事を必須とする．",
        "preparatoryStudy": "moodle上で講義後に次回の講義資料の公開を行う．講義資料と該当する部分の教科書の内容を基に，次回の内容について予習を行うこと．資料内に例題が示されている場合，その問題を解くことも含む（６０分程度）．講義内で示されたmoodle上での課題は，内容の復習と共に次の週の授業開始までには提出を完了しておくこと（６０分程度）．",
        "gradingGuidelines": "試験の配分を6割とし，残りの4割については理解度チェック，授業態度などを考慮して評価する．なお，総点で6割を下回った場合は単位は認めない．",
        "textbook": "小山敏行，「熱力学きほんの「き」」，森北出版",
        "referenceMaterials": "日本機械学会，「伝熱工学(JSMEテキストシリーズ)」，日本機械学会",
        "courseSchedule": "第1回：導入：何故熱力学を学ぶのか第2回：系の概念・種類，取り扱う物理量と熱平衡第3回：エネルギーの形態と仕事，熱力学第１法則第4回：準静的仮定と移動境界仕事第5回：エンタルピーと理想気体の状態式第6回：理想気体の状態変化Ⅰ第7回：理想気体の状態変化Ⅱと到達演習まとめ第8回：熱力学第２法則と熱機関のモデル化第9回：様々なエネルギーサイクル第10回：エントロピーと状態変化第11回：ガスサイクル第12回：伝導伝熱第13回：対流熱伝達第14回：総復習・演習",
        "courseDataUpdatedAt": "2024/02/05"
    },
    "updateAt": "2024/12/09"
}