{
    "lectureCode": "K502001",
    "courseName": "機械力学",
    "lecturer": [
        "福島E文彦(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金3"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ５０２"
    ],
    "courceDetails": {
        "courseOverview": "多くの機械は物理的に運動することによって機能するものである。したがって、そのような機械を創造・設計するためには、その動的挙動に関する知識や解析手法が必要不可欠である。本科目では、機械やその構成要素の動力学的挙動、特に振動現象を解析するための基礎を習得し、論理的に解釈する知識・能力が身につく。",
        "outcomesMeasuredBy": "本授業科目では以下を到達目標とする。1)力学現象を微分方程式の問題として定式化できる。2)1自由度振動系の運動方程式を導出・説明できる。3)1自由度振動系の自由振動と強制振動の解を導出・説明できる。4)1自由度振動系の固有振動数と減衰比を導出・説明できる。5)振動の固有振動数と固有振動モードを説明できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "【授業形態：講義】プロジェクターを使った講義形式の説明が中心となるが、MATLABを使った実習も随時行う【MATLABのインストール、ノートＰＣ必携】。",
        "notices": "1年前期科目の「数学基礎[ES]、または数学概論[ES1][ES2]」、「線形代数（M）」「微分積分Ⅰ」、「基礎力学」のいずれかの単位取得に至っていない場合、あるいは下記に挙げる内容を理解していない場合、積極的に本学の学修支援センターを利用して準備学習に努めること。【基礎力学】の復習をすること。本科目（機械力学）は1年前期の「基礎力学」と密接に関係している。次の内容は確実に復習しておくこと：質点の運動学、質点の動力学、剛体の運動学、剛体の動力学（運動方程式、慣性モーメント）、質点系および剛体の運動方程式の記述と解放、仕事とエネルギー、力積と運動量。他の準備学習：本学1年前期で学修した下記関連科目を復習しておくこと。諸理論を十分理解し説明できることはもとより、具体的な演算や例題の解法ができるようにしてくること。・数学基礎[ES]、または数学概論[ES1][ES2]：三角関数の性質、周期的な変化をする現象、複素数とベクトル。・微分積分Ⅰ：位置、速度、加速度と微分・積分の関係、微分演算の基礎（和、差、積、商の微分演算）、合成関数の微分。・線形代数（M）：連立1次方程式と行列、行列の行基本変形、固有方程式、固有値、固有ベクトル。1年後期に履修する「微分積分Ⅱ」科目の下記内容も参考にすること：・三角関数および対数・指数関数の微分・積分、偏微分、テーラー展開と級数展開。",
        "preparatoryStudy": "予習：各回の授業で、次回までに読んでくる教科書の範囲を指定する。（100分程度）復習：各回の授業内容を復習すること、また提出課題を期限内に提出すること。（100分程度）",
        "gradingGuidelines": "レポート・理解度チェック結果、期末試験結果で総合評価する。比率は50:50とする。",
        "textbook": "わかりやすい振動工学砂子田勝昭著・伊藤智博著・鄭萬溶著・平元和彦著共立出版発売日2012\/02\/25ISBN9784320081857体裁B5・232頁",
        "referenceMaterials": "1年前期の基礎力学の教科書も参考にすること。(Schaum'sOutlines）EngineeringMechanicsDynamics，McGraw-Hill",
        "courseSchedule": "第1回：総論、力学と運動の復習：物体の運動、力と運動、仕事と力学的エネルギー第2回：剛体の運動の復習：回転運動、慣性モーメント、剛体の運動第3回：1自由度振動系第１回：自由振動粘性減衰のある自由振動第4回：1自由度振動系第２回：自由振動摩擦力が作用する場合の減衰自由振動第5回：1自由度振動系第３回：強制振動調和外力による強制振動第6回：1自由度振動系第４回：その他の強制振動第7回：1自由度振動系第５回：まとめおよび理解度チェック第8回：2自由度振動系第１回：2自由度ばね質点系の自由振動第9回：2自由度振動系第２回：減衰のない各種2自由度振動系の自由振動第10回：2自由度振動系第３回：2自由度ばね質点系の強制振動第11回：多自由度系の運動方程式、ラグランジュの方程式、固有振動数と固有振動モード第12回：その他の振動系：連続体の振動、非線形振動、振動制御第13回：2自由度振動系のまとめおよび理解度チェック第14回：総復習・演習",
        "courseDataUpdatedAt": "2024\/02\/06"
    },
    "updateAt": "2024\/09\/13"
}