{
    "lectureCode": "K502601",
    "courseName": "システム工学",
    "lecturer": [
        "余錦華(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "システムとは，生産ラインやロボットから，コンピュータゲームや会社組織や行政機関に至るまで，きわめて広範囲に及ぶものを指し，ある目的を達成するために，形成されたいろいろの構成要素の集合体である。システム工学は，システムの計画・運用・解析をするための手法を検討するものである。アポロ計画の実現にシステム工学は大きく貢献していた。様々な技術を統合し目標を達成するために，システムの最適化は不可欠である。本講義では，シンプレックス法などのシステム最適化の基本手法と解法，およびシステム変動による影響を調べる感度解析などについて学ぶ。本授業を履修することにより，MATLABの最適化ツールの使い方をマスターし，いくつかの実際の最適化問題を解く練習を通して，システムの最適化手法を身につける。",
        "outcomesMeasuredBy": "本授業は、以下を到達目標とする。１）システム，システム工学に関する基本概念が理解できる２）実問題を最適化問題に変換するやり方がマスターできる３）線形計画法，特に，シンプレックス法を用いて最適問題を解くことができる４）シミュレーションの基本技法がマスターできる",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "教科書に沿って講義を進めるが，適宜に演習問題を交えて理解を深める。グループ学習とプレゼンなどの能動的学習手法も取り入れる。また，授業形態は板書とマルチメディア資料やPCによるプレゼンとなる。",
        "notices": "本授業は新しい概念が多く出てくるので，遅刻せずに授業に出席すること。また，授業の内容について，必ず教科書を読み，予習・復習を十分に行うこと。授業にMATLABを用いて演習を行うので，PCは必携である。",
        "preparatoryStudy": "本講義は関数や線形代数の基本知識が必要であるため，それらの知識について各自適宜に復習しておくこと。また，レポート作成を通して重要な基本概念や手法の復習を行い理解を深めること（予習復習時間目途：60分程度）。",
        "gradingGuidelines": "数回のレポート（40％）と段階テスト（50％）に加えて，授業態度（10％）も加味して評価を行う。段階テストは筆記用具，電卓とものさしだけ持込可である。",
        "textbook": "システム工学の数理手法，奈良宏一・佐藤泰司著，コロナ社，ISBN978-4-339-02334-3，3000円＋税",
        "referenceMaterials": "最新MATLABハンドブック第七版，小林一行，秀和システム，2020/12/，3520円また，システム工学に関する参考書は数多く出版されている。自らの能力に適した参考書を自ら探し出すこと。",
        "courseSchedule": "第1回：オリエンテーション第2回：システム工学に関する基本概念第3回：数学基礎１第4回：数学基礎２第5回：線形計画問題の定式化第6回：シンプレックス法第7回：第1回-第6回のまとめ第8回：相対性第9回：感度解析第10回：組合せ問題と分枝限定法第11回：ラグランジュ緩和法第12回：切除平面法第13回：近似解法第14回：第8回-第13回のまとめ",
        "courseDataUpdatedAt": "2024/03/27"
    },
    "updateAt": "2024/12/09"
}