{
    "lectureCode": "K502301",
    "courseName": "加工学",
    "lecturer": [
        "高橋秀智(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "金3"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義棟Ａ３０４"
    ],
    "courceDetails": {
        "courseOverview": "種々の機械や工業製品を構成する部品を加工する方法、そのために使用する工作機械や工具等について学ぶのが、本講義の目的である。金属を中心とする無機材料の切削・研削などの機械加工、鋳造・溶接などの加工、ならびに有機材料の加工などについて学ぶ。また一般的に使用される金属材料についても学ぶ。さらに代表的な塑性加工の方法を学ぶ。具体的には、塑性力学の工学的応用例を学習したあと、塑性変形と加工硬化の原理から塑性構成式とその使用方法までを学ぶ。さらに、基本的な塑性加工の方法として、最も基本的な4つの加工法：圧延、引抜き・押出し、プレス成形、鍛造について学ぶ。したがってこの授業では、機械技術者として必要となる製品を加工する技術に関する理論と知識が身につき、対象とする製品の形状と材料などから、適切な工作機械と加工法を選び、詳細を決定できるようになる。",
        "outcomesMeasuredBy": "本授業科目では，本学の「６つのラーニングアウトカム」のうち・実学に基づく専門能力・論理的な思考力・分析・評価能力の３つを目指し、より具体的には以下を到達目標とする。本科目の修得により、加工学の全般的な知識と実践力を身に付けることを目指す。具体的には、以下の項目ができるようになる。１）各加工法の原理と特徴を理解し，説明することができる．２）各加工法の適応可能な材料，形状，精度，コスト等の制約を理解し，説明することができる．３）与えられる部品仕様：形状，材料，精度，仕上げ面性状，生産数等から適切な加工法を選択し，具体的な加工工程を検討できる．",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "講義は市販のテキストを用い、適宜MicrosoftPowerpointにまとめた資料、ビデオ教材を適宜参照し、講義中の演習課題や、その他の演習課題により、理解度を確認しながら授業を進める。",
        "notices": "講義ノートを必ず作成し、授業の要点等をまとめながら受講すること。また、授業開始時に配布される演習課題は、当日の講義の理解度チェックに役立つので必ず解答し提出すること。提出した演習課題は、次週までに採点し返却されるので、見直しを行い、正しい解答をノートに記載すること。手書きのノートのみ期末試験の持ち込みを可能とするので、ノートには資料等を貼り付けないこと。",
        "preparatoryStudy": "１、2年次の数学、物理系科目と機械製図実習を復習しておくこと。講義資料は前日19時までに公開されるので，予習は毎回の授業範囲のテキストと講義資料を読み、専門用語とその意味をノートにまとめること。復習は、授業中のノートを確認・追記し、返却された演習課題を見直し、回答に必要な式とその変数、さらに正答をノートに書くこと。章末の問題も解いてみること。予習・復習合わせて120分程度行うこと。",
        "gradingGuidelines": "授業への取組み姿勢（40%）、演習課題等による理解度チェック（30%）、期末試験の成績（30%）により、総合的に評価する。なお、各％は目安である。",
        "textbook": "小林輝夫，機械工作入門，オーム社(2016)",
        "referenceMaterials": "",
        "courseSchedule": "第1回：機械工作法のあらまし第2回：鋳造(1)第3回：鋳造(2)第4回：溶接と溶断第5回：塑性加工(1)第6回：塑性加工(2)第7回：熱処理第8回：到達度チェックとこれまでのまとめ、ノートチェック第9回：切削加工(1)第10回：切削加工(2)第11回：切削加工(3)第12回：研削加工第13回：特殊加工，数値制御工作機械第14回：最新の加工法と本講義のまとめ",
        "courseDataUpdatedAt": "2025/01/07"
    },
    "updateAt": "2025/03/21"
}