{
    "lectureCode": "K503502",
    "courseName": "機械創造応用[一般]Ｔ",
    "lecturer": [
        "福島E文彦(工学部機械工学科)",
        "余錦華(工学部機械工学科)",
        "関口暁宣(工学部機械工学科)",
        "大久保友雅(工学部機械工学科)",
        "禹珍碩(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火4",
        "火5"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "専門科目の学修で身につけた技術や理論を実践的に活用し、「限られたエネルギー源だけを搭載して、指定された経路を時間内にできるだけ長距離周回する」機械システムを着想から完成まで一貫して設計開発して創造的なグループプロジェクトを体験する。機械の設計開発を基本テーマとし、自由な発想で移動機能（フォーミュラカー型車両も含む）や把持機能を有した独創的なロボット機構に各種センサと制御系（PCやマイコン）を統合した機械システムを構築する。機械システムの考案・設計・製作の流れを一貫して体験することによって、ものづくりの技術や手法と併せて、工学的プロジェクトの共同推進の方法を実践的に修得する。",
        "outcomesMeasuredBy": "本授業科目では以下を到達目標とする。1)自由な発想に基づいて、目的の機能・仕事を行う機械システムを実現できる。2)既成機構要素の選定、機構や部品の設計や加工、組み立てができる。3)強さ・剛性・寿命・精度を考慮して機械の設計や加工、組み立てができる。4)環境にやさしい材料やエネルギー消費を考慮した機械システムの設計ができる。5)プロジェクト管理、スケジュール管理ができる。6)少人数のグループで課題を解決することができる。7)グループの中で決められた分担作業を責任を持って遂行できる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "学生自ら主担当する作業（機構設計、加工、ソフトウェア等）を選び、他の担当者とも連携し、グループワークで全体の設計開発作業を行う。教員、TA、SAが指導と補助にあたるが、学生主体で設計や加工を進める。",
        "notices": "各種工具、装置や工作機械の安全マニュアルを熟読し、安全に利用すること。専門科目の学修で身につけた技術や理論を復習すること。はんだ付けを練習すること。NC旋盤、NCフライス盤、ボール盤、バンドソウの基本操作を復習すること。3DCADソフトウェアCreo、数値解析ソフトウェアMATLAB\/Simulink、Arduinoの開発環境を各自のノートPCで使えるように準備すること。3Dプリンタ、レーザー加工機、プリント基板加工機、CNCプロッタ（4軸加工機）の基本操作を習得することが望ましい。",
        "preparatoryStudy": "予習：次回授業で行う作業内容等を「オンラインミーティング」で確認して決定してくること。（60分程度）復習：各回の授業内容を復習すること、また提出課題を期限内に提出すること。（60分程度）",
        "gradingGuidelines": "毎回の提出物、各種競技の結果、中間発表会、最終発表会により総合的に評価する。比率は個人評価40、グループ評価60とする。",
        "textbook": "3年次前期までに使ってきた教科書を参考にすること。",
        "referenceMaterials": "【全教員が全回担当】第1回：ガイダンス，担当個所の決定，仕様の検討，概念図の作成第2回：詳細設計①：組立図，部品表（購入リスト），図面，計算書等の作成第3回：詳細設計②：加工部品図の完成、設計計画書の提出第4回：駆動系（モータ，ESC）と質量等確定，自由製作第5回：自由製作第6回：規定競技1（単独測定1\/2回），自由製作第7回：規定競技1（単独測定2\/2回），自由製作第8回：中間発表会，自由製作第9回：規定競技2，自由製作第10回：自由製作第11回：規定競技2のクラス対抗決勝戦、自由製作第12回：自由競技の最終確認、自由製作第13回：自由競技の開催、デモ走行第14回：最終発表会",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/05\/11"
    },
    "updateAt": "2024\/09\/03"
}