{
    "lectureCode": "K503902",
    "courseName": "機械工学基礎実験[B]",
    "lecturer": [
        "大久保友雅(工学部機械工学科)",
        "余錦華(工学部機械工学科)",
        "三田俊裕(工学部機械工学科)",
        "関口暁宣(工学部機械工学科)",
        "古井光明(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本実験科目では，機械工学における基礎的な知識と技術の習得を目的とする。専門科目の学習内容の理解を助ける実験を行うほか，ものづくりのために必要な加工技術についても実習する。実験テーマは，４力学およびロボット・制御における代表的な問題を扱い，あわせて機械工作実習を行う。具体的なテーマとしては，引張試験，熱力学実験，管摩擦の測定，時定数の測定，機械工作実習，熱処理，アナログ回路・ディジタル回路とセンサーの仕組み，メカトロニクス・システムの駆動技術などを少人数のグループ単位で体験する。本授業を履修することにより，実験の立案から実行までの一連の作業をマスターし，メカトロニクス関連の計測機器の使い方を理解し，機械・電気・電子に関する基本測定手法が身につく。",
        "outcomesMeasuredBy": "本授業科目では、本学の「6つのラーニングアウトカムズ」のうち・実学に基づく専門能力・論理的な分析・評価能力・コミュニケーション能力・論理的な思考力・問題解決力の五つの修得をめざし、より具体的には以下を到達目標とする。１）各回の実験における原理が説明できる２）使用する各種実験装置と計測器を正しく扱える３）機械工作の基本をマスターする４）アナログ回路の基本とその周波数特性の調べ方が理解できる５）ディジタル回路の原理を理解する６）メカトロニクス用各種センサーの原理とテスト手法を理解する７）工学レポートの作成法をマスターする",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "下記のテーマについて少人数によるグループで実験を行う。指定されたグループ毎の実験順序および実験日程に従うこと。",
        "notices": "毎回必ず出席し，レポートを提出すること。やむを得ず欠席する場合はそれを証する書類（診断書等）を期限内に提出し，追実験手続きを行うこと。",
        "preparatoryStudy": "各実験テーマについて前もって予習しておくことが望ましい。実験に関する内容などについて参考書やインターネットを利用して調べておくこと（30分程度)。また，レポート作成を通して基本概念の復習を行い理解を深めること（120分程度）。",
        "gradingGuidelines": "各実験テーマのレポート評価を総合して，成績を評価する。",
        "textbook": "第1回の授業にて実験テキストを配布する。",
        "referenceMaterials": "別途指定",
        "courseSchedule": "第1回：引張試験第2回：熱力学実験第3回：管摩擦の測定第4回：時定数の測定第5回：旋盤第6回：手仕上げ・ボール盤第7回：フライス盤第8回：熱処理第9回：基本センサ技術1第10回：基本センサ技術2第11回：基本センサ技術3第12回：基本センサ技術4第13回：実験のまとめ(1)第14回：実験のまとめ(2)",
        "courseDataUpdatedAt": "2024/02/03"
    },
    "updateAt": "2024/12/09"
}