{
    "lectureCode": "K503201",
    "courseName": "サステイナブル生産技術",
    "lecturer": [
        "高橋秀智(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "講義実験棟４０２"
    ],
    "courceDetails": {
        "courseOverview": "工業製品のサステイナブルな生産・製造を実現するために必要となる生産工学の概念や技術・知見について学ぶ。まず、工作機械と生産技術の歴史を概観し、生産システムの構成要素について理解する。次いで、現在の生産を支える個々の生産加工システム技術と、それらを活かす製品設計手法、そして経済性の評価方法などについても学ぶ。さらに、資源や環境負荷を重視した生産システムと、生産技術・生産システムの社会に与える影響についても学ぶ。最後に、現実の生産システムの例を取り上げた演習を通じて、サステイナブル生産技術を実践的に利用できるようになる。",
        "outcomesMeasuredBy": "本授業科目では，本学の「６つのラーニングアウトカム」のうち・実学に基づく専門能力・論理的な思考力・分析・評価能力の３つを目指し、より具体的には以下を到達目標とする。本科目の修得により、生産システム工学の全般的な知識と実践力を身につけることを目指す。具体的には、以下の項目ができるようになる。１）生産システムの構成要素の役割と基本理論を理解し、説明することができる。２）与えられた生産システムに対して、生産システム工学的な視点から考察を行うことができる。３）与えられた製品仕様から、必要な加工法案を検討し、生産システムの構成を検討することができる。４）要求される生産仕様から、生産システム工学的な視点から最適な生産システムの検討を行うことができる。５）さらにサステイナブル工学的な視点から、最適な生産システムの検討を行うことができる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "講義は市販のテキストを用い、適宜MicrosoftPowerpointにまとめた資料やビデオ教材を適宜参照し、講義中の演習課題や、その他の演習課題により、理解度を確認しながら授業を進める。",
        "notices": "講義ノートを必ず作成し、授業の要点等をまとめながら受講すること。また、授業開始時に配布される演習課題は、当日の講義の理解度チェックに役立つので必ず解答し提出すること。提出した演習課題は、次週に解答が示されるので見直しを行い正しい解答をノートに記載すること。手書きの綴じたノートのみ（貼り付け不可）期末試験の持ち込みを可能とするので、ノートには資料等を貼り付けないこと。",
        "preparatoryStudy": "2年次前期の加工学とサステイナブル工学関連科目を復習しておくこと。事前学習は、テキストの該当範囲を読み、専門用語の英文、意味をノートにまとめておくこと。復習は、授業中に記入したノートを補完し、返却された解答を確認して、必要な公式、変数の意味を加えて正答を記入する。さらに、章末の問題も行う。予習・復習合わせて120分程度行うこと。",
        "gradingGuidelines": "授業への取組み姿勢（40%）、演習課題等による理解度チェック（30%）、期末試験の成績（30%）により、総合的に評価する。なお、各％は目安である。",
        "textbook": "本位田光重，皆川健多郎:生産工学-ものづくりマネジメント工学–、コロナ社",
        "referenceMaterials": "第1回：生産システムと管理第2回：生産プロセス(1)第3回：生産プロセス(2)・設計プロセス(1)第4回：設計プロセス(2)第5回：設計プロセス(3)第6回：計画プロセス(1)第7回：計画プロセス(2)第8回：計画プロセス(3)第9回：到達度チェック＆これまでのまとめ第10回：管理プロセス第11回：改善活動のマネジメント第12回：改善の経済性評価、PC演習第13回：サステイナブル生産技術(1)第14回：サステイナブル生産技術(2)、本講義のまとめ",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024/05/21"
    },
    "updateAt": "2024/09/03"
}