{
    "lectureCode": "K503801",
    "courseName": "マイクロコントローラ実習[3QT]",
    "lecturer": [
        "禹珍碩(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火",
        "火2"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "マイクロコントローラは、メカトロニクスシステムやロボットをはじめ、さまざまな機械の知能となる組込み用のコンピュータである。近年、オープンソースハードウェアとして安価でも高機能なプロトタイピング用の開発システムが普及している。本授業では、このようなマイクロコントローラとその開発環境、メカトロニクスシステムへの応用について、実習を通じて実践的に学ぶ。具体的には、マイクロコントローラの基本的プログラミング方法を身につけた上で、マイクロコントローラとセンサ、アクチュエータ、機構を組み合わせた実システムの例として自立移動ロボットの制御システムの構築を行う。実験・実習を通して、実践的なマイクロコントローラのプログラミング方法と、論理的考察に基づいたアルゴリズム・プログラムの作成・修正方法を身につける。特に、解決策を覚えるのではなく、解決する方法を見つける力を身につける。",
        "outcomesMeasuredBy": "本授業科目では以下を到達目標とする。１．マイクロコントローラの動作を説明し、周辺機器との接続プログラムを作成できる。２．参考プログラムを理解し、再利用することができる。３．自立移動ロボットの動作仕様に基づいたプログラムを作成することができる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ノートPC（Windowsベース）は必携である。ノートPC以外の必要な機器は講義中に貸与し、マイクロコントローラボードを用いた演習・実習を行う。各自のノートPC（Windowsベースとする）に開発環境を構築し、実際にプログラミングを行って、動作を確認しながら学習する。必要な資料（英語版も含む）は講義のホームページに掲載する。各自のノートPCに接続されたマイクロコントローラボードにプログラムを転送し、動作を確認しながら学習する。また、後半では自立移動ロボットシステムの構築を行う。",
        "notices": "プログラミング基礎、電気電子回路Ⅰ、電気電子回路Ⅱ、工学基礎実験の内容を復習しておくこと。また、問題点に対して、『解決策を覚えるのではなく、解決する方法を身につける』ことを重視するので、他人との議論、Web情報、書籍情報などの利用が重要である。欠席の場合は速やかに教員へ連絡し、教員の指示を受けること。",
        "preparatoryStudy": "講義資料は事前に公開されるため、各自確認して予習を行うこと。前半のArduinoに関する実習は、Webサイト(TinkerCAD)を用いて予習することが望ましい。後半の機器を用いた演習は講義時間中しかできないため、予習では、講義サイトに掲載された資料などを基に、あらかじめフローチャートやプログラムのプロトタイプなどを設計しておくこと。（60分程度）復習では、指定された課題に対してレポートを作成すること（各回のレポートは定められた期日までに提出する）。自宅での予習と復習には、Webサイト(TinkerCAD)を利用すること。（100分程度）",
        "gradingGuidelines": "各実習課題の成果とそのレポート内容およびシステム構築発表（レポートでの説明を含む）の内容によって評価する（実習課題７０％、発表３０％の比率で評価する）。2回目以降の授業では、レポートの内容に関するフィードバックや、質問に対応することで理解を深められるようにする。",
        "textbook": "指定しない（講義のホームページに資料を掲載する）",
        "referenceMaterials": "高木孝頼「みんなのArduino入門」（リックテレコム）牧野浩二「たのしくできるArduino電子工作」（東京電機大学出版局）鈴木哲哉「Arduino互換機」（ソシム）などArduino関連参考書、およびArduino関連Webページ",
        "courseSchedule": "第1回：開発環境の構築（イントロダクションとプログラミングの基礎）第2回：Arduinoシステムのプログラミング1（Arduinoプログラム開発環境の構築）第3回：Arduinoシステムのプログラミング2（ディジタル入出力プログラムの作成）第4回：Arduinoシステムのプログラミング3（ディジタル入力プログラムの作成）第5回：Arduinoシステムのプログラミング4（アナログ入出力プログラムの作成）第6回：Arduinoシステムのプログラミング5（入出力プログラムのまとめ）第7回：自立移動ロボットの構築1（ライントレースロボットの製作と動作仕様の設定）第8回：自立移動ロボットの構築2（ライントレースロボットの製作と動作仕様の設定）第9回：自立移動ロボットの構築3（ライントレースロボットのプログラミング（要素構築））第10回：自立移動ロボットの構築4（ライントレースロボットのプログラミング（要素構築））第11回：自立移動ロボットの構築5（ライントレースロボットのプログラミング（システム構築））第12回：自立移動ロボットの構築6（ライントレースロボットのプログラミング（システム構築））第13回：自立移動ロボットの構築7（ライントレースロボットのプログラミング（システム構築））第14回：自立移動ロボットの構築8（ライントレースロボットの成果発表）",
        "courseDataUpdatedAt": "2024\/02\/05"
    },
    "updateAt": "2024\/09\/13"
}