{
    "lectureCode": "K504801",
    "courseName": "メカトロニクス基礎",
    "lecturer": [
        "上野祐樹(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "メカトロニクスとは，機械工学や電子工学，システム工学の相乗的な組み合せで製品設計や製造工程を行うことと定義されている．メカトロニクスは今日の工学的問題に対して，狭い工学の境界を越えて解決できるエンジニアに対する産業界の需要の高まりに応えている．メカトロシステムが有効に機能するためには，要素や機器同士の間でさまざまな情報を授受したり，信号波形の整形や成分の抽出，除去などの処理を施す必要がある．このために，情報を電圧や電流として取得，あるいはこれらに変換して，電子回路によって信号処理を実現する場合が多い．一方，モータなど電気エネルギーで作動する要素に望みの動作をさせるためには，電力を信号で制御する電子回路が必要になる．この授業では，まず，１年次後期の「電気電子回路」で学んだ内容を基礎に，電子回路の基本としてトランジスタなどの能動素子による増幅回路を取り上げる．次に，メカトロニクスの構成要素であるメカニクス，センサ，アクチュエータ等に関する基礎知識を身につけるとともに，ロボット等のシステムへの適用について理解，考察することでメカトロニクスに関する理解を深める．本授業では，実験を行う代わりに，MATLAB／Simulink，Simscapeを用いて，各電子素子やメカトロ要素の働きや性質の実践的な理解を目指す．本科目で得られる知識や技術は，メカトロニクス，制御，ロボットに関する講義や実験，卒業研究のための重要な基盤となる．",
        "outcomesMeasuredBy": "本授業科目では，本学の「６つのラーニングアウトカムズ」のうち・国際的な教養・実学に基づく専門能力・論理的な思考力・分析・評価能力・問題解決力の５つを目指し，より具体的には以下を到達目標とする．1）トランジスタなどの能動素子を用いた増幅回路の原理を理解し，簡単な設計ができるようになること2）電気電子回路の周波数特性について基礎を習得し，その概念を説明できるようになること3）1），2）の基本法則や定理を用いて数式による特性計算ができること4)メカトロニクスの構成要素の基礎知識を身に付け，それぞれの働きを説明できること4）シミュレータを使った解析・設計が実行でき，結果を説明できるようになること5）メカトロニクスに関する基本的な英語の技術用語や語法を理解し，説明できること",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "「電気電子回路」の内容を受け，前半はダイオードやトランジスタ，FETなどの能動素子を用いた増幅回路やフィルタ回路を対象とする．後半はメカトロニクスの構成要素の一つであるアクチュエータを取り上げ，その原理や制御法を取り上げる．毎回の講義，演習，予習課題，レポート課題の内容は，授業専用のウェブサイトにスライドとして掲載する．授業では，基本概念の講義，必要最小限の数式計算に加えて，原則として毎回，MATLAB/Simulink，Simscapeを活用して具体的な例題や演習問題を受講生自身が自分でシミュレーションし結果を観察・考察するアクティブラーニングによって，より直感的な理解とその定着を図る．回路シミュレータや専用ウェブサイトを活用するためWindowsを搭載したノートPC必携．必要なソフトウェアのインストールについては初回に説明する．さらに，電気電子回路や理工学における基本的な英語の語彙や語法を身につけるため，これも「電気電子回路」と同じ実用志向の英語の教科書を用いる．ただし，講義は日本語で行う．",
        "notices": "「電気電子回路」を履修済みであること．",
        "preparatoryStudy": "・予習：次回取り扱う内容やシミュレーション方法について説明している動画を視聴し，スライドにまとめる．授業時間は演習を通して理解を深める（60分程度）・復習：授業時間中にまとめられなかった演習をスライドにまとめる（60分程度）",
        "gradingGuidelines": "予習，演習報告（40%），中間レポート２回（40%），最終レポート（20%）の結果によって評価する．課題やレポートの解説，フォローアップは授業時間中に行う．",
        "textbook": "・Scherz,Monk:PracticalElectronicsforInventors,McGraw-Hill(2016)",
        "referenceMaterials": "・高木，編著：アナログ電子回路，オーム社（2011）・藤井：電子回路入門，実教出版（2004）・渋谷：メカトロニクスの基礎，森北出版（2016）",
        "courseSchedule": "第1回：受講準備，整流回路第2回：トランジスタの基本特性第3回：エミッタ接地型増幅回路第4回：MOSFETと基本回路第5回：MOSFETのスイッチング動作第6回：レポート１課題第7回：アクチュエータ，DCモータの原理とモデリング第8回：DCモータの駆動回路第9回：慣性モーメント第10回：レポート２課題第11回：伝達要素，減速機第12回：センサ，モータの制御１第12回：モータの制御２第14回：レポート３課題",
        "courseDataUpdatedAt": "2025/02/04"
    },
    "updateAt": "2025/03/21"
}