{
    "lectureCode": "K504701",
    "courseName": "電気電子回路",
    "lecturer": [
        "上野祐樹(工学部機械工学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "工学部機械工学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ５０２"
    ],
    "courceDetails": {
        "courseOverview": "電気は，機械システムにおいて，エネルギーおよび信号として重要な役割を果たす．したがって，このような電気の作用を活用する電気回路は機械工学の基本技術の一つである．本科目ではその基礎として，主に受動素子を使った電気回路と能動素子を使った電子回路について，その基本的な概念，理論，解析・設計手法を，実用的な英語教科書と回路シミュレータを活用して実践的に身につける．具体的には，次の項目について概念と知識を習得し，特性計算や回路シミュレータによるシミュレーションにより，抵抗やコンデンサ，コイルなどの受動素子からなる電気回路，およびダイオードやトランジスタ，MOSFETなどの能動素子からなる電子回路の原理を理解し，解析・設計ができるようになることを目標とする．本科目で得られる知識や技術は，メカトロニクス，制御，ロボットに関する講義や実験，卒業研究のための重要な基盤となる．",
        "outcomesMeasuredBy": "本授業科目では，本学の「６つのラーニングアウトカムズ」のうち・実学に基づく専門能力・論理的な思考力・分析・評価能力の３つを目指し，より具体的には以下を到達目標とする．1）受動素子と電源からなる電気回路について，概要にあげた基本概念や，Ohmの法則，Kirchhoffの電圧則・電流則，TheveninおよびNortonの定理などの基本法則を理解し，説明できること2）トランジスタなどの能動素子を用いた増幅回路の原理や周波数特性を理解し，説明できること3）上記基本法則・定理を用いた数式による特性計算ができること4）回路をシミュレータ上に組んで，過渡解析シミュレーション，パラメータや電源波形を変化させた場合のシミュレーションを実施できること5）電気回路に関する基本的な英語の技術用語や語法を理解し，説明できること",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "電流，電圧など電気の基本概念や，電源，抵抗，キャパシタ，インダクタなどの基本要素の原理と性質からはじめて，電気回路の基本法則から受動素子を用いた直流回路，交流回路，また，ダイオードやトランジスタ，FETなどの能動素子を用いた増幅回路の周波数特性までを対象とする．毎回の講義，演習，予習課題，レポート課題の内容は，授業専用のウェブサイトにスライドや動画として掲載している．授業では，基本概念の講義，必要最小限の数式計算に加えて，原則として毎回，回路シミュレータを活用して具体的な例題や演習問題を受講生自身が自分でシミュレーションし結果を観察・考察し，説明することにより直感的な理解とその定着を図る．回路シミュレータには，MATLAB\/Simulink，Simscapeを利用する．回路シミュレータや専用ウェブサイトを活用するため，Windowsを搭載したノートPC必携．必要なソフトウェアのインストールについては初回に説明する．電気電子回路や理工学における基本的な英語の語彙や語法を身につけるため，実用志向の英語の教科書を用いる．講義は日本語で行うが，キーパラグラフ，キーセンテンス，キーワードの把握の仕方を学び，次の回の内容の英文を速読・意訳する課題への解答を通じて予習する．授業では時間の許す範囲で解答・解説を行う．",
        "notices": "事前に高校物理や物理学における電気や電気回路に関する基本法則などを復習または自習しておくこと．",
        "preparatoryStudy": "・予習：次回取り扱う内容やシミュレーション方法について説明している動画を視聴し，スライドにまとめる（60分程度）・復習：授業時間中にまとめられなかった演習をスライドにまとめる（60分程度）",
        "gradingGuidelines": "予習課題と演習課題への解答（40%）と中間レポート２回（40%），最終レポート（20%）の結果によって評価する．課題やレポートの解説，フォローアップは授業中に行う．",
        "textbook": "・Scherz,Monk:PracticalElectronicsforInventors,McGraw-Hill(2016)",
        "referenceMaterials": "・高木，編著：アナログ電子回路，オーム社（2011）・藤井：なっとくする電子回路，講談社（1994）",
        "courseSchedule": "第1回：授業の概要と受講準備，電気抵抗とOhmの法則第2回：抵抗の並列・直列接続第3回：複合回路とKirchhoffの法則第4回：電圧源・電流源第5回：正弦波交流と抵抗第6回：コンデンサとその特性第7回：コイルとその特性第8回：正弦波交流とコンデンサ，コイル第9回：正弦波交流回路とインピーダンス第10回：半導体，ダイオードと整流回路第11回：トランジスタの基本特性第12回：エミッタ接地型増幅回路第13回：MOSFETと基本回路第14回：MOSFETのスイッチング動作",
        "courseDataUpdatedAt": "2024\/02\/06"
    },
    "updateAt": "2024\/09\/03"
}