{
    "lectureCode": "11050B06",
    "courseName": "フレッシャーズゼミI[6]BS",
    "lecturer": [
        "杉山友康(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "実学基礎科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "1",
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "フレッシャーズゼミⅠは，新入生の入学直後の学期の必修科目であり，大学生活へ慣れ，学業はもちろん，サークル活動などその他の大学での活動を含めて，計画や目標を立案など，学生生活を支援することを行う．また，将来，社会で活躍するために必要な社会人基礎力を伸ばすことを行う．具体的には，この授業では，履修計画を立案し，プレゼンテーション力やグループワークなどの学びの技法を修得し，学業などにおける目標を立て，より充実したキャンパスライフをスムースにスタートできるよう，アドバイザー（クラス担任）の教員が支援する．同時に，学生同士がグループワークや発表会などを通して，コミュニケーション能力を高める内容が含まれている．また，社会で活躍するために必要な能力を測定するための汎用的能力測定テストを受検する．本講義のクラス担任は，この講義の後も，アドバイザーとして１年次から３年次前期まで（３年次後期からは研究室の教員がアドバイザーとなる），定期的な面談・相談によって担当の学生の支援をすることになる．",
        "outcomesMeasuredBy": "少人数での共同作業やプレゼンテーションを通して，大学生，あるいは，卒業後の社会人として十分なコミュニケーション能力を身につけること，プレゼンテーション内容の調査を通して分析・評価能力を身につけることが目標である．また，班単位での活動により，他の人と協力して目的を遂行する問題解決力をつけることも目標である．",
        "learningOutcomes": "コミュニケーション能力分析・評価能力問題解決力",
        "teachingMethod": "この授業は，各専攻を小人数（10-15名程度）のクラスに分け，演習形式で行われる．具体的な進め方は，各クラスの教員の指示に従うこと．一部の授業はグループワーク形式で行う．また，一部の授業は全クラス合同授業方式で行う．指示があった場合はノートPCを持参すること．",
        "notices": "この授業は学生が中心となってそれを教員が支援する形で行う．各自が自ら進んで発言し，授業に参加することが必要である．自分なりの意見を発表していけるよう努力してほしい．",
        "preparatoryStudy": "プレゼンテーション内容の調査やプレゼンテーション資料，レポート作成のための予習や復習が必要である．詳細は各教員の指示に従うこと．",
        "gradingGuidelines": "プログラムへの参加（参加とは単なる出席ではなく，グループワークへの参加と授業内で自分の意見を発信することを含む）70%,発表内容および提出物30%．なお，各クラスで指定する重要な発表や重要な提出物を欠いた場合には単位の取得はできない．",
        "textbook": "教科書は指定しない．",
        "referenceMaterials": "各教員の指示に従うこと．",
        "courseSchedule": "下記の授業予定は事情によって変更する場合がある．第1回:担当教員紹介，自己紹介，学内IT環境へのアクセスの確認第2回:学部内交流第3回:履修登録の確認，各クラスでの活動第4回:大学の理念と歴史の理解，ハラスメント教育，大学における安全第5回:図書館，学修支援センター，キャリアコープセンター，学務課の紹介第6回:汎用的能力測定テスト（GPS-Academic）第7回:各クラスでの活動（プレゼンテーションのテーマ選択など）第8回:日本語力の測定（Webテスト），資格支援について第9回:学生相談窓口説明会第10回:各クラスでの活動第11回:就職について，キャリアデザインについて，大学院のすすめ第12回:汎用的能力測定テストの振り返り第13回:プレゼンテーション第14回:各クラスでの活動（個別面談など）",
        "courseDataUpdatedAt": "2024\/02\/14"
    },
    "updateAt": "2024\/09\/13"
}