{
    "lectureCode": "11121B1",
    "courseName": "キャリア設計II[BS]",
    "lecturer": [
        "江村文英(応用生物学部応用生物学科)",
        "松井徹(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "講義実験棟３０６",
        "講義実験棟４０３",
        "片柳研究所Ｅ１０４",
        "片柳研究所Ｅ２０２"
    ],
    "courceDetails": {
        "courseOverview": "前期のキャリア設計Ⅰの講義内容をもとに、目前に迫った就職活動に直接役立つ実践的な就業力を身につける。そのために、自分に合った職種・業界・企業を選択する力「選択力」を向上させ、強みは伸ばし、弱みは克服することで「選抜力」を養成し、各自が就活に備えて行動目標と実行計画を作成する。特に、エントリーシートの添削やフォローアップ講座を通じて各自のエントリーシートの雛形を完成させる。さらに、模擬面接とそのフィードバックを行ない面接の基本を体験的に修得する。また、冬期・春期インターンシップへの参加の促進を図る。特進クラスでは、より実践的な模擬面接を複数回実施する。",
        "outcomesMeasuredBy": "本講義では、主に演習形式の授業により、論理的な思考力、分析・評価能力および問題解決力を身に付けることを目標とする。さらに、自分に合った職種や企業を選択し、書類選考を通過するエントリーシートの作成能力と面接試験を通過できるコミュニケーション能力を身につける。特進クラスについては、有力企業の面接やグループディスカッションを通過できる能力を身につける。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・集合授業と100人以下のクラス別の講義から成る。各学部に有力企業への就職を目指す特進クラスを設ける。・模擬エントリーシートの添削を行う。また、授業では模擬エントリーシートや模擬面接の具体的例について講師が解説や講評を加えることなどによりフォローアップを行う。・模擬面接（基本クラス）はキャリア設計Ⅱの授業の一環として研究室単位で実施する。",
        "notices": "・3年次の必修単位である。・出席とすべての課題提出が、単位取得の必須要件である。やむを得ない理由で欠席した場合のみ、所定の届出書の提出により出席扱いとなり得る。",
        "preparatoryStudy": "・毎日15分程度は新聞やインターネット等により、社会情勢や経済情勢について広く情報収集を行い、志望業界や企業については特に積極的に調べて、採用動向も入手すること。授業後には教科書の講義内容に該当する箇所や参考資料を用いて復習すること。・自己のキャリアビジョンに基づき、自主的な就職対策もあわせて行うこと。",
        "gradingGuidelines": "・成績評価は、14回の全出席・無遅刻，および指示された課題やレポートを期限までに提出することが前提である。・その上で、授業で課される課題やレポートなどの提出物等の評価（60点）と模擬エントリーシートや模擬面接等のワークの評価（40点）で成績を評価する。",
        "textbook": "・MYCAREERNOTEⅢ（ベネッセキャリア）・他に必要な資料は講義用HPにアップする。",
        "referenceMaterials": "・変更点を含めて講義情報や補足資料は全て、講義用HPに掲載するので参考にすること。",
        "courseSchedule": "第1回：ガイダンス第2回：全国一斉webテスト（社会人基礎力）➀第3回：模擬ESブラッシュアップ講義第4回：SPI適性診断➀第5回：業界業種研究会講座、GPSアカデミック振り返り講座第6回：業界研究（就職四季報、業界地図、マクロ/ミクロ分析）第7回：面接対策講座第8回：グループディスカッション（選択型実践）第9回：グループディスカッション（解決型実践）第10回：模擬面接第11回：模擬面接フォローアップ講義第12回：全国一斉webテスト（社会人基礎力）②、マッチプラスの再受験第13回：SPI適性検査②第14回：有力企業受験意識向上のための講話、先輩講演",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/09/13"
}