{
    "lectureCode": "11120B1",
    "courseName": "キャリア設計I[BS]",
    "lecturer": [
        "江村文英(応用生物学部応用生物学科)",
        "松井徹(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        "片柳研究所Ｅ２０２",
        "片柳研究所Ｅ３０２",
        "片柳研究所Ｅ３０３",
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "本学の基本理念である「実学主義」を各自が実践するため、社会で活躍するために必要な能力である「社会人基礎力」の醸成と強化を目的とする。社会人基礎力に関する座学に加えて、業界・企業研究とインターンシップや採用試験の応募書類の作成などのワークを行うことで、各学生が実践を通して各種能力を身につけるカリキュラムになっている。具体的には、学部就職委員会とキャリアコーオプセンターによる就職活動とインターンシップのガイダンス、適正検査対策としてのwebテストの受験、外部講師による社会や自己を理解するための講義、業界・企業研究、面接・グループディスカッション、エントリーシートの作成などを通して社会人基礎力の醸成を行う。夏休みにインターンシップに参加することを奨励するため、その準備も行う。特進クラスでは、有力企業への応募を想定したより実践的なワークを採り入れる。",
        "outcomesMeasuredBy": "本講義では、企業研究と自己分析を行うことで論理的な思考力と分析・評価能力を養い、自分に適した職種や企業の選択に役立てるとともにコミュニケーション能力の向上をはかる。また、グループディスカッション形式の演習により、問題解決力の向上をめざす。これにより社会人基礎力を醸成する。また、夏季休暇中にインターンシップに参加することを推奨する。特進クラスについては、上場企業に就職する意義を理解し、自己分析と企業研究に基づいて適切な優良企業を選択し、その企業の選考に通る準備を行う。",
        "learningOutcomes": "コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・基本は、100人以下のクラス別に講義形式で行う。また、少人数の特進クラスを設置する。（編成は別途指示）・ワークシートなどを活用しながら、セルフワーク・グループワークを中心に進める。・レポートやワークシート等の提出物は評価に加えて、必要に応じて添削フィードバックを行う。・夏期インターンシップ等に備えた応募書類の作成を目標にして、キャリアコーオプセンターと協力して計画的にそのための準備をする。",
        "notices": "・3年次の必修単位である。・出席とすべての課題提出が、単位取得の必須要件である。やむを得ない理由で欠席した場合のみ、所定の届出書の提出により出席扱いとなり得る。",
        "preparatoryStudy": "・毎日15分程度は新聞やインターネット等により、社会情勢や経済情勢について広く情報収集を行い、志望業界や企業については特に積極的に調べて、採用動向も入手すること。授業後には教科書の講義内容に該当する箇所を復習すること。・自己のキャリアビジョンに基づき、自主的な就職対策もあわせて行うこと。",
        "gradingGuidelines": "・成績評価は、14回の全出席・無遅刻，および指示された課題やレポートを期限までに提出することが前提である。・その上で、授業で課される課題やレポートなどの提出物等の評価（60点）と各種ワークの評価（40点）で成績を評価する。",
        "textbook": "・MYCAREERNOTEⅢ（ベネッセキャリア）・他に必要な資料は講義用HPにアップする。",
        "referenceMaterials": "・変更点を含めて講義情報や補足資料は全て、講義用HPに掲載するので参考にすること。",
        "courseSchedule": "第1回：オリエンテーション第2回：社会に出るとは、自己理解を深める第3回：業界・企業研究①業界・企業研究の方法第4回：業界・企業研究②企業研究発表、職種研究第5回：インターンシップ応募書類を作る①自己PR、学チカ第6回：インターンシップ応募書類を作る②志望動機第7回：エントリーシート講座第8回：選考準備①面接練習第9回：選考準備②公開型模擬面接第10回：選考準備③グループディスカッション第11回：就活戦略プレゼンテーション、授業の総まとめ第12回：大学院説明、夏期インターンシップ傾向について第13回：マッチプラス実施第14回：夏期休暇前ガイダンス",
        "courseDataUpdatedAt": "2025/02/13"
    },
    "updateAt": "2025/03/21"
}