{
    "lectureCode": "B10204",
    "courseName": "生物・化学基礎実験I[火BE]",
    "lecturer": [
        "松井徹(応用生物学部応用生物学科)",
        "矢野和義(応用生物学部応用生物学科)",
        "秋元卓央(応用生物学部応用生物学科)",
        "村上優子(応用生物学部応用生物学科)",
        "中村知世(応用生物学部応用生物学科)",
        "後藤早希(応用生物学部応用生物学科)",
        "岡本瑞穂(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義・実験科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火4",
        "火5",
        "水2"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "本授業は、実験と講義を通じて微生物学と化学の基礎的な知識と実験方法を学び、実学に基づく専門能力を身に付けることを目的とする。授業の前半は、身の回りに存在する微生物を顕微鏡で観察したり、培養したりすることで、通常は目に見えない微生物の存在と微生物の働きを理解する。授業の後半は、化学の基礎に関する講義と実験を通して、化学反応や濃度計算に関する知識、化学測定の基礎的技術、得られたデータの解析方法などを学ぶ。",
        "outcomesMeasuredBy": "本講義付実験では、班作業によりコミュニケーション能力、レポート作成により論理的な思考力、実験作業および実験結果の整理により分析・評価能力を身に付けることを目指す。また、生物学・化学についての実学に基づく専門能力を身に付けることを目指す。具体的には、微生物の培養や観察を通して微生物の大きさや生息環境、生育に必要な栄養条件などを理解することを目的とする。また、濃度計算や化学反応を理解することで、基礎的な化学実験を正確に実施し解析できる能力を身に付けることを目的とする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "毎週水曜日の講義と毎週１回（クラスにより曜日は異なる）の実験で構成される。この講義は、すべてのクラスが同時に受講する。講義では、ガイダンスおよびそれぞれの実験内容を解説する。実験は各自または数人のグループで行う（グループワーク）。しかし、レポートは一人一人が作成し、実験終了後１週間以内に提出する。内容が不十分なレポートは添削の後に返却し、フィードバックを行う。改訂後、再度提出する。講義と実験でノートPCは使用しない。",
        "notices": "すべての実験と講義に必ず出席し、実験レポートを期限内に必ず提出すること。やむを得ない理由で欠席した場合には、学期末に実施する追実験を受ける。追実験を受けるためには申請が必要である。追実験申請の際には、欠席の理由を証明する書類（診断書等）を提出すること。実験時は、テキスト、実験ノートおよび実験別紙、白衣、名札、保護メガネを必ず持参する。",
        "preparatoryStudy": "実験には予習が必須である。実験前には、講義内容を復習し、実験テキストを読むことで実験の目的と内容を理解しておくこと。",
        "gradingGuidelines": "すべての実験・講義への出席を前提にして、実験レポート（９０％）、講義における理解度チェック結果（１０％）で評価する。",
        "textbook": "実験テキスト（第1回と第7回の講義で配布）",
        "referenceMaterials": "はじめての化学実験（オーム社）",
        "courseSchedule": "第1回:基本的な器具の使用方法とレポートの作成方法。(松井徹)第2回:培地の調製：微生物の培養に必要な培地の調製を行なう。（秋元卓央）第3回:身近な微生物の観察：ブドウ球菌を中心に身近な微生物の観察を行なう。（岡本瑞穂）第4回:環境中の微生物の培養：環境中の微生物を培養し、形成したコロニーの観察を行なう。（秋元卓央）第5回:微生物の顕微鏡観察：培養した微生物の顕微鏡観察を行なう。（松井徹）第6回:微生物のエネルギー代謝：パン酵母がアルコール発酵を行う様子を観察する。（中村知世）第7回:実験の基礎実験を行う上での諸注意や有効数字の考え方、試薬調製などの基本操作を学ぶ。（矢野和義）第8回:吸光度測定グラフの作成方法と、ランベルト・ベールの法則を利用した吸光度測定を学ぶ。（村上優子）第9回:比色分析赤ワインに含まれるポリフェノールの濃度を比色分析により測定する。（村上優子）第10回:反応速度定数の測定過酸化水素の分解反応の反応速度定数を測定する。（矢野和義）第11回:キレート滴定水中の金属イオン濃度をキレート滴定により測定し、水の硬度を判定する。（後藤早希）第12回:中和滴定食品中に含まれる有機酸の濃度を中和滴定により測定する。（後藤早希）",
        "courseDataUpdatedAt": "2024/02/14"
    },
    "updateAt": "2024/08/07"
}