{
    "lectureCode": "B10301",
    "courseName": "生物・化学基礎実験II[月AD]",
    "lecturer": [
        "岩渕徳郎(応用生物学部応用生物学科)",
        "未定(所属なし)",
        "佐藤拓己(応用生物学部応用生物学科)",
        "西良太郎(応用生物学部応用生物学科)",
        "木村将大(応用生物学部応用生物学科)",
        "西野勝俊(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義・実験科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月4",
        "月5",
        "水2"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "本科目は、講義と実験を通じて生物学と生化学の基礎に触れ、その基本的実験操作を学ぶことを目的とする。授業の前半は、植物組織の観察、細胞分裂の観察、微生物の運動観察、ヒトの視覚・触覚に関する実験を行う。授業の後半は、緩衝液の調製、酵素反応の基礎、植物の光合成色素の分離、DNAの電気泳動、DNAの分離と検出に関する実験を行う。実験は、グループ内で協力して行う。実験結果は、各自まとめレポート提出を行う。ノートPCについては実験内容に従って必要になる場合がある。ノートPCが必要な場合は、事前に指示をする。",
        "outcomesMeasuredBy": "本講義付実験では、学生が生物学と生化学の基礎知識と基本的な実験手段についての生物・化学に関する実学に基づく専門能力を身に付けることを目指す。これらの実験を行うことにより、生命現象を理解するために必要な顕微鏡観察の手技、細胞の観察、統計学に基づいたデータ処理に対して理解を深める。また緩衝液の調製、酵素反応の基礎、植物の光合成色素の分離、DNAの電気泳動、DNAの分離と検出に関して理解を深める。大学授業での生命科学生物学などに対する具体的イメージを身につけることを達成目標とする。グループ内で協力して実験を行い、実験結果のまとめと科学的なレポート作成を通してコミュニケーション能力、分析・評価能力と論理的な思考力を育成する。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "講義・実験を前半と後半で各6回行う。講義では実験原理と実験操作についての基礎的知識を実験テキストに基づいて解説する。実験は3から４人のグループで行う（グループワーク）が、レポートは各自で書き、期限までに提出する。提出レポートは授業内に評価し、フィードバックする。",
        "notices": "実験と講義に必ず出席し、実験レポートの提出は必須である。講義の出席は、講義内にある課題を提出することにより認定される。また、やむを得ない理由で欠席した場合は、理由を証明する書類（領収書、必要に応じて診断書等）を提出したうえで、追実験を申請して受けることができる。また、白衣・名札・保護メガネを持参すること。",
        "preparatoryStudy": "第1回と第7回の講義時に配布される実験テキストを必ず読み、予習すること。実験前に講義の内容を復習し、実験の目的と内容を事前に理解しておくこと。特に実験方法については事前に理解し、実験日には速やかに実験操作に入れるようにしておくこと。また、分からない点があれば各自確認しておくこと。実験テキスト内に設けられた空欄箇所については、講義の内容に従って実験前の記入が必要になる場合がある。実験前の記入が必要な場合は、講義中に指示をする。",
        "gradingGuidelines": "講義・実験への出席、およびレポートの期限内の提出を前提に、実験レポート90%、毎回の講義の提出課題10%で評価する。",
        "textbook": "第1回と第7回の講義において実験テキストを配布する。",
        "referenceMaterials": "参考書は特に指定しないが、必要に応じて講義の中で紹介する。",
        "courseSchedule": "第1回：原形質流動と原形質分離について実験し、現象とメカニズムを理解する（岩渕）第2回：物体の色の見え方について実験し、現象とメカニズムを理解する（講師）第3回：体細胞分裂の観察し、細胞周期について理解する（岩渕）第4回：ミドリムシの運動を観察し、現象の科学的表現方法を学習する（講師）第5回：ミドリムシの運動を観察し、運動のメカニズムを学習する（助教）第6回：皮膚の２点識別実験と重さを識別する実験におけるデータの解析を行うことにより基礎統計処理法を学習する（助教）第7回：生化学実験の基本操作の習得と緩衝液の調製および緩衝作用の確認（西）第8回：酵素反応の基礎1（pH依存性の確認）（佐藤）第9回：酵素反応の基礎２（グルコース濃度の測定）（佐藤）第10回：薄層クロマトグラフィーを用いた植物の光合成色素の分離（木村）第11回：DNAの電気泳動（岡本）第12回：DNAの分離と検出（木村・岡本・西）",
        "courseDataUpdatedAt": "2024\/01\/10"
    },
    "updateAt": "2024\/08\/07"
}