{
    "lectureCode": "B10502",
    "courseName": "生命科学II[2]",
    "lecturer": [
        "松井毅(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "生命に関する知識は、われわれ自身の体や生活に密接に関係するものであり、重要である。とくに生体を構成する分子の構造と機能を理解することは不可欠である。複雑で何か不思議な力で生きているように見える生物も、実は生体分子一つ一つの巧妙な働きによって生命が保たれている。本講義では、タンパク質の構造と機能、および細胞のエネルギー代謝について、わかりやすく解説する。受講することにより、タンパク質の働きや生体の代謝に関する論理的な思考力が身に付く。",
        "outcomesMeasuredBy": "この科目では、生命科学についての実学に基づく専門能力を育成することを目標としている。その専門能力とは具体的に以下のことを示す。(1)タンパク質が酸素運搬や物質変換や運動を司る仕組みについて、論理的に考察し説明する能力(2)細胞や生体のエネルギー代謝について、論理的に考察し説明する能力",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "【授業形態：講義】教科書は必携です。講義は教科書と教科書に即した配布プリント（空欄あり）を使い、これら資料に関連するパワーポイントを用いて進行します。ノートPCまたはスマートフォンは出席管理や授業中の双方向コミュニケーションに用いるので必携です。また講義資料（空欄なし、空欄あり）は授業開始前にMoodleに掲載するので、事前の予習、講義中の資料の補助、講義後の復習に活用してください。授業開始時に、前回講義の「理解度クイズ」の解説、その後、前回講義の「復習クイズ」とその解答解説、授業終了前にその回の講義の「理解度クイズ」を行います。また次の週までに、その回の授業内容を要約した「小レポート」をMoodleに提出してもらいます。",
        "notices": "生命科学Iを受講済みであることが望ましい。",
        "preparatoryStudy": "予習：各回ごとに対応した教科書の該当ページを読み、Moodleに掲載されている次回講義用の資料の空欄に答えを入れることを試みてください。復習：毎回の授業のはじめに行われる前回講義の復習クイズ、および授業の最後に行われる理解度クイズ、Moodle掲載の講義資料を教科書を見ながら復習してください。その上で、小レポートにその回の授業内容を200-500字以内で要約することで整理してください。授業後にMoodle上に公開される講義動画もうまく活用してください。復習の効果を上げるためには、Moodle掲載の講義資料の空欄に正しい答えを記載することが有効です。",
        "gradingGuidelines": "毎回の授業における演習課題等（20%）と講義内容の理解度チェック（第7回）（40％）および期末試験（40%）で評価する。",
        "textbook": "・はじめて学ぶ生命科学の基礎畠山智充・小田達也編著化学同人",
        "referenceMaterials": "・ストライヤー基礎生化学第4版、J.L.Tymoczko(著),J.M.Berg(著),Jr.G.J.Gatto(著),L.Stryer(著),入村達郎(著),岡山博人(著),清水孝雄(著),仲野徹(監修)（東京化学同人）・ミースフェルド生化学、RogerL.Miesfeld(著),MeganM.McEvoy(著),水島昇(翻訳)（東京化学同人）",
        "courseSchedule": "第1回:タンパク質の機能と構造1酸素運搬タンパク質第2回:タンパク質の機能と構造2ヘム結合タンパク質の構造と機能第3回:タンパク質の機能と構造3酵素の特異性、分類と補因子第4回:タンパク質の機能と構造4酵素の反応機構と反応速度第5回:タンパク質の機能と構造5モータータンパク質第6回:タンパク質の機能と構造6細胞骨格第7回:タンパク質の機能と構造7中間理解度チェック第8回:細胞のエネルギー代謝1エネルギーの通貨と代謝の全体像第9回:細胞のエネルギー代謝2解糖系第10回:細胞のエネルギー代謝3クエン酸回路第11回:細胞のエネルギー代謝4電子伝達系第12回:細胞のエネルギー代謝5光合成の明反応第13回:細胞のエネルギー代謝6光合成の暗反応第14回:細胞のエネルギー代謝7脂肪酸のベータ酸化",
        "courseDataUpdatedAt": "2024\/01\/31"
    },
    "updateAt": "2024\/09\/13"
}