{
    "lectureCode": "B10503",
    "courseName": "生命科学II[3]",
    "lecturer": [
        "関洋子(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "生命に関する知識は、われわれ自身の体や生活に密接に関係するもので、一般的な知識として、重要である。とくに生体を構成する分子の構造と機能を理解することは不可欠で、複雑で何か不思議な力で生きているように見える生物も、実は生体分子一つ一つの巧妙な働きによって生命が保たれている。本講義では、タンパク質の構造と機能、および細胞内のエネルギー代謝を、わかりやすく解説する。受講によって、日常の代謝を科学的に考えるスキルと論理的な思考力が身に付く。",
        "outcomesMeasuredBy": "本講義では次の(1)から(3)の生物・化学についての専門基礎力を身に付けることを目指す。さらに、生物・化学についての実学に基づく専門能力を育成することを目標とする。(1)タンパク質の機能と構造を説明できる能力(2)酵素と酵素反応を説明できる能力(3)生物のエネルギー生産を説明できる能力",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "【授業形態：講義】授業は講義形式で行う。講義資料は事前に印刷して持参するか、PCにダウンロードしてPCで見ながら受講すること。毎回の授業では用紙を配布する。授業内で理解度チェックおよび授業に関連する演習を行い、回答用紙に記入して授業の最後に提出する。理解度チェックについては当日の授業内で、演習の内容については次回の講義でフィードバックする。",
        "notices": "生命科学Iを受講済みであることが望ましい。",
        "preparatoryStudy": "予習：各回ごとに指定する教科書の該当ページを読んでくること。また、Moodleから講義資料をダウンロードしてPCに保存もしくは印刷してくること。さらにその資料内容について、相当する箇所が教科書の何ページに記載があるが確認すること。復習：毎回の授業の資料をよく復習すること。",
        "gradingGuidelines": "毎回の授業における演習課題等（20%）と講義内容の理解度チェック（第7回）（40％）および期末試験（40%）で評価する。",
        "textbook": "はじめて学ぶ生命科学の基礎畠山智充・小田達也編著化学同人",
        "referenceMaterials": "・ストライヤー基礎生化学第4版、J.L.Tymoczko(著),J.M.Berg(著),Jr.G.J.Gatto(著),L.Stryer(著),入村達郎(著),岡山博人(著),清水孝雄(著),仲野徹(監修)（東京化学同人）・ミースフェルド生化学、RogerL.Miesfeld(著),MeganM.McEvoy(著),水島昇(翻訳)（東京化学同人）",
        "courseSchedule": "第1回:タンパク質の機能と構造1酸素運搬タンパク質第2回:タンパク質の機能と構造2ヘム結合タンパク質の構造と機能第3回:タンパク質の機能と構造3酵素の特異性、分類と補因子第4回:タンパク質の機能と構造4酵素の反応機構と反応速度第5回:タンパク質の機能と構造5モータータンパク質第6回:タンパク質の機能と構造6細胞骨格第7回:タンパク質の機能と構造7中間理解度チェック第8回:細胞のエネルギー代謝1エネルギーの通貨と代謝の全体像第9回:細胞のエネルギー代謝2解糖系第10回:細胞のエネルギー代謝3クエン酸回路第11回:細胞のエネルギー代謝4電子伝達系第12回:細胞のエネルギー代謝5光合成の明反応第13回:細胞のエネルギー代謝6光合成の暗反応第14回:細胞のエネルギー代謝7脂肪酸のベータ酸化",
        "courseDataUpdatedAt": "2024\/01\/31"
    },
    "updateAt": "2024\/09\/13"
}