{
    "lectureCode": "B10601",
    "courseName": "分子生物学I",
    "lecturer": [
        "佐藤淳(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "遺伝子組換え技術の進展に伴い、最近の生物学では、分子レベルで生体反応を理解する分子生物学が主流となっている。その中心を担う遺伝子情報は、生体内において転写、翻訳レベルで精巧に制御されている。また、生体内の機能は、様々な分子の相互作用によって発現される。本講義では、遺伝子構造、複製、転写、翻訳のいわゆるセントラルドグマに関する分子生物学を、分子生物学Iとして解説する。本講義内容は、分子生物学II、細胞生物学の基礎となる内容なので、しっかり理解していただきたい。この講義では、遺伝子の構造、複製、転写、翻訳を学ぶことによって、分子生物学の実学に基づく専門能力、さらに、理解した内容を論理的に説明できる思考力を身につけることを目標とする。",
        "outcomesMeasuredBy": "本講義では、生命科学についての実学に基づく専門能力の定着を目指す。具体的には遺伝子の構造、複製、転写、翻訳について理解することを目標とする。特に遺伝子構造は化学構造式として、核酸の伸長反応は化学反応として理解することが重要である。さらに、遺伝子の複製（PCR法）、転写、翻訳については、具体的な塩基配列を使ってその現象を説明できるようにすること。記述式の試験問題を出題することで、論理的な思考力が身についた履修者に単位を認めている。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "教科書を中心に合計14回の授業を講義形式で行う。本講義では、予習を前提とした反転授業を行う。授業前に教科書や資料をよく読んで必ず予習し、課題を提出すること。教科書では触れていない内容についても講義することがあるので、その場合は事前に配布する資料をダウンロードして学習すること。本講義では、講義中に簡単なクイズを出題して、その回答を履修者に求めるアクティブラーニングを取り入れている。ノートPCは、特に指示のない場合は使用しない。",
        "notices": "頻出する専門用語は確実に理解すること。講義中に出てくる項目については、論理的に説明出来るよう理解すること。",
        "preparatoryStudy": "授業前に教科書や資料をよく読んで予習し、課題を提出すること。毎授業後は、講義で新しく出てきた専門用語をまとめ、さらに、講義中に出てくる項目については、論理的に説明出来るよう復習すること。",
        "gradingGuidelines": "出席を前提として、講義中の発言や質問15%、課題への対応15%（なお、課題については、講義内で説明したり、補足資料を使ってフィードバックする）、期末試験70%で評価する。試験では、学習した内容を論理的に説明出来るようにしておくこと。また、遺伝子構造についてはその化学構造式、核酸の伸長反応については化学反応として説明できるようにしておくこと。遺伝子の複製（PCR法）、転写、翻訳については、具体的な塩基配列を使ってその現象を説明できるようにすること。",
        "textbook": "カラー図解アメリカ版大学生物学の教科書（第2巻、分子遺伝学）、D.サダヴァ他著、講談社、2000円（税抜き）",
        "referenceMaterials": "特になし",
        "courseSchedule": "第1回:遺伝子とは何か(1)、原核生物と真核生物の染色体の違い第2回:遺伝子とは何か(2)、グリフィスの実験、核酸とタンパク質の熱安定性の違い第3回:遺伝子とは何か(3)、エーヴリーの実験、ハーシーとチェイスの実験、真核生物の形質転換第4回:核酸の構造、DNAの二重らせん構造(1)第5回:DNAの二重らせん構造(2)、核酸の定量第6回:プラスミドDNAの高次構造とアガロース電気泳動での解析第7回:メセルソンとスタールの複製実験、DNAの半保存的複製第8回:テロメア構造、ポリメラーゼ連鎖反応(PCR法）第9回:遺伝情報の転写(1)、転写開始、mRNAの伸長、転写終結第10回:遺伝情報の転写(2)、真核生物での遺伝子発現制御（5'キャップ、3'ポリA、RNA干渉、ヒストンコード）第11回:遺伝情報の翻訳(1)、遺伝暗号（コドン）第12回:遺伝情報の翻訳(2)、tRNAのアミノアシル化第13回:遺伝情報の翻訳(3)、リボソームの構造と機能、タンパク質の局在第14回:講義のまとめ",
        "courseDataUpdatedAt": "2024\/01\/27"
    },
    "updateAt": "2024\/09\/13"
}