{
    "lectureCode": "B10801",
    "courseName": "生態学",
    "lecturer": [
        "浦瀬太郎(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金3"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "本講義では、生物学の対象のうちスケールが大きいもの(個体/個体群/生物群集/生態系)を扱う。これらの生態学の内容をおおむね次の順に講義する。1)種（生命の進化，生物種の系統分類，多様性，環境への適応）2)個体群（増殖，競争，捕食被食のモデル化）3)生物群集（ニッチ，植生，食物連鎖）4)生態系（物質やエネルギーの循環，生態系の保全，地球の歴史）",
        "outcomesMeasuredBy": "医薬，環境，食品，化粧品などの分野を目指す学生に対して，現在の生命が地球の長い進化の歴史の上に成立していることを意識する機会を提供する。それぞれの目指す分野でさまざまな問題解決のアイディアを，多様な視点，時間的空間的に大きい視点から見出す能力を付けることを目指す。また，将来の方向に関わらず，生態学の分野の専門の基礎を身につけ，生物・化学を学んだものに社会から期待されるレベルの実学に基づく専門能力を育成する。さらに，生物の進化などに関する講義を通して，生物多様性に関する広い視点からの問題解決力を身につけることを目指す。",
        "learningOutcomes": "実学に基づく専門能力問題解決力",
        "teachingMethod": "授業では要点を解説するとともに，質問と応答を重視したアクティブラーニングの形式でおこなう。応答では，さまざまな生態学の問いの回答(解答)を考えることで，問題解決力を育成する。毎回の授業では、出席の確認をかねた小課題を課すことによって，自律的な学びを定着させ，また，標準的な確認問題とすることによって，標準的な生態学の考え方を確認する。小課題とは別に，やや重い課題(中間試験的性質のもの)を14回の講義のうち1回課す。Moodle上の講義資料をあらかじめ，印刷して講義に臨むことを推奨する。また，Moodle上で回答する課題も用意しているので，その回答が可能なデバイス(たとえばノートPC)が授業時に必要である。",
        "notices": "高等学校での「生物」の履修を前提としていないが，高等学校での「生物」の生態系，進化，生物分類の章の内容を復習しつつ，それらを応用し，応用生物学部の他の学び(分子生物学など)とも連携した生態学の授業を展開する。高等学校の「生物」「生物基礎」の教科書もよい参考書になるので，高等学校でこれらの科目を履修した学生は，これらの教科書を捨てないのがよい。",
        "preparatoryStudy": "特定の科目を前もって履修しておくことを受講の前提とはしていないが，指定された教科書をよく予習して授業に臨むこと(120分程度)。予習のための教科書のページを別に予習復習欄に示している。さらに，復習のためのキーワードを別に提示しているので，授業後にそれらの言葉を自分の言葉で説明できるようになっているか，毎回，確認してください(120分程度)。",
        "gradingGuidelines": "50点を期末試験の評点，20点を毎回の提出物の自動採点による評点(一部の回では紙による課題提出を併用)，30点を14回の講義中に1回実施する問題演習による評点とし，その合計で成績を評価する。毎回の課題の回答には，講義内容の確認の意味に加えて，出席の確認の意味があり，単位取得のために必要な課題の提出回数がある。毎回の課題をmoodleから提出した後，解説を確認することができ，これをもってフィードバックとする。問題演習については，授業内で解説を行いフィードバックとする。",
        "textbook": "『生態学入門(第2版)』，日本生態学会編，東京化学同人（2012）",
        "referenceMaterials": "第1回:生態学の定義，生物の定義（個体，個体群，生物群集，生態系）第2回:生物の多様性と分類（5界説と3ドメイン説，系統分類）第3回:生命進化の歴史（生命の誕生，真核生物の誕生，多細胞生物の誕生，大絶滅）第4回:種の分化（生殖隔離，自然選択，突然変異）第5回:分子進化（分子進化の中立説，遺伝的浮動）第6回:進化の方向としてのK選択，r選択（ロジスティック式，環境収容力，有性生殖）第7回:進化や分類に関する問題演習第8回:環境への適応と動物行動（乾燥，資源，適応度，社会性昆虫）第9回:ニッチという棲み分け（基本ニッチ，実現ニッチ，調査法）第10回:個体群生物学（競争式，捕食式）第11回:生物種間の関係（病原体，宿主，食物連鎖）第12回:気候と植生，植生の遷移（バイオーム，極相，ギャップ，気候区分）第13回:炭素・窒素・エネルギーの循環（生産者，消費者，分解者）第14回:生態系の保全（希少生物の絶滅，生態系の人の手による再生法）",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024/02/01"
    },
    "updateAt": "2024/08/07"
}