{
    "lectureCode": "B11102",
    "courseName": "化学演習[B]",
    "lecturer": [
        "松井毅(応用生物学部応用生物学科)",
        "横山憲二(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月4",
        "月5"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義棟Ａ３０３"
    ],
    "courceDetails": {
        "courseOverview": "本科目は、大学における化学系講義ならびに学生実験を受講する上で、必要な化学の知識、化学計算について、講義および演習を行う。これにより、基礎力を伸ばし、ハイレベルで実践的な理解を深めることを目標とする。授業では、以下の項目を中心に、高いレベルで講義・演習を行う。・化学式と物質量・化学結合・化学反応、反応速度・物質の三態と気体の状態方程式・溶解度と濃度・酸塩基とpH・酸化と還元・生物化学",
        "outcomesMeasuredBy": "本講義では、化学についての実学に基づく専門能力、論理的な思考力、分析・評価能力、問題解決力を身につけることを目指す。具体的には、学生実験および１年次後期以降の化学系科目講義において、高度な化学の知識の活用、化学計算がスムーズにできることを目標とする。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "高校化学の習熟度が高い学生を対象とした講義と演習を行う。授業時間中に、まず予習状況確認テストを行う。次に講義形式で例題等についての解説を行う。その後演習を行い、授業の最後に習熟度確認テストを行う。１回の講義・演習は、２限分（200分）の時間で行う。講義に使用するパワーポイントファイル（PDF）を講義前にMoodleにアップロードしておく。PCを使ってそのファイルを見ながら講義を受講することができる（予習テスト、確認テスト実施時を除く）。",
        "notices": "本授業は、講義と演習（小テストを含む）で構成されるため、毎回の演習と小テストへの出席が必須である。やむを得ない理由で欠席した場合は、理由を明示した証明書とともに教員に申し出ること。自己理由による欠席、遅刻は減点の対象となる。",
        "preparatoryStudy": "本講義では予習は必須である。講義に使用するパワーポイントファイル（PDF）を講義前にMoodleにアップロードしておくので、講義前にダウンロードし、予習することができる。各自、与えられた予習課題を講義前に済ませ、毎回の授業時間最初に行う予習状況確認テストに備える。講義終了後、予習テスト、練習問題、演習問題、確認テストの解答例をアップロードするので、解き方を確認しておく。",
        "gradingGuidelines": "予習状況確認テスト10%、毎回の授業時間最後に行う習熟度確認テスト30%、前後半それぞれの最終回に行う到達度確認テストを60％として評価する。毎回行う演習、テストにより、即日フィードバックできる。演習の模範解答は、講義終了後にMoodle上にアップロードされるので、これらによってもフィードバックできる。",
        "textbook": "なし。プリントまたはMoodleにアップロードした教材を用いる。",
        "referenceMaterials": "・これでわかる化学（三共出版）・これでわかる化学演習（三共出版）・Catchup大学の化学講義（改訂版）（裳華房）",
        "courseSchedule": "第1回：ガイダンス、単位と有効数字（横山）第2回：原子量・分子量・式量・物質量（基礎）（横山）第3回：物質量（発展）・化学反応の量的関係（横山）第4回：原子の電子配置・化学結合（横山）第5回：反応熱・反応エンタルピー（横山）第6回：反応速度・化学平衡（横山）第7回：到達度確認（前半）（横山）第8回：濃度（松井毅）第9回：酸塩基とpH（松井毅）第10回：酸化と還元（松井毅）第11回：物質の三態（松井毅）第12回：溶液（沸点、凝固点）（松井毅）第13回：生物化学、後半総復習（松井毅）第14回：到達度確認（後半）（松井毅）",
        "courseDataUpdatedAt": "2024\/02\/14"
    },
    "updateAt": "2024\/09\/13"
}