{
    "lectureCode": "B20301",
    "courseName": "生命科学III",
    "lecturer": [
        "佐藤淳(応用生物学部応用生物学科)",
        "佐藤拓己(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "私たちの身体は、約37兆個の細胞から構成されている。しかし始まりはたった1個の受精卵であり、その細胞は遺伝情報に基づいて分裂しながら増殖し、様々な組織、器官、そして個体へと分化していく。生命科学IIIでは、生命科学I、IIでの学習内容をさらに発展させて、生命科学を細胞、器官、および個体レベルで理解することを目的とする。具体的には、細胞増殖、発生と分化、細胞死、クローン動物、細胞情報伝達、生体防御と免疫を取り上げ、分子レベルから個体レベルへの幅広い生命科学を学習する。本講義では、生命科学についての実学に基づく専門力を身につけることを目指す。さらに、講義で触れた生命現象については、論理的に説明できる”論理的な思考力”の定着を目指すこと。",
        "outcomesMeasuredBy": "本講義では、生命科学についての実学に基づく専門能力を身につけることを目指す。具体的には、生命科学を細胞レベル、および器官レベルで理解し、論理的に説明できる思考力の獲得を到達目標とする。授業中に講義内容と関連する簡単な質問を出題するので、口頭で論理的に回答できるようにすること。これにより、「論理的な思考力」の定着を目指す。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "教科書を中心に合計14回を講義形式で行う。教科書第７章および第８章を、２名の教員が担当する。講義中は、指名した学生に講義での関連事項を質問し、その回答を求める。その回答例を参考にしながらフィードバックを行うことで、講義内容の確認を進めるアクティブラーニングを実施する。授業の終わりには、その日の講義内容の修得度をクイズで確認する。講義で触れた生命現象については、論理的に説明できる”論理的な思考力”の定着を目指すこと。ノートPCは、特に指示のない場合は使用しない。",
        "notices": "生命科学I、IIを受講して、その内容を理解していることが望ましい。講義中に出てくる項目については、論理的に説明出来るよう理解すること。",
        "preparatoryStudy": "講義で使用するスライドは、moodleシステムからダウンロード可能である。事前に資料を印刷、予習の上講義に臨むこと。また、教科書も合わせて予習すること。専門用語に関しては、用語集を各自作成すると良い。",
        "gradingGuidelines": "出席を前提に、講義に参加した際の質問や授業中の発言など5%、課題提出とその内容10%、期末試験85%で評価する。",
        "textbook": "はじめて学ぶ生命科学の基礎、畠山智充、小田達也編著、化学同人、2300円（税抜き）",
        "referenceMaterials": "なし",
        "courseSchedule": "第1回（担当佐藤拓己）:細胞概論（クローンとは何か？）第2回（担当佐藤拓己）:細胞分裂と細胞老化第3回（担当佐藤拓己）:体細胞分裂第4回（担当佐藤拓己）:減数分裂第5回（担当佐藤拓己）:初期発生第6回（担当佐藤拓己）:細胞死第7回（担当佐藤拓己）:ガン第8回（担当佐藤淳）:細胞における情報伝達(1)：シグナル伝達とは第9回（担当佐藤淳）:細胞における情報伝達(2)：チロシンキナーゼ結合型受容体、イオンチャネル型受容体[1]第10回（担当佐藤淳）:細胞における情報伝達(3)：イオンチャネル型受容体[2]、Gタンパク質共役型受容体第11回（担当佐藤淳）:免疫とは何か？自然免疫を中心に第12回（担当佐藤淳）:獲得免疫(液性免疫(1)）第13回（担当佐藤淳）:液性免疫(2)、細胞性免疫(1)第14回（担当佐藤淳）:細胞性免疫(2)",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/08/07"
}