{
    "lectureCode": "B21203",
    "courseName": "有機化学I[1]BS（2024年度入学者用）",
    "lecturer": [
        "加藤輝(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "1年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "人の体重の約40％は有機化合物からなる。有機化合物の構造と化学反応の関連性を学習することは、生体内の有機化合物の機能や生命化学反応を理解する上で重要な基礎知識となる。そこで、本講義では、有機化合物の結合様式、命名法、立体構造、置換・付加反応等に関する基礎的な知識について学習する。",
        "outcomesMeasuredBy": "本講義では、有機化合物の構造と化学反応性との関連性についての実学に基づく専門能力を身に付けることを目指す。具体的には、有機化合物の名称から化学構造が理解でき、物性および反応性が予測できるようになること、そしてさらに高度な有機化学反応を理解するための基礎を習得することである。化学構造と物性および反応性を関連付けた例題、課題を解くことにより、論理的な思考力と有機化学に関する問題解決力を育成する。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "講義形式で行う。教科書にしたがって、スライド（講義資料）や黒板を使いながら説明する。講義の中盤に例題を、終わりに課題を解き、理解度を確認しながら講義を進める。例題はアクティブラーニング形式で指名―回答―解説を行う。ノートPCで講義資料を閲覧したい場合はノートPCを持参すること。",
        "notices": "高校の「化学基礎」の元素記号や原子の成り立ち、「化学」の有機化学に関する内容を復習しておくこと。1年生前期「一般化学」の混成軌道など有機化学に関連する内容を復習しておくこと。",
        "preparatoryStudy": "予習：教科書の指定された範囲とMoodleにアップされる講義資料を読んでおくこと。（120分程度）復習：例題・課題を再度解いて講義の要点を理解できたか確認すること。必要な内容は理解し暗記すること。（120分程度）",
        "gradingGuidelines": "期末試験70％、毎回の課題30％で成績評価する。講義の終わりの課題は次回の講義のはじめにフィードバックを行う。",
        "textbook": "「これでわかる基礎有機化学」畔田博文、樋口弘行、川淵浩之、高木幸治共著三共出版税抜2,300円（有機化学Ⅰ、Ⅱで共通して使用する）",
        "referenceMaterials": "「これでわかる基礎有機化学演習」畔田博文，鈴木秋弘，高木幸治，川淵浩之共著三共出版税抜2,200円",
        "courseSchedule": "第1回：有機化合物の価電子と共有結合、共有結合の分極と水素結合、酸と塩基第2回：有機化合物の表現方法第3回：アルカンの名称と性質、反応，立体構造について第4回：アルカンの命名法第5回：アルケン、アルキン、芳香族化合物の命名法第6回：アルケン、アルキンの混成軌道と立体構造、アルケンの求電子付加反応第7回：アルケンのラジカル付加、酸化還元反応第8回：アルキン、共役ジエン、ポリエンの反応第9回：芳香族化合物とヒュッケル則第10回：立体化学について第11回：有機ハロゲン化合物の求核置換反応（SN1，SN2反応）について第12回：有機ハロゲン化合物の脱離反応（E1，E2反応）について第13回：有機ハロゲン化合物の競争反応第14回：講義全体のまとめと質疑応答",
        "courseDataUpdatedAt": "2024\/02\/05"
    },
    "updateAt": "2024\/09\/13"
}