{
    "lectureCode": "B21302",
    "courseName": "分析化学・有機化学実験[B]",
    "lecturer": [
        "藤沢章雄(応用生物学部応用生物学科)",
        "浦瀬太郎(応用生物学部応用生物学科)",
        "横山憲二(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "片柳研究所Ｅ５０３"
    ],
    "courceDetails": {
        "courseOverview": "多くの理科系の分野において，座学による学習に加えて，実際に体験することが，知の体系の理解のためには必要である．この実験科目では，分析化学，有機化学を題材として，生物や化学を応用した分野における実験操作を3名1班を原則としたグループワークでおこなう．",
        "outcomesMeasuredBy": "本実験では，生物・化学の実験手法を分析化学，有機化学を題材として体験することによって，生物や化学の分野に関して，研究室や就職先などにおいて自分の考えで主体的に行動できる力を身に着ける(実学に基づく専門能力)．また，得られた実験結果を自分で考察することができることを目指す(分析・評価能力)．さらに，グループ内で協力し，実験内容を発表することができるようになる(コミュニケーション能力)．また，得られた結果を考察して独力で筋の通ったレポートが作成できるようになる(論理的な思考力)．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "本科目は，実験14回を実施する科目である．実験を行う前に，実験内容の基礎事項，および，実験を行う際の安全に関する注意事項を説明する．続いて，3名程度の班にわかれて課題が達成されるまで実験操作を行う(グループワーク)．実験は13:15-18:45の時間でおこなうことを原則としているが，反応などのために時間がかかる課題では，12:45ごろから実験を行い，14:15ごろに食事休憩をとるスケジュールでおこなう．時間変更に関しては教員の指示にしたがうこと．",
        "notices": "白衣，保護メガネを常に着用すること．白衣を忘れたり，遅刻をすると，その日の実験に参加できない場合がある．やむを得ない理由によって，欠席することが分かっている場合には，「事前に」担当教員と相談すること．遅刻や欠席の事情によっては，別の日に設ける追実験に参加できる場合がある．",
        "preparatoryStudy": "実験を行う前にテキストを熟読し，関連事項について必ず予習をすること．予習ノートのチェックを行う．予習状況が十分でないと判断されたものは，その日の実験に参加できない．また，実験結果をすみやかにまとめ，レポート作成をすること．",
        "gradingGuidelines": "単位取得要件：全実験への出席と全レポートの提出が必須である.成績評価：単位取得要件を満たしていることを前提に，レポートが60%，実験への取り組み（予習ノートの記述，実験操作への参加や授業態度など）が40%で評価する．レポートにおいて，一定のレベルに達していない記述については，問題のある箇所を本人に具体的，個別に指摘し，書き直しを要求することで，レポート評価のフィードバックをおこなう．また，実験中に担当教員や授業スタッフが気付いた点について，毎実験後のスタッフミーティングで検討し，次回の実験の開始時に全体に注意を与え，フィードバックを実施する．",
        "textbook": "実験テキストを配布する．",
        "referenceMaterials": "なし",
        "courseSchedule": "第1回：安全に実験を進めるためのガイダンス，ルールの確認，担当者の紹介，実験室の使用方法，マイクロピペットの使用と測定誤差の扱い(藤沢)第2回：有機化学(酢酸ビニルのエマルジョン重合)(藤沢)第3回：有機化学(抗酸化物質の性質ビタミンEやビタミンC，ラジカル消去薬エダラボンと安定ラジカルとの反応速度を調べる)(藤沢)第4回：有機化学(油脂の酸化とその抑制1均一溶液中でのリノール酸メチルの酸化とその抑制実験)(藤沢)第5回：有機化学(油脂の酸化とその抑制2エマルジョン系でのリノール酸メチルの酸化とその抑制実験)(藤沢)第6回：有機化学課題のまとめと分析化学（微生物計数法）顕微鏡を用いた微生物の同定と計数(浦瀬)第7回：分析化学（塩素消毒効率の測定）次亜塩素酸ナトリウムによる微生物消毒効率を測定する(浦瀬)第8回：分析化学（滴定法）溶存酸素濃度を滴定によって定量する方法を学びその応用として，化学物質の生分解性測定を行う(浦瀬)第9回：分析化学（固相抽出法）固相抽出法によって，水中の色素を分離濃縮定量する方法を学ぶ(浦瀬)第10回：分析化学（発色ー検量線法）アンモニアの定量を通して吸光度測定による検量線法を学び，その応用として，硝化反応をモニタリングする(浦瀬)第11回：分析化学（官能検査法）臭気の定性および定量試験(三点比較式)をおこなう(浦瀬)，有機化学実験の解説(横山)第12回：有機化学(アセチルサリチル酸の合成と加水分解)(横山)第13回：有機化学(メチルオレンジの合成)(横山)第14回：全体(内容の振り返り，演習問題，口頭試問)(全担当者)",
        "courseDataUpdatedAt": "2024\/02\/14"
    },
    "updateAt": "2024\/08\/07"
}