{
    "lectureCode": "B21401",
    "courseName": "生化学・微生物学実験[生命科学・医薬品専攻]",
    "lecturer": [
        "西野智彦(応用生物学部応用生物学科)",
        "加藤輝(応用生物学部応用生物学科)",
        "横山憲二(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "片柳研究所Ｅ５０３"
    ],
    "courceDetails": {
        "courseOverview": "多くの理科系の分野において，座学による学習に加えて，実際に体験することが，知の体系の理解のためには必要である．この実験科目では，生化学，微生物学を題材として，生物や化学を応用した分野における実験操作を3名1班を原則としたグループワークで行う．具体的には，1回目は実験ガイダンス，安全教育，基本的な実験操作の説明を行い、2～6回目は生化学実験としてタンパク質，ゲノムDNAについて，7～11回目は微生物学実験として微生物の基本操作について，12，13回では生化学分析に関する実験を実際に体験する。14回目は追実験等を行う．",
        "outcomesMeasuredBy": "本実験では，生物・化学の実験手法を生化学，微生物学を題材として体験することによって，生物や化学の分野に関して，研究室や就職先などにおいて自分の考えで主体的に行動できる力を身に着ける(実学に基づく専門能力)．また，得られた実験結果を自分で考察することができることを目指す(分析・評価能力)．さらに，グループ内で協力し，実験内容を発表することができるようになる(コミュニケーション能力)．また，得られた結果を考察して独力で筋の通ったレポートが作成できるようになる(論理的な思考力)．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "本科目は，実験14回を実施する科目である．実験を行う前に，実験内容の基礎事項，および，実験を行う際の安全に関する注意事項を説明する．続いて，3名程度の班にわかれて課題が達成されるまで実験操作を行う(グループワーク)．",
        "notices": "白衣，保護メガネを常に着用すること．白衣を忘れたり，遅刻した場合，その日の実験には参加できない．やむを得ない理由によって，欠席の場合には，「事前に」担当教員と相談すること．遅刻や欠席の事情によっては，別の日に設ける追実験に参加できる場合がある．",
        "preparatoryStudy": "実験を行う前にテキストを熟読し，関連事項について必ず予習をすること（60分）．予習ノートのチェックを行う．予習状況が十分でないと判断されたものは，その日の実験に参加できない．また，実験結果をすみやかにまとめ，レポート作成をすること（120分）．",
        "gradingGuidelines": "単位取得要件：全実験への出席と全レポートの提出が必須である.成績評価：単位取得要件を満たしていることを前提に，レポートが60%，予習ノートや実験への取り組み（予習ノートの記述，実験操作への参加や授業態度など）が40%で評価する．レポートにおいて，一定のレベルに達していない記述については，問題のある箇所を本人に具体的，個別に指摘し，書き直しを要求することで，レポート評価のフィードバックをおこなう．また，実験中に担当教員や授業スタッフが気付いた点について，毎実験後のスタッフミーティングで検討し，次回の実験の開始時に全体に注意を与え，フィードバックを実施する．",
        "textbook": "実験テキストを配布する。",
        "referenceMaterials": "無し",
        "courseSchedule": "第1回:実験ガイダンス，安全教育，基本的な実験操作の説明（加藤、西野、横山）第2回:生化学実験1ウシ血清からのIgG抗体の精製（加藤）第3回:生化学実験2ポリアクリルアミド電気泳動によるタンパク質の分析（加藤）第4回:生化学実験3免疫染色法によるウシIgG抗体の検出（加藤）第5回:生化学実験4ゲノムDNAの抽出と濃度測定（加藤）第6回:生化学実験5PCR法によるヒト遺伝子配列の増幅と多型解析（加藤）第7回:微生物学実験1培地の調製と滅菌器具の準備（西野）第8回:微生物学実験2寒天培地を用いた単菌分離と抗生物質耐性の観察（西野）第9回:微生物学実験3単菌分離したコロニーの観察と顕微鏡を用いた観察（西野）第10回:微生物学実験4市販発酵乳からの乳酸菌の分離（西野）第11回:微生物学実験5市販発酵乳中に含まれる乳酸菌を用いた発酵乳の製造（西野）第12回:生化学分析実験1タンパク質の定量（横山）第13回:生化学分析実験2タンパク質の分離・ゲルろ過（横山）第14回:追実験，内容の振り返り，演習問題，口頭試問（加藤、西野、横山）",
        "courseDataUpdatedAt": "2024\/02\/01"
    },
    "updateAt": "2024\/08\/07"
}