{
    "lectureCode": "B22101",
    "courseName": "化粧品科学",
    "lecturer": [
        "吉田雅紀(応用生物学部応用生物学科)",
        "藤沢章雄(応用生物学部応用生物学科)",
        "柴田雅史(応用生物学部応用生物学科)",
        "岩渕徳郎(応用生物学部応用生物学科)",
        "松井毅(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木5"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "化粧品は普段から広く使用される身近な製品である。機能別にスキンケア化粧品、メイクアップ化粧品、ヘアケア化粧品、ボディケア化粧品、フレグランス化粧品などがあることからわかるように、その製品のもつ効能は外見を整えるのみならず、肌への有効性や心理的な作用、感性への刺激など多岐にわたる。そのため化粧品の研究開発には皮膚や毛髪の生理学・細胞生物学・生化学に加え、化粧品原料の物理化学的性質・機能性・安全性、香りや使用感触・使いやすさといった感性に関する幅広い知識や技術が必要である。また、その有効性や安全性の担保には様々な法律による規制があり、その規制は広告や販売の仕方にもおよぶ。本講義では、初めて化粧品を学ぶ学生を対象に化粧品のもつ様々な側面について授業を行い、化粧品・医薬部外品の役割や法律、皮膚の構造と機能、化粧品原料・製品、品質保証などに関する実践的な基礎知識を学ぶことによって化粧品への理解を深め、化粧品開発者に求められる知識やコミュニケーションの能力を養う。",
        "outcomesMeasuredBy": "本講義は、複数の実務経験がある教員が担当し、化粧品について理解し、化粧品開発者の専門能力を身に着けるための基盤知識を得ることを到達目標とする実践的科目である。具体的には、本講義を受講することによって、化粧品科学の基本的な内容(品質・機能性・感性)について理解するとともに、化粧品効能表記に対する規制や安全性保証について理解することを到達目標とする。講義と理解度チェックに皮膚科学と化粧品との関連について総合的な理解を深める内容を取り入れることによって論理的な思考力や化粧品開発における問題解決力を養う。履修後には、化粧品の効能や、広告、有効性などをある程度理解し開発作業について理解できるようになることを目標とする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "化粧品コースの教員のオムニバス形式で講義をおこなう。担当教員は、化粧品会社で皮膚科学の基盤研究と薬用化粧品(医薬部外品)の開発研究に従事した経験に基づき、化粧品と薬用化粧品の研究開発の一連の流れ（法規、新規有効成分の研究開発、処方設計、広告等）を実例に基づいて解説する。ノートPCは課題提出等で使用するため必携",
        "notices": "各回の講義は化粧品コース教員のオムニバス形式で行い、順番は前後することがある。また一部の講義については内容が差し替えになることがあり、第一回目の講義にて通知する。",
        "preparatoryStudy": "講義資料をダウンロードして復習をすること。",
        "gradingGuidelines": "理解度チェック80%と課題20%の合計点で評価する。",
        "textbook": "授業で用いたパワーポイント資料はPDFとして掲載するので、復習すること。",
        "referenceMaterials": "美容皮膚科学(南山堂)化粧品業界のしくみと仕事がしっかりわかる教科書（技術評論社）",
        "courseSchedule": "第1回:化粧品総論（吉田）第2回:マーケティングと販売戦略（外部講師）第3回:基礎化粧品のカテゴリー/化粧品の法規制と広告/美白化粧品（吉田）第4回:保湿化粧品（松井）第5回:サンスクリーン、抗老化化粧品（藤沢）第6回:香料の世界（外部講師）第7回:理解度チェック第8回:洗浄剤（洗顔料、全身洗浄料、メイククレンジング）（柴田）第9回:インバスヘアケア化粧品（岩渕）第10回:基礎化粧品の製剤開発の全容（柴田）第11回:メイクアップ化粧品（柴田）第12回:ブリーチおよびヘアカラー剤（岩渕）第13回:化粧品の安全性保証（岩渕）第14回:理解度チェック",
        "courseDataUpdatedAt": "2025/02/10"
    },
    "updateAt": "2025/03/21"
}