{
    "lectureCode": "B22701",
    "courseName": "バイオメディカル分析",
    "lecturer": [
        "矢野和義(応用生物学部応用生物学科)",
        "横山憲二(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金3"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "微生物や酵素、抗体などの生体は、分子の細かい違いを見極める力を持っている。生体が持つこのような優れた分子認識能を巧みに計測技術に応用したバイオセンシング技術は血液検査や血糖値計測に代表されるような医療分野、また基礎医学分野で非常に多く利用されている。本講義では、まずこのようなバイオメディカル分析で使われる生体素子としての酵素、抗体、DNAなどの特徴を説明する。次にこれらを用いたバイオセンシングの手法である酵素センサー、免疫センサーなどの原理を説明する。さらにそれらががんの研究や診断などに利用されている例を紹介する。また、糖尿病診断法、タンパク質の分離分析法、蛍光分光法、液体クロマトグラフィー等のバイオメディカル分析法について学修する。",
        "outcomesMeasuredBy": "本講義では、バイオメディカル分析についての実学に基づく専門能力を身に付けることを目指す。健康状態や疾病の指標物質などを、生体素子を使って選択的かつ高感度に測定するための問題解決力を高めることを目標とする。またバイオセンシングによって得られたデータについての分析・評価能力も身に付ける。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力問題解決力",
        "teachingMethod": "（矢野）パワーポイントを用いた講義形式で行う。講義資料は主にプリントとして配布する。ノートPCは使用しない。（横山）各回の授業の前半はパワーポイントを用いた講義形式で行う。講義資料は事前にMoodleにアップロードするので、ダウンロードしておくことが望ましい。ノートPC、スマートフォンを持参すること。",
        "notices": "「生命科学Ⅰ、Ⅱ」、「一般化学」を復習しておくこと。また「生命科学Ⅲ」を履修していることが望ましい。",
        "preparatoryStudy": "Moodleにアップロードされた講義資料を活用して、予習、特に復習をしっかり行うこと。また各講義の最後に行う小テストについても復習すること。",
        "gradingGuidelines": "試験（80％）と小テスト（20％）で評価する。毎回授業の後半に小テストを行い、次回の講義冒頭に解説することでフィードバックを行う。",
        "textbook": "指定しない。必要に応じて資料を提示する。",
        "referenceMaterials": "「バイオセンサーのはなし生体分子や細胞を用いた新しいバイオ計測法」軽部征夫編著、日刊工業新聞社「はじめて学ぶ生命科学の基礎」畠山智充・小田達也編著、化学同人（「生命科学Ⅰ～Ⅲ」教科書）「実験医学別冊タンパク質精製と取扱いのコツ」森山達哉編、羊土社",
        "courseSchedule": "第1回：イントロダクション：バイオメディカル分析とは（矢野）第2回：タンパク質の構造とpKa（矢野）第3回：分子認識素子としての酵素（矢野）第4回：分子認識素子としての抗体、DNA（矢野）第5回：分子認識素子の固定化技術と酵素センサー（矢野）第6回：免疫センサー、DNAセンサー（矢野）第7回：疾病診断への応用（矢野）第8回：タンパク質分析法１（タンパク質の定量）（横山）第9回:タンパク質分析法２（タンパク質の荷電、イオン交換、ゲルろ過クロマトグラフィー）（横山）第10回:タンパク質分析法３（疎水性相互作用、アフィニティークロマトグラフィーほか）（横山）第11回：電気化学バイオセンサー、糖尿病診断法（横山）第12回：蛍光分光法による生化学分析（横山）第13回：液体クロマトグラフィーによる生化学分析１（HPLCシステム、分離カラム）（横山）第14回:液体クロマトグラフィーによる生化学分析２（HPLCの実際・応用編、分離の改善）（横山）",
        "courseDataUpdatedAt": "2024\/08\/29"
    },
    "updateAt": "2024\/09\/13"
}