{
    "lectureCode": "B22801",
    "courseName": "免疫学",
    "lecturer": [
        "吉田雅紀(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火2"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "私たちの身体（自己）は、環境中に無数に存在する微生物や異物と共生・共存しています。それと同時に、有害な異物（非自己）が体内に侵入すると、巧妙な免疫の仕組みにより自己と区別して撃退します。本講義では、この免疫の仕組みについてわかりやすく解説します。また免疫の破綻に関係するアレルギー、リウマチ、エイズ、がん、生活習慣病などの病気についても解説します。受講によって、免疫のしくみや健康・病気との関連を、遺伝子・分子・細胞のレベルから理解できるようになり、将来の職業に役立つだけでなく自身や家族の健康を守る上で有用です。",
        "outcomesMeasuredBy": "本講義では免疫学についての実学に基づく専門能力を身に付けることを目指します。その専門力とは具体的に以下のことを示します。(1)自然免疫・獲得免疫のしくみに対する、遺伝子・分子・細胞のレベルからの分析・評価能力(2)免疫と健康・病気の関連を実生活の中で説明し、健康上の問題を解決できる実学に基づく専門能力",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力",
        "teachingMethod": "【授業形態：対面授業】毎回配布したPDF資料をもとに授業を進めます。教科書の内容と対応していますので、教科書は予習復習の勉強に活用してください。第1回〜第7回、第9回〜第14回は対面授業を行います。第8回は理解度チェックを行います。対面授業は教科書に即した配布プリントを使い、これら資料に関連するパワーポイントを用いて進行します。ノートPCまたはスマートフォンは出席管理および課題提出に用いるので必携です。各回の終わりに各テーマの要点について問う小問題を解いて提出します。小問題の提出は必須です。第２回以降は先週の授業内容に対し理解度が自分でわかるようにムードル上でテストを行い、点数をフィードバックします（こちらの受験は出席を兼ねております）。テスト受験後は、自習用にムードル上で何度も受講できるさらに多くの内容を組み込んだテストを用意してあります。",
        "notices": "生命科学IIを受講済みであることが望ましい。",
        "preparatoryStudy": "予習：各回ごとに対応する教科書の該当ページを読み、Moodleに掲載されている次回授業用の資料の空欄に答えを入れることを試みてください。復習：毎回の授業で用いた講義資料を使って授業後のその日のうちに復習してください。Moodle上で小問題を出しますので、次回の講義日までに解答するようにしてください。強制ではないですが、前回の内容の復習テストを公開しますので使用して復習に役立ててください。",
        "gradingGuidelines": "授業への出席を前提として，授業後の課題点（小問題解答）30%、授業中に行う理解度チェックと試験成績の合計70%で成績を評価します。課題点は欠席者には与えられません。また授業への姿勢について減点を加えることがあります。",
        "textbook": "休み時間の免疫学（第3版）齋藤紀先著講談社",
        "referenceMaterials": "好きになる免疫学萩原清文著講談社イラストレイテッド免疫学原書2版（リッピンコットシリーズ）丸善出版実験医学別冊：もっとよくわかる炎症と疾患",
        "courseSchedule": "第1回：細菌に対抗する戦略第2回：自然免疫と体液性免疫第3回：抗原を提示して抗体を作る第4回：ウイルスに対抗する戦略第5回：自然免疫と細胞性免疫第6回：得意分野ごとの免疫分子第7回：免疫担当の細胞たち第8回：体液性・細胞性免疫についての理解度チェック第9回：炎症とアレルギー第10回：免疫不全とエイズ第11回：がんと免疫のせめぎ合い第12回：皮膚の免疫システムと皮膚炎第13回：慢性炎症第14回：老化と免疫/全体振り返り",
        "courseDataUpdatedAt": "2025/02/12"
    },
    "updateAt": "2025/03/21"
}