{
    "lectureCode": "B22901",
    "courseName": "生物化学II",
    "lecturer": [
        "村上優子(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "生物化学IIでは、主な生体構成物質である脂質、タンパク質、核酸などの構造と生体内における機能（エネルギー代謝、物質代謝経路における役割、制御機構と反応様式）を理解することを目標とする。生物を構成する物質の化学的性質を理解することは、生命現象を分子レベルで理解するために必須である。生物化学を学習することによって、生物は何からできているか、それらはどのような性質を持ち、生体の中でどのような働きをしているか等について理解できるようになる。そしてそれは、健康や疾病、食品などを理解する上で、基礎となる重要な内容を数多く含んでいる。",
        "outcomesMeasuredBy": "生物化学Ⅱを受講することによって、以下の３つの能力が身につくことを期待する。①論理的な思考力：脂質、タンパク質、アミノ酸、核酸の分子構造や性質を理解し、これらの物質が生体内で担っている役割について論理的に考えることができる。②問題解決力：代謝の過程を分子レベルで学習し、生命現象が緻密に制御されていることを理解する。健康状態の生命現象を理解することによって疾病に対する関心を高め、予防や治療について考察することができる。③実学に基づく専門能力：生物化学Ⅱの学習内容は、食品、化粧品、生命科学、環境、医薬品などの分野の基礎となる。単に専門能力を身に付けるに留まらず、これらに関する卒業研究を遂行する上で学習内容を役立てることができる。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "出席登録及び課題提出に利用するため、必ずノートPCまたはスマートフォンを持参すること。14回の講義形式で行う。教科書およびスライド、黒板を用いて解説する。毎回講義の最初に復習を、講義の最後に理解度チェックを行う。",
        "notices": "生物化学Ⅰやその他の生物系科目において学習した内容を十分に復習・理解しておくこと。",
        "preparatoryStudy": "予習：教科書の指定の頁を読んでくること。復習：復習問題や理解度チェックの各自の結果を見て、適宜授業プリントや教科書を用いて復習すること。",
        "gradingGuidelines": "授業への出席を前提として、期末試験70％、授業中に行う理解度チェック30％で成績評価し、100点満点中60点以上で単位認定とする。記述式の試験問題を出題することで、基礎学力と論理的な思考能力が身についた履修者に単位を認める。",
        "textbook": "マクマリー生物有機化学[生化学編]原書8版（丸善出版）",
        "referenceMaterials": "[基礎]エッセンシャル生化学第三版（東京化学同人）ヴォート基礎生物学第五版（東京化学同人）[発展]ヴォート生化学（上）（下）（東京化学同人）レーニンジャーの新生化学（上）（下）（廣川書店）ストライヤー生化学第八版（東京化学同人）イラストレイテッドハーパー生化学第30版（丸善出版）",
        "courseSchedule": "第1回：脂質の構造第2回：脂質の生化学第3回：脂質の分解第4回：脂質の合成第5回：タンパク質とアミノ酸の代謝第6回：核酸の構造第7回：核酸の生化学（複製）第8回：核酸の生化学（転写）第9回：核酸の生化学（翻訳）第10回：ヌクレオチド代謝-1（プリン、ピリミジン合成）第11回：ヌクレオチド代謝-2（プリン、ピリミジン代謝）第12回：ゲノム科学-1（遺伝子組換え実験）第13回：ゲノム科学-2（突然変異と多型、がん、ゲノムリテラシー）第14回：ホルモン、神経伝達物質、薬物",
        "courseDataUpdatedAt": "2023/12/25"
    },
    "updateAt": "2024/09/13"
}