{
    "lectureCode": "B23101",
    "courseName": "バイオエントリープロジェクト",
    "lecturer": [
        "藤沢章雄(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験・演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "応用生物学部には生命医薬，地球環境，食品，そして化粧品の4つのコースがあり，3年次に進級する際にコース選択を行う．1年次に開講した「応用生物学概論」では各コースの内容を紹介し，各分野の特色を理解した．本科目はその後継科目として，各分野で実際に行われる特徴的な内容の実習・演習を通して，各コースに対する理解を深めることを目的とする．本科目は各分野での実務経験を有する教員による，実学基礎科目である．",
        "outcomesMeasuredBy": "本科目では，各コースの専門分野で実際に行われている内容を見学，実習することで，それらに対する理解を深める(実学に基づく専門能力)．また，見学では積極的に質問をし，また実習では同じグループの学生と相談をして，より良いものを作製する努力をする（コミュニケーション能力）．そして，実習を通して出来上がった製品や結果を自身で評価し（分析・評価能力），なぜそのようなものになったのかを原理・原則から考察できるようにする（論理的な思考力）．さらに，その問題点を考え，より良い製品や結果を得られるためには，どのようなアプローチが必要であるかなどを考察できるようにする（問題解決力）．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "各コースで内容は異なる．講義，施設見学，実習・演習，イベントなどへの参加を行う．コースによっては3時限分の集中講義形式となる．各コースのスケジュールに関しては，ガイダンスなどで伝達する．また，注意点やスケジュール変更などについてはその都度，Moodleや学生ポータルにてアナウンスするので注意すること．また，各コースの内容に関するレポートを作成する．",
        "notices": "4コース全てに参加することが，単位取得には必須である．在校生ガイダンスで各コースのスケジュールを公開する．コースによっては土曜日に開講することもある．履修を希望する者は，必ずスケジュールを確認してから履修すること．出席状況によっては，以降の実習などへの参加を認めない場合がある．また，本科目は選抜制である．履修登録前に希望調査を行い，初回講義前に選抜結果を公開する．",
        "preparatoryStudy": "各コースで予習用の課題が課される場合がある．履修者はMoodleをよく確認すること．",
        "gradingGuidelines": "単位取得要件：全てのコースの講義（実習などを含む）への出席と，全レポートの提出が必須である．成績評価：単位取得要件を満たしていることを前提に，レポートが60%，実習・演習への取り組み（各実習で，実習操作への積極的な参加や受講態度など）が40%で評価する．",
        "textbook": "各コースでテキストなどを配布する．",
        "referenceMaterials": "指定しない．各コースの担当教員の指示に従うこと．",
        "courseSchedule": "第1回：ガイダンス，スケジュールおよびルールの確認，担当者の紹介，および本科目の概要に関する講義（藤沢）第2回：食品製造実習1チーズの作成1（食品コース）（西野）第3回：食品製造実習2チーズの作成2（食品コース）（西野）第4回：企業出身者による勤務体験談の講義（食品コース）（西野）第5回：化粧品製造実習1化粧品設計の基礎広義（化粧品コース）（藤沢）第6回：化粧品製造実習2化粧品の製造1（化粧品コース）（藤沢）第7回：化粧品製造実習3化粧品の製造2（化粧品コース）（藤沢）第8回：地球環境関連施設の見学1（地球環境コース）(浦瀬)第9回：地球環境関連施設の見学2（地球環境コース）(浦瀬)第10回：発表会と質疑応答（地球環境コース）(浦瀬)第11回：展示会（バイオ医薬EXPO）の見学1（生命医薬コース）（西）第12回：展示会（バイオ医薬EXPO）の見学2（生命医薬コース）（西）第13回：展示会（バイオ医薬EXPO）の見学3（生命医薬コース）（西）第14回：振り返りとレポート作成（藤沢）",
        "courseDataUpdatedAt": "2025/02/04"
    },
    "updateAt": "2025/03/21"
}