{
    "lectureCode": "B23301",
    "courseName": "実践応用生物特別演習I",
    "lecturer": [
        "東海林保志(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "生物に関する研究者として、医薬品はもとより化粧品や食品、環境分野といった多岐にわたる研究で活躍するのがバイオ技術者である。バイオ技術者認定試験は、1994年にスタートした、日本で最も歴史の長いバイオ技術関連の資格試験であり、社会で活躍する技術者に求められるバイオ技術関連の知識・技術を認定している。公的な資格ではないが、近年、教育界のみならず、産業界からも注目を浴びている認定試験で、製薬会社、臨床検査会社、食品会社などへの就職活動に活用できると期待される。本講義では、中級バイオ技術者認定試験に合格しうる、遺伝子工学技術や細胞工学技術などのバイオ技術分野の基盤となる生化学、微生物学、分子生物学、遺伝子工学の知識を習得する。",
        "outcomesMeasuredBy": "遺伝子工学技術や細胞工学技術などのバイオ技術分野の基盤となる生化学、微生物学、分子生物学、遺伝子工学の知識を持ち、指導者の指示のもとでバイオ関連実験を適切かつ安全に実行しうる能力を得る。また、その能力を習得することを通して中級バイオ技術者認定試験の合格を目指す。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "出席登録及び課題提出に利用するため、必ずノートPCまたはスマートフォンを持参すること。14回の講義形式で行う。教科書、プリント、スライド、黒板を用いて解説する。数回毎に理解度チェックのための小テストを行う。最終回に中級バイオ試験の模擬試験を行う。",
        "notices": "生命科学I,II,III、分子生物学I,II、生物化学I、微生物学を履修し、内容を理解していることが望ましい。",
        "preparatoryStudy": "予習：教科書の指定の問題を解き、正誤を確認し、解説を読んでおくこと。復習：講義で扱った内容を適宜復習すること。",
        "gradingGuidelines": "授業への出席を前提として、最終回の模擬試験70％、講義の中で行う小テスト30％で成績評価し、100点満点中60点以上で単位認定とする。",
        "textbook": "中級バイオ技術者認定試験対策問題集（2025年12月試験対応版）つちや書店3,300円",
        "referenceMaterials": "生命科学I,II,III、分子生物I,II、生物化学I、微生物学で指定されている教科書",
        "courseSchedule": "第1回：本授業の概要、バイオ技術者認定試験について、バイオテクノロジー総論（1）機器取扱い第2回：バイオテクノロジー総論（2）バイオテクニカルターム第3回：バイオテクノロジー総論（3）環境と安全性、小テスト（バイオテクノロジー総論）第4回：生化学（1）細胞・水・生体エネルギー・糖質・タンパク質第5回：生化学（2）脂質・核酸・酵素・ビタミン・ホルモン・ミネラル、小テスト（生化学）第6回：微生物学（1）種類と特徴・構造と機能・代謝・増殖・変異第7回：微生物学（2）利用・食品の保存・環境における活動・実験、小テスト（微生物学）第8回：分子生物学（1）細胞と遺伝・核酸第9回：分子生物学（2）遺伝子・遺伝情報第10回：分子生物学（3）タンパク質・生体防御、小テスト（分子生物学）第11回：遺伝子工学（1）核酸の構造・酵素・宿主・ベクター第12回：遺伝子工学（2）遺伝子クローニング・核酸の抽出・遺伝子と遺伝子産物の検出第13回：遺伝子工学（3）細胞融合・発生工学・植物細胞工学、小テスト（遺伝子工学）第14回：模擬試験とその解説",
        "courseDataUpdatedAt": "2025/01/06"
    },
    "updateAt": "2025/03/21"
}