{
    "lectureCode": "B30501",
    "courseName": "食品実験Ｉ",
    "lecturer": [
        "関洋子(応用生物学部応用生物学科)",
        "安川然太(応用生物学部応用生物学科)",
        "永井利治(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3",
        "木4",
        "木5",
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "片柳研究所Ｅ４０１",
        "片柳研究所Ｅ５０３"
    ],
    "courceDetails": {
        "courseOverview": "食品実験Iは、食品分析実験、食品化学実験、および食品酵素学実験の各４回からなる。食品分析実験では、食品中に含まれる基本的な栄養成分の定量分析を行い、公定法について学ぶ。すなわち、カロリーメイト（大塚製薬）を試料として、食品を構成しているたんぱく質、脂質、水分、灰分（ミネラル）の定量分析の方法について学ぶ。食品化学実験では、食用油の化学特数の測定、食品からの脂質の抽出および同定、アミノ酸とたんぱく質の定性反応、アミノ・カルボニル反応について学ぶ。また、食品酵素学実験では、たんぱく性触媒としての酵素の特性を理解するとともに、微生物から実際に酵素を抽出し純度と活性を確認する。",
        "outcomesMeasuredBy": "食品の品質管理における基礎知識と技術を習得することを目標とする。本実験を通して、食品分野における技術と知識に関する実学に基づく専門能力、共同作業によるコミュニケ―ション能力、レポート作成による論理的な思考力、分析・評価能力と問題解決力を得ることができる。レポート返却により到達度をフィードバックする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "実験操作に入る前に、実験内容の基礎事項および実験を行う際の安全に関する注意事項を説明する。説明後は、各グループに分かれて実験操作を行い（グループワーク）、実験後は、実験内容をまとめたレポートを提出するが、内容に不備があるレポートについては、再提出を求めることがある。",
        "notices": "実験への出席およびレポートの提出は必須である。（ただし、病気やけが等でやむを得ず欠席の場合は、追実験を受けることができる。遅刻・欠席する場合は担当教員、実験助手への連絡は必須）実験の際は必ず白衣、保護メガネを着用すること。本実験では、危険な試薬を扱うことがあるので、安全管理には十分気をつけること。",
        "preparatoryStudy": "実験の前にテキストを熟読し、関連事項について必ず予習をすること。実験ノートに実験方法を記載しておくこと。また、実験操作の意味を理解して、実験に臨むこと。（実験を行う前の基礎事項の説明では、内容を理解していることを前提に進める。）",
        "gradingGuidelines": "実験に対する予習（ノートチェック）（30%）およびレポート内容（70%）により評価する。全実験に出席して、レポートを提出することが単位取得の必要条件である。",
        "textbook": "プリント（実験テキスト）を配布する。",
        "referenceMaterials": "「食品の基礎と機能性分析法」宇田・大石編、アイ・ケイコーポレーション「食品学実験書」藤田・山田編、医歯薬出版「基礎から学ぶ食品化学実験テキスト」谷口・古庄・松本編著、建帛社「食品環境実験50」藤田・山田編、医歯薬出版",
        "courseSchedule": "第1回:食品実験ガイダンス（全教員）第2回:食品分析実験：ケルダール法によるたんぱく質の定量（関洋子）第3回:食品分析実験：ソックスレー法による脂質の定量（関洋子）第4回:食品分析実験：水分の定量（カール・フィッシャー法）（関洋子）第5回:食品分析実験：灰分の定量、食品中の亜鉛の定量（関洋子）第6回:食品化学実験：油脂の化学特数の測定（永井利治）第7回:食品化学実験：脂質の抽出と分画、定性（永井利治）第8回:食品化学実験：たんぱく質（アミノ酸）の反応及び分離（永井利治）第9回:食品化学実験：アミノーカルボニル反応（永井利治）第10回:食品酵素学実験：酵素活性の測定（安川然太）第11回:食品酵素学実験：酵素活性の反応速度論的解析（安川然太）第12回:食品酵素学実験：酵素の最適pHの検討（安川然太）第13回:食品酵素学実験：カビの生産する凝乳酵素の精製（安川然太）第14回:再実験（追実験）",
        "courseDataUpdatedAt": "2024\/02\/01"
    },
    "updateAt": "2024\/09\/13"
}