{
    "lectureCode": "B30601",
    "courseName": "食品実験ＩＩ",
    "lecturer": [
        "関洋子(応用生物学部応用生物学科)",
        "安川然太(応用生物学部応用生物学科)",
        "永井利治(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木3",
        "木4",
        "木5",
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "食品実験IIは、食品製造加工実験、食品衛生学実験、および糖質科学実験の各４回からなる。食品衛生学実験では、大腸菌の生育条件、食品中の生菌数測定、グラム染色、汚染細菌の同定、食品添加物について学ぶ。食品製造加工実験では、伝統的な加工食品（豆腐、ジャム、こんにゃく・フライシュケーゼ・かまぼこ）を製造することを実際に体験し、食品加工工程における食品成分の変化や反応の原理と共に、衛生管理に対する基本姿勢を学ぶ。糖質科学実験では、糖の同定、定量、デンプンの分離、検鏡、糊化、アミラーゼによる加水分解などについて学ぶ。",
        "outcomesMeasuredBy": "食品の製造加工や衛生管理における基礎知識と技術を習得することを目標とする。本実験を通して、食品製造加工における衛生管理と知識に関する実学に基づく専門能力、共同作業によるコミュニケ―ション能力、レポート作成による論理的な思考力、分析・評価能力と問題解決力を得ることができる。レポート返却により到達度をフィードバックする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "実験操作に入る前に、実験内容の基礎事項および実験を行う際の安全に関する注意事項を説明する。説明後は、各グループに分かれて実験操作を行い（グループワーク）、実験後は、実験内容をまとめたレポートを提出するが、内容に不備があるレポートについては、再提出を求めることがある。",
        "notices": "実験への出席およびレポートの提出は必須である。（ただし、病気やけが等でやむを得ず欠席の場合は、追実験を受けることができる。遅刻・欠席する場合、担当教員、実験助手への連絡は必須）実験の際は必ず白衣、保護メガネ等を着用すること。また、微生物を扱う場合は、衛生管理には十分気をつけること。",
        "preparatoryStudy": "実験を行う前にテキストを熟読し、関連事項について必ず予習をすること。実験ノートに実験方法を記載しておくこと。また、実験操作の意味を理解して、実験に臨むこと。（実験を行う前の基礎事項の説明では、内容を理解していることを前提に進める。）",
        "gradingGuidelines": "実験に対する予習（ノートチェック）（30%）およびレポート内容（70%）により評価する。",
        "textbook": "プリント（実験テキスト）を配布する。",
        "referenceMaterials": "「基礎から学ぶ食品化学実験テキスト」谷口・古庄・松本編著、建帛社「食品環境実験50」藤田・山田編、医歯薬出版「食品保蔵・加工学」海老原・関川・大槻編、講談社サイエンテイフィク",
        "courseSchedule": "第1回:食品実験ガイダンス（全教員）第2回:食品衛生学実験：大腸菌の生育条件（安川然太）第3回:食品衛生学実験：食品中の生菌数測定（安川然太）第4回:食品衛生学実験：グラム染色（安川然太）第5回:食品衛生学実験：汚染細菌の同定（安川然太）第6回:食品製造加工実験：豆腐（関洋子）第7回:食品製造加工実験：ジャム（関洋子）第8回:食品製造加工実験：フライシュケーゼ（関洋子）第9回:食品製造加工実験：かまぼこ（関洋子）第10回:糖質科学実験：糖実験１（糖の定量）（永井利治）第11回:糖質科学実験：糖実験２（化学的測定法を用いた糖の同定）（永井利治）第12回:糖質科学実験：デンプン実験１（デンプンの分離、検鏡、糊化）（永井利治）第13回:糖質科学実験：デンプン実験２（デンプンの加水分解）（永井利治）第14回:優秀実験レポート発表会（学部長賞選考会）",
        "courseDataUpdatedAt": "2024\/01\/24"
    },
    "updateAt": "2024\/09\/13"
}