{
    "lectureCode": "B30701",
    "courseName": "化粧品実験Ｉ",
    "lecturer": [
        "柴田雅史(応用生物学部応用生物学科)",
        "前田憲寿(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3",
        "木4",
        "木5",
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "片柳研究所Ｅ５０１"
    ],
    "courceDetails": {
        "courseOverview": "1)化粧品設計実験コロイド界面化学の基礎知識と化粧品設計と製剤化に必要な技術を習得することを目的とする。前半は乳化、洗浄、ゲル化を題材に基礎実験をおこなう。後半は応用として化粧品の設計製造の実践（処方設計）をおこなう。2)化粧品評価実験・美白剤の評価美白剤のチロシナーゼ活性阻害効果と阻害様式の評価方法を学ぶ。・紫外線吸収剤の評価日焼け止め化粧品の効果と紫外線吸収剤の効果の評価方法を学ぶ。",
        "outcomesMeasuredBy": "本実験では、実験作業を通して、化粧品分野についての実学に基づく専門能力をつけることを目指す。またグループ内で結果・考察の議論とレポート作成を通してコミュニケーション能力を、実験結果の解析と処方設計の試行を通して論理的思考能力と分析・評価能力そして化粧品分野の実態に沿った問題解決能力を身につけることを目指す。本実験を履修することで、化粧品の設計・製造および美白剤・紫外線吸収剤の評価のための理論と技術を、実験を通して理解し、身につけることができる。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "【授業形態：実験】数人のグループで実習でおこない、結果および考察をおこなう。（グループワーク）。実験レポートは各自で作成し、提出する。",
        "notices": "実験と講義には必ず出席し、実験のレポートを期限内に提出すること。やむを得ず欠席する場合は、理由を証明する書類を提出すること。グループ単位で実験をおこなうので、協力しあって積極的に作業に取り組むこと。実験ノート、筆記用具、および電卓を各自で準備すること。実験の際は必ず白衣、保護メガネを着用すること。PCを各自持参する。",
        "preparatoryStudy": "実験前にテキストを熟読し、実験手順などをフローチャートにしてノートに記述しておくこと。化粧品設計実験では事前課題があるので、それをノートに解答してから実験に参加すること。",
        "gradingGuidelines": "講義や実験中の取り組み方（予習準備、共同での実験操作や議論への積極的参加、安全への配慮、を確実におこなう）ならびに実験時間中におこなう発表に対する評価を30％、実験結果とそのレポートに対する評価を70％の比率で成績評価をする。実験結果に対するフィードバックは、実験終了後にグループ単位でおこなう。",
        "textbook": "実験テキスト「化粧品実験I」を配布する。",
        "referenceMaterials": "第1回:ガイダンス(柴田、前田)第2回:1)界面活性剤の種類と洗浄性能(柴田)第3回:1)O\/W乳化とW\/O乳化、所要HLB(柴田)第4回:1)乳化法と乳液の性質(柴田)第5回:1)サンスクリーン乳液の設計(柴田)第6回:1)オイルの基本物性(柴田)第7回:1)オイルのゲル化とゲル物性(柴田)第8回:1)口紅スティックの設計：スタート処方とトライアル処方1の調製(柴田)第9回:1)口紅スティックの設計：トライアル処方2と3の調製と処方検討のまとめ(柴田)第10回:2)美白剤のチロシナーゼ活性阻害効果の評価(前田)第11回:2)美白剤のチロシナーゼ阻害様式の評価(前田)第12回:2)日焼け止め化粧品の効果と紫外線吸収剤の分析(前田)第13回:2)紫外線吸収剤の効果の評価(前田)第14回:優秀者発表会(学部長賞選考)（柴田・前田）",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/08\/07"
}