{
    "lectureCode": "B30801",
    "courseName": "化粧品実験ＩＩ",
    "lecturer": [
        "吉田雅紀(応用生物学部応用生物学科)",
        "柴田雅史(応用生物学部応用生物学科)",
        "松井毅(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木3",
        "木4",
        "木5",
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "１）化粧品設計実験本科目は、実験を通してコロイド界面化学の基礎知識と化粧品設計および製剤化に必要な技術を習得することを目的とする。後期の実験では、乳化物、ゲルに次ぐ主要化粧品基剤である粉体製剤を題材に、粉体の調製と粉体化粧料の設計をおこなう。またアイシャドウを題材に調色についての実技をおこなう。2）スキンケア素材の評価スキンケア素材を開発するために使われる細胞での評価方法を習得し、皮膚の構造や皮膚内のメラニンの分布などの化粧品の標的となる対象の症状について知識を高める。無菌操作に加えてメラニン合成系への評価や美白剤評価法を実習する。皮膚色の違いとメラニン顆粒の分布を組織切片と角層で観察することで実際の皮膚での変化を学習する。３）肌状態の評価ヒトの皮膚の状態を判断する上で、測定機器を用いた皮膚の水分量、TEWL、テープストリップによる角層の評価、マイクロスコープによるきめ観察、肌色測定などは皮膚状態を判断する上で非常に重要な情報を得ることができる。これらのデータに対し有意差判定、相関解析、PCA分析などの統計学的手法をRなどのソフトを用いて行い、データから商品開発や肌診断法開発につながる情報を得る方法を学ぶ。",
        "outcomesMeasuredBy": "本実験では、実験作業を通して、化粧品分野についての実学に基づく専門能力をつけることを目指す。またグループ内で結果・考察の議論とレポート作成を通してコミュニケーション能力を、実験結果の解析と処方設計の試行を通して論理的な思考力と分析・評価能力、そして化粧品分野の実態に沿った問題解決能力を身につけることを目指す。本実験を履修することで、化粧品の設計と有効物質評価法の原理を理解して、正確に素早く実験を行い、適切な統計解析とグラフ表示ができ、実験結果を適切に考察できる技術・能力が身につく。また、わかりやすい研究発表ができる技術・能力も身につく。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "【授業形態：実験】1)化粧品設計実験実験は数人がグループを組み、共同作業でおこなう（グループワーク）。実験レポートは各自で作成し、提出する。2)スキンケア素材の評価数人のグループで実習でおこなう（グループワーク）。毎回、レポートを提出する。設備の都合上人員をＡＢ２チームにわけ実習内容をずらした日程でおこなう。",
        "notices": "実験と講義には必ず出席し、実験のレポートを期限内に提出すること。全ての実験に出席しレポートを提出することが単位取得の必須条件である。やむを得ず欠席し、単位取得の為に追実験等を希望する場合は理由を証明する書類を提出すること。グループ単位で実験をおこなうので、協力しあって積極的に作業に取り組むこと。実験ノート、筆記用具、および電卓を各自で準備すること。実験の際は必ず白衣、保護メガネを着用すること。化粧品設計実験ではデータ解析にPCを用いるので持参すること。",
        "preparatoryStudy": "実験前にテキストを熟読し、実験手順などをフローチャートにしてノートに記述しておくこと。化粧品設計実験では事前課題があるので、それをノートに解答してから実験に参加すること。",
        "gradingGuidelines": "講義や実験中の取り組み方（予習準備、共同での実験操作や議論への積極的参加、安全への配慮、を確実におこなうこと）ならびに実験時間中におこなう発表に対する評価を30％、実験結果とそのレポートに対する評価を70％の比率で成績評価をする。実験結果に対するフィードバックは、実験終了後にグループ単位でおこなう。",
        "textbook": "実験テキスト「化粧品実験II」を配布する",
        "referenceMaterials": "",
        "courseSchedule": "第1回:ガイダンス(柴田・吉田・松井)第2回:1)体質顔料の性質・粉体の表面処理(柴田)第3回:1)調色理論と測色(柴田)第4回:1)アイシャドウの調色実習(柴田)第5回:1)粉体化粧料の成型技術・パール顔料の干渉色(柴田)第6回:2)皮膚組織切片による構造/皮膚内メラニン観察、チロシナーゼの抗体染色(吉田・松井)第7回:2)無菌操作の練習と細胞への添加実験および試料回収とタンパク質量評価(吉田・松井)第8回:2)電気泳動とウエスタンブロッティングI(吉田・松井)第9回:2)ウエスタンブロッティングIIと細胞でのメラニン合成評価(吉田・松井)第10回:2)皮膚色・水分量およびTEWLの測定(吉田・松井)第11回:2)角層細胞面積重層剥離の観察(吉田・松井)第12回:2)皮膚表面の観察/TEWL測定/テープストリップによる角層の採取(吉田・松井)第13回:2)皮膚色をベースにした統計解析(吉田・松井)第14回:追実験(柴田・吉田・松井)",
        "courseDataUpdatedAt": "2024/05/10"
    },
    "updateAt": "2024/09/13"
}