{
    "lectureCode": "B30902",
    "courseName": "生命科学実験Ｉ",
    "lecturer": [
        "多田雄一(応用生物学部応用生物学科)",
        "佐藤淳(応用生物学部応用生物学科)",
        "吉田亘(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3",
        "木4",
        "木5",
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本実験では、生命科学の実学に基づく専門能力を身に付けることを目指している。そのために、植物バイオテクノロジーを環境保全や環境モニタリングに適用するための実験操作とその原理、遺伝子の発現量を定量するための実験操作とその原理、タンパク質医薬品の生産のための実験手法を学ぶ。具体的には、植物細胞の融合、光合成速度の測定、DNA鑑定法、がん細胞からのRNAの抽出、逆転写反応、定量PCR、大腸菌を利用したタンパク質生産・精製と活性測定についての知識と各種の実験技法を学ぶ。実験で得られたデータを、ノートPCを使用して解析することで、分析評価能力も身につける。",
        "outcomesMeasuredBy": "本実験では、生命科学についての実学に基づく専門能力を身に付けることを目的とする。また、実験を通して自主的に創意工夫や論理的な考察を行うことで、問題解決力、論理的な思考力、分析・評価能力を養う。さらに、グループ単位での共同実験を通してコミュニケーション能力を養うことを目的とする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1.植物バイオテクノロジー、2.遺伝子工学、3.タンパク質医薬品の3分野についてそれぞれ4回ずつの実験を行い、さらに、それに関連する学習を行う。実験は2～6人程度のグループで行うが、レポートは各人が作成して期限までに提出する。レポートの内容が不充分である場合、再提出を求める場合がある。実験は、信頼できる結果が得られるまで行う。実験は学生が主体的に取り組むアクティブラーニングであるので、よくテキストを予習して積極的に実験に参加して理解を深めること。",
        "notices": "実験への出席および、レポート提出は必須であり、未提出のレポートや実験に欠席の回がある場合には単位が与えられない。ただし、万が一やむを得ない状況により欠席の場合は、必ず欠席について決められた方法でできるだけ早く連絡すること。欠席についての届出のあった者については、事情を審査のうえで追実験または追加の課題を課す。実験の際の白衣、保護眼鏡、名札は必携である。サンダルは禁止する。レポートの盗作を防止するために専用ソフトを使用して類似論文の照合を行うので、紙ベースのレポートの提出に加えてMoodleを利用してレポートのテキストデータをアップロードすること。",
        "preparatoryStudy": "あらかじめ配布された実験テキストをよく読んで、予習課題を実験開始前までに実施しておく。予習状況をスタッフがチェックし、充分でないと判断されると実験ができなかったり、後日の追実験となることがある。実験後には、実験結果についてまとめ、専門書などを参考にして適切な考察を行ってレポートを完成させること。また、テキストの課題に解答すること。",
        "gradingGuidelines": "全ての実験を行い、全レポートを提出したものを対象に、予習課題への取り組み（10％）、実験に対する取り組み（班員と協力しているか、忘れ物の有無など）（10％）、レポートの評価（80％）を総合して行う。予習課題は実験時間中にチェックしてその結果をフィードバックする。レポートの完成度が低い場合には、問題点をフィードバックして再提出を課す。",
        "textbook": "実験テキストを配布する。",
        "referenceMaterials": "特に指定しない",
        "courseSchedule": "第1回：実験の進め方、実験の安全、廃液などの管理、実験の説明（多田雄一、吉田亘、佐藤淳）第2回：植物バイオテクノロジー(1)プロトプラストの単離と融合（多田雄一）第3回：植物バイオテクノロジー(2)光合成速度の測定（多田雄一）第4回：植物バイオテクノロジー(3)DNA鑑定の技術習得（多田雄一）第5回：植物バイオテクノロジー(4)DNA鑑定の実践（多田雄一）第6回：ヒト乳がん細胞株MCF-7とMDA-MB-231からのRNA抽出（吉田亘）第7回：cDNAの合成とRT-PCR（吉田亘）第8回：電気泳動と定量PCR（吉田亘）第9回：電気泳動と定量PCRのデータ解析（吉田亘）第10回：大腸菌で封入体として発現させたGSTヒト融合顆粒球コロニー刺激因子（GST-G-CSF）の可溶化、巻き戻し、精製、濃度測定（佐藤淳）第11回：精製したGST融合ヒト顆粒球コロニー刺激因子（GST-G-CSF）のSDS-PAGEによる解析（佐藤淳）第12回：封入体よりリフォールディングしたGST-G-CSFの活性—Pulldownassayによる可溶性ヒトG-CSF受容体との結合確認（佐藤淳）第13回：ウエスタンブロット法による可溶性ヒトG-CSF受容体Fc融合タンパク質の検出（佐藤淳）第14回：再実験（追実験）およびレポートの解説（多田雄一、吉田亘、佐藤淳）注：実験の順序は変更することがある",
        "courseDataUpdatedAt": "2024\/01\/31"
    },
    "updateAt": "2024\/08\/07"
}