{
    "lectureCode": "B31002",
    "courseName": "生命科学実験II",
    "lecturer": [
        "多田雄一(応用生物学部応用生物学科)",
        "杉山友康(応用生物学部応用生物学科)",
        "吉田亘(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木3",
        "木4",
        "木5",
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "本実験では、生命科学の実学に基づく専門能力を身に付けることを目指している。そのために、微生物バイオテクノロジーを利用した抗菌物質の評価・タンパク質生産・環境モニタリング技術、標的遺伝子のメチル化レベル解析法、核酸医薬と抗がん剤の作用の評価に関する実験技法とその原理を学ぶ。具体的には、大腸菌を用いた抗菌活性の測定や微生物を利用した環境モニタリング、無細胞タンパク合成に関する技術、がん細胞からのゲノムDNAの抽出法、バイサルファイトPCR法、RNA干渉技術と細胞を用いた抗がん剤の評価技術を習得する。実験で得られたデータを、ノートPCを使用して解析することで、分析・評価能力も身につける。",
        "outcomesMeasuredBy": "本実験では、生命科学についての実学に基づく専門能力を身に付けることを目的とする。また、実験を通じて自主的に考えて行動し、結果について論理的な考察を行うことで、問題解決力、論理的な思考力、分析・評価能力を養う。さらに、グループ単位での共同実験を通してコミュニケーション能力を養うことを目的とする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "1.微生物バイオテクノロジー、2.遺伝子工学、3.核酸医薬品の3分野についてそれぞれ4回ずつの実験を行い、さらに、それに関連する学習を行う。実験は2～6人程度のグループで行うが、レポートは各人が作成して期限までに提出する。レポートの内容が不充分である場合、再提出を求める場合がある。実験は、信頼できる結果が得られるまで行う。実験は学生が主体的に取り組むアクティブラーニングであるので、よくテキストを予習して積極的に実験に参加して理解を深めること。",
        "notices": "実験への出席および、レポート提出は必須であり、未提出のレポートや実験に欠席の回がある場合には単位が与えられない。ただし、万が一やむを得ない状況により欠席の場合は、必ず欠席について決められた方法でできるだけ早く連絡すること。欠席についての届出のあった者については、事情を審査の上、追実験または追加の課題を課す。実験の際の白衣、保護眼鏡、名札は必携である。サンダルは禁止する。レポートの盗作を防止するために専用ソフトを使用して類似論文の照合を行うので、紙ベースのレポートの提出に加えてMoodleを利用してレポートのテキストデータもアップロードすること。",
        "preparatoryStudy": "あらかじめ配布された実験テキストをよく読んで、予習課題を実験開始前までに実施しておく。予習状況をスタッフがチェックし、充分でないと判断されると実験ができなかったり、後日の追実験となることがある。実験後には、実験結果についてまとめ、専門書などを参考にして適切な考察を行ってレポートを完成させること。また、テキストの課題に解答すること。",
        "gradingGuidelines": "全ての実験を行い、全レポートを提出したものを対象に、予習課題への取り組み（10％）、実験に対する取り組み（班員と協力しているか、忘れ物の有無など）（10％）、レポートの評価（80％）を総合して行う。予習課題は実験時間中にチェックしてその結果をフィードバックする。レポートの完成度が低い場合には、問題点をフィードバックして再提出を課す。",
        "textbook": "実験テキストを配布する。",
        "referenceMaterials": "特に指定しない。",
        "courseSchedule": "第1回：実験の進め方、実験の安全、廃液などの管理、実験の説明（多田雄一、吉田亘、杉山友康）第2回：微生物バイオテクノロジー(1)ハロー試験：抗生物質や抗菌物質の効果の比較（多田雄一）第3回：微生物バイオテクノロジー(2)藻類生産力試験（AGP）：水質検査と微生物の培養（多田雄一）第4回：微生物バイオテクノロジー(3)微生物の環境応答と遺伝子発現：RNA発現の検出（多田雄一）第5回：微生物バイオテクノロジー(4)無細胞タンパク質合成：試験官内でDNAからタンパク質を合成する（多田雄一）第6回：乳がん細胞株MCF-7とMDA-MB-231からのゲノムDNAの精製とバイサルファイト変換（吉田亘）第7回：バイサルファイト産物の精製、PCR、アガロースゲル作製（吉田亘）第8回：電気泳動、PCR産物の精製、ポリアクリルアミドゲル作製、制限酵素処理（吉田亘）第9回：電気泳動とメチル化レベルの定量（吉田亘）第10回：二本鎖RNA用核酸のDNAシーケンシング（杉山友康）第11回：バイオインフォマティックスを利用した標的遺伝子予測、および二本鎖RNAの機能予測（杉山友康）第12回：ヒトがん細胞の培養の基本操作および抗がん剤の効果（杉山友康）第13回：がん細胞増殖性の半定量的な評価（杉山友康）第14回：優秀実験レポート発表会（学部長賞選考会）（多田雄一、吉田亘、杉山友康）",
        "courseDataUpdatedAt": "2024/01/04"
    },
    "updateAt": "2024/08/07"
}