{
    "lectureCode": "B31101",
    "courseName": "医薬品実験I",
    "lecturer": [
        "佐藤淳(応用生物学部応用生物学科)",
        "杉山友康(応用生物学部応用生物学科)",
        "吉田亘(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実験科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3",
        "木4",
        "木5",
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "本講義では、バイオ医薬品（タンパク質医薬品、核酸医薬品）に関する基礎知識や技術、および遺伝子工学に関する基礎的な実験手法とそのデータ解析を、実験操作を通して修得する。実験とは、ある仮説を証明したり、結論を導いていく上で重要かつ不可欠なプロセスである。正しい結論を導くためには、実験における各操作の意味を正しく理解するとともに、正確な操作技術が必要である。本講義では、タンパク質医薬品実験として、大腸菌による異種タンパク質発現(GFP)、大腸菌で封入体として発現させたGST-ヒト顆粒球コロニー刺激因子(G-CSF)の可溶化、巻き戻し、さらにグルタチオンセファロース担体によるGST-ヒトG-CSFの精製、核酸医薬品実験として、ヒトがん細胞株をモデルとして使用したRNA干渉法による特定の遺伝子発現抑制、遺伝子工学実験として、がん細胞からのRNAの抽出、逆転写反応、定量PCRを行う。",
        "outcomesMeasuredBy": "本実験では基本操作の習得、さらに実験結果についてはレポートとしてまとめ、その結果から考察する実学に基づく専門能力を身に付けることを目指す。具体的には実験操作法、及び操作の意味を習得するとともに、得られた実験結果について考察する論理的な思考力の獲得を目指す。また、実験における各操作を通して、バイオ医薬品、及び遺伝子工学に関する実学に基づく専門能力を身につけ、実験グループ内でのコミュニケーション能力を高め、実験の意義を考えることによる論理的な思考力、さらに得られた結果から分析・評価能力、問題解決力を高めることも目標とする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "【授業形態：実験】実験を行う前に、実験内容の基礎事項、および、実験を行う際の安全に関する注意事項を説明する。実験内容の説明では、予習を前提として、実験に関するクイズを出題し、指名した学生にその回答を求めるアクティブラーニングを実施する。その解答、および関連事項の説明については、講義中に適宜フィードバックする。説明後は、各グループに分かれて実験操作を行う。扱うテーマは、1.タンパク質医薬品（担当佐藤淳）、2.核酸医薬品（担当杉山友康）、3.遺伝子工学（担当吉田亘）の3分野に関するものであり、それぞれ4回ずつ実験を行い、さらに、それに関連する学習を行う。実験は3人程度のグループで行う。実験後は、実験内容をまとめたレポートを提出する。内容に不備があるレポートについては、再提出を求める。",
        "notices": "安全には十分留意の上、授業に参加すること。実験への出席、レポートの提出は必須である。やむを得ず欠席する場合には理由を証明する書類（診断書等）を提出すること。実験の際の白衣、名札（各自で用意）と保護眼鏡（実験室に用意あり）は必携である。レポートの盗作を防止するために、専用ソフトを使用してオンライン上にあるあらゆる表現、提出された全レポートを対象とした類似文章、内容の照合を行うので、紙ベースのレポートの提出に加えて、レポートのテキストデータのアップロードを行うこと。",
        "preparatoryStudy": "本講義で扱う実験は専門性が高いので、実験を行う前にテキストを熟読し、関連事項について必ず予習をすること。予習状況については毎回実験講師、あるいはTAによるチェックを行う。また、実験操作の意味、安全事項をよく理解して、実験に臨むこと。実験を行う前の基礎事項の説明では、テキストを熟読し、ある程度内容を理解していることを前提に進めていくので注意すること。",
        "gradingGuidelines": "出席を前提として、予習状況15%、授業への参加積極度（授業での発言、実験への積極性など）5%、レポート80%で判断する。全実験に出席して、レポートを提出することが単位取得の必要条件である。",
        "textbook": "プリントを配布する。",
        "referenceMaterials": "なし",
        "courseSchedule": "第1回講義ガイダンス（担当佐藤淳、杉山友康、吉田亘）第2回（担当佐藤淳）:大腸菌で発現させた緑色蛍光タンパク質(GFP)の抽出、GSTヒト融合顆粒球コロニー刺激因子（GST-G-CSF）の大腸菌での発現第3回（担当佐藤淳）:SDSポリアクリルアミドゲル電気泳動(SDS-PAGE)による発現GFPの解析、GSTヒト融合顆粒球コロニー刺激因子（GST-G-CSF）発現大腸菌の集菌第4回（担当佐藤淳）:大腸菌で封入体として発現させたGSTヒト融合顆粒球コロニー刺激因子（GST-G-CSF）の可溶化、巻き戻し、精製、濃度測定第5回（担当佐藤淳）:精製したGST融合ヒト顆粒球コロニー刺激因子（GST-G-CSF）のSDS-PAGEによる解析第6回（担当杉山友康）：ヒトがん細胞培養の基本操作、および二本鎖RNA導入第7回（担当杉山友康）：RNA干渉した細胞の蛍光顕微鏡観察と蛍光画像解析、および細胞からのタンパク質抽出第8回（担当杉山友康）：遺伝子発現抑制を評価するためのタンパク質電気泳動と、ウェスタンブロッティング第9回（担当杉山友康）：ウェスタンブロッティングの検出と画像解析第10回（担当吉田亘）：ヒト乳がん細胞株MCF-7とMDA-MB-231からのRNA抽出第11回（担当吉田亘）：cDNAの合成とRT-PCR第12回（担当吉田亘）：電気泳動と定量PCR第13回（担当吉田亘）：電気泳動と定量PCRのデータ解析第14回まとめ（担当佐藤淳、杉山友康、吉田亘）",
        "courseDataUpdatedAt": "2024/01/30"
    },
    "updateAt": "2024/09/13"
}