{
    "lectureCode": "B31402",
    "courseName": "バイオプロセス工学",
    "lecturer": [
        "松井徹(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "火4"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ２０２"
    ],
    "courceDetails": {
        "courseOverview": "バイオプロセス工学は、生物機能を活用した有用物質生産などを産業利用するための実践的科目である。具体的には、１）生物機能に特徴的な技術（酵素反応、遺伝子工学など）の理解２）実験室で得られた生物機能に関する知見を中規模、大規模で再現する（スケールアップ）ための基本的な考え方３）生物機能を活用した産業プロセスの全体像（バイオプロセス）の理解を目的とする。各種産業分野（化粧品、食品、医薬品、環境）での実用化例や実務経験についても可能な限り解説を行う。",
        "outcomesMeasuredBy": "この科目では，生物機能を産業利用するにあたって留意すべき知識に関する実学に基づく専門能力を育成するとともに，バイオプロセス工学における工学的技術、手法の解説を実施することで分析・評価能力を高めることを目標としている。さらに，試験問題として生物機能やスケールアップに関する記述問題、計算問題等を出題することによって論理的な思考力を有する者に単位を与えている。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "講義を中心に、授業を進める。講義に加えて、授業の内容をより深く理解するため、以下の内容についても実施することがある。理解を深めるためアクティブラーニングとして授業中に練習問題や演習問題を出す場合がある。・小レポート。・PC（エクセルなど）を活用したデータ解析・インターネット上の計算サイトを活用したバイオインフォマティクス（グループワーク）Moodleなどを通じて前回課題のフィードバックを行う。",
        "notices": "前もって履修が必要な科目は設定していないが，微生物学，生化学、分子生物学などについての講義，あるいは，実験を経験していると理解が容易である。・2年生の履修も可。",
        "preparatoryStudy": "シラバス「予習」欄の教科書範囲を参照し、不明な用語等については、あらかじめ調べておくと共に不明点を整理しておく。配布資料と講義内容のノートを整理する、小レポート内容を見直すことで復習を行う。教科書の指定部分を自宅で読み、理解して授業に臨むこと（授業ではその振り返りやディスカッションを行う反転授業）。",
        "gradingGuidelines": "授業への出席を前提として、期末試験（４0％），理解度チェック（４0％），授業中に課す小テストおよび提出物等（２0%））を総合して評価する。",
        "textbook": "生物化学工学の基礎（コロナ社）3300円松井徹、徳田宏晴、上田誠、黒岩崇、武田穰",
        "referenceMaterials": "生物化学工学基礎のきそ（日刊工業新聞社）、基礎から学ぶ生物化学工学（コロナ社）、生物反応工学（産業図書社）、新版生物化学工学（講談社サイエンティフィク）",
        "courseSchedule": "第1回：ガイダンス、生物化学工学とは第2回：生体触媒の特性（酵素の特異性、多様性など）第3回：バイオプロセスとバイオリアクター（各種装置の特徴など）第4回：酵素反応速度論（Michaelis-Menten式、酵素阻害様式など）第5回：増殖の動力学（単細胞生物の増殖について）第6回：酵素バイオリアクター（各分野実用化例など）第7回：微生物バイオリアクター（機能化学品生産など）第8回：各種生物の培養（動物植物細胞など）第9回：講義の理解度チェック第10回：バイオプロセスの操作要素（滅菌操作等）第11回：バイオプロセスの操作要素（酸素移動速度等）第12回：バイオプロセスの実際（遺伝子解析演習等）第13回：バイオプロセスの実際（実用化例）第14回：バイオプロセスの実際（これからのバイオプロセス）",
        "courseDataUpdatedAt": "2025/01/05"
    },
    "updateAt": "2025/03/21"
}