{
    "lectureCode": "B31801",
    "courseName": "植物細胞工学",
    "lecturer": [
        "多田雄一(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "植物細胞工学とは植物バイオテクノロジーとも言い換えることが可能で、バイオテクノロジーを活用した植物の改良、すなわち分子育種である。人類は古くから植物を食糧としてだけでなく、エネルギー、衣服、住居、道具の材料として活用しており、近年では地球環境を保全する重要な要素としての認識も高まっている。本講義では、植物の優れた機能を細胞・遺伝子レベルで学び、さらにそれらの機能を向上させて利用するために必要な基本的な細胞生物学・生化学・遺伝子工学の知識と技術について解説する。また、近年増加している遺伝子組換え植物の実用化・研究例についても解説する。毎回の授業の最後に行う課題では、創造力や論理的な思考力を養う問題も含まれている。担当教員が三井化学（株）において、植物バイオテクノロジーを利用した種苗の開発に従事した実務経験に基づき、大学で学ぶ基礎的な技術や知識が実際の製品開発にどのように利用されているかについて解説する実践的科目である。",
        "outcomesMeasuredBy": "本講義では、植物細胞工学についての実学に基づく専門能力と論理的な思考力を身に付けることを目指す。分子生物学や遺伝子工学で学んだ知識や技術が植物を利用する産業にどのように応用されているかを理解するとともに、身近で利用されている組換え植物についても正しく理解する。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "講義形式で行なう。指名-回答-解説形式のアクティブラーニングを取り入れた授業を行う。Moodleを使用した理解度チェック問題を授業中に行って理解度を確認する。そのため、ノートPC、またはスマートフォンを使用する。授業の最後に演習課題を解かせて提出させる場合もある。",
        "notices": "「分子生物学Ⅰ、Ⅱ」と「細胞生物学」を受講済みであることが望ましい。",
        "preparatoryStudy": "予習と復習をすること。予習として、Moodle上の各回の授業資料を参照しながら、対応する教科書の章を読んで理解しておくこと。復習として、授業内で行ったMoodle上の理解度チェック問題の解答を確認するとともに、教科書の各章末にある演習問題を解いておくこと。",
        "gradingGuidelines": "出席を前提として、期末試験（70％）と毎回の講義中に行う理解度チェックや演習課題（30％）の結果をもとに評価する。理解度チェックの解説はその授業時間中にフィードバックを行う。",
        "textbook": "改訂版植物細胞遺伝子工学多田雄一三恵社定価￥2200",
        "referenceMaterials": "必要に応じて指示する。",
        "courseSchedule": "第1回：講義概要植物の細胞工学と遺伝子工学第2回：植物細胞工学クローン、細胞融合と培養細胞を利用した物質生産第3回：植物遺伝子工学植物を分子育種するための遺伝子工学の知識と技術第4回：初期の組換え作物と生産性除草剤・害虫耐性、生産性に関する組換え作物第5回：非生物的ストレス非生物的ストレス耐性の植物の開発第6回：生物的ストレス生物的ストレス耐性の植物の開発第7回：花色の改良花色の分子育種第8回：成分の改良植物中の成分を改変する第9回：健康に役立つ植物健康の保持・増進に役立つ植物の分子育種第10回：形態の改良植物の形態を改良する第11回：光合成光合成能力を改良する第12回：環境の浄化・修復環境を浄化・修復する植物の分子育種第13回：資源・エネルギー資源・エネルギーとなる植物の分子育種第14回：組換え植物の安全性組換え植物の環境に与える影響と食品としての安全性",
        "courseDataUpdatedAt": "2024\/02\/01"
    },
    "updateAt": "2024\/08\/07"
}