{
    "lectureCode": "B31901",
    "courseName": "食品製造学",
    "lecturer": [
        "関洋子(応用生物学部応用生物学科)",
        "西野智彦(応用生物学部応用生物学科)",
        "安川然太(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月4"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "我々の豊かな食生活は、多種多様な食品が安定して供給されることによって支えられている。大量に流通するこれらの食品が「どのような過程を経て製造されているのだろう？」と考えたことがあるだろうか？食品の製造過程とは、出発食材の生産からはじまり、食材の加工から保存までを含む。食品製造学はこれらの過程を科学的に理解するための学問領域であり、この科目を履修することによって得られた知識や情報は良質な食品を製造するために重要なものとなる。本講義では、多岐にわたる食品の中から日常生活で親しみのある代表的な食品を取り上げ、その食品学的・栄養学的性質や分類、一連の製造過程（生産、加工、保存）について、科学的な視点から解説する。本講義は、各教員が企業で食品開発研究・製造に従事した実務経験に基づき、食品開発・食品製造・食品衛生検査など市販製品に密接に関連した事柄を実例を交えて解説する実践的科目である。",
        "outcomesMeasuredBy": "食品製造学を受講することによって、以下の３つの能力が身につくことを期待する。①分析・評価能力：食品の性質や分類、生産から加工、保存に関する知識を幅広く学習することにより、食品の品質を客観的に分析・評価することができる。②問題解決力：食品の製造過程で生じる問題の解決策を提案することができる。また、食品製造に関する疑問に対して、科学的な根拠を示して適切に回答を述べることができる。③実学に基づく専門能力：本講義では食品製造現場において蓄積された情報を科学的に解説する。これらの情報は、食品成分を利用する分野（化粧品、生命科学、環境、医薬品など）においても有用となりえる。また、これらの専門能力は卒業研究を遂行する際に役立てることができる。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力問題解決力",
        "teachingMethod": "講義形式で行う。説明にはパワーポイントを使用する。毎回、講義で使用する資料をMoodleに掲載する。また、本講義では、知識の定着を図るため、授業内で演習課題に取り組む。本講義ではノートPCは必携ではないがMoodleを利用することが出来るようにスマートフォン等を持ってくること。",
        "notices": "本講義の受講によって食品製造に関する知識を十分に得ることができるが、生物化学Ⅰや生物化学Ⅱ、食品関連の科目も受講しておくと理解がより深まると考えられる。授業中はスライド・説明内容の要点をノートにメモし、帰宅後に授業内容を完全に再現できるようにすること。",
        "preparatoryStudy": "講義前までにその日の講義に関する内容を参考書やインターネットで調べておく。また資料が事前にMoodleにアップロードされる場合は、資料を用いて次回の講義内容を予習しておく。PDF資料に記されている内容や語句は、参考書やインターネットを使用して学習しておくこと。また、講義直後は「学習した内容をよく理解できた」と錯覚してしまう傾向があるため、復習によって知識の定着を図ることが重要である。そのため、講義内で行う演習課題やノートを見直して復習することで、知識の定着を図る。",
        "gradingGuidelines": "毎回の講義で行う演習課題（20%）、理解度確認（第1回から第7回の内容：40%）、定期試験（第9回から第14回までの内容：40％）により、総合的に評価する。100点満点中60点以上で単位認定とする。なお、演習課題の解説は講義内で、理解度確認や定期試験の結果はMoodle内でフィードバックする。",
        "textbook": "使用しない。アップロードする資料に沿って講義を行う。",
        "referenceMaterials": "食品加工・保蔵学栄養科学シリーズNEXT講談社食品加工貯蔵学新スタンダード栄養・食品シリーズ東京化学同人栄養科学イラストレイテッド食品学Ⅰ羊土社栄養科学イラストレイテッド食品学Ⅱ羊土社",
        "courseSchedule": "第1回：イントロダクション(ガイダンス)（食品製造学とは）(西野)第2回：乳の加工①（生乳の成分、製造、乳製品の分類）(西野)第3回：乳の加工②（粉乳、クリーム、バター、発酵乳）(西野)第4回：肉の加工①（食肉の成分、分類、牛肉）(西野)第5回：肉の加工②（豚肉、鶏肉、食肉加工品）(西野)第6回：豆類・大豆の加工(安川)第7回：小麦、米、とうもろこしと粉の加工(安川)第8回：卵の加工と乳化(安川)第9回：野菜の加工(関)第10回：果物の加工(関)第11回：魚、海藻の加工(関)第12回：油脂、調味料、嗜好飲料(関)第13回：食品の加工、保存、流通、包装(関)第14回：食品の表示と規格、HACCP等(関)",
        "courseDataUpdatedAt": "2024/02/02"
    },
    "updateAt": "2024/08/07"
}