{
    "lectureCode": "B32101",
    "courseName": "食品微生物学",
    "lecturer": [
        "西野智彦(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ４０３"
    ],
    "courceDetails": {
        "courseOverview": "古来より、人間は微生物を利用して食品や有用物質などを製造している。本講義では、食品製造にかかわる微生物について説明する。前半は、発酵の定義、食品製造に関係する微生物の種類、食品の腐敗とその対策について説明する。後半は、酒類、乳製品などの代表的な発酵食品の製造法や微生物を利用した有用物質生産例について説明する。本講義は、ヤクルト本社で発酵乳製造に関する研究に従事した実務経験に基づき、食品開発・食品製造・食品衛生検査など市販製品に密接に関連した事柄を実例を交えて解説する実践的科目である。",
        "outcomesMeasuredBy": "授業項目を学ぶことによって、微生物や微生物によって生産される物質が私たちの生活に深く関わっていることを知り、生命科学についての実学に基づく専門能力を身に付けることを目指す。発酵食品の製造、微生物を用いた薬品や化粧品原料などの生産、日常生活と食品製造現場における衛生管理などに必要な知識を身につける。発酵食品製造や食中毒発生における微生物の挙動を考察する課題に取り組むことで、論理的な思考力を育成する。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "教科書とPDF資料を中心に講義形式で行う。適宜、課題に取り組むことで理解到達度を確認する。対面形式の講義の場合、ノートPCは必携ではないがMoodleを利用することが出来るようにスマートフォン等を持ってくること。",
        "notices": "「微生物学」を履修していることを前提に講義を進める。講義中はスライドの要点をノートに簡潔にメモし、帰宅後に授業内容を再現できるようにすること。",
        "preparatoryStudy": "Moodleで見ることのできるPDF資料は講義前に各自ダウンロードし、その内容に関する教科書の部分を講義前に読んでおくこと。高校で生物を選択していない学生、「微生物学」の成績が思わしくなかった学生は十分な予習をすること。講義後は教科書とPDF資料とノートを読んで復習を行うこと。",
        "gradingGuidelines": "毎回の出席を前提に、講義中に提示する課題10％、理解到達度の確認30％、期末試験60％で評価する。課題・理解到達度の確認に対するフィードバックは講義中あるいはMoodle上で行う。",
        "textbook": "「微生物学」青木健次編著化学同人",
        "referenceMaterials": "「発酵食品学」小泉武雄著講談社「図解食品衛生学第5版」一戸正勝ら編講談社「食品微生物学の基礎」藤井建夫編著講談社「新版ビギナーのための微生物実験ラボガイド」中村聡ら著講談社",
        "courseSchedule": "第1回:講義の概要、発酵の定義、発酵に関係する微生物第2回:微生物の構造と微生物を用いた有用物質の生産第3回:通気が微生物の代謝に及ぼす影響第4回:食品の腐敗と防止方法第5回:食中毒の発生状況と食中毒原因菌の種類１第6回:食中毒原因菌の種類２、食品衛生の考え方、食品の殺菌方法第7回:理解度到達度の確認第8回:アルコール発酵１：アルコール発酵の歴史と糖化の重要性、ワインの醸造法第9回:アルコール発酵２：清酒の醸造法第10回:アルコール発酵３：ビールの醸造法、蒸留酒の製造法第11回:乳酸発酵第12回:有用物質の生産１：有機酸発酵、アミノ酸発酵第13回:有用物質の生産２：核酸発酵、抗生物質、酵素生産第14回:さまざまな発酵食品：醤油、酢、納豆など",
        "courseDataUpdatedAt": "2024\/02\/01"
    },
    "updateAt": "2024\/08\/07"
}