{
    "lectureCode": "B32301",
    "courseName": "皮膚科学",
    "lecturer": [
        "吉田雅紀(応用生物学部応用生物学科)",
        "松井毅(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木2"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ４０２"
    ],
    "courceDetails": {
        "courseOverview": "皮膚科学の基礎知識と化粧品の機能との関連について理解し、卒業研究および化粧品関連業務に携わる上で必須の美容皮膚科学の基礎知識を習得することを目的とした実践的科目として開講する。まず、皮膚の基本的な構造と役割、機能について解説する。その後、化粧品開発の実務経験から必要と考えられた項目として皮膚の保湿、皮膚色および老化による形態の変化や疾病に関係する皮膚内部の現象を選択して解説し、皮膚表面に現れてくる変化や症状との因果関係について解説する。また、皮膚は環境からの影響を強く受けることから低湿度や太陽光線が皮膚の変化に及ぼす作用とそのメカニズムについて解説する。",
        "outcomesMeasuredBy": "本講義では、学生が皮膚科学の基礎知識と化粧品の機能との関連性についての実学に基づく専門能力を身に付けることを目指す。皮膚の基本的な構造、機能および年齢による変化や外的因子により誘導される変化とその変化を誘導する作用機序について理解し、皮膚有用性を実現するための研究テーマの創出による論理的な思考力、機能性化粧品コンセプトの立案と化粧品による改善効果の評価方法が立案できるよう問題解決力の基盤を身に付けることを達成目標とする。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "パワーポイント資料、配布プリント、板書を併用して授業を行う。理解度を高める目的で授業内容についての小テストを行い、解答のフィードバックは次の回の授業内で解説とともに行う。出席および課題でPCを使用するためPCは必携。",
        "notices": "細胞に関する基礎知識および脂質の構造等の基礎知識を履修にあたり、復習して置くこと。",
        "preparatoryStudy": "毎回の授業前において全体の内容を含むプリントをMoodleで公開する。また、穴あき資料を公開するので、あらかじめ印刷等して穴埋めをしながら授業を受ける準備をする。",
        "gradingGuidelines": "中間理解度チェックテスト・期末定期試験70%、課題点30%（出席を前提として授業後に課す理解度チェック用小問題）にて総合的に評価する。",
        "textbook": "各講義時に配布した書類を教科書とする",
        "referenceMaterials": "化粧品の効能を考える時に読む皮膚科学（正木仁著：技術教育出版社）あたらしい皮膚科学（清水宏著：中山書店）美容皮膚科学(南山堂）保湿・美白・抗シワ・抗酸化評価・実験法マニュアル（フレグランスジャーナル社）あたらしい美容皮膚科学（監修日本美容皮膚科学会、南山堂）",
        "courseSchedule": "第1回：皮膚科学総論（皮膚の構造と付属器）（松井毅）第2回：表皮の分化・角化（松井毅）第3回：角層形成のプロセス（松井毅）第4回：表皮のバリア（松井毅）第5回：表皮ターンオーバーと恒常性（松井毅）第6回：皮膚疾患にともなう表皮構造や機能変化（松井毅）第7回：中間理解度チェックテスト（松井毅）第8回：皮脂分泌の機構およびニキビの症状（吉田雅紀）第9回：太陽光線と皮膚傷害紫外線と酸化ストレス（吉田雅紀）第10回：太陽光線のもたらす皮膚の機能と外見の老化様変化（光老化）（吉田雅紀）第11回：光老化に伴う真皮代謝の変化（吉田雅紀）第12回：太陽光線のもたらす色素沈着およびメラニンの生成経路（吉田雅紀）第13回：光老化にともなう色素生成異常症／各種化粧品の効能と標的（吉田雅紀）第14回：各種化粧品の開発標的について（吉田雅紀）",
        "courseDataUpdatedAt": "2024\/01\/08"
    },
    "updateAt": "2024\/09\/13"
}