{
    "lectureCode": "B32401",
    "courseName": "機能性食品学",
    "lecturer": [
        "安川然太(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月4"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "食品には栄養機能、感覚機能、生体調節機能があるとされる。この内、生体調節機能に関わるのが機能性食品(functionalfoods)である。現代は「飽食の時代」と言われており、病気を予防する食品が求められるようになった。機能性食品は「生理系統（免疫、代謝、分泌、神経、循環、消化）の調節によって病気の予防、治癒に寄与する新食品」と定義される。講義では食品及びその素材に含まれる様々な生理機能を有する成分について、その化学的性質や生体調節作用について解説する。食品、食品成分に機能性を表示することを可能とする制度が保健機能食品制度である。健康増進法、食品表示法に基づき、特定保健用食品、栄養機能食品、機能性表示食品制度がある。これらの制度について概説する。その上で、自身が興味を持つ保健機能食品について調査し、まとめる。本科目は、担当教員が企業で機能性食品の開発研究に従事した実務経験も踏まえ、機能性表示食品、特定保健用食品の開発について具体例を交え解説する実践的科目である。",
        "outcomesMeasuredBy": "本講義では、食品分野における食品の機能性についての実学に基づく専門能力を身に付けることを目指す。主要栄養素の各種機能について理解を深め、機能性食品による病気の予防、治癒について理解できる事を目標とし、論理的な思考力を養成する。食品成分の働きならびに食品成分の変化や相互作用を理解し、さらに、それらが及ぼす影響について分析・評価能力が理解できる事を目標とする。教授された知識を活用して、新たな機能性食品や医薬品などの開発に発展できる問題解決力を養う。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義形式で授業を行う。講義前半（第1回～第9回）ではパワーポイントを用いる。ノートPCを用いて当該授業の内容を記録することは差支えない。毎回Moodleを用いたアンケートや確認テストを行うのでPCもしくはスマートフォンを持参すること。講義後半（第10回～第14回）では上市されている機能性食品について調査する。調査結果をまとめるため、ノートPCを持参すること。",
        "notices": "授業前半ではスライドの要点を簡潔にメモし、授業後半に取り組む課題に対応できるようにしておくこと。",
        "preparatoryStudy": "市場に出ている機能性食品（健康食品）にはどの様な種類があるかを調査する。基本的に教科書のページ順に解説していくので、予習としては教科書を熟読しておく。復習としては講義で示された重要ポイントを再確認する。",
        "gradingGuidelines": "授業前半の講義中に行うアンケートや確認テストの取り組み20％、授業後半の課題の取り組み40%、期末テスト40%により評価する。各取り組みに対するフィードバックは授業内で実施する。",
        "textbook": "三共出版わかりやすい食品機能学第2版編著森田英利・田辺創一2022年発行",
        "referenceMaterials": "コロナ社機能性食品学著者今井伸二郎2020年発行",
        "courseSchedule": "第1回：機能性食品学概要（食品の役割、機能性食品の位置づけ）第2回：糖、ミネラルの吸収を制御する食品成分第3回：脂質代謝の吸収を制御する食品成分第4回：腸内環境に影響を与える食品成分第5回：骨、歯の健康と関わる食品成分第6回：抗疲労成分、抗酸化成分第7回：食品成分の循環系、神経系への作用第8回：免疫系に作用する食品成分第9回：食品表示制度第10回：機能性食品の調査（１）第11回：機能性食品の調査（２）第12回：機能性食品のまとめ、調査結果の発表（１）第13回：機能性食品の調査結果の発表（２）第14回：機能性食品の調査結果の発表（３）",
        "courseDataUpdatedAt": "2024\/02\/01"
    },
    "updateAt": "2024\/08\/07"
}