{
    "lectureCode": "B32401",
    "courseName": "機能性食品学",
    "lecturer": [
        "安川然太(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月4"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ３０３"
    ],
    "courceDetails": {
        "courseOverview": "現代社会では、単なる栄養摂取を超えて、健康維持や疾病予防に役立つ食品への関心が高まっています。本講義では、食品が持つ三つの機能（栄養機能、感覚機能、生体調節機能）のうち、特に生体調節機能に着目し、機能性食品（functionalfoods）について学びます。機能性食品とは、免疫、代謝、分泌、神経、循環、消化などの生理系統を調節することで、疾病予防や健康増進に寄与する食品です。講義では、様々な食品素材に含まれる機能性成分について、その化学的特性と生体への作用メカニズムを解説します。また、日本における保健機能食品制度（特定保健用食品、栄養機能食品、機能性表示食品）について、健康増進法や食品表示法に基づく規制や認証プロセスを学びます。授業の一環として、受講生は各自が興味を持つ保健機能食品について調査研究を行い、その成果をまとめます。本科目の担当教員は、企業での機能性食品開発の実務経験を有しています。この経験も含め、機能性表示食品や特定保健用食品の開発プロセスについて、具体的な事例を交えながら解説する実践的科目です。",
        "outcomesMeasuredBy": "本講義の到達目標は以下の4つの能力の修得です：【実学に基づく専門能力】・食品の三大機能（栄養機能、感覚機能、生体調節機能）の特徴と相互関係を説明できる・保健機能食品制度の仕組みと各制度（特定保健用食品、栄養機能食品、機能性表示食品）の特徴を理解し、具体例を挙げて説明できる・主要な機能性食品素材について、その化学的特性と生理作用のメカニズムを説明できる【論理的な思考力】・食品の機能性に関する科学的エビデンスを理解し、その妥当性を論理的に考察できる・機能性食品による疾病予防や健康維持のメカニズムを、生化学的・生理学的観点から説明できる【分析・評価能力】・食品成分間の相互作用や体内での変化について、科学的に分析・評価できる・機能性表示の妥当性や安全性について、科学的根拠に基づいて評価できる・市場に流通している機能性食品について、その有効性と安全性を客観的に評価できる【問題解決力】・習得した知識を活用して、新たな機能性食品の開発に向けた課題を見出し、その解決策を提案できる・消費者ニーズや社会的課題を踏まえて、機能性食品の開発戦略を立案できるこれらの目標達成を通じて、将来の機能性食品開発や研究に携わるための基礎的な能力を身につけることを目指します。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本講義は、理論的理解と実践的な調査研究を組み合わせた形式で実施します。【前半（第1回～第9回）：基礎知識の習得】・パワーポイントを用いた講義形式で実施します・各回の講義では、機能性食品の基礎知識、制度、開発事例などについて解説します・講義内容の理解度を確認するため、Moodleを用いた小テストやアンケートを実施します・実例を用いたディスカッションも適宜取り入れ、主体的な学びを促進します【後半（第10回～第14回）：実践的調査研究】・市場に流通している機能性食品について、グループまたは個人で調査研究を行います・調査内容には、製品の特徴、機能性表示の根拠、市場での位置づけなどを含みます・調査結果をレポートにまとめ、プレゼンテーションを行います・相互評価を通じて、多角的な視点での理解を深めます【必要な準備物】・教科書、ノートPC（講義内容の記録、調査研究、レポート作成に使用）・スマートフォンまたはノートPC（Moodleでの小テスト・アンケート回答用）【学習支援】・講義内容は主に教科書に基づきます。・講義資料の一部はMoodleを通じて提供します・質問や相談は講義終了後に随時受け付けます・調査研究の過程で必要な指導・助言を適宜行いますアクティブラーニングの要素を取り入れることで、知識の定着と実践的スキルの向上を目指します。",
        "notices": "【授業への取り組み方】・講義前半（第1回～第9回）では、スライドの要点を簡潔にメモし、重要なポイントを整理してください・板書やスライドの単なる書き写しではなく、教員の説明や補足情報も含めて記録することが重要です・理解が不十分な点は、不十分なままにせず質問してください【課題への準備】・講義後半（第10回～第14回）の調査研究に向けて、前半の講義内容を十分に復習しておきましょう・日頃から機能性食品に関する新聞記事やニュースに関心を持ち、情報を収集する習慣をつけましょう・調査研究では、信頼性の高い情報源（学術論文、公的機関の報告書等）を活用してください【授業参加に関する注意】・毎回の小テストやアンケートは、成績評価の要素となります。必ず参加してください・遅刻や早退は他の受講生の学習を妨げる可能性があるため、特別な事情がある場合は事前に連絡してください【機器の使用について】・ノートPCやスマートフォンは、授業に関係のない用途での使用は避けてください・講義資料の撮影や録音は、著作権や肖像権の観点から原則禁止とします主体的な学習姿勢を持ち、積極的に授業に参加することで、より深い理解と実践的なスキルの習得が可能となります。",
        "preparatoryStudy": "市場に出ている機能性食品（健康食品）にはどの様な種類があるかを調査しておきましょう。基本的に教科書のページ順に解説していくので、予習としては教科書を熟読しておいてください。復習としては講義で示された重要ポイントを再確認すると良いです。授業の理解を深めるため、基礎的な生化学、生理学の知識を確認しておくことを推奨します。シラバスに示された各回の内容について、事前に関連する用語や概念を調べておきましょう。",
        "gradingGuidelines": "授業前半の講義中に行うアンケートや確認テストの取り組み20％、授業後半の課題の取り組み30%、期末テスト50%により評価する。各取り組みに対するフィードバックは授業内で実施する。",
        "textbook": "三共出版わかりやすい食品機能学第2版編著森田英利・田辺創一2022年発行",
        "referenceMaterials": "コロナ社機能性食品学著者今井伸二郎2020年発行",
        "courseSchedule": "第1回：機能性食品学概要（食品の役割、機能性食品の位置づけ）第2回：糖、ミネラルの吸収を制御する食品成分第3回：脂質代謝の吸収を制御する食品成分第4回：腸内環境に影響を与える食品成分第5回：骨、歯の健康と関わる食品成分第6回：抗疲労成分、抗酸化成分第7回：食品成分の循環系、神経系への作用第8回：免疫系に作用する食品成分第9回：食品表示制度第10回：機能性食品の調査（１）第11回：機能性食品の調査（２）第12回：機能性食品のまとめ、調査結果の発表（１）第13回：機能性食品の調査結果の発表（２）第14回：機能性食品の調査結果の発表（３）",
        "courseDataUpdatedAt": "2025/01/31"
    },
    "updateAt": "2025/03/21"
}