{
    "lectureCode": "B32901",
    "courseName": "再生細胞医薬概論",
    "lecturer": [
        "杉山友康(応用生物学部応用生物学科)",
        "西良太郎(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ２０２"
    ],
    "courceDetails": {
        "courseOverview": "多能性幹細胞の研究のきっかけは、がん研究です。そのがん基礎研究の成果として、培養可能な胚性幹細胞株が樹立され、人工多能性幹細胞(iPS)細胞株が開発されました。これらの細胞株の大きな特徴は様々な種類の細胞を人工的に作製可能にしたことです。この成果の下、現在は基礎と応用、異分野を融合した新しい医療（これらの細胞由来の分化した細胞そのものを医薬品として利用するもの）が創製されようとしています。本講義では、バイオケミカル事業の実務経験のある担当教員から幹細胞の発生生物学的、細胞生物学的な基礎は、再生医療の応用に欠かせない知識であること及び、両者の基盤技術が近いことを学び、将来の再生医療製品の研究・開発につながる実践的科目として将来の再生医療の進んだ社会についての理解を深めます。",
        "outcomesMeasuredBy": "本講義では再生細胞医薬についての実学に基づく専門能力を身に付けることを目指します。その専門能力とは具体的に以下のことを示します。さらに再生細胞医薬についての実学に基づいた専門力、および論理的な思考力を育成することを目標としています。（１）幹細胞について説明できる（２）細胞を医薬品として扱うことの課題を説明できる",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "【授業形態：講義】ノートPCまたはスマートフォンは必携です。出席管理や各種の理解度チェック等に利用します。講義は講義資料に関連するパワーポイントを用いて、指名ー回答―解説を適時行うアクティブラーニングのスタイルで進行します。またMoodle等を利用したチェック課題等を指定の時間中に行い、各学生はこの結果を授業の理解度の確認に利用します。またMoodleをレポート等の提出に使用します。第1－7回担当：西、第8－14回担当：杉山。",
        "notices": "生命科学III、および細胞生物学の単位を取得済みであることが望ましい。",
        "preparatoryStudy": "予習：事前にMoodleに講義資料がアップロードされている場合は、講義資料をダウンロードして印刷、あるいはダウンロードした資料を講義中に閲覧できるようにしてください。その中にある専門用語については意味を事前に調べてください。また各回、事前に指定する教科書の該当ページを読んできてください（授業では理解度を確認する反転授業を行う）。復習：毎回の授業で行われるMoodle等の理解度チェックについて、授業後のその日の内に再確認してください。",
        "gradingGuidelines": "毎回の講義の課題、クイズ、レポート、グループワーク（30%）、講義内容の理解度中間チェックや期末試験（70%）の合計で評価します。レポート課題や講義中の小課題は、Moodleなどを通じてフィードバックを行います。",
        "textbook": "幹細胞と再生医療（丸善出版）中辻憲夫著000円+税",
        "referenceMaterials": "幹細胞研究と再生医療（南山堂）中内啓光編5600円+税バイオ医薬品と再生医療（中山書店）乾賢一監修4800円+税幹細胞技術の標準化（日本規格協会）堀友繁監修2300円+税もっとよくわかる！幹細胞と再生医療（羊土社）長船健二著3800円+税",
        "courseSchedule": "第1回：多能性幹細胞の研究の歴史・・・（西良太郎）第2回：ヒトの発生過程とゲノムDNA・・・（西良太郎）第3回：幹細胞の基礎・・・（西良太郎）第4回：組織幹細胞の特徴・・・（西良太郎）第5回：多能性幹細胞株の特徴（１）ES細胞とiPS細胞・・・（西良太郎）第6回：多能性幹細胞株の特徴（２）有用性と課題・・・（西良太郎）第7回：幹細胞の基礎にかかわる理解度チェック・・・（西良太郎）第8回：幹細胞株の利用と社会の課題・・・（杉山友康）第9回：幹細胞株の実用化の可能性・・・（杉山友康）第10回：幹細胞技術研究・臨床応用の前線・・・（杉山友康）第11回：幹細胞技術の標準化・・・（杉山友康）第12回：再生医療の知財と制度・・・（杉山友康）第13回：再生医療の本格化・・・（杉山友康）第14回：幹細胞株の薬物毒性試験等への応用・・・（杉山友康）",
        "courseDataUpdatedAt": "2024\/02\/01"
    },
    "updateAt": "2024\/08\/07"
}