{
    "lectureCode": "B33101",
    "courseName": "創薬学II",
    "lecturer": [
        "佐藤淳(応用生物学部応用生物学科)",
        "西良太郎(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "火3"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｅ１０４"
    ],
    "courceDetails": {
        "courseOverview": "従来の医薬品のほとんどは、「低分子医薬品」と呼ばれる分子量の小さい医薬品で、主に化学合成技術により生産される。これに対して、近年、注目されているのが、低分子医薬品よりはるかに大きい分子量を持つ高分子医薬品、「バイオ医薬品」である。「バイオ医薬品」はその構成成分から、タンパク質医薬品と核酸医薬品に大別できる。「バイオ医薬品」は、遺伝子組換え技術や細胞培養などのバイオテクノロジーを利用して開発製造される医薬品で、高い特異性と低い副作用がその特徴である。そのため近年開発が集中しており、医薬品の売上高でも上位を占めている。本講義では、この「バイオ医薬品」に焦点を絞り、様々な「バイオ医薬品」の特徴、作用機序、製造方法についての実学に基づく専門能力を身につけることを目指す。前半７回で、主な「バイオ医薬品」について解説するとともに、「バイオ医薬品」の中心的な存在である抗体医薬品、特に低分子では開発が困難な免疫領域で力を発揮する抗体制ガン薬などにもスポットを当てる。さらに「バイオ医薬品」の薬効を最大限に引き出す薬物送達法(DDS)であるIgGFc融合やアルブミン融合技術に関して、担当教員の研究事例を紹介しながら解説する。後半７回では、バイオ医薬品を理解するために、代表的なバイオ医薬品の分子設計のコンセプト、研究・開発に関する基本的な考え方をその実例・データと共に解説する。さらに、バイオ医薬品の製造工程から臨床試験、承認申請までの一連の過程を解説することにより、バイオ医薬品の研究・開発の実際を俯瞰的に理解することを目指す。なお、担当教員のうち一名は、東レ（株）医療システム研究所や基礎研究所での医療（診断薬開発）と医薬（インターフェロンなどのバイオ医薬品）の開発研究に従事した実務経験をもつ。本講義はその経験に基づき、創薬、特にバイオ医薬品の基礎研究、非臨床研究、臨床試験などの研究開発動向について実例を示しながら解説する実践的科目である。講義の始めに、予習内容の確認を行うので、しっかり予習してくること。授業中に講義内容と関連する簡単な質問を出題し、指名した学生に回答を求めるアクティブラーニングを実施する。",
        "outcomesMeasuredBy": "本講義では、「バイオ医薬品」についての実学に基づく専門能力を身につけることを目指す。具体的には、各種タンパク質医薬品や核酸医薬品の特徴、作用機序、製造方法、薬物送達法(DDS)の理解を目標とする。授業中に講義内容と関連する簡単な質問を出題し、指名した学生に回答を求めるアクティブラーニングを実施する。質問に対しては、口頭で論理的に説明できるようにすること。これにより、「コミュニケーション能力」、「論理的な思考力」、「問題解決力」を身につけることを目標とする。さらに試験問題では記述式の試験問題を出題することで、論理的な思考力が身についた履修者に単位を認めている。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力問題解決力",
        "teachingMethod": "第1〜7回までを佐藤淳、第8〜14回までを西良太郎が講義を担当する。配布資料や、ダウンロード可能なスライド資料を使いながら、バイオ医薬品開発全般を解説する。資料を最大限利用して学習し、予習、および課題提出は必ず行うこと。講義の始めに、予習内容の確認を行うので、しっかり予習してくること。授業中に講義内容と関連する簡単な質問を出題し、指名した学生に回答を求めるアクティブラーニングを実施する。ノートPCは、特に指示のない場合は使用しない。後半の講義では授業開始までに各回の資料をダウンロードし、印刷、もしくはノートPCなどで閲覧できるように手元に用意すること。講義の中で提示される課題・議題についてグループディスカッションを行い、その結果を口頭にて回答する方式の学修スタイルをとる。また、指名した学生への質問-回答-解説、講義中課題の出題等のアクティブラーニングを実施する。",
        "notices": "事前に配布する資料をダウンロードして学習すること。予習の時点で、専門用語については調べてくること、また課題は事前に提出すること。講義中に出てくる項目については、論理的に説明出来るよう理解すること。なお、本講義の理解のために、創薬学Iを受講してその内容を理解していることが望ましい。",
        "preparatoryStudy": "事前に配布する資料をダウンロードして、必ず予習し、課題を提出すること。講義の始めに、予習内容の確認を行う。",
        "gradingGuidelines": "課題や講義中のアクティブラーニングにおける回答内容、期末試験の点数により総合的に成績を決める。具体的には、出席を前提として、アクティブラーニングでの評価（講義中の発言や質問）15%、課題への対応15%、期末試験70%で評価する。試験では、学習した内容を論理的に説明出来るようにしておくこと。レポート課題や講義中の小課題については、講義中に、またはMoodleなどを通じてフィードバックを行う。",
        "textbook": "指定しない。講義で使用するスライドはダウンロード可能なので、印刷の上、予習、復習に利用すること。",
        "referenceMaterials": "バイオ医薬品-開発の基礎から次世代医薬品まで-、化学同人社、6000円（税抜き）バイオ医薬、基礎からは開発まで、東京化学同人社、4400円（税抜き）",
        "courseSchedule": "第1回（担当佐藤淳）：バイオ医薬品とは何か？第2回（担当佐藤淳）：バイオ医薬品で重要な基本技術は”遺伝子組換え技術”である第3回（担当佐藤淳）：バイオ医薬品（インスリン、インターフェロン、エリスロポエチン）第4回（担当佐藤淳）：バイオ医薬品（顆粒球コロニー刺激因子、トロンボポエチン、TPO受動態作動薬）第5回（担当佐藤淳）：抗体医薬品（抗腫瘍薬）第6回（担当佐藤淳）：DDS技術（Fc融合タンパク質技術）第7回（担当佐藤淳）:DDS技術(血清アルブミン融合技術）第8回（担当西良太郎）：バイオ医薬品の研究・開発・製造の俯瞰第９回（担当西良太郎）：バイオ医薬品の分子設計と分子生物学によるその実例第10回（担当西良太郎）：高機能化する抗体医薬品第11回（担当西良太郎）：バイオ医薬品におけるリード抗体の最適化技術第12回（担当西良太郎）：次世代抗体医薬品（抗体薬物複合体、低分子抗体）とバイオ医薬品の製造・品質管理第13回（担当西良太郎）：承認申請と今後のバイオ医薬品の展開（バイオシミラー、核酸医薬品）第14回（担当西良太郎）：理解度確認",
        "courseDataUpdatedAt": "2024/01/30"
    },
    "updateAt": "2024/09/13"
}