{
    "lectureCode": "B33501",
    "courseName": "毛髪科学",
    "lecturer": [
        "岩渕徳郎(応用生物学部応用生物学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "応用生物学部応用生物学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所Ｅ２０２"
    ],
    "courceDetails": {
        "courseOverview": "本講義は四つの習得すべき課題を設定し、これらの課題について十分な習得を目指す。第一の課題は、毛髪化粧品の歴史と、毛髪化粧品を理解するために必要な毛髪科学の基礎的知識の習得。第二の課題は、毛髪化粧品の基礎的処方および代表的薬剤の作用機序と、毛髪化粧品の関連法規の習得。第三の課題は、ヘアスタイル、ヘアカラーによる印象変化の習得。そして、第四の課題は器官発生、細胞分化といった観点から生物学的な毛包器官形成の基礎の習得と、最先端の毛髪再生医療の理解である。第一の課題については、皮膚および毛包と毛幹の構造、毛周期、毛幹の物性、まつ毛の生理などの毛髪科学の基礎を学習する。併せて、薄毛、白髪、頭皮と毛髪の関係、人類遺伝と毛髪の基礎についても学習する。第二の課題については、シャンプー、コンディショナー、染毛剤等の毛髪化粧品の処方設計の考え方について学習する。併せて、これら毛髪商品と毛髪ダメージの関連性について学習する。また、市販の毛髪化粧品の実例調査を行い、毛髪化粧品設計の考え方の基礎を学ぶ。さらに、各種育毛薬剤および抗白髪薬剤の作用機序についても学習する。第三の課題については、人物印象における顔立ち、ヘアスタイル、毛髪色の関係について学習する。本学習を通して、印象変化などの官能評価に関する分析・評価能力を身につける。第四の課題については、毛髪を形成する毛包器官の発生および毛周期調節において、作用する各種生体因子の重要性とその作用機序について学習する。さらに、植毛医療や最先端の毛髪再生医療についても解説する。本講義は化粧品大手企業において毛髪科学研究、育毛薬剤開発、美容医療研究に従事した担当教員の実務経験と、実際に毛髪化粧品設計に携わっている現役化粧品企業講師の実務経験に基づき、「実学」学習の観点から講義が行われる。本科目は、毛髪科学研究、毛髪関連薬剤開発、毛髪化粧品設計、毛髪再生医療の各現場において、学んだ事柄がどのように活用・応用されているのかを講義する実践的科目である。",
        "outcomesMeasuredBy": "生物学に根差した毛髪科学の基礎、化粧品科学の観点からみた毛髪化粧品の基礎および商品設計の基礎、美容科学の観点からみた毛髪美容の基礎、最先端の毛髪再生医療の基礎といった、実学に基づく専門能力養成を主眼とした毛髪科学を学ぶ。市販毛髪化粧品の調査などを通して、机上理論のみならず実際の商品企画・設計についても体験し、実学に基づく専門力養成を目指す。これらを総合的に体験することを通じて、調査結果の分析・評価能力、コミュニケーション能力および論理的な思考力を身につける。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力",
        "teachingMethod": "主に、スライド、動画および板書を使いながら講義形式で行う。実学学習として、化粧品会社出身者を外部講師として招き、一部講義内容についてご講演頂く場合がある。なお、毎回の授業の最後に提出課題を出題し、翌週の授業中にフィードバックを行う。質問についてはメールでも対応する。",
        "notices": "本講義は「皮膚科学」および「化粧品科学」を受講していることを前提に行う。また、「生命科学Ⅰ、Ⅱ」、「生物科学Ⅰ、Ⅱ」、「分子生物学Ⅰ、Ⅱ」、「細胞生物学」を受講していることが好ましい。",
        "preparatoryStudy": "参考書などを利用して次回学習範囲を予習し、講義終了後は参考書および講義資料を利用して復習を十分に行うこと。毎回の講義終了時に行う提出課題の内容は、特によく復習しておくこと。",
        "gradingGuidelines": "授業への出席を前提として、最終習熟度確認課題40%、中間習熟度確認課題40％、毎回授業中に行う提出課題20%で成績を評価する。",
        "textbook": "特になし。講義資料を中心に解説する。",
        "referenceMaterials": "「毛髪の科学」クラーレンス・R・ロビンス著、山口真主訳（フレグランスジャーナル社）「最新の毛髪科学」松崎、新井、上甲、細川、中村著（フレグランスジャーナル社）",
        "courseSchedule": "第1回:毛髪化粧品の歴史、毛包と毛幹の構造第2回:毛幹の特性(形態、組成)、まつ毛の特性第3回:毛髪のダメージと原因、毛髪の物性測定第4回:くせ毛、毛髪生物学の実験手法第5回:毛周期と薄毛の性差第6回:毛髪化粧料（パーマ剤、染毛剤）第7回:中間習熟度確認課題第8回:頭皮環境と毛髪形成の関係第9回:毛周期・毛髪発生を調節する因子(1)第10回:毛周期・毛髪発生を調節する因子(2)第11回:白髪と抗白髪薬剤、色素細胞第12回:幹細胞と毛髪再生医療、毛髪美容医療第13回:化粧品の品質保証（安全性保証、微生物保証、GMP）第14回:講義全体を通じての最終習熟度確認課題",
        "courseDataUpdatedAt": "2024/01/25"
    },
    "updateAt": "2024/08/07"
}