{
    "lectureCode": "11058C1",
    "courseName": "インターンシップI[CS]",
    "lecturer": [
        "大石邦夫(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "教養教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 1,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "インターンシップは、これまで学んだ基礎が社会でどのように応用されているかを学外の企業において、実務経験が豊富な指導者のもとで企業活動を通じて経験することができる実践的科目である。社会人としてのコミュニケーション能力、基礎知識、新しい技術の進展に対応できる論理的な思考力と実務での課題の問題解決力の習得を主眼におく。また、企業での技術的な業務を通して分析・評価能力を高めることを行なう。履修する学生は、事前にインターンシップを行う企業を自ら探す必要がある。インターンシップに参加することが決まったら、必ずインターンシップ参加前に、キャリアコーオプセンターに申し出る必要がある。担当教員がインターンシップを審査して承認するか否かを決定する．事後、もしくはすでにインターンシップ開始後に申し出た場合、この単位の認定はできない。この授業は、大学の学外の企業でのインターンシップを行なうことによって，実務経験を積むことができる実践的な科目である。",
        "outcomesMeasuredBy": "・自分の希望する業界から具体的な企業を選んでコンタクトをとることで，実務的な社会体験をする（コミュニケーション能力）。・インターンでの業務の実践的な専門技術を習得する。（実学に基づく専門能力，論理的な思考力）・インターンでの業務を通じて技術調査や検討を行なう。（分析・評価能力，実学に基づく専門能力）・チームメンバーとのやりとりをすることで実務を行なう。（コミュニケーション能力）・実務での実際の課題や問題を解決する経験をする。（問題解決力）・インターンシップ先で日報を作成、また報告書を作成する。（分析・評価能力）",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "企業あるいは団体のインターンシップに、5日以上または30時間以上参加することが必要である。ノートブックPCは、インターンシップ先の企業で必携かどうかによって決まる。",
        "notices": "・学生自らがインターンシップ先の企業を探す。またキャリアコーオプセンターに相談して、企業を探すことも可能である。・インターンシップ先の企業が決まったら、キャリアコーオプセンターに事前申し込みをする。・インターンシップ先の企業が、適切かどうかを審査して、その結果を通知する。・インターンシップ先が決定した学生は、必ずインターンシップ保険に加入する必要がある。・インターンシップの決定者に対しては、事前ガイダンスを行なうので必ず出席すること。事前ガイダンスの日程は、別途、連絡する。",
        "preparatoryStudy": "インターンシップの開始前に、社会人としてのマナーやルールについて、書籍で学習しておくこと。インターンシップ先での実務や専門技術について、事前に書籍や資料をもとに予習しておくこと。インターンシップ先で習得した内容についてメモをとり、毎回終わったあとに記録しているメモをもとに復習すること。",
        "gradingGuidelines": "１．インターンシップの期間が5日以上または30時間以上であること。（単位取得の前提条件）※オンラインのリモート実習については別途判断の上、単位の認定を行う。２．インターンシップ先の担当者の「評価報告書」に目標達成または目標達成の見込みの評価があること。（必須条件:成績評価の50%）３．「インターシップレポート」に実習の経過、実習で得たことについて自己評価すること。（必須条件：成績評価の50%）フィードバックは，「評価報告書」と「インターンシップレポート」の提出後に個別に行なう。",
        "textbook": "講義形式ではなく実習形式なので、教科書は特に指定しない。",
        "referenceMaterials": "講義形式ではなく実習形式なので、教科書は特に指定しない。",
        "courseSchedule": "講義形式ではなく、インターンシップ先の企業において実習形式で行われる。企業のインターンシップに5日以上または30時間以上参加すること。",
        "courseDataUpdatedAt": "2024\/03\/18"
    },
    "updateAt": "2024\/09\/13"
}