{
    "lectureCode": "C10108",
    "courseName": "線形代数I[BS4]CS",
    "lecturer": [
        "臺信直人(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金3"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義棟Ａ２０４"
    ],
    "courceDetails": {
        "courseOverview": "線形代数は自然科学・工学・社会科学などに幅広く応用される基礎科目である．線形代数Iではベクトル，行列についての基礎事項と計算，それらの応用例について学ぶ．具体的にはベクトルの定義と性質，内積，1次独立と1次従属，平面，空間図形などベクトルの応用，行列の演算，行列の基本変形と行列の階数，行列の基本変形による逆行列の計算法，連立1次方程式の解法を扱う．さらに，2行2列の行列に関して行列式，逆行列，逆行列を用いた連立1次方程式の解法などについて，1次変換の観点も交えつつ解説を行う．本講義では，論理的な思考力と問題解決力を身につけることを主な目標とする．加えて，工学への応用例に触れることを通して，実学に基づく専門能力や分析・評価の能力の基礎も養うこととする．また，数学の理工系分野における基礎的な言語としての役割について認識を深めることにより，コミュニケーション能力の習得も目指すこととする．",
        "outcomesMeasuredBy": "本講義では以下のことを到達目標とする．・ベクトルおよびその演算の定義を理解し，基本的な計算ができるようになること・図形のベクトルによる表示を理解し，図形の問題をベクトルの問題として解くことができるようになること・1次独立および1次従属の定義を理解しその判定ができるようになること・行列の基本的な定義を理解し,基本的な計算ができるようになること・1次変換の定義・1次変換と行列との関係を理解し，1次変換の基本的な問題が解けるようになること・2次および3次正方行列の行列式を理解し，計算できるようになること・逆行列を用いた連立1次方程式の解法を理解し，簡単な計算ができるようになること・基本変形・階段行列・行列の階数の定義とそれらの間の相互の関係を理解し，基本的な計算ができるようになること・連立方程式を基本変形により解くことができるようになること・係数行列のサイズ・階数と解の自由度との関係を理解すること講義全体を通して基礎事項の解説を理解し，問題演習を行うこと，その際，単なるパターンの当てはめによる答案作成では終わらず，言葉の定義をよく理解し，演繹するという作業に意識を向けることで，論理的な思考力，問題解決力，コミュニケーション能力の習得を目指す．また，講義中に提示される応用例を通して実学に基づく専門能力，分析・評価能力の基礎を養う．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "各クラスに分けて授業を行う．尚，本講義ではクラスによってノートPCを出欠確認以外にも使用することがある．講義開始時のアナウンスに注意すること．",
        "notices": "講義を履修するにあたり，高校数学の内容を良く復習しておくこと.特に数学Bのベクトルは重要である．学期中は復習・予習を欠かさないこと．とりわけ復習を十分に行うこと．演習問題を解き，自ら力をつけること．",
        "preparatoryStudy": "各回の講義前には予定されているトピックについて，指定参考書や図書館の書籍などを読んで予習しておくこと．講義後は講義中に出された演習問題を解き，さらには講義内容について自力でまとめてみること．講義の内容を他者に説明できるようになることが望ましい．",
        "gradingGuidelines": "期末試験（約70％）のほか，レポート・小テスト（約30％）を考慮して評価する．提出物や小テスト，学修状況について，講義中に適宜コメントや講評などの形でフィードバックを行う予定である．",
        "textbook": "石原繁・浅野重初著「理工系の基礎線形代数」（裳華房）",
        "referenceMaterials": "指定しない",
        "courseSchedule": "第1回:ベクトル(1)：ベクトルの定義，ベクトルの和・スカラー倍第2回:ベクトル(2)：ベクトルの内積第3回:ベクトル(3)：ベクトルの外積第4回:ベクトル(4)：ベクトルと図形第5回:ベクトル(5)：ベクトルの1次独立，1次従属第6回:行列(1)：行列の定義，行列の演算（行列の和・スカラー倍）第7回:行列(2)：行列の演算（行列とベクトルの積，行列と行列の積，転置）第8回:行列(3)：正則行列と逆行列第9回:行列と1次変換第10回:行列の計算(1)：2次および3次正方行列の行列式第11回:行列の計算(2)：逆行列を用いた連立1次方程式の解法第12回:行列の基本変形(1)：行列の基本変形，階段行列，行列の階数第13回:行列の基本変形(2)：基本行列，行列の基本変形による逆行列の計算第14回:行列の基本変形(3)：行列の基本変形による連立1次方程式の解法，解の自由度",
        "courseDataUpdatedAt": "2024/02/29"
    },
    "updateAt": "2024/09/13"
}