{
    "lectureCode": "C10301",
    "courseName": "マーケティングとITビジネス",
    "lecturer": [
        "瀬之口潤輔(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "教員の実務経験に基づく「実践的科目」。日本の産業構造の変化、またAIやIT技術の発達により、企業のマーケティング手法も大きく変化している。本授業では、日本の産業の変化やAIの発達により、どのような販売戦略を採用した企業が成功するかを議論し、論理的な思考力や実学に基づく専門能力を身に付ける。特に新しいビジネスを起業することを念頭に置いて、効果的なマーケティング戦略を探るノウハウと問題解決力を身に付ける。また市場調査の手段として、データベースの使い方を学び、Pythonを用いて機械学習により分析・評価能力も身に付ける。",
        "outcomesMeasuredBy": "今後10年程度の間に日本の産業構造がどのように変わるか推測する能力を身に付ける（論理的な思考力）。またAIの発達により日本の企業がどのような影響を受けるかを理解する（分析・評価能力）。新しい産業構造の中で、臨機応変にマーケティング戦略を企画できる討論力とコミュニケーション能力も身に付ける（実学に基づく専門能力）。また市場調査を行うためのデータ解析手法も取得する（分析・評価能力、問題解決力）。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "アクティブラーニング形式により、挙手による授業参加を重視した授業方法をとる。クラス討議およびグループワークを中心に行い、コミュニケーション能力・問題解決力を養う。授業の前に予習として、企業のマーケティングに関する事例を読み、企業の問題点を自分で考える。それを授業で他の生徒と討論し、自らの主張が正しいこと、誤っていることを理解し、洗練された主張に磨き上げていく。授業中に課題を行うことがあるため、ノートPC必携。",
        "notices": "クラス討議を行う上では、授業前の予習と積極的な発言が求められる。いくら十分に学習しても、積極的に挙手をして発言しないと個人の評価につながらない。",
        "preparatoryStudy": "事前に与えたいくつかの課題を授業の前に調べ、自分なりの答えを考えてくることが求められる。課題にこたえるためには、インターネットなどで十分な調査や予備知識の理解が必要になる。これらを予習として行ったうえで授業に参加することが求められる。復習として、次回の授業の予習の際に、前回の授業得た知識を確認すること。",
        "gradingGuidelines": "成績評価は以下の基準で行う授業中に行う課題・小テスト：30％グループ討議における他メンバーからの評価：30％授業中の挙手・発言：40％課題の採点後にMoodleに解答例を記載するとともに、授業内で解説を行う。",
        "textbook": "「マーケティング・ケーススタディ」著者：池尾恭一碩学舎",
        "referenceMaterials": "指定しない",
        "courseSchedule": "第1回：日本の産業が直面する重要課題（1：政府債務の拡大がもたらす未来）第2回：日本の産業が直面する重要課題（2：紙幣増発が国民に与える負担）第3回：日本の産業が直面する重要課題（3：資本主義の終焉）第4回：日本の産業が直面する重要課題（4：働かなくてもよい世の中に）第5回：ITによる産業構造の変化（1：AIがもたらす産業の変化）第6回：ITによる産業構造の変化（2：AIにとってかわらない仕事とは）第7回：ビジネスに必要なデータ解析（1：線形回帰、ツリーモデル）第8回：ビジネスに必要なデータ解析（2：ベイズ統計、機械学習）第9回：マーケティングの基礎知識（1：教科書の知識）第10回：マーケティングの基礎知識（2：実務の知識）第11回：ケーススタディとグループ発表（製品政策、ブランド政策）第12回：ケーススタディとグループ発表（新製品開発政策、価格政策）第13回：ケーススタディとグループ発表（プロモーション政策、流通チャネル政策）第14回：ケーススタディとグループ発表（インターネット戦略、消費者データ戦略）",
        "courseDataUpdatedAt": "2024\/01\/29"
    },
    "updateAt": "2024\/05\/29"
}