{
    "lectureCode": "C10401",
    "courseName": "オペレーションマネジメントとDX",
    "lecturer": [
        "山口淳(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "〇本科目名の1つめのキーワードであるオペレーションとは、企業活動において製品やサービスを提供する「生産・供給機能」を実現するための仕事のことである。それらのオペレーションを実行するための、Plan-Do-Check-Actionのシステムおよびプロセスのマネジメントをどのように行なうかが、本講義のテーマである。〇もう１つのキーワード、DX（デジタルトランスフォーメーション）とはICTを用いて価値創造や効率化につながる変革を実現することを指す。ICTシステムは情報の伝達・加工の自動化という機能を持ち、オペレーションの一角を形成している。そのため、ICTエンジニアがオペレーションを理解し、分析・改善できる能力は重要であると考える。〇講義では、具体的には、生産・供給機能が果たすべき役割に関する基本的役割の理解と、オペレーションに内在する課題を発見・分析・改善する視点を身に付けることを目的とする。〇授業の進め方としては、最初に標準化やオペレーション能力が企業経営に及ぼす影響について、事例を通じて学び、オペレーションと経営のつながりについて理解する。次に、仕事の現場を把握するための３つの視点と方法を学ぶ。具体的にはオペレーションプロセスの分析・改善方法（もの・こと分析）と、現場の問題を把握し正しい意思決定を行うために必要不可欠な数量分析の方法（経済性分析）、そして、現場に生じている複雑な問題を把握・解決するマネジメント方法（因果関係分析、５つのなぜ）である。講義の終盤では、DXにおける重要な概念となる自動化やICTサービスによる価値創造について考察を行う。自動化の成功・失敗事例の分析や、ICTサービスの成長・停滞事例の分析を行い、DXを担うICTエンジニアに必要な視点の習得を目指す。〇この授業は教員の東京ガスにおける情報システム開発プロジェクトの間接業務改革とシステム構築に従事した実務経験に基づく実践的科目である",
        "outcomesMeasuredBy": "（１）定量・定性両面からオペレーションプロセスの状況を把握し、それを表現する方法と、さらに改善していくための視点を身に付ける。（実学に基づく専門能力、論理的な思考力、分析・評価能力、コミュニケーション能力）（２）DX・自動化が現場のオペレーションにもたらす功罪や、DXによる価値創造について、実際の事例とともに理解し、現実の世界で価値あるDXを実施する際の基礎能力を習得する。（実学に基づく専門能力、分析・評価能力）（３）演習を通じ、問題点をロジカルに明らかにするとともに、問題点に即した解決策を提示するスキルを身につける。（コミュニケーション能力、論理的な思考力、問題解決力）",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "○授業では、講義用スライドを基に、理論の基礎的内容について学ぶ。また、授業内で事例分析や演習を行ない、理論を実際に使用する機会を多く設ける。○本講義は、毎回の講義前の事前アサインメントを課す。事前アサインメントは、前回内容の復習と次回内容の予習を行う問題演習である。講義では事前アサインメントで演習した問題への解答状況や問題への疑問点を踏まえて、誤りやすい点・疑問点への解説を行うとともに、優れた解答やユニークな解答を共有するアクティブラーニングを実施する。〇また単元の終わりのタイミングでＱ＆Ａの時間を設け、個々の疑問点を解消する機会を設ける〇全回ノートPC必携である。",
        "notices": "本講義では事前知識は必要としない。講義内で取り上げる事例や用語のうちわからないものに関しては、参考書やインターネットで各自調べて講義に臨むこと。",
        "preparatoryStudy": "〇本講義では毎回事前アサインメントを課し、前回内容の復習と次回内容の予習となる問題演習を実施する。講義ではアサインメントの理解状況や回答内容、疑問点を紹介して解説する反転授業を行う。〇事前アサインメントの取組が重要である。その理由は4点あり、1)予習を行うことで部分は授業内容や理論の価値が理解できるようになる、2)予習に取り組むことで初見の現実的課題に対してどのように考えを進めればよいかの経験を積むことができる、3)復習を行うことで授業内容や理論の重要な箇所の理解が身についているかの確認やその定着が図られる、4)授業評価の点で、事前アサインメントの提出と内容が評価に入るだけでなく、中間到達度演習や期末レポート対策の基礎となる、",
        "gradingGuidelines": "事前アサインメントの評価30%，中間到達演習30％，期末演習レポート40%。事前アサインメントについては、全体の理解状況や誤りやすいポイントについて解説するとともに、疑問点に関してフィードバックしていく。また受講生全体にプラスとなる視点が得られる解答に関しても解説とともに紹介する。中間到達演習では、正解と正解に至る考え方、全体の理解状況と採点ポイントについて解説する。",
        "textbook": "指定しない",
        "referenceMaterials": "中村善太郎『もの・こと分析で成功するシンプルな仕事の構想法』、日刊工業新聞社、2003年藤本隆宏『生産マネジメント入門Ⅰ－生産システム編－』、日本経済新聞社、2001年藤田精一『ビジネスマンの基礎知識としての損得計算入門』、日経BP社、2013年",
        "courseSchedule": "第1回:講義の目的と進め方，オペレーション・マネジメントとは何か？第2回:標準化と経営【月桂冠、ZOZOタウンのUI、earthmusic\u0026ecologyのVMD】第3回:オペレーション能力と経営【吉野家2004年、すき家2014年】第4回:現場を見る視点1＿作業と付加価値1【ボールペン組立作業】第5回:現場を見る視点1＿作業と付加価値2【紙切り作業】第6回:現場を見る視点1＿作業と付加価値3【稟議書・自動販売機】第7回:現場を見る視点2＿損得を捉える1【当たりの宝くじ・サンクコスト】第8回:現場を見る視点2＿損得を捉える2【暇なそば屋】、前半全体の振り返り第9回:中間到達演習第10回:中間到達演習のまとめと解説第11回:現場を見る視点3＿5回のなぜ、因果関係分析【不振のファミリーレストラン】第12回:DXと自動化：自動化の成功・失敗事例分析【島津製作所IoT実証ライン、キユーピーAI導入事例、変なホテル、鈴鹿富士ゼロックス】第13回:DXとしてのICTサービスの提供価値と停滞要因【ぐるなび：UIと提供価値、模倣困難性】第14回:講義全体の振り返り、期末レポートに向けた質疑応答",
        "courseDataUpdatedAt": "2024\/01\/07"
    },
    "updateAt": "2024\/05\/29"
}