{
    "lectureCode": "C10503",
    "courseName": "価値創造演習[A2]",
    "lecturer": [
        "井出充(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "片柳研究所Ｃ１００３",
        "片柳研究所Ｃ１００４"
    ],
    "courceDetails": {
        "courseOverview": "超スマート社会（Society5.0）の実現のためには、情報システムとしてのコンピュータシステムだけでなく、クラウド、ビッグデータ、人工知能といった様々な技術群を活用できることはもちろんのこと、ビジネス・社会ニーズに応じて必要な技術・モノと、サービスを結びつけ、市場に提供できることが必要である。そのためには、「価値創造」という視点が不可欠である。そもそも「価値」とは絶対的なものではなく、ユーザや場面（状況）によってその評価が異なる。つまり「価値」を理解するためには、「ユーザ」や「場面状況」を理解する必要がある。また、「創造」するとは、何かを新しく生み出すことであるが、新しい価値を生み出してもユーザに届かなければ「価値創造」にはならない。つまり、「価値そのものを作り」、その価値を「ユーザに伝えること」が価値創造といえる。この授業では、情報システムにおける「価値創造」とは何か、ユーザ体験（UserExperience）という視点から学ぶ。",
        "outcomesMeasuredBy": "次の3点ができるようになることを到達目標とする。・ユーザと価値を関連付けて説明することができる（実学に基づく専門能力）・国際的に標準として用いられるUX作成プロセスを理解し、説明することができる（国際的な教養、論理的な思考力、分析・評価能力）・ビジネスプレゼンテーションができるようになる（コミュニケーション能力）また次の2点についても習得することも付加的な目標である・ユーザーの持つニーズと解決策に関する仮説を立て、その仮説の検討を繰り返すことで、実効性のある問題解決策の構築プロセスを経験する（問題解決力）・問題解決プロセスを進める中で、事実・意見・課題を論理的に整理する訓練を行う（論理的な思考力、分析・評価能力）",
        "learningOutcomes": "国際的な教養実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ショートレクチャーおよびグループワークにより授業を行う。価値検証のためグループワークではフィールド調査も行う。グループでのプレゼンテーションおよび個人レポートにより、理解度を確認する。プレゼンテーションの機会を講義中に何度も設ける。中間・期末のチーム発表に加え、各回のチーム活動の成果や進捗を学生自身がクラス全体に向けて発表する機会を持ち、学生の主体的な学びを促進するアクティブラーニングを実施する。※授業（チーム成果物作成）や個人課題（中間・期末レポート、各回の個人振り返りレポート）作成の取組において、生成AIを利用してもよいが、次の３項目についての明記を必須とする。1)利用箇所の明記：生成AIを利用して作成した箇所を明記すること、2)出典の明記：利用結果（生成AIの成果物）の根拠となる事例や理論の出典は自らが探し明記すること、３)妥当性に関する考察の明記：利用結果（生成AIの成果物）が、求められているテーマやその条件に対して、妥当な回答と言えるかに関する自らの考察・評価を記述すること。",
        "notices": "情報検索、電子ホワイトボード使用、プロトタイプ作成、プレゼンテーション作成のためノートPCを使用するので必携のこと。",
        "preparatoryStudy": "身の回りにある「サービス」についてどんなものがあるか調査してくる。講義後に、毎回の講義内容やチーム活動に関する振り返りのレポート作成を課題とする。また、講義回によっては次回のチーム活動に向けての準備調査も行う。学修時間の目安は予習・復習あわせて1週分で120分程度である。",
        "gradingGuidelines": "チーム活動による成果物の評価(30%)、個人に対する成果物・授業貢献・チーム活動貢献の評価(70%)により評価する。期末のチーム発表および個人レポートについては、それぞれのルーブリックを導入する。講義資料にルーブリックを掲載する。チーム発表内容はその講義中もしくは次回の講義で内容に関するフィードバックを行う。毎回の個人レポートや毎回のチーム活動についても、特に優れた内容や全体的な傾向、課題とすべき内容について、適宜フィードバックを実施する。",
        "textbook": "指定なし（都度、必要な教材を配布する）",
        "referenceMaterials": "「ビジネスモデル・ジェネレーションビジネスモデル設計書」（翔泳社）2012年「ユーザーストーリーマッピング」（オライリー・ジャパン）2015年",
        "courseSchedule": "第1回：イントロダクション／チームビルディング第2回：チームビルディング／グループワークで用いるツールの使い方トレーニング第3回：KA法を使った価値発見演習第4回：アイデア出し／仮説検討第5回：ペーパープロトタイピング作成／リサーチ計画第6回：リサーチ結果の整理と第1回発表（プレゼン）第7回：アイデア出し／仮説検討／リサーチ計画第8回：リサーチ結果の分析／UX作成／仮説見直し第9回：ペーパープロトタイピング作成／仮説見直し／プロトタイピング計画第10回：プロトタイピング開発第11回：プロトタイピング開発／プロトタイプ発表とフィードバック／フィードバックの評価第12回：仮説の見直しと価値の評価／発表準備第13回：第2回発表（プレゼン）第14回：振り返りとまとめ",
        "courseDataUpdatedAt": "2025/02/20"
    },
    "updateAt": "2025/03/21"
}