{
    "lectureCode": "C10601",
    "courseName": "コンピュータ概論I[A]",
    "lecturer": [
        "布田裕一(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "水",
        "水3"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "研究棟Ａ４０２",
        "片柳研究所ＣＢ０１"
    ],
    "courceDetails": {
        "courseOverview": "本講義及び演習では、コンピュータのハードウェアを中心に、コンピュータの基本的な構成およびその仕組みを概説する。講義では、はじめに、コンピュータにおけるデータの表現や演算、ハードウェアの基本要素である論理回路などの基本知識（国際的な教養）を学ぶ。それらの基本知識に基づいて、コンピュータのハードウェアを構成するプロセッサ、記憶装置／入出力装置などの機能と動作の流れを解説する。最後に、コンピュータの性能や信頼性を評価する指標について紹介する。演習では、基本情報技術者試験の問題を中心に取り組む。この授業では主に国際的な教養や論理的な思考力を身につけることを目的としている。さらに、実学に基づく専門能力を鍛えることを目指している。",
        "outcomesMeasuredBy": "・2・10・16進数による数値表現および、それらの負数を含む加減算ができる（国際的な教養、論理的な思考力）・ブール代数と論理式や、基本的な論理回路とその動作を理解できる（国際的な教養、論理的な思考力）・コンピュータの基本構成を説明できる（実学に基づく専門能力）・プロセッサの処理の流れを理解できる（実学に基づく専門能力、論理的な思考力）",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力",
        "teachingMethod": "講義では、教科書として指定している書籍の記載順序に従い、座学形式にて講義を進めていく。演習では、基本情報技術者試験の問題への取り組みや、JavaScriptのプログラミングコードに対するデバッグを用いたコンピュータの計算処理の理解を実施する。講義及び演習の両方でノートPC必携。",
        "notices": "講義の中では、個々の技術項目についての理解度を確認するため、原則として、毎回小テストを実施する。",
        "preparatoryStudy": "予習として、該当する教科書の範囲を一読しておくこと。基本的に毎回、復習の小テストを出題するため取り組むこと。",
        "gradingGuidelines": "講義・演習の中及び復習として実施する小テスト(成績の約1/3)、期末試験の結果(成績の約2/3)を考慮して評価する。小テストについては、Moodleによりフィードバックを実施する。また、授業内で解答を解説することもある。",
        "textbook": "橋本洋志,松永俊雄,小林裕之,天野直紀,中後大輔「図解コンピュータ概論ハードウェア」（改訂4版）（オーム社）",
        "referenceMaterials": "指定しない。",
        "courseSchedule": "第1回:数の表現２進数の表現と用いられている理由第2回:基数の変換８、１６進数変換第3回:負数の表現と加減算２の補数表現とその有効性第4回:浮動小数点数と文字コード浮動小数点数の基本概念、ASCIIコード第5回:論理回路の基礎ブール代数と基本論理演算第6回:組み合わせ回路カルノー図、加算器第7回:順序回路フリップフロップ、レジスタ第8回:プロセッサの基礎コンピュータの構成要素、プロセッサの基本機能第9回:命令の種類と形式データの移動・演算・制御第10回:実際のプロセッサアセンブリ言語第11回:記憶装置主記憶装置、補助記憶装置第12回:入出力装置入出力インタフェース第13回:コンピュータの性能と信頼性性能の指標、性能の推移第14回:コンピュータの未来講義の総まとめ",
        "courseDataUpdatedAt": "2024/01/29"
    },
    "updateAt": "2024/09/13"
}