{
    "lectureCode": "C10702",
    "courseName": "コンピュータ概論II[B]",
    "lecturer": [
        "佐藤公則(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水",
        "水3"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "研究棟Ａ４０３"
    ],
    "courceDetails": {
        "courseOverview": "コンピュータの使用方法に関する基本的概念についてソフトウェアを中心に概説する．コンピュータの一般化された体系を知り，情報化社会に必要なICTの基礎知識を養う（国際的な教養）．コンパイラやインタプリタの仕組みを理解するよう，プログラム言語，言語プロセッサ，プログラミングの方法について説明する（実学に基づく専門能力，論理的な思考力）．オペレーティングシステムでは，プログラムの処理形態，仮想化，プロセス，入出力，記憶管理，ファイルとデータベースの仕組みを理解するよう，説明を行う（実学に基づく専門能力，論理的な思考力）．また，複数のコンピュータをネットワーク接続するための基本技術を概説する（実学に基づく専門能力，論理的な思考力）．演習の時間には，Linuxコマンドによるシェルスクリプトを学ぶ(実学に基づく専門能力)．これらは今後ICT関連の仕事をしていく上で，必須のものである．",
        "outcomesMeasuredBy": "・コンピュータの一般化された体系とICTの基礎知識の理解（国際的な教養）・コンパイラとインタプリタの仕組みの理解とその活用（実学に基づく専門能力，論理的な思考力）・オペレーティングシステムの理解とその活用（実学に基づく専門能力，論理的な思考力）・ネットワークシステムの基本技術の理解（実学に基づく専門能力，論理的な思考力）・Linuxコマンドとシェルスクリプトの理解(実学に基づく専門能力)これらの仕組みやシステムは，論理的な構造を伴うものであり，目標に到達する過程で，論理的な思考力を養う．",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力",
        "teachingMethod": "講義は教科書を中心に進める．演習は対面で教科書から離れた内容を扱うことがある．ノートPC必携．",
        "notices": "講義の中では，個々の技術項目についての理解度を確認するため，原則として毎回小テストを実施する．",
        "preparatoryStudy": "予習として，該当する教科書の範囲をよく読んでおくこと．復習として，毎回の授業で学んだ内容を教科書で確認し，自宅での復習問題が課されたときは，期限までに必ず取り組むこと．",
        "gradingGuidelines": "講義の中で実施する小テスト等による，講義への取り組みを評価(60%)するとともに，期末試験の結果(40%)を総合的に判断した上で，成績評価を行う．小テスト等については，Moodleのフィードバック機能を使って，解答期間の終了後に正解と得点をフィードバックする．",
        "textbook": "橋本洋志,菊池浩明,横田祥「図解コンピュータ概論ソフトウェア・通信ネットワーク」（改訂4版）（Ohmsha）",
        "referenceMaterials": "指定しない",
        "courseSchedule": "第1回：コンピュータの構成ガイダンス,PCの基本構成,ハードウェアの基礎第2回：ソフトウェアソフトウェアの種類,応用ソフトウェア第3回：プログラム（1）プログラムとは,プログラム言語第4回：プログラム（2）言語プロセッサ,プログラミング第5回：オペレーティングシステム（1）オペレーティングシステム（OS）とは，プロセス第6回：オペレーティングシステム（2）入出力，主記憶管理，ファイルシステム第7回：オペレーティングシステム（3）サービスプログラム，実際のOS第8回：ファイルとデータベース（1）ファイルとデータベースの特徴第9回：ファイルとデータベース（2）ファイルの編成，データベースの構成第10回：通信ネットワーク（1）通信ネットワークとは，コンピュータどうしをつなぐ第11回：通信ネットワーク（2）ローカルエリアネットワーク（LAN）第12回：通信ネットワーク（3）インターネット第13回：情報社会と情報リテラシー第14回：情報セキュリティ",
        "courseDataUpdatedAt": "2024/02/29"
    },
    "updateAt": "2024/05/29"
}