{
    "lectureCode": "C11102",
    "courseName": "WebプログラミングII[IT2]",
    "lecturer": [
        "松岡丈平(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "講義実験棟４０２"
    ],
    "courceDetails": {
        "courseOverview": "本授業は、Webにおける妥当な表記方法および適切な設定方法をプログラミングを通して実践的に学び、Web技術を体系的に理解することを目的とする。受講者は、プログラミングによりWebページのオブジェクト構造を理解し、Webコンテンツの適切な扱いについて理解を深められる。また、受講者はWebサイトを構築する技術について学び、演習を通して自ら設定を行うことにより、Webサイトを適切に管理する方法を実体験する。プログラミングにおいては、見た目の変化ではなくオブジェクト構造の理解に重点を置き、W3Cの考え方に沿う体系的なWebとその学術的な意義を知る。本授業では、実学に基づく専門能力、論理的な思考力、問題解決力の鍛錬を目指している。",
        "outcomesMeasuredBy": "妥当なHTMLの表記と構造を理解し、ツールに依存せずに記述できるようになる。（実学に基づく専門能力、論理的な思考力）HTMLのDOMを理解し、プログラミングによる適切な処理が行えるようになる。（実学に基づく専門能力、論理的な思考力、問題解決力）HTML、CSS、XMLの意義を知り、Web技術を体系的に理解できるようになる。（実学に基づく専門能力、論理的な思考力）Webコンテンツを適切に配置し、Webサーバの設定を適切に行えるようになる。（実学に基づく専門能力、論理的な思考力、問題解決力）サーバサイドのプログラミングを通して、アクセス権限を適切に設定できるようになる。（実学に基づく専門能力、論理的な思考力、問題解決力）",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "ノートPCの使用と、教室から学内および学外ネットワークへの接続を前提に、個人での作業による授業を行う。受講者はノートPC必携であり、仮想的にLinuxを実行できる環境を構築できるだけの空き容量を、SSDまたはHDDに確保している必要がある。講義の時間においては、受講者は実践に必要な技術を学び理解する。演習の時間においては、受講者は講義で学んだ知識を生かし、課された課題に適切に応用する。",
        "notices": "ノートPCはWindows環境で動作すること。Windows以外のOSを使用するノートPCを所持している場合には、Windowsも使用できるようにしておくこと。Windows以外のOSの上で仮想的にWindowsを実行している場合には、性能が十分ではない可能性があることに注意する。Windows環境の上で、仮想的にLinuxを実行可能な性能を持つノートPCを持参する必要がある。Web技術を体系的に理解することが目的であるため、課題の提出方法については教員の指示を守ること。プログラミング基礎Iの知識は必須であり、本授業の履修前に条件文、繰り返し文、リストの処理が適切に行えること。情報リテラシー演習のLinux操作に関する知識は必須であり、本授業の履修前にコマンドラインからLinuxの操作が適切に行えること。WebプログラミングIの内容を修得していること。",
        "preparatoryStudy": "プログラミング基礎Iの知識を使用するので、本授業の開始日までにその内容を十分に復習し、理解していること。情報リテラシー演習のLinux操作を修得していることを前提に授業を行うので、本授業の開始日までにコマンドラインからのLinuxの操作を十分に復習し、理解していること。予習として、次の回の授業に該当する教科書のページを確認し、理解が困難な箇所を把握してくること。復習として、その回の授業内容で、TAの助けが必要だった項目において、何ができなかったのかを再確認し、解決方法を理解する。",
        "gradingGuidelines": "理解度チェックの得点を7割、提出課題の得点を3割として評価する。提出課題には、履修者全員が提出する課題と、希望者のみ提出する課題があり、最終回を除く各回に課される。提出課題についは、Moodleなどを通じてフィードバックを行う。",
        "textbook": "松下温監修、市村哲、宇田隆哉、伊藤雅仁共著、「基礎Web技術(改訂2版)」、（オーム社）、定価2,500円（2017年）",
        "referenceMaterials": "なし",
        "courseSchedule": "第1回：WebおよびHTMLの概要、基本構造、HTTPについて学ぶ第2回：HTMLによるページレイアウト、文字に関するタグ、リストについて学ぶ第3回：HTMLによるリンクの概念、画像の表示について学ぶ第4回：HTMLによるテーブルの使い方を学び、フレームについて知る第5回：CSSを用いたレイアウトについて学ぶ第6回：CGI、SSIによるWeb表現、情報セキュリティについて学ぶ第7回：CGIを利用したプログラミングについて学ぶ第8回：SSIを利用したプログラミングについて学ぶ第9回：JavaScriptによるWeb表現について学ぶ第10回：JavaScriptによるイベント処理について学ぶ第11回：DOMの操作について学ぶ第12回：XMLの意義について学ぶ第13回：DTDの記述、スキーマについて学ぶ第14回：総復習、理解度チェック",
        "courseDataUpdatedAt": "2024/09/06"
    },
    "updateAt": "2024/09/13"
}