{
    "lectureCode": "C11201",
    "courseName": "データ分析プログラミング",
    "lecturer": [
        "瀬之口潤輔(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金4",
        "金5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "研究棟Ａ５０３"
    ],
    "courceDetails": {
        "courseOverview": "本授業では、まず例題を使用してデータ分析を行う手法を概説し、データ分析の基礎となる統計解析の知識を理解する。また機械学習により予想・分類を行う際の代表的な手法について、基礎と理論を理解する。特に機械学習の基礎的な知識については、論理的な思考力を養ったうえでコンピュータを使わずに手計算で人工知能・機械学習の中身の計算を行えるようにすることを目指す。また実際にコンピュータを使用してデータ解析を行う専門能力も身に付ける。実際のデータを用いて、Rおよびpythonにより機械学習モデルを作成し、データの解析や将来予想を行うスキルを身に付ける。",
        "outcomesMeasuredBy": "本授業の到達目標は以下のようになっている。1.コンピュータにおける数の取り扱いを深く理解する（実学に基づく専門能力）2.論理に関する基礎的な諸事実を知る（論理的な思考力）3.国際的に通用する人工知能と機械学習の基礎的な知識を理解する（国際的な教養）4.伝統的な統計的手法によるデータ解析手法を習得する（問題解決力）",
        "learningOutcomes": "国際的な教養実学に基づく専門能力論理的な思考力問題解決力",
        "teachingMethod": "各回の授業はいずれも、講義と演習がセットになって構成されている。質問は随時行うので、積極的に教員と交流を図ること。授業は配布資料を中心に進める。演習は教科書から離れた内容を扱うことがある。ノートPCは必携。単に知識を知るだけではなく、積極的に手を動かすこととする。",
        "notices": "知識やスキルなど自分に足りないものが発覚した場合、自主的・主体的に勉強すること。まずは復習をしっかりと、かつ、着実に行うこと。くれぐれもわからない箇所を残さないように心がけること。",
        "preparatoryStudy": "予習・復習は、学生個々が主体的に適宜行うこと。特に予習に関しては、教科書の該当範囲をよく読んでおくことが肝要である。",
        "gradingGuidelines": "授業中に実施する課題・小テスト（30%）、期末試験の結果(50%)、授業態度(20%)を総合的に判断し成績評価を行う。試験の採点後にMoodleに成績と解答例を記載する。",
        "textbook": "増井敏克「RとPythonで学ぶ統計学入門」オーム社、3,000円",
        "referenceMaterials": "第1回：統計的手法（データ解析の基礎）データ解析の基礎となる平均と分散、ヒストグラムの概念を理解し、実際のデータを用いてデータ解析の基礎を身に付ける。第2回：統計的手法（確率変数と確率分布）伝統的な統計的手法を使いデータ解析する。確率変数と確率分布の概念を理解し、データ解析の基礎を身に付ける。第3回：母集団と標本標本から母集団の特徴を推定するために、点推定の手法を身に付ける。また統計・解析に特に重要な概念である大数の法則、中心極限定理も理解する。第4回：いろいろな離散型確率分布母集団の特徴を捉えるために、いろいろな確率分布の知識を得る。この回では離散型の確率変数に対応する分布、とくに二項分布、ポアソン分布、幾何分布について、確率関数の導入の仕方を含めて解説する。第5回：いろいろな連続型確率分布母集団の特徴を捉えるために、いろいろな確率分布の知識を得る。この回では連続型の確率変数に対応する分布、とくに正規分布、χ2乗分布、t分布を中心に、確率関数の導入の仕方を含めて解説する。第6回：区間推定これまでの授業で習得したスキルを用いて、データ解析の重要な部分である母数の区間推定を学ぶ。第7回：検定これまでの授業で習得したスキルを用いて、データ解析の重要な部分である検定を学ぶ。第8回：理解度確認課題第1回から第7回までの授業の内容を復習し、理解度をチェックするための課題を行う第9回：Rの基礎1R，Rstudioのインストール、四則演算、ファイルの読み込み保存、データの入力出力、関数、ベクトル・行列・配列、第10回：Rの基礎2データフレーム、論理演算、簡単なデータ分析、図表作成第11回：Rによるデータ分析1確率分布、推測統計（母比率の検定、χ2乗検定、t検定、積率相関係数）第12回：Rによるデータ分析2単回帰分析、重回帰分析、ロジスティック回帰分析、主成分分析第13回：Pythonによるデータ分析1単回帰分析、重回帰分析、ロジスティック回帰分析第14回：Pythonによるデータ分析2主成分分析、因子分析、クラスター分析、決定木、パーセプトロン",
        "courseSchedule": "",
        "courseDataUpdatedAt": "2024/01/02"
    },
    "updateAt": "2024/05/29"
}