{
    "lectureCode": "C11603",
    "courseName": "社会情報専門演習I[SI・3]",
    "lecturer": [
        "福西広晃(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "1年",
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "講義実験棟３０３"
    ],
    "courceDetails": {
        "courseOverview": "近年、データとデジタル技術でビジネスモデルや働き方に変革を起こすことを目的とした「DX（デジタルトランスフォーメーション）」が推進されている。DX時代において、企業の競争力を高めるためには、蓄積されたデータを分析し、データ駆動型の意思決定を行うことが必要となっている。このような状況下で、DX時代を牽引する人材にはデータサイエンスのスキルが求められる。本講義は、プログラミング言語Pythonのライブラリを活用し、データ操作、データ可視化、統計解析、機械学習を実践的に学習することによって実学に基づく専門能力を身に付ける。また、データ分析の評価指標や分析結果の解釈方法を学習することによって分析・評価能力を身に付ける。さらに、演習課題を通して、一連の分析プロセスの設計と実行を行い、論理的な思考力や問題解決能力を身に付ける。",
        "outcomesMeasuredBy": "・Pythonライブラリを用いて主体的にデータ分析を実行できるようになること（実学に基づく専門能力）・データ分析の評価指標を理解し、分析結果を解釈できるようになること（分析・評価能力）・目的に応じてデータ処理方法や分析手法を選択し、一連の分析プロセスを設計・実行できるようになること（論理的な思考力、問題解決力）",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・講義時間では、分析手法の解説とともに、Pythonのサンプルプログラムを実行して理解を深める。演習時間では、個々の学生が講義内容に沿った分析課題に取り組む。・本講義は、各自のノートPCでプログラミングを行うため、毎回の授業でノートPCおよびACアダプタを持参すること。・論理的思考力の育成のため、授業及び課題取り組みにおいて、生成AIの使用を禁じる。",
        "notices": "・データサイエンスやAIの基礎的な内容を学んだ上で受講することが望ましい。・講義時間のサンプルプログラムの実行や演習はPythonを用いて行うため、Pythonの文法を理解していることを前提に授業を進める。・プログラミングはJupyter環境を使用するため、各自のノートPCにインストールしておくこと。",
        "preparatoryStudy": "毎回の授業は、それまでの講義・演習の内容が理解されていることを前提に進める。そのため、前回の授業で作成した演習課題のプログラムを、講義資料を参照することなく作成できるように繰り返し取り組むこと。授業前にMoodle上で公開された講義資料は確認しておくこと。",
        "gradingGuidelines": "・平常授業の演習課題（30%）と最終回の総合演習課題（70%）によって評価する。・授業内でTAのチェックによる演習課題のフィードバックを行う。",
        "textbook": "教科書の指定はなし。毎回、Moodle上に講義資料と演習資料を掲載する。",
        "referenceMaterials": "参考書の指定はなし。参考資料が必要な場合は、Moodle上に掲載する。",
        "courseSchedule": "第01回：データ検索/抽出第02回：データ集計第03回：データ加工第04回：データクレンジング第05回：データ可視化第06回：データ取得第07回：仮説検定第08回：レコメンドシステム第09回：クラスタリング第10回：予測分析①（過学習対策）第11回：予測分析②（ハイパーパラメータ探索）第12回：予測分析③（説明可能な予測モデル）第13回：要因分析第14回：総合演習",
        "courseDataUpdatedAt": "2025/02/06"
    },
    "updateAt": "2025/03/21"
}