{
    "lectureCode": "C20103",
    "courseName": "解析学応用I[S3]",
    "lecturer": [
        "加用一者(教養学環)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ４０２"
    ],
    "courceDetails": {
        "courseOverview": "「解析学応用I」では微分方程式および多変数関数の微分積分についての講義を行う．多くの自然・社会現象は微分方程式を用いて表現することができる．そのため微分方程式を立て，その解を考察することは，様々な現象を理解するための極めて重要な手法となる．講義前半では解析学の科学・工学全般への初歩的な応用に慣れるために，簡単な常微分方程式を扱う．また，より一般的な現象を扱うためには偏微分方程式の理論が必要になるが，その足がかりとして講義後半では多変数関数の解析学に関する基礎的な解説を行う．本講義では，論理的な思考力と問題解決力を身につけることを主な目標とする．加えて，工学への応用例に触れることを通して，実学に基づく専門能力や分析・評価の能力の基礎も養うこととする．また，数学の理工系分野における基礎的な言語としての役割について認識を深めることにより，コミュニケーション能力の習得も目指すこととする．",
        "outcomesMeasuredBy": "講義前半では簡単な常微分方程式を解くことができ，その解について考察できるようになること，また具体的な自然，社会現象についてモデル化を行い微分方程式をたてることができるようになることを目標とする．講義後半では偏微分の定義とその応用および重積分の定義について理解し，それらの基本的な計算が出来るようになることを目標とする．講義全体を通して基礎事項の解説を理解し，問題演習を行うこと，その際，単なるパターンの当てはめによる答案作成では終わらず，言葉の定義をよく理解し，演繹するという作業に意識を向けることで，論理的な思考力，問題解決力，コミュニケーション能力の習得を目指す．また，講義中に提示される応用例を通して実学に基づく専門能力，分析・評価能力の基礎を養う．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "理論の解説と問題の演習を行うが，自らも問題の演習を積極的に行って補うことが望ましい．尚，本講義ではクラスによってノートPCを出欠確認以外にも使用することがある．講義開始時のアナウンスに注意すること．",
        "notices": "講義を履修するにあたって，「解析学基礎」で学んだ事項を良く復習しておくこと．学期中は復習・予習を十分に行うこと．演習問題を解き，自ら力をつけること．",
        "preparatoryStudy": "各回の講義前には予定されているトピックについて，指定参考書や図書館の書籍などを読んで予習しておくこと．講義後は講義中に出された演習問題を解き，さらには講義内容について自力でまとめてみること．講義の内容を他者に対して説明できるようになることが望ましい．",
        "gradingGuidelines": "試験（約70％）のほか，レポート・小テスト・演習（約30％）を考慮して評価する．提出物や小テスト，学修状況について，講義中に適宜コメントや講評などの形でフィードバックを行う予定である．",
        "textbook": "石原繁，浅野重初「理工系入門微分積分」（裳華房）",
        "referenceMaterials": "矢野健太郎，石原繁「解析学概論（新版）」（裳華房）",
        "courseSchedule": "第1回:微分の定義と計算第2回:積分の定義と計算1（初等関数の基本的な積分）第3回:積分の定義と計算2（置換積分，部分積分，有理関数の積分）第4回:微分方程式の定義と例第5回:1階常微分方程式の解法1（変数分離）第6回:1階常微分方程式の解法2（線形）第7回:2階線形常微分方程式の解法1（同次方程式）第8回:2階線形常微分方程式の解法2（一般の場合）第9回:微分方程式の応用第10回:多変数関数とグラフ第11回:偏導関数の定義と計算第12回:高階偏導関数，テイラー展開第13回:多変数関数の増減および極値問題第14回:重積分の定義と計算",
        "courseDataUpdatedAt": "2024/02/29"
    },
    "updateAt": "2024/09/13"
}