{
    "lectureCode": "C20201",
    "courseName": "データと統計[A]",
    "lecturer": [
        "杉本岩雄(兼任講師)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ４０２"
    ],
    "courceDetails": {
        "courseOverview": "「ビックデータ」がIT用語として頻出されるごとく、社会のいたるところで大量のデータが蓄積され、日々更新・追加されている。また、様々な形態の大量データから、信ぴょう性の高い推論や判断を導くような実践的活動に主眼を置く数理体系の一つと言える「データサイエンス」が、理系や文系の枠を超えて幅広く注目されている。実験やアンケートなどから得たデータを扱う際、誤差を含んだデータや不十分な数のデータを用いて高精度な分析を行い、真の事象に導く手法を提供できる統計学は、IT関連技術の発展に伴い、益々その重要性を高めている。本講義では、統計の実用面を意識して、データ解析のための基本的な手法の理解とその結果を解釈できる能力を養うことを目的に講述する。本講義を受講すると、データの整理、確率分布、推定・検定、データ解析に関する知識が習得できるようになる。この授業では主に論理的な思考力、問題解決力と分析・評価能力、及び実学に基づく専門能力を身に付けることを目指している。",
        "outcomesMeasuredBy": "本講義の目標は、確率論（確率変数、確率的独立、極限定理など）および統計学（データ解析、相関分析など）の理解とその応用の習得である。実社会での不確定な事象が発出する複雑なデータを数理学的に統計分析する力を身につけることを介して、論理的な思考力や問題解決力を養う。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "原則として配布資料と教科書に沿って授業を進める。特に、複雑な図面、難解な内容については、学生ポータルから補足資料を配布する。小テストをMoodle上で実施することがあるため、ノートPCを必携すること。",
        "notices": "高校までの数学では、データ分析、場合の数と確率、確率分布を理解していると、この授業の理解が容易になる。また、大学1年次のデータサイエンス入門、解析学基礎、線形代数との関連があるので、必要に応じて見直してほしい。",
        "preparatoryStudy": "講義中に行う練習問題をよく復習し、次回の講義に備えておくこと。また、Moodleにあがっている次回の授業資料や教科書の該当箇所を確認し、内容が効率よく理解するできるよう、予習を心がけてほしい。",
        "gradingGuidelines": "小テスト(30%)、学期末試験(70%)によって総合的に成績を評価する。課題に関するフィードバックは、Moodleを中心に行い、授業でも必要に応じて補足説明をする。質問時間なども積極的に活用してほしい。",
        "textbook": "栗原伸一著、「入門統計学第2版―検定から多変量解析・実験計画法・ベイズ統計学まで－」、オーム社",
        "referenceMaterials": "伊藤公紀・伊藤裕康、「身につく統計学」、森北出版栗原伸一・丸山敦史、「統計図鑑」、オーム社渡辺浩・宮部賢志、「確率統計入門－モデル化からその解析へ－」、森北出版岩佐学・薩摩順吉・林利浩、「理工系の数理確率・統計」、裳華房",
        "courseSchedule": "第1回：データの整理：データの特徴と抽出、データの代表値第2回：データの整理:データの分布と関係性第3回：確率と確率分布：データの属性、集合・場合の数第4回：確率と確率分布：確率と分布、試行とその確率第5回：標本分布：確率分布の形と確率関数第6回：標本分布：母集団と標本、不偏統計量と二項分布第7回：推定：種々の確率分布と推定の基礎、中間まとめ第8回：推定：正規分布による近似と推定の考え方第9回：検定：統計的な推測と検定の考え方第10回：検定：種々の標本分布と代表的な検定第11回：母集団の推定、データの構成とその検定第12回：データの構成と３群以上の検定（分散分析）第13回：多重比較法と重回帰分析第14回：全体まとめ（実験計画法）",
        "courseDataUpdatedAt": "2024/02/29"
    },
    "updateAt": "2024/05/29"
}