{
    "lectureCode": "C20401",
    "courseName": "解析学応用II",
    "lecturer": [
        "千葉康生(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ４０２"
    ],
    "courceDetails": {
        "courseOverview": "「解析学応用II」では，理工学の分野で広く用いられる複素解析ならびにフーリエ解析についての講義を行う．実解析(実数を変数とする関数の解析学)で扱われる問題は，複素解析（複素数を変数とする関数の解析学）の問題として捉え直すと見通しが良くなることが多い．特にフーリエ解析は実解析の範囲では正弦関数と余弦関数に分けて考える必要があるのに対し，複素関数としての指数関数を用いると統一的に扱うことができる．また，このことによりフーリエ解析とラプラス解析との関係も明らかになる．そのため，本講義ではフーリエ解析についての効率的な理解に主眼を置き，はじめに複素解析の基礎的な解説を行った後，フーリエ解析の解説を行う．複素解析やフーリエ解析は信号処理・画像解析・データ圧縮などの技術を支える数学的基盤として重要であるが，時間があればそれらの工学的な応用についても概説する予定である．さらに，通常の関数の意味では微分できない関数の概念を拡張して超関数を導入し，それが微分方程式やフーリエ解析に有効であることを示す．本講義を通して，論理的な思考力と問題解決力を身につけることを主な目標とする．加えて，工学への応用例に触れることにより，実学に基づく専門能力や分析・評価の能力の基礎も養うこととする．また，数学の理工系分野における基礎的な言語としての役割について認識を深めることにより，コミュニケーション能力の習得も目指すこととする．",
        "outcomesMeasuredBy": "複素解析，フーリエ解析それぞれの内容について，以下のことを目標とする．○複素解析・複素関数の性質を理解し計算が出来るようになること・複素関数の微分可能性について理解し実関数との違いを認識すること・線積分の概念を理解しその計算が出来るようになること・Cauchyの積分定理を理解すること○フーリエ解析・三角関数の直交関係を理解し，フーリエ係数の計算ができるようになること・フーリエ余弦級数，フーリエ正弦級数，複素フーリエ級数を理解し，折れ線で表せるような周期関数のフーリエ級数展開ができるようになること・周期を長くした極限としてのフーリエ変換を理解すること・フーリエ変換とフーリエ逆変換との関係、線形性などフーリエ変換の性質を理解すること・超関数の概念を理解し，フーリエ変換との関係を理解すること講義全体を通して基礎事項の解説を理解し，問題演習を行うこと，その際，単なるパターンの当てはめによる答案作成では終わらず，言葉の定義をよく理解し，演繹を進めるという作業に意識を向けることで，論理的な思考力，問題解決力やコミュニケーション能力の習得を目指す．また，講義中に提示される応用例を通して実学に基づく専門能力，分析・評価能力の基礎を養う．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "理論の解説と問題の演習を行うが，自らも問題の演習を積極的に行って補うことが望ましい．講義に関する資料の確認や問題を解くためにノートPCを利用する.",
        "notices": "講義を履修するにあたって，微分積分，線形代数，複素数の計算などの内容をよく復習しておくこと．特に解析学基礎(微分積分I)の内容(微分の定義や計算方法，積分の定義や計算方法)をある程度把握していることを前提に講義は行われる.学期中は復習・予習を十分行うこと．",
        "preparatoryStudy": "各回の講義前には予定されているトピックについて，指定参考書や図書館の書籍などを読んで予習しておくこと．講義後は講義中に出された演習問題を解き，さらには講義内容について自力でまとめてみること．講義の内容を他者に説明できるようになることが望ましい．",
        "gradingGuidelines": "期末試験を中心（約80％）に，小テスト・レポート（約20％）を考慮して評価する．提出物や小テスト，学修状況について，講義中に適宜コメントや講評などの形でフィードバックを行う予定である．",
        "textbook": "教科書は指定しない．",
        "referenceMaterials": "矢野健太郎，石原繁「解析学概論（新装版）」（裳華房）参考書として挙げられている書籍を予習，復習のために活用することを強く推奨する．",
        "courseSchedule": "第1回：はじめに，複素解析，フーリエ解析と応用例第2回：三角関数とその性質，複素数，複素平面，オイラーの公式第3回：三角関数，指数関数の微分積分第4回：複素関数の定義と例第5回：複素関数の導関数および正則性の定義，コーシー・リーマンの方程式第6回：複素関数の積分と基本的性質第7回：コーシーの積分定理と積分路の変形第8回：コーシーの積分公式とローラン展開第9回：特異点の種類と留数計算第10回：留数計算とその応用第11回：フーリエ級数展開：定義第12回：フーリエ級数展開：一般的な場合の計算例第13回：フーリエ変換，フーリエ逆変換，超関数第14回：フーリエ解析の応用",
        "courseDataUpdatedAt": "2024\/01\/31"
    },
    "updateAt": "2024\/09\/13"
}