{
    "lectureCode": "C20701",
    "courseName": "経営戦略デザイン",
    "lecturer": [
        "山口淳(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "〇企業は、取り巻く環境の中で生じている機会（戦略機会）に対して、自社の資源や能力を適合させることを通じて、他社に打ち勝つ競争優位を築く。そして、その競争優位の結果として利益を上げ、自らの理念を達成する。〇経営戦略とは、この競争優位を持続的に確立するための大局的な方針であり、その方針を顧客視点から総合的に構想・設計することが経営戦略デザインである。〇この講義では、企業を取り巻く環境の分析方法、企業の資源や能力の分析方法、及び、顧客視点から捉えた自社の資源と能力の適合のさせ方について、数多くの身近な事例を通じて学ぶことを目的とする（分析・評価能力）。その上で、それらの分析方法を実際に活用する演習も多数行い、経営戦略をデザインする能力を身に付ける（実学に基づく専門能力）。〇ICTエンジニアにとって経営戦略デザインの知識を活用することが求められる場面は2つ考えられる。1つは、自らが起業や新規事業創造に携わる際に、サービス、ビジネスモデル、戦略を構築する場面である。そしてもう1つは、顧客のシステム企画・提案・構築を行う際に、情報を含む経営資源と組織能力の統合のさせ方を構想・設計する場面である。〇この授業は教員の東京ガスにおける戦略・経営計画立案や、経営管理システム企画・開発に従事した実務経験に基づく実践的科目である",
        "outcomesMeasuredBy": "１）経営環境と企業の資源・能力の分析方法を理解し、分析が実践できる能力を修得する。（実学に基づく専門能力、分析・評価能力）２）戦略機会を把握し、顧客視点から捉えた資源・能力の統合の方法について理解し、統合を構想・設計するための視点を修得する。（実学に基づく専門能力、分析・評価能力）",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力",
        "teachingMethod": "○授業では、講義用スライドを基に、理論の基礎的内容について学ぶ。また、授業内で事例分析や演習をチームでのグループディスカッションにより行ない、チームでの発表の機会も設け、アクティブラーニングにより進める。○本講義は、毎回の講義前の事前アサインメントを課す。事前アサインメントは、前回講義内容の復習と次回のグループディスカッションの演習内容の準備学習を扱い、講義ではアサインメントの理解状況や回答内容、疑問点を紹介して解説する反転授業を行う。〇全回ノートPC必携である。〇授業（グループディスカッションやチームでの発表を含む）、及び個人課題（事前アサインメント、期末レポート）の取組において、生成AIを利用してもよいが、次の３項目についての明記を必須とする。1)利用箇所の明記：生成AIを利用して作成した箇所を明記すること、2)出典の明記：利用結果（生成AIの成果物）の根拠となる事例や理論の出典は自らが探し明記すること、３)妥当性評価の明記：利用結果（生成AIの成果物）の妥当性について自らが評価しその評価内容について記述すること。",
        "notices": "〇この講義において、事前アサインメントとグループディスカッションへの取り組みが実践的な知識修得の鍵となるため、両者への熱心な取り組みを強く勧める〇グループディスカッションのチームは、第1回に仮編成し、第2回に正式編成する。本講義では、チームによるグループディスカッションが講義全体を通した核となるため、受講希望者は第1回・第2回のチーム編成に参加することを必須とする。",
        "preparatoryStudy": "各回の事前アサインメントの課題により復習と予習を行う。復習の課題は、前回講義で学んだ理論の内容や活用方法や活用時の留意点、講義内で取り上げた事例に関して整理を行うとともに、その中での疑問点や発展的な疑問について整理する内容である。予習の課題は、次回の講義内容と関連する事例や理論内容の予習であり、事例について自ら考察・分析することや、理論内容に関するスライドを読み理解した点と疑問を持った点について整理する内容となっている。学修時間の目安としては、各回とも復習120分程度、予習120分程度である。",
        "gradingGuidelines": "事前アサインメントの評価25％、チーム活動の評価35％、期末レポートの評価40％により成績評価を行う。事前アサインメントでの質問に関しては各回および授業パートのまとめの回でのフィードバックを行う。チーム演習や発表のフィードバックについては、各授業で実施する。",
        "textbook": "指定しない。",
        "referenceMaterials": "ロバート・M・グラント(著),加瀬公夫(監修)『グラント現代戦略分析』中央経済社，2019年",
        "courseSchedule": "第1回：講義の目的と進め方，経営戦略とそのデザイン第2回：経営戦略の3大要素と全体像第3回：企業の目的第4回：ドメイン、全社戦略と事業戦略、次回チーム演習対象企業選定第5回：チームでの演習と発表1（企業理念と戦略）第6回：環境分析１＿SWOT分析と戦略的適合性第7回：環境分析2＿マクロ環境分析：PEST分析第8回：環境分析3＿ミクロ環境分析：５Forcesと影響要因の分析第9回：チームでの演習と発表2（PEST分析,５Forces分析）第10回：組織能力分析１＿バリューチェーン分析第11回：組織能力分析2＿VRIN・VRIO分析第12回：事業戦略のデザイン１＿コスト優位性を軸とした戦略要素の統合、チームでの演習と発表3（コストリーダーシップ戦略）第13回：事業戦略のデザイン２＿差別化を軸とした戦略要素の統合、チームでの演習と発表4（差別化戦略）第14回：講義全体のまとめ",
        "courseDataUpdatedAt": "2025/01/04"
    },
    "updateAt": "2025/03/21"
}