{
    "lectureCode": "C20701",
    "courseName": "コンピュータ概論III[A]",
    "lecturer": [
        "亀田弘之(兼任講師)",
        "瀬之口潤輔(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金3",
        "金4"
    ],
    "targetDepartment": "",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "研究棟Ａ４０２"
    ],
    "courceDetails": {
        "courseOverview": "本授業は、基礎・理論編と応用・実践編の２部構成となっている。基礎・理論編では、手始めにコンピュータにおける基本的な概念「数」を取り上げ、「数」の深い理解を目指すとともに、コンピュータサイエンスの奥の深さを垣間見る。次いで、コンピュータサイエンスにおいて「論理」が如何に基礎的であり、かつそれ故に重要であるかを事例を通して知る。一方本授業の応用・実践編では、人工知能と機械学習の基礎となる統計解析の知識を理解し、例題を使用してデータ解析を行う手法を概説する。また実際のデータを用いてpythonにより機械学習モデルを作成し、データの解析や将来予想を行うスキルを身に付ける。",
        "outcomesMeasuredBy": "本授業の到達目標は以下のようになっている。1.コンピュータにおける数の取り扱いを深く理解する（実学に基づく専門能力）2.論理に関する基礎的な諸事実を知る（論理的な思考力）3.人工知能と機械学習の基礎的な知識を理解する（実学に基づく専門能力）4.伝統的な統計的手法によるデータ解析手法を習得する（分析・評価能力）5.点推定・区間推定および仮説検定の基本を徹底的に理解し、統計学について重要なテーマを基本から理解する（分析・評価能力）",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "各回の授業はいずれも、講義と演習がセットになって構成されている。質問は随時行うので、積極的に教員と交流を図ること。授業は配布資料を中心に進める。演習は教科書から離れた内容を扱うことがある。ノートPCは必携。単に知識を知るだけではなく、積極的に手を動かすことと。",
        "notices": "知識やスキルなど自分に足りないものが発覚した場合、自主的・主体的に勉強すること。まずは復習をしっかりと、かつ、着実に行うこと。くれぐれもわからない箇所を残さないように心がけること。",
        "preparatoryStudy": "予習・復習は、学生個々が主体的に適宜行うこと。特に予習に関しては、教科書の該当範囲をよく読んでおくことが肝要である。",
        "gradingGuidelines": "授業中での発言（30%）、授業中に実施する小テスト（30%）、最終課題の結果(40%)を総合的に判断し、成績評価を行う。なお、テストの回答例は、解説も添えながら適宜Moodleにて周知する。",
        "textbook": "向後千春、冨永敦子「統計学がわかる（ハンバーガーショップでむりなく学ぶ、やさしく楽しい統計学）」技術評論社、1,680円",
        "referenceMaterials": "1.RussellandNorvig「エージェントアプローチ人工知能第2版」（共立出版)、18,700円。2.情報処理推進機構「AI白書2022」、4,840円。",
        "courseSchedule": "※第1回～第7回：亀田、第8回～第14回：瀬之口担当第1回：数と計算理論的には無限個存在する数を、人類が計算をどう克服してきたかを理解する。第2回：論理と計算（命題論理と推論）組み合わせ回路を例として論理と推論の基本概念を学ぶ。第3回：論理と計算（述語論理と推論）自然言語と述語論理の関係をもとに、コンピュータに推論させる。第4回：論理と計算（人工知能実現へ向けて）Prolog言語を使い、人工知能プログラムを作成する。第5回：コンピュータにおける関数（関数のプログラミング）Pythonなどでの関数の実装例を取り上げ、関数実装の難しさについて知る。関数型言語Lispを体験する。第6回：チューリングマシンと量子コンピュータコンピュータにおける基本原理をチューリングマシンと量子コンピュータで紹介する。第7回：ここまでのまとめ産業革命を例に、技術と社会の関係などについて学び、今後の社会におけるコンピュータサイエンスの役割や進むべき道を考える。第8回：統計的手法（データ解析の基礎）データ解析の基礎となる平均と分散、ヒストグラムの概念を理解し、実際のデータを用いてデータ解析の基礎を身に付ける。第9回：統計的手法（確率変数と確率分布）伝統的な統計的手法を使いデータ解析する。確率変数と確率分布の概念を理解し、データ解析の基礎を身に付ける。第10回：母集団と標本標本から母集団の特徴を推定するために、点推定の手法を身に付ける。また統計・解析に特に重要な概念である大数の法則、中心極限定理も理解する。第11回：いろいろな離散型確率分布母集団の特徴を捉えるために、いろいろな確率分布の知識を得る。この回では離散型の確率変数に対応する分布、とくに二項分布、ポアソン分布、幾何分布について、確率関数の導入の仕方を含めて解説する。第12回：いろいろな連続型確率分布母集団の特徴を捉えるために、いろいろな確率分布の知識を得る。この回では連続型の確率変数に対応する分布、とくに正規分布、χ2乗分布、t分布を中心に、確率関数の導入の仕方を含めて解説する。第13回：区間推定と検定これまでの授業で習得したスキルを用いて、データ解析の重要な部分である母数の区間推定と検定を学ぶ。第14回：総括最終課題",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}