{
    "lectureCode": "C21201",
    "courseName": "データビジュアライゼーション",
    "lecturer": [
        "渡辺昌洋(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "月4",
        "月5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "片柳研究所Ｃ１００１",
        "片柳研究所Ｃ１００２"
    ],
    "courceDetails": {
        "courseOverview": "情報通信に関わる企業の研究所において製品、サービスのデザイン経験を有し、ワークショップのデザイン方法の立案などに携わった長年の実務経験を元に、情報の可視化に関する知識や方法を講義形式とアクティブラーニングとしてのワークショップ形式の演習を実施する実践的科目である。演習においてプログラミング言語の前提知識は不要である。ビッグデータが普及し、データに触れる機会が増えている。データを活用するためには、データのビジュアライゼーション（可視化）がますます重要になっている。データを正しく使いこなすためには、データの概要を把握し、目的に沿った可視化を行い、人に伝えられることが重要である。そのためには、データを正しく解釈し、データの持つ情報を正しく伝達するための「データビジュアライゼーション」という視点が不可欠である。さらに、与えられた可視化データを正しく解釈する力も重要である。データビジュアライゼーションには、データを概観する、気付きを与える、情報を他人に伝えるという3つの側面がある。本講義では、ユーザ体験（UX）デザインの観点から、データビジュアライゼーションの役割を学修する。データ取得方法から始め、様々な方法で可視化する。様々にあるデータビジュアライゼーションの手法を使いこなせるようにする。伝えたい情報に適したデータビジュアライゼーションの方法を選択し、どのようにすると情報が伝わるかに主眼を置き学習を深める。UXデザインにおけるデータの位置づけからデータビジュアライゼーションを理解し、データの持つ意味を理解することができるようになることを目的とする。",
        "outcomesMeasuredBy": "次の4点ができるようになることを到達目標とする。・データに適したビジュアライゼーション手法を説明することができる（実学に基づく専門能力）・UXデザインプロセスを理解し、データビジュアライゼーションの位置づけを説明することができる（論理的な思考力）・データ取得の方法を理解し、データ分析の結果を適切なビジュアライゼーションにより説明することができる（分析・評価能力）・データビジュアライゼーションの結果明らかになった問題に対し、実効性のある問題解決策の仮説を立てることができる（問題解決力）",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ショートレクチャーおよびグループワークにより授業を行う。データを取得するための実験計画を立案し、調査、実験を行う。グループでのプレゼンテーションおよび個人レポート等により、理解度を確認する。プレゼンテーションの機会を講義中に何度も設ける。中間・期末のチーム発表に加え、各回のチーム活動の成果や進捗を学生自身がクラス全体に向けて発表する機会を持ち、学生の主体的な学びを促進するアクティブラーニングを実施する。なお、授業（グループ成果物作成）や個人課題（中間・期末レポート、個人振り返りレポート）作成において生成AIを利用してもよいが、次の３項目についての明記を必須とする。1)利用箇所の明記：生成AIを利用して作成した箇所を明記すること、2)出典の明記：利用結果（生成AIの成果物）の根拠となる事例や理論の出典は自らが探し明記すること、3)妥当性に関する考察の明記：利用結果（生成AIの成果物）が、求められているテーマやその条件に対して、妥当な回答と言えるかに関する自らの考察・評価を記述すること。",
        "notices": "データ取得、情報検索、データビジュアライゼーション、プレゼンテーションのためノートPCを使用する。",
        "preparatoryStudy": "予習として、講義前に授業資料に目を通し、講義内容について把握して授業に臨むこと。さらに、世の中にあるデータビジュアライゼーションの事例について調査すること。復習として、講義後に毎回の講義内容やチーム活動に関する振り返りのレポート作成を課題とするので期限までに提出すること。事前学習時間の目安は予習120分と復習120分を含む予復習300分程度。",
        "gradingGuidelines": "チーム活動による成果物の評価（30%）、個人に対する成果物・授業貢献・チーム活動貢献の評価（30％）、授業中内の理解度チェックを含む理解度確認結果の評価（40%）により評価する。チーム発表内容はその講義中もしくは次回の講義で内容に関するフィードバックを行う。毎回の個人レポートや毎回のチーム活動についても、特に優れた内容や全体的な傾向、課題とすべき内容について、適宜フィードバックを実施する。",
        "textbook": "指定なし（都度、必要な教材を配布する）",
        "referenceMaterials": "小久保奈都弥著「データ分析者のためのPythonデータビジュアライゼーション入門」（翔泳社）2020年永田ゆかり著「データ視覚化のデザイン」（SBクリエイティブ）2020年藤俊久仁、渡部良一著「データビジュアライゼーションの教科書」（秀和システム）2019年その他、講義中に紹介する",
        "courseSchedule": "第1回：イントロダクション/チームビルディング第2回：データとは？/ビジュアライゼーションの手法（１）第3回：データ尺度と実験計画法/ビジュアライゼーションの手法（２）第4回：統計解析と実験計画法/ビジュアライゼーションの手法（３）第5回：心理尺度/ビジュアライゼーションの手法（４）第6回：心理実験の実践/ビジュアライゼーションの手法（５）第7回：理解度確認/ビジュアライゼーションの手法（６）第8回：データビジュアライゼーションの実践第9回：データ取得の準備第10回：データ取得調査・実験第11回：データ分析第12回：発表準備第13回：発表（プレゼン）第14回：振り返りとまとめ",
        "courseDataUpdatedAt": "2025/02/07"
    },
    "updateAt": "2025/03/21"
}