{
    "lectureCode": "C21301",
    "courseName": "プロジェクト分析・管理",
    "lecturer": [
        "細野繁(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門基礎教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "月4",
        "月5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "片柳研究所Ｃ１００１",
        "片柳研究所Ｃ１００２"
    ],
    "courceDetails": {
        "courseOverview": "この科目では、プロジェクトマネジメントの基礎から高度な分析手法までを体系的に学修する。プロジェクトマネジメントの基本原則やツール、手法を学び、実際のプロジェクトに適用するための方法を探求する。授業の前半回では、プロジェクトマネジメントの基礎理論を学ぶ。具体的には、プロジェクトの定義、ライフサイクル、ステークホルダーの識別と管理、スコープ管理、時間管理、コスト管理、品質管理、リスク管理、資源管理、コミュニケーション管理などの主要な領域について学ぶ。次に、プロジェクトマネジメントツールの使用方法を学び、プロジェクトのスケジュール作成やタスク管理、進捗状況の追跡、チームメンバーとの協力方法などについて学ぶ。授業の後半回では、DX（デジタルトランスフォーメーション）に関わるプロジェクトマネジメントの専門的なトピックを学ぶ。また、チームでプロジェクト実施に比重を置いて、開発ライフサイクルの工程に沿って知識とスキルを統合的に適用する。これにより、理論と実践を結びつけ、現実のプロジェクトマネジメントに直結する実践力を養う。この科目では主に実学に基づく専門能力、論理的な思考力、分析・評価能力、問題解決力の修得を目指す。※本科目は、担当教員がICT企業においてシステム開発プロジェクトに従事した実務経験に基づき、大学で学ぶ基礎的な技術や知識が実際の製品開発にどのように利用されているかについて解説する実践的科目である。",
        "outcomesMeasuredBy": "プロジェクトマネジメントの基本的な概念と原則を理解し、これを実際のプロジェクトに適用できること。これには、プロジェクトライフサイクル、スコープ管理、タイムマネジメント、コスト管理、品質管理、リスク管理、資源管理、およびコミュニケーション管理が含まれる。また、プロジェクトマネジメントツールの使い方を習得する。これにより、プロジェクトの計画、スケジュール作成、タスク管理、進捗追跡、およびチームコラボレーションを効率的に行えることを目指す。また、ケーススタディのプロジェクトを通じて、現実のプロジェクト環境で即戦力となる力を身につける。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "本科目では、理論と実践をバランスよく学べるように、授業方法を組み合わせて進行する。授業の前半回では、プロジェクトマネジメントの基本原則や理論、主要なコンセプトについての講義を行う。講義は、プロジェクトマネジメントの主要な知識体系（PMBOKガイド）を基に、基礎から高度な内容まで段階的に理解できるよう内容で構成する。ここで修得した理論を踏まえて授業の後半回からAIサービス開発を題材にチーム毎にプロジェクト計画の策定～実施に比重を置く。これにより、現実のプロジェクトマネジメントにおける課題解決能力を養う。また、チームでのディスカッションを通じて、コミュニケーションスキルやチームワークの重要性を理解し、実践する力を養う。ノートPC必携のこと。なお、論理的思考力の育成のため、授業及び課題取り組みにおいて生成AIの利用を一切認めないことがある。",
        "notices": "授業では講義だけでなく、実践演習やグループディスカッション、ケーススタディなども行う。これらの活動への積極的な参加が求められる。自分の意見を述べ、他の学生と協力して課題に取り組む姿勢が重要である。プロジェクトマネジメントそのものが時間管理と自己管理を重視する分野である。課題の提出期限やプロジェクトの進行状況をしっかりと管理し、計画的な学修が求められる。遅延や未提出は評価に影響するため、注意すること。",
        "preparatoryStudy": "プロジェクトマネジメントはビジネスの多くの分野と関連している。事前学習において基本的なビジネスプロセスやマネジメントに関する書籍や資料を読むこと。この内容には、経営戦略、組織構造、マーケティング、ファイナンスなどが含まれる。授業後は、授業内容を振り返り事前学習で読んだ資料を再読すること。事前学習時間の目安は予習120分と復習120分を含む予復習計300分程度。",
        "gradingGuidelines": "全レポートを提出すること。チームでの共同検討と発表による理解度の評価（30％）、授業中に実施する理解度チェックによる評価（50％）、レポートによる理解度の評価（20％）課題レポートに対して、受講者全体へのフィードバックを行う。授業中に実施する理解度チェックについては、実施後その解答例を提示する。",
        "textbook": "プロジェクトマネジメント標準PMBOK入門：（PMBOK第7版対応版）、広兼修、オーム社（2022）、2,420円（税込）",
        "referenceMaterials": "・ITエンジニアのためのプロジェクトマネジメント基礎講座、金田光範、C&R研究所（2024）、2,552円（税込）・P2Mプログラム&プロジェクトマネジメント標準ガイドブック、日本プロジェクトマネジメント協会、4,620円（税込）・プロダクトマネジメントのすべて、及川卓也、曽根原春樹、小城久美子、翔泳社（2021）、2,970円（税込）・AIプロジェクトマネージャのための機械学習工学、吉岡信和、内平直志、鷲崎弘宜、竹内広宜、科学情報出版（2023）、3,300円（税込）",
        "courseSchedule": "第1回：プロジェクトとは，プロジェクトマネジメントとは第2回：プロジェクトマネジメント活動1（5つのプロセス）第3回：プロジェクトマネジメント活動2（10の知識エリア）第4回：計画フェーズ第5回：要求定義フェーズ第6回：設計・開発フェーズ第7回：テスト・移行フェーズ，運用・保守フェーズ第8回：プロジェクトマネジメントツール第9回：プロジェクトマネジメントの実践1（アジャイル開発他）第10回：プロジェクトマネジメントの実践2（AIプロジェクト他）第11回：プロジェクトマネジメントの発展1（プログラムマネジメント他）第12回：プロジェクトマネジメントの発展2（プロダクトマネジメント他）第13回：プロジェクトマネジメントの発展3（事例分析）第14回：チーム発表、理解度チェック",
        "courseDataUpdatedAt": "2025/02/05"
    },
    "updateAt": "2025/03/21"
}