{
    "lectureCode": "C21402",
    "courseName": "コンピュータアーキテクチャ[後期]",
    "lecturer": [
        "松下宗一郎(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ５０２"
    ],
    "courceDetails": {
        "courseOverview": "本講義では、コンピュータハードウエアの基本構成要素となっているディジタル論理回路について、入力、出力、記憶、演算、制御といった各機能要素との関わりを参照しつつ、基本的な特性や設計上の諸条件を論じる。また、コンピュータの内部におけるディジタルデータの表現と、記憶や伝送、演算処理といった具体的な取扱いを考察することで、シンプルな固定ビット長の整数数値から浮動小数点数や自然言語情報にいたる多種多様なデータを、ハードウエアによって効率よく処理する手法について学習する。そして、原理的にはディジタル数値の逐次処理装置であるコンピュータのハードウエアを、人間による記述や理解を前提としているプログラミング言語による汎用的な情報処理システムの構築へと結びつけている機械語について、処理速度や実装コストとこれらの間のトレードオフ関係といった実用的な視点を交えつつ学ぶ。さらには、コンピュータシステムの性能に大きな影響を及ぼす並列処理の実装とその制約条件について知ることで、システムに要求された性能を達成する上で最適なコンピュータアーキテクチャを要素ごとに分析・評価し、構築をしていく手法について論じていく。",
        "outcomesMeasuredBy": "コンピュータの内部におけるデータ表現とその処理をハードウエアによる実装の視点から知ることで、レイテンシやスループットといった性能指標とその原理を理解する。また、ソフトウエアを実行した際のコンピュータシステムの効率や性能の視点から、最適なデザインを行う上での指針を立てられるようになることを目標とする。そして、コンピュータの内部で起きていることについての論理的な思考力、実践的なアーキテクチャの比較を行うための実学に基づく専門能力ならびに分析・評価能力を習得する。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "スクリーン投影や黒板への板書を併用した座学形式にて実施する。",
        "notices": "この科目は１年次開講科目であるコンピュータ概論I及びコンピュータ概論IIを確実に履修していることを前提としている。また、理解度確認小テストを実施するため、講義WebサイトにアクセスできるノートPCないしはモバイル通信機能つき端末が必要となる。",
        "preparatoryStudy": "コンピュータアーキテクチャにおける性能トレードオフを扱うため、速度（時間、周波数）、消費電力（発熱量、電源容量）、実装サイズといった現実世界における指標に関する基礎的な知識が必要となる。特に1年次のコンピュータ概論Iにおいては、論理回路の基本原理ならびに回路設計の手法についての理解がこの授業の前提となっている。また、コンピュータアーキテクチャの歴史上、多くの用語や概念が英語由来となることから、関連する基礎教養科目を確実に履修しておくことが求められる。以上により、事前予習としては１年次に開講されているコンピュータ概論I,コンピュータ概論IIを復習するとともに、ＰＣやスマートフォン等で用いられるコンピュータの概要や専門用語の英語表現についても、随時知見を得ていくことが求められる。また、コンピュータを構成する各回路要素と計算性能との関わりについては、講義内で紹介する実例を中心に十分な復習が必要である。",
        "gradingGuidelines": "講義内にて実施する理解度確認小テスト（50％）ならびに期末試験（50％）にて成績評価を行う。このうち、理解度確認小テストについてはMoodle上に設置する講義サイト等を通じ、採点結果や問題解説を適宜行っていく。",
        "textbook": "特に指定しない。",
        "referenceMaterials": "講義の中で必要に応じて紹介する。なお、JMOOC（https:\/\/www.jmooc.jp\/)にて、入門者向けのオンライン大学講座「コンピュータのしくみ」を開講している。",
        "courseSchedule": "第1回：コンピュータアーキテクチャとは第2回：コンピュータを構成する要素～演算・記憶・伝送～第3回：論理演算回路と記憶回路の原理第4回：回路の動作速度と消費電力第5回：算術および論理演算回路第6回：記憶回路と階層構造第7回：データ通信インタフェース第8回：状態機械としてのコンピュータ第9回：機械語とアセンブリ言語第10回：メモリアーキテクチャ～レジスタから仮想記憶まで～第11回：コンピュータ資源とその管理第12回：コンピュータにおける性能とコストのトレードオフ第13回：コンピュータアーキテクチャの実例第14回：講義全体のまとめ",
        "courseDataUpdatedAt": "2024\/02\/29"
    },
    "updateAt": "2024\/09\/13"
}