{
    "lectureCode": "C21801",
    "courseName": "オペレーティングシステム[後期]",
    "lecturer": [
        "串田高幸(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ４０３"
    ],
    "courceDetails": {
        "courseOverview": "オペレーティングシステムは，コンピュータのハードウェア資源を管理するための基本ソフトウェアである．このソフトウェアは，利用者とコンピュータのハードウェアの間に設置して，プログラムのロードと実行，メモリ領域の管理，プロセスとスレッドのスケジュール，ファイルシステムとそのアクセスを管理している．オペレーティングシステムの基本機能として，プログラムの管理，プロセスの管理，メモリの管理，ファイルシステムの管理，I/Oの管理及び周辺ハードウェア機器の管理がある．この授業では，オペレーティングシステムとは何かという定義を理解する．次にオペレーティングシステムにおけるプロセスとスレッドについて学び，それらの実行を管理しているスケジューリングの技術について理解する．また，並行プロセスにおける排他制御のセマフォアとモニタに関する技術を理解する．メモリ管理では，領域割り当て，ページング，セグメンテーション，仮想記憶及びページ置き換え方式の技術について理解する．ファイル管理では，ファイルシステムの基礎とより進んだファイルシステムの技術について理解する．また，クラウドで使われている仮想化技術について理解する．",
        "outcomesMeasuredBy": "・オペレーティングシステムの概念と基本機能を理解して説明できるようになり，さらに基本機能の相互関係を論理的な思考をもとに説明できるようになる．（論理的な思考力）・オペレーティングシステムの基本機能を実現している要素技術を理解して，基本機能を利用するための知識を獲得する．また，オペレーティングシステムの管理技術を理解して，実際にシステムを開発するときや利用するときに必要になる専門能力とスキルを獲得する．（実学に基づく専門能力）",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力",
        "teachingMethod": "・授業は，教科書を使った講義形式で行なう．・講義資料は，Moodleからファイルをダウンロードできるようにする．・授業中に復習問題，小テストや質疑応答のアクティブラーニングを行なうことで内容の理解を深める．・授業中にMoodleを使った復習問題や小テストを行うため，ノートブックＰＣと教科書を必ず持ってくること．・授業内容の理解度を向上させるために，宿題を出すので期限までに提出すること．・論理的思考力の育成のため，授業，復習問題，小テスト及び宿題の取り組みにおいて，生成AIの使用を禁じる．",
        "notices": "・Web出席管理で出欠を記録する．・授業の開始時刻に遅刻せずに出席すること．・授業開始から10分以上経過した後の遅刻者は，欠席として扱う．また，理由が不明確な途中退出と早退は，欠席として扱う．・授業中によくわからない箇所や疑問点は，その場で質問をして理解するようにすること．・授業に関連する技術ニュース，新聞記事，専門誌を日頃から読んで，身の回りや企業での活用事例に関する理解を深めることを努めること．",
        "preparatoryStudy": "・予習は，教科書と配布資料を授業前までによく読んで理解してくること（60分程度）．・予習は，次の授業に関連する資料を検索によって探し出して，その資料の内容を理解しておくこと（60分程度）．・復習は，授業で行った内容の理解を深めるために教科書や関連資料を再度読んで理解すること（60分程度）．・復習として，授業中に理解ができなかった内容だったり疑問が残ったりした箇所は，自ら小テストを再度実施して理解を深めること．また，教科書と配布資料の該当箇所を再度読んで内容を理解すること（60分程度）．",
        "gradingGuidelines": "・成績評価は，期末試験の結果（50%），小テストと宿題の結果（50%）をもとに毎回の授業態度を入れて行う．・100点満点で60点以上を単位として認める．・ただし，復習問題，小テストあるいは宿題の提出数が基準よりも足りないときは，不合格になる．・学習内容を定着させるために，復習問題，小テストと宿題の結果をMoodleによってフィードバックする．・宿題の模範解答を授業で説明することでフィードバックを行なう．",
        "textbook": "松尾啓志著,オペレーティングシステム（第2版），森北出版株式会社．",
        "referenceMaterials": "大澤範高著,オペレーティングシステム,コロナ社．A.Silberschatzetal.,OperatingSystemConceptsEssentials,JohnWiley&SonsLtd.",
        "courseSchedule": "第1回オペレーティングシステムとは第2回CPUの仮想化：プロセス第3回CPUの仮想化：スケジューリング第4回並行プロセス：排他制御基礎第5回並行プロセス：セマフォア第6回並行プロセス：モニタ第7回主記憶管理：基礎第8回主記憶管理：領域割り当て第9回主記憶管理：ページング第10回主記憶管理：セグメンテーション第11回主記憶管理：仮想記憶第12回主記憶管理：ページ置き換え方式第13回ファイル：基礎第14回ファイル：より進んだファイルシステム",
        "courseDataUpdatedAt": "2025/02/05"
    },
    "updateAt": "2025/03/21"
}