{
    "lectureCode": "C21802",
    "courseName": "計算アルゴリズム[後期]",
    "lecturer": [
        "大石邦夫(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水3"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ３０３"
    ],
    "courceDetails": {
        "courseOverview": "基本的なデータ構造（配列、ポインタを利用したリスト、スタック、キュー、木等）を理解する。代表的な整列アルゴリズム、分割統合法と再帰、データの検索、グラフアルゴリズム、技術計算の仕組みを理解する。また、アルゴリズムを時間計算量で評価し、アルゴリズムの特徴や性能について学ぶ。また、これらの知識を様々なプログラミングに応用できる基本的な力を身につけることを目的とする。",
        "outcomesMeasuredBy": "1)コンピュータを用いた数学的な問題解法手順について理解できるようになる。（論理的な思考力、問題解決力）2)アルゴリズムの特徴や性能を評価できるようになる。（論理的な思考力、問題解決力）3)専門の研究を始めたときに、発展的に知識をレベルアップできるようになる。",
        "learningOutcomes": "論理的な思考力問題解決力",
        "teachingMethod": "原則として配布資料に沿って授業を進める。複雑な図面、難解な内容については、学生ポータルから補足資料を配布する。毎回、講義中にMoodle上で小テストを実施するので、ノートPCは必携とする。",
        "notices": "計算手順に関するプログラミングを授業では扱わないが、毎回、自宅で授業内容に基づきプログラミングを学習すると、アルゴリズムの仕組みが深く理解できる。",
        "preparatoryStudy": "C言語とそのプログラミングの知識・経験があると理解が容易になる。予習として、次回講義資料と教科書を熟読して、指示に従い例題を解法してみること。復習として、講義の小テストをもう一度自ら解答した後、正解を用いて答え合わせを行い、間違いがあれば訂正すること。また、授業で扱ったアルゴリズムに基づき自分でプログラムを作成することを通じて理解を深めること。",
        "gradingGuidelines": "小テスト(20%)、期末試験(80%)によって総合的に成績を評価する。小テスト、期末試験、課題等の実施後にMoodleに正解、受験結果、解答例を掲載するとともに、小テストについては次回の講義冒頭で解説する。",
        "textbook": "藤原暁宏、”アルゴリズムとデータ構造”、森北出版",
        "referenceMaterials": "大谷紀子、志村正道、”アルゴリズム入門（改訂版）”、コロナ社田中敏幸、”数値計算法基礎”、コロナ社",
        "courseSchedule": "第1回:アルゴリズムとは何か、アルゴリズムの評価基準、データ構造：配列とリスト第2回:データ構造：二分木、数式と木、ヒープ第3回:再帰コール：再帰コールとスタック、再帰コールによる階数とフィボナッチ数列の計算、ユークリッドの互除法、ハノイの塔の問題第4回:データの探索：線形探索法、二分探索法第5回:ソート（整列）：単純選択法、バブルソート第6回:ソート（整列）：ヒープソート、クイックソート第7回:文字列照合：素朴な照合法、ホールスプールの探索アルゴリズム、ボイヤ-ムーア法第8回:グラフ：グラフの表記と用語、隣接行列と隣接リスト第9回:アルゴリズム設計の基本的技法：分割統治法と再帰、バックトラック法、分枝限定法第10回:動的計画法:多項式と行列：動的計画法に基づく多項式の計算、分割統治法と動的計画法に基づく合同式の計算、分割統治法による行列の連続積第11回:固有値問題と方程式の解法：固有値と固有ベクトル、ニュートン法、ガウス消去法第12回:方程式の解法：ガウス・ジョルダン法、常微分方程式の解法、オイラー法、ルンゲ・クッタ法、連立常微分方程式の解法第13回:補間法：ラグランジュ補間、ニュートン補間、数値積分、数値積分：台形公式、シンプソンの公式第14回:全体まとめ",
        "courseDataUpdatedAt": "2024/02/29"
    },
    "updateAt": "2024/09/13"
}