{
    "lectureCode": "C22201",
    "courseName": "ソフトウエアエンジニアリング[前期]",
    "lecturer": [
        "竹田昌弘(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金2"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ３０２"
    ],
    "courceDetails": {
        "courseOverview": "情報システムあるいはソフトウェアは、情報社会にとって欠かすことができない。ほとんどすべてのソフトウェアは人手によってつくられている。多少自動化されているとはいえ、どんな複雑で巨大なシステムも人が一行一行書いている。そのため、勘違いや見落としなどの問題が発生する。これを前提として誤りのないソフトウェアを開発するための諸技術をまとめてソフトウェア工学(ソフトウェアエンジニアリング)という。この授業では、伝統的なソフトウェアエンジニアリングから比較的最近のソフトウェア技術に関連するソフトウェアエンジニアリングまでの網羅していく。この授業は、コンサルタントとして大手電機メーカーなどのシステム開発に携わった実務経験に基づく、実践的科目である。",
        "outcomesMeasuredBy": "この授業の履修によって、以下の修得を目指します。・伝統的なソフトウェア開発の概要(実学に基づく専門能力)・高品質はソフトウェア開発の方法(実学に基づく専門能力)・ソフトウェア開発のプロジェクト管理(実学に基づく専門能力)・演習を通じた深い理解(論理的な思考力、分析・評価能力)",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "原則、講義と演習を行う。予習のための教材を用意する場合には、その内容の理解度を判定するための小テストを行う。ノートPC必携。",
        "notices": "比較的規模の大きなソフトウェア(プログラム)の開発経験があることが望ましい。ソフトウェア開発における課題について事前に考えておいてほしい。",
        "preparatoryStudy": "教科書および指定の事前学習教材などを用いて予習し、授業に臨むこと。授業では、事前に学習したことを理解していると想定して講義と演習を行う。授業に関連して復習のためのレポートを課す。十分な予習・復習をしなければ、この授業から得られるものは少ないし、単位の修得も困難となる。",
        "gradingGuidelines": "予習に関わる小テスト及び授業に関連する毎週のレポート（40%）、中間レポート（30%）および最終レポート（30%）の成績から評価する。期末試験は実施しない。予習に関わる小テストについては、moodleを使い、授業の中でに正解をフィードバックする。",
        "textbook": "レクチャーソフトウェア工学、鵜林尚靖(著)、数理工学社、2,530円(税込)",
        "referenceMaterials": "・実践ソフトウェアエンジニアリング第9版、R.S.Pressman,B.R.Maxim(著)、オーム社、8,800円(税込)・ソフトウェア工学、中谷多哉子,中島震(編)、NHK出版、3,520円(税込)・ソフトウェア品質知識体系ガイド第3版、SQuBOK策定部会(編)、オーム社、4,400円(税込)・実践TLA＋プラン駆動型システム開発の理解と演習、HillelWayne(著)、翔泳社、3,850円(税込)",
        "courseSchedule": "第1回：ソフトウェア工学とは第2回：ソフトウェア工学開発プロセス第3回：代表的なソフトウェア開発手法第4回：ソフトウェアモデリングとUML第5回：要求獲得第6回：アーキテクチャ設計第7回：ソフトウェア分析第8回：ソフトウェア設計と実装第9回：ソフトウェアテスト第10回：形式手法第11回：ソフトウェア保守第12回：ソフトウェア品質第13回：プロジェクトマネジメントと開発環境第14回：これからのソフトウェア工学",
        "courseDataUpdatedAt": "2024/02/06"
    },
    "updateAt": "2024/05/29"
}