{
    "lectureCode": "C22302",
    "courseName": "データサイエンス[後期]",
    "lecturer": [
        "大野澄雄(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月3"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "2",
    "classroom": [
        "研究棟Ａ４０３"
    ],
    "courceDetails": {
        "courseOverview": "データサイエンスとは、数学・統計学、情報科学、機械学習、プログラミングなどの理論を活用してデータを分析し、科学的・社会的に有益な知見を見出すものである。データサイエンスでは、「ITスキル」、「統計学の知識」、「ドメインナレッジ」の3つのスキルが必要とされる。すなわち、プログラミングをはじめとするツールが使えるだけではなく、適切な統計手法を用いること、解析結果を活用分野に合わせて解釈して価値を見いだせる力を習得しなければならない。本講義では、特に構造化データ（表形式で蓄積されるデータ：例えば業務データ等）を対象とし、データサイエンティストの基盤となる分析・評価能力、及び問題解決力を身に着けることを目的とする。前半ではデータの処理方法や統計学的手法を学習し、後半では機械学習の手法を学習する。また、知識の習得だけでなく、プログラミング言語Pythonとそのデータ解析ライブラリPandas等を用いて実際のデータ解析プログラムを作成・実行し、分析結果を出すことによって実学に基づく専門能力を身に着ける。",
        "outcomesMeasuredBy": "・様々な分析方法を理解し、実行できるようになること（分析・評価能力、問題解決力）・問題に応じて適切なデータ処理方法、及び分析方法を組み合わせ、分析結果を出せるようになること（実学に基づく専門能力、分析・評価能力、問題解決力）",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力問題解決力",
        "teachingMethod": "講義資料にて理論的・技術的内容を解説し、Pythonによるサンプルプログラムを実行しながら分析手法の理解を深める。サンプルプログラムの実行やデータ分析の課題を行うためノートPCを持参すること。",
        "notices": "・１年次のデータサイエンス入門を理解しているものとして進めるので、理解が不十分である場合は復習しておくこと。・サンプルプログラムの実行やデータ分析の課題はPythonを用いて行うため、プログラミング基礎I\/IIで学んだPythonの文法の理解が不十分である場合は復習しておくこと。",
        "preparatoryStudy": "予習として、授業資料に目を通し、特に資料冒頭の「本日の内容」について把握して授業に臨むこと。復習として、第1回から第12回まで毎回演習課題を課すので、期限までに必ず提出すること。第13回、第14回については、第12回までの総まとめになるので、全体を通して授業内容および演習課題を復習すること。",
        "gradingGuidelines": "理解度確認結果(60%)、各回の課題とデータ分析演習結果（40%）によって総合的に評価する。理解度確認の講義回では、後半に解説を行う。",
        "textbook": "講義資料をWeb上で公開する。",
        "referenceMaterials": "・JoelGrus、菊池彰訳、「ゼロからはじめるデータサイエンス第2版―Pythonで学ぶ基本と実践」（オライリー・ジャパン）・塚本邦尊ほか、「東京大学のデータサイエンティスト育成講座～Pythonで手を動かして学ぶデ―タ分析～」（マイナビ出版）その他、講義中に紹介する",
        "courseSchedule": "第01回：データサイエンスの位置付け第02回：データ取得・データ前処理第03回：データの可視化第04回：統計的仮説検定(1)〜仮説検定とは。平均値の差の検定第05回：統計的仮説検定(2)〜独立性の検定。適合度の検定。母比率の差の検定第06回：重回帰分析による要因分析第07回：ロジスティック回帰分析による要因分析第08回：クラスター分析によるデータ分類第09回：次元削減によるデータ圧縮第10回：機械学習による予測モデルの学習と評価(1)〜教師あり学習。予測モデルの精度指標。決定木による予測モデル第11回：機械学習による予測モデルの学習と評価(2)〜過学習。決定木における説明変数の重要度第12回：時系列データ分析第13回：データ分析演習第14回：理解度確認およびまとめ",
        "courseDataUpdatedAt": "2024\/02\/29"
    },
    "updateAt": "2024\/05\/29"
}