{
    "lectureCode": "C22402",
    "courseName": "認知科学[後期]",
    "lecturer": [
        "菊池眞之(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "水2"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ３０２"
    ],
    "courceDetails": {
        "courseOverview": "本講義では人間の認知を司る脳の情報処理の仕組みや，その基盤の上に発現する「こころ」の有する性質などに主眼に据えて論じてゆく．科学としての人間自身についての知見を深めるとともに，将来新たなAIのアルゴリズムを創出するための基盤を養うことをも目指す．具体的には，脳の神経情報処理の性質や，視覚認知をはじめとする各種感覚情報処理の特性・機構，学習や記憶，運動制御・意思決定，注意・意識などの仕組み，さらには心理物理学や感情・感性，Brain-ComputerInterface，身体拡張とVR，自己と他者，ヒトとAIとの関係などについて論じる．本講義を通し，実学に基づく専門能力，論理的な思考力，分析・評価能力などを養う．",
        "outcomesMeasuredBy": "本講義の履修により，教養として私達自身の脳の中で行われる情報処理を理解するとともに，現実の問題にも適用可能なモデルを習得し自ら用いたり，視覚認知等に関連する実社会のデザインやアプリケーションの設計指針を考える際の参考にしたりできるようにすることを目指す（実学に基づく専門能力）．本講義で扱う各知見はコンピュータで再現し得るレベルで説明する．それらの理解を通し論理的な思考力を養う．そして各知見がどのように分析・評価されて確立されたのかも学びつつ，深層学習をはじめとする分析処理に適用可能なトピックスを扱うことで，受講生の分析・評価能力を醸成することも目指す．",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力",
        "teachingMethod": "スライドなどを活用しながら講義を進める．重要な項目については，眺めるだけでなく各自メモをとることを推奨する．授業中に説明した内容の理解度を問う課題を出題する．",
        "notices": "授業ではノートPCを使用するので毎回持参すること．",
        "preparatoryStudy": "予習について：毎回の授業にて，次の回の授業のトピックスに関連する複数のキーワードが提示されるので，各自それらを事前に調べておくことが望まれる．復習について：毎回の授業の理解には，それまでの授業内容が予備知識として必要になる．毎回の授業で不明確な点があれば復習し理解に努めること．",
        "gradingGuidelines": "成績は授業中に出題する課題の総得点と期末テストの得点とを50%：50%の比率で足し合わせた結果をもとに評価する．各回の課題の正解や得点の情報は提出期間締め切り後にMoodle上にて開示する．また，課題出題週の次の回の授業にて課題の解き方等について解説する．",
        "textbook": "特に定めない．",
        "referenceMaterials": "村上郁也(編)：「イラストレクチャー認知神経科学」，オーム社（2010）乾敏郎，川口潤，吉川左紀子(編)：「よくわかる認知科学」，ミネルヴァ書房（2010）福島邦彦，斎藤秀昭，大串健吾：「視聴覚情報処理」，森北出版(2001）高橋宏知：「メカ屋のための脳科学入門-脳をリバースエンジニアリングする」，日刊工業新聞社（2016）",
        "courseSchedule": "第1回:認知科学の諸領域の概観第2回:神経情報処理の基礎第3回:初期視覚第4回:中期視覚第5回:高次視覚第6回:聴覚・言語第7回:学習・記憶第8回:運動制御・意思決定第9回:注意・意識第10回:心理物理学第11回:感情と感性第12回:Brain-ComputerInterface第13回:身体拡張とVR・自己と他者第14回:ヒトとAI",
        "courseDataUpdatedAt": "2024\/02\/29"
    },
    "updateAt": "2024\/09\/13"
}