{
    "lectureCode": "C22502",
    "courseName": "分散コンピューティング[後期]",
    "lecturer": [
        "串田高幸(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ５０２"
    ],
    "courceDetails": {
        "courseOverview": "分散コンピューティングは，複数のコンピュータ上でプログラムが実行されて，高性能な処理能力を出すための方法であり，それを実現する仕組みは，分散システムと呼ばれている．分散システムは，コンピュータ間をネットワークで接続して効率よく利用できるようにするための統合化技術であり，最近の大規模Webシステム，クラウド，ビッグデータ処理，IoT，ブロックチェーンは，この分散システムで構築されている．この授業では，分散システムの基礎を体系立てて理解して，どのような機能を持っているのか，その特徴はどのようなものなのかを理解する．また，この授業では，主に実学に基づいた専門能力，分析・評価能力，問題解決力，コミュニケーション能力を身につけて，論理的な思考力を増やすことを目的としている．また，この授業は，担当教員が企業においてクラウドと分散システムの研究開発に従事した実務経験に基づき，大学で学ぶ基礎技術や知識が，実際の研究開発の現場でどのように利用されているかについて理解することができる実践的科目である．",
        "outcomesMeasuredBy": "・分散システムの透過性，開放性，制約を理解して説明できるようにする．（実学に基づく専門能力，分析・評価能力）・分散システムの種類と分散情報システムを体系立てて説明できるようにする．（実学に基づく専門能力，分析・評価能力）・分散システムのアーキテクチャについて，基本的な形式を理解して，課題に対して応用できるようにする．（実学に基づく専門能力，論理的な思考力，問題解決力）・プロセス，スレッド，仮想化，コンテナ化を体系立てて説明できるようにする．（実学に基づく専門能力，分析・評価能力）・クライアント・サーバモデルと，ソケット通信を理解して説明できるようにする．（実学に基づく専門能力，分析・評価能力）・同期，複製，一貫性，フォールトトレラント性を理解して，システムの課題を解決できることを説明できるようにする．（実学に基づく専門能力，論理的な思考力，問題解決力）・分散ファイル，分散オブジェクト，分散Webシステムを理解して説明できるようにする．（実学に基づく専門能力，分析・評価能力）・密結合型分散システムと排他制御を体系立てて説明できるようにする．（実学に基づく専門能力，分析・評価能力）・復習をすることで，習得した分散コンピューティング技術を適切に利用できるための能力を確実に習得する．（実学に基づく専門能力，論理的な思考力）・宿題では，実際に現場で使われている分散システム技術を検索によって調査して，この中から企業の活用事例として報告できる能力を確実に習得する．（分析・評価能力，コミュニケーション能力）",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・授業は，教科書を使った講義形式で行なう．・授業時間中に小テストや質疑のアクティブ・ラーニングを行なうことで内容の理解を深める．・講義資料は，Moodleからダウンロードできるようにする．・授業中に復習問題や小テストを行うため，ノートＰＣと教科書を必ず持ってくること．・授業内容の理解度を上げるため，宿題を出すので期限までに提出すること．",
        "notices": "・Web出席管理で出欠を記録する．授業の開始時刻に遅刻せずに出席すること．授業開始から10分以上経過した後の遅刻者は，欠席として扱う．・授業中によくわからないところや疑問点は，その場で質問をして理解を深めるようにすること．・分散システムの技術についての講義を行なうので，関連する技術ニュース，新聞記事，専門誌を日頃から読んで理解することに努めること．",
        "preparatoryStudy": "・予習は，事前に教科書や配布資料をよく読んで理解してくること(45-90分)．・復習は，授業でよくわからないところについて教科書や関連資料をよく読んで理解すること．また，授業中に理解ができなかったり疑問が残ったところは，再度小テストすることによって内容の理解を深めること．（45-90分)",
        "gradingGuidelines": "成績評価は，期末試験の結果（50%）と授業中の小テストと宿題の結果（50%）をもとに，授業態度を入れて判定する．合計100点満点として60点以上を単位として認める．ただし，復習，小テストと宿題の提出数が基準よりも足りないときは，不合格とする．学習内容の定着のため，復習，小テストと宿題の結果をMoodleを使ってフィードバックする．また，授業中に宿題の解答を説明することでのフィードバックを行なう．",
        "textbook": "分散システム（第2版）水野忠則監修共立出版社(ISBN978-4-320-12449-3)",
        "referenceMaterials": "DistributedSystems(ThirdEdition)byMaartenVanSteen,AndrewS.Tanenbaum分散システム真鍋義文著森北出版(ISBN978-4-627-81071-6)分散処理谷口秀夫著オーム社(ISBN978-4-274-20133-2)",
        "courseSchedule": "第１回分散システムの概要第２回分散システムの種類第３回通信第４回名前付け第５回アーキテクチャ第６回プロセス第７回クライアントサーバ第８回時計と同期第９回フォールトトレラント性第11回分散ファイルとオブジェクト第11回分散Webシステム第12回パ―ベイシブシステムと分散組み込みシステム第13回セキュリティ第14回まとめ，総合復習",
        "courseDataUpdatedAt": "2024\/02\/29"
    },
    "updateAt": "2024\/09\/13"
}