{
    "lectureCode": "C22601",
    "courseName": "プロジェクト演習I[テーマA・B]CS",
    "lecturer": [
        "岩下志乃(コンピュータサイエンス学部コンピュータサイエンス学科)",
        "大野澄雄(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "火3",
        "火4",
        "火5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "＜テーマA＞人工知能の根幹的技術である機械学習について理解すると共に，機械学習を組み込んだボット（自動返答システム）を作成することを目標とする．特に，言葉を用いたデータを機械学習に利用する方法を習得し，Webから収集したビッグデータの解析や利用に役立てられる技術を身につける．＜テーマB＞Linux系OSの利用に関して，ユーザとしての基本コマンド・操作を理解するだけでなく，管理者としてのシステム設定やサービス設置の方法を演習を通して学ぶ．また，設置した複数のサービスに対してウェブコンテンツを作成する技術について理解し，与えられた条件を満たすウェブサイトをグループで制作する．本演習を通じて，実学に基づく専門能力，論理的な思考力，分析・評価能力，問題解決力を身につける．また，グループワークを通じてコミュニケーション能力を身につける．",
        "outcomesMeasuredBy": "＜テーマA＞まずは機械学習の基礎技術と言語データへ応用する方法を身につけることを目標とする（実学に基づく専門能力）．次に，得た技術を応用し，データからの情報分類や知識発見ができるようになる（問題解決力，分析・評価能力，論理的な思考力）．分析から考察に至る一連の過程をグループワークで共有し，協調的に実施できるようにする（コミュニケーション能力，問題解決力）．概要，手順，結果，考察といったレポートの一連の流れを理解し，実際に作成できるようになる（論理的な思考力）．＜テーマB＞OSのインストールや各種サービスの設置について，手順書に沿った正確な操作ができるとともにそれらの各操作について理解する（実学に基づく専門能力）．また，個々に与えられた条件に応じて詳細な設定変更ができ（論理的な思考力，問題解決力），その動作結果について検証する方法を学ぶ（分析・評価能力）．グループワークにおいて与えられた問題を把握し（問題解決力），役割分担と作業協力をすることができる（コミュニケーション能力）．全体的な作業の流れを理解し、その記録を適切に文書としてまとめることができ，また作業成果について他者に説明することができる（コミュニケーション能力）．",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "＜テーマA＞講義部分は反転授業とし，事前にMoodle上に講義資料を配布し，予習してきてもらう．演習はMoodle上にアップロードしたオリジナルの資料に沿って進める．演習で得られた結果をレポートとしてまとめるための学習を行う．＜テーマB＞講義資料を配布し，資料内の指示に従って演習を進める．必要に応じて自らウェブ上の情報を参照してシステムの設定やコンテンツを作成する．個人サーバ・グループサーバともにグループワーク形式で協力して作業を進める．",
        "notices": "＜テーマA＞ノートPC必携＜テーマB＞ノートPC必携",
        "preparatoryStudy": "＜テーマA＞1年次の「プログラミング基礎I」「プログラミング基礎II」で学んだPythonプログラミングについてよく復習しておくこと．講義部分は反転授業のため，毎回の授業開始前にMoodle上に配布された講義資料と動画で予習し，理解度テストを実施してくること．演習時間に終わらなかった課題はスタッフの指示に従い翌週までに終えるようにすること．＜テーマB＞１年次の「情報リテラシー演習」で学んだUNIXの基本コマンドについてよく復習しておくこと．システム構築は毎週の作業の積み重ねになるので，前週までの内容を十分に理解して臨むこと．",
        "gradingGuidelines": "＜テーマA＞各回の課題提出（30%），レポート（70%）で評価する．レポートについては評価シートによりフィードバックする．＜テーマB＞レポート（60%），プレゼン（20%），制作コンテンツと貢献（20%）で評価する．レポートの評価について確認したい場合には個別に問い合わせてください．コンテンツとプレゼンについては当日講評する．この講義の成績評価は，＜テーマA＞と＜テーマB＞の評価を総合して決定する．",
        "textbook": "＜テーマA＞なし＜テーマB＞なし",
        "referenceMaterials": "＜テーマA＞・クジラ飛行机，増補改訂Pythonによるスクレイピング&機械学習開発テクニック，ソシム，2018・柳井，庄司（著），Pythonで動かして学ぶ自然言語処理入門，翔泳社，2019＜テーマB＞特に指定しない．最新情報はウェブ上のオフィシャルサイトやユーザの技術情報サイトが参考になるので，随時URLを紹介する．",
        "courseSchedule": "＜第1回～第7回：テーマA＞（岩下）第1回：導入・機械学習の基礎第2回：言語処理の基礎第3回：SVMによるネガポジ判定第4回：SlackBotの作成，第1回レポート作成第5回：SlackBotの対話戦略第6回：SlackBotへのオリジナル戦略の組み込み第7回：SlackBotの評価，第2回レポート作成＜第8回～第14回：テーマB＞（大野）第8回：OSインストール．遠隔操作．テキストエディタ演習第9回：CMS\"WordPress\"の設置とコンテンツ作成第10回：ウェブサーバの設置とコンテンツ作成(1)HTML，CSS第11回：ウェブサーバの設置とコンテンツ作成(2)CGI，認証，仮想サーバ第12回：グループサーバ構築・コンテンツ制作演習(1)グループごとに議論・計画して進める第13回：グループサーバ構築・コンテンツ制作演習(2)前回に引き続き、グループごとに議論・計画して進める第14回：グループサーバ構築・コンテンツ制作演習(3)前々回、前回に引き続き、グループごとに議論・計画して進める.後半は成果報告会",
        "courseDataUpdatedAt": "2024/02/07"
    },
    "updateAt": "2024/05/29"
}