{
    "lectureCode": "C22601",
    "courseName": "データインテリジェンス",
    "lecturer": [
        "瀬之口潤輔(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "木3"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ４０２"
    ],
    "courceDetails": {
        "courseOverview": "本授業では、ビジネスデータを数理により分析し、ビジネスの意思決定に繋げる方法を学修し、実学に基づく専門能力を身に付ける。回帰分析や時系列分析による売上予測、アソシエーション分析によるお薦め商品提案など、ビジネスにおける意思決定の質を向上する分析手法を習得する。また実際のデータを用いてpythonにより機械学習モデルを作成し、データの解析や将来予想を行う分析・評価能力や問題解決力も身に付ける。",
        "outcomesMeasuredBy": "本授業の到達目標は以下のようになっている。・pythonで人工知能と機械学習の使い方を理解する（実学に基づく専門能力）・伝統的な統計的手法と機械学習を用いてビジネスデータを解析する様々な手法を習得する（実学に基づく専門能力）・データ解析モデルの汎用性を高めるためのモデルの汎用性評価・ハイパーパラメータのチューニングの手法を学習する（分析・評価能力、問題解決能力）",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力問題解決力",
        "teachingMethod": "各回の授業はいずれも、講義と演習がセットになって構成されている。質問は随時行うので、積極的に教員と交流を図ること。授業は配布資料を中心に進める。ノートPCは必携。単に知識を知るだけではなく、積極的に手を動かすことに重きを置く。",
        "notices": "この授業では、一つの授業でわからないことがあると、次の授業につながらないことがる。よって授業中にわからないことがあれば、しっかりとわかるまで復習すること。復習は、授業内課題の解答と解説が授業終了時点でMoodleに公開されるので、それをよく理解し、同様の問題を解けるようにすることが重要となる。",
        "preparatoryStudy": "教科書には、この授業で扱うテーマがわかりやすく解説されている。授業内容についていけない場合は、自主的・主体的に教科書の該当部分を熟読し、わからない箇所をあとに残さないようにすること。",
        "gradingGuidelines": "授業中に実施する課題・小テスト（30%）、最終課題の結果(60%)、授業態度(10%)を総合的に判断し成績評価を行う。試験の採点後にMoodleに成績と解答例を記載する。",
        "textbook": "門脇大輔,阪田隆司,保坂桂佑,平松雄司「Kaggleで勝つデータ分析の技術」技術評論社、3,608円",
        "referenceMaterials": "指定しない。",
        "courseSchedule": "第1回：データの種類と構造第2回：線形モデルを使った時系列分析第3回：ニューラルネットワークを用いた画像認識、将来予測第4回：決定木ブースティングを用いた分類問題の解決第5回：様々な評価指標を用いた分析モデルの評価（回帰）第6回：様々な評価指標を用いた分析モデルの評価（分類）第7回：モデルの学習法（最急降下法）第8回：汎用性の評価・バリデーションの手法第9回：データの変換方法第10回：特徴量の次元削減第11回：特徴量の重要性の評価第12回：ハイパーパラメータのチューニング第13回：データのサンプリング・アンサンブル第14回：まとめ，最終課題",
        "courseDataUpdatedAt": "2025/01/28"
    },
    "updateAt": "2025/03/21"
}