{
    "lectureCode": "C22701",
    "courseName": "サービスマネジメント",
    "lecturer": [
        "細野繁(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "月2"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 2,
    "classroom": [
        "研究棟Ａ５０２"
    ],
    "courceDetails": {
        "courseOverview": "サービスマネジメントは、サービスの運営・管理・提供の最適化を目指す領域である。サービスの無形性、不可分性、異質性、消失性といった特性を踏まえ、顧客満足度を最大化するための方法を探求する。本講義では、サービスの定義、特性、設計、提供、品質管理、顧客関係管理など、サービスマネジメントの基礎から応用までを総合的に学ぶ。特にDX（デジタルトランスフォーメーション）に繋がるITサービスの効果的な設計と提供方法について学修を深める。ITサービスマネジメントのベストプラクティスであるITIL（InformationTechnologyInfrastructureLibrary）に沿って、デジタル技術による変革、柔軟性と俊敏性、バリューチェーンに焦点を当てていく。さらに、DXの促進やAIを活用したサービスなど、現代のサービスマネジメントにおける革新的な取り組みを学ぶ。この科目では主に実学に基づく専門能力、分析・評価能力、問題解決力の修得を目指す。",
        "outcomesMeasuredBy": "サービスの特性を理解し、これらがサービスの運営・管理にどのように影響するかを説明できること。効果的なサービスの設計および提供方法について学び、実践方法が分かること。サービスの品質管理および顧客関係管理の重要性を理解し、実践方法が分かること。ITサービスマネジメントのベストプラクティスであるITILの基本概念を理解し、実践方法が分かること。デジタル技術を活用したサービスの効果的な設計と提供方法を学び、DX促進やカスタマーデライト向上の仕組みが分かること。",
        "learningOutcomes": "実学に基づく専門能力分析・評価能力問題解決力",
        "teachingMethod": "全14回の授業は、教科書を中心に、参考書に挙げたトピックを網羅する形で進めていく。前半回の講義では、教科書とMoodleから配布するスライドを併用する。後半回の講義では、参考書に挙げた書籍のトピックに関して、Moodleから配布するスライドで解説を行う。ノートPC必携のこと。なお、論理的思考力の育成のため、授業及び課題取り組みにおいて生成AIの利用を一切認めないことがある。",
        "notices": "マネジメント理論だけでなく実践的な応用力を育むため、ケーススタディや事例を通じて学んだ内容をどう活かすかを考えることが重要である。デジタル技術とITサービスマネジメント分野は常に進化しているため、最新の情報やトレンドを追い続ける努力が必要である。",
        "preparatoryStudy": "開講までにITサービスマネジメントに関連する基本的なIT知識（クラウドコンピューティング、ネットワーク、データベースなど）を学んでおくと良い。受講期間中は、教科書を用いて予習し、授業に臨むこと。授業では、事前に学習したことを理解していると想定して講義を行う。授業後は、授業内容を振り返りながら教科書を再読し、課題レポートに取り組むこと。事前学習時間の目安は予習120分と復習120分程度。",
        "gradingGuidelines": "予習に関わるテストおよび各回の課題レポート（20%）、中間理解度チェック（30%）および総合理解度チェック（50%）の成績から評価する。テスト・課題レポートに対して、受講者全体へのフィードバックを行う。テストについては、moodleを使い解答期間の終了後に正解をフィードバックする。",
        "textbook": "ITIL4の知識と実践がこれ1冊でしっかりわかる教科書、加藤明、技術評論社（2023）、2,530円（税込）",
        "referenceMaterials": "・サービスサイエンス、岡田幸彦、原辰徳、放送大学教育振興会（2023）、3,190円（税込）・DX時代のサービスマネジメント、官野厚、技術評論社（2020）、2,398円（税込）・サービスエクセレンス規格の解説と実践ポイント、水流聡子、原辰徳、安井清一、日本規格協会（2022）、2,970円（税込）",
        "courseSchedule": "第1回：サービスとは第2回：サービスマネジメントとは第3回：ITILの主要概念第4回：サービスバリューシステム（SVS）第5回：バリューストリームユーザーサポート（VSM他）第6回：バリューストリームユーザーサポート（サービスレベル管理他）第7回：カスタマージャーニー第8回：リーン思考と実践第9回：価値共創の構造第10回：ITプロセスのリーン化第11回：最新ITに対応したマネジメント第12回：サービスエクセレンス、カスタマーデライト第13回：DX時代における経営第14回：まとめと理解度チェック",
        "courseDataUpdatedAt": "2025/02/05"
    },
    "updateAt": "2025/03/21"
}