{
    "lectureCode": "C22901",
    "courseName": "人工知能専門演習I[AI・1]",
    "lecturer": [
        "佐藤公則(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "研究棟Ａ３０３"
    ],
    "courceDetails": {
        "courseOverview": "近年あらゆる分野において画像処理，動画解析が求められている．実際，コンピュータの高速化・小型化とテレビカメラの分解能・感度向上・小型化・低価格化が平行して発展しつつあり，マシンビジョンシステムがFA・オフィス・医療・福祉など幅広い分野に導入されるようになってきた．本講義では，画像処理の基本から応用までを学び（分析・評価能力），講義演習を通して実際に，画像処理プログラムを作成し，処理のアルゴリズムと処理結果の解析までを学ぶ（実学に基づく専門能力）ことを目的とする．VisualStudioCommunity(無償）を用いて，言語としては，C++とPythonを用い，実際の画像処理を実装し，実行していく．主な内容は，静止画像・動画像の読み込み，平滑化やエッジ処理，HSVと肌色検出，直線検出・円検出，カスケード分類器を用いた顔検出，画像中の特徴検出などを行う．応用分野にて画像理解を行う必要が生じたときに使うべき技法を自ら考え，選択・実装できるようになることを目標にしている（論理的な思考力、問題解決力）．",
        "outcomesMeasuredBy": "本講義を通し，画像処理の本質を理解し（分析・評価能力），画像処理の各種技法の原理を習得するとともに，実際プログラムを組み自ら実行できることを目指す（実学に基づく専門能力）．応用分野にて画像理解を行う必要が生じたときに使うべき技法を自ら考え，選択・実装できるようになることを目指す（論理的な思考力、問題解決力）．",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "パワーポイントの講義資料を用いて講義する．講義資料はMoodleから入手できるようにする．Macでは受講できません.Moodleアクセスとプログラミングを行うため，受講にはノートPC（Windows限定）が必要である．",
        "notices": "画像処理開発のエンジニアになるための実務に就くことを意識して受講すること．レポート課題は必ず提出すること．復習・予習を十分におこなうこと．",
        "preparatoryStudy": "ノートPC（Windows限定）にVisualStudioCommunity(無償）を使えるように準備しておくこと．プログラミング基礎I,プログラミング基礎IIのPythonやC言語に関する実験・演習などで学んだプログラミングスキルを前提とする．予習については次回行う講義について資料を読んでおくこと．復習については，授業内で扱った例題や演習をもとに，再度振り返りを行い，その内容を確実に理解すること．",
        "gradingGuidelines": "レポート2回80%と毎回の演習の成果発表20%とする．レポート・演習の解答例はMoodleに記載する.",
        "textbook": "講義資料をMoodleにて配布する．",
        "referenceMaterials": "指定しない．ただし,C++やPythonに関する参考書を準備しても良い．",
        "courseSchedule": "第1回：環境構築（C++）第2回：静止画像・動画像の読み込み，表示と平滑化・二値化・エッジ検出第3回：HSV変換（肌色検出），ノイズ除去（膨張，縮小）第4回：ハフ変換（直線検出と円検出）第5回：haar-like特徴を用いた顔検出と目検出第6回：アルファチャンネル画像の重ね書き第7回：環境構築（Python）と静止画像・動画像の読み込み，表示第8回：LeapMotionプログラム作成第9回：Pythonによる平滑化・二値化・エッジ検出とHSV変換第10回：Pythonによるhaar-like特徴を用いた顔検出と目検出第11回：Pythonによるアルファチャンネル画像の重ね合わせとオーバーレイ第12回：Pythonによる特徴検出，直線検出，円検出第13回：Pythonによる背景差分，フレーム間差分，テンプレートマッチング，オプティカルフロー第14回：PythonによるGrubCut（グラブカット）",
        "courseDataUpdatedAt": "2024\/01\/30"
    },
    "updateAt": "2024\/05\/29"
}