{
    "lectureCode": "C23203",
    "courseName": "先進情報専門演習・知能II[AI・3]",
    "lecturer": [
        "松岡丈平(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "講義実験棟３０２"
    ],
    "courceDetails": {
        "courseOverview": "近い将来、人間とロボットが協働する社会が実現することを見据え、本講義ではソフトウェアエンジニアとして、ロボット制御プログラミングの基礎技術習得を目的とする。具体的には、AIを活用した物体認識、ナビゲーションプランニング、把持プランニングを実現可能なロボットを題材に取り上げ、次世代ロボットの制御技術を学ぶ。演習では、TurtleBot3Limeのシミュレータを用いた開発を通して、RobotOperatingSystem(ROS)の基本操作やロボット制御プログラミング技術を習得する。実施環境として、Windows上のWSL2を利用したDocker環境を想定しているため、事前に基本的なLinuxコマンドの使用方法を理解していることが望ましい。ロボット制御プログラミングではPythonを使用する。技術習得、理解の評価のために、講義の後半では、グループワーク形式でプチコンペを実施する。また、リアルロボットの制御も実際に体験する機会を提供する。これにより、理論と実践を統合的に学ぶことができる。本講義を通して、実学に基づく専門能力、論理的な思考力、分析・評価能力、問題解決力を身に着けることを目的としている。",
        "outcomesMeasuredBy": "・ROSの基本操作およびロボット制御プログラミングの基礎技術を習得し、実際のロボット制御を活用した開発に応用できるスキルを身につける。・Docker環境を用いた開発を通じて、ロボット制御に必要な現場レベルの技術を体得する。・グループワークを通じて、複雑な課題に対する分析的・論理的アプローチを体得する。・プチコンペ形式の演習や実機でのロボット制御課題に対し、創造的かつ効率的な解決策を立案・実行できるスキルを習得する。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "演習形式で実施するため、ノートPC必携である。講義の後半では、グループワーク形式でプチコンペを実施する。開発には主にPythonを使用する。WindowsOS、もしくは、UbuntuOSのノートPC必携。MacOSではROS周辺のツールが実行出来ないため、必ずWindowsOS、もしくは、UbuntuOSを準備してくること。第8回に第1回～第8回の理解度確認課題を課す（提出期限は第10回まで）。",
        "notices": "「情報リテラシー演習」、「プログラミング基礎I・Ⅱ」を履修していること。「情報リテラシー演習」、「プログラミング基礎I」の内容を十分に理解していること。Linux(Ubuntu)コマンドによる操作、および、Pythonの基礎的な構文については理解しておくこと。Pythonにおいて、「プログラミング基礎Ⅱ」の範囲であっても、授業で使用されている教科書については、前もって自習しておくことが望ましい。",
        "preparatoryStudy": "開発を行う際には、それ以前の授業内容を理解していることが必要となる。毎回の授業後には、授業内で用いたLinux(Ubuntu)コマンドやプログラミングの構文等は理解しておくなど、復習を十分に行うこと。また、次回資料が事前に公開された際には、同様に予習を行うこと。後半のグループワークでは、授業外でもグループメンバーとのコミュニケーションを欠かさないこと。",
        "gradingGuidelines": "第8回の理解度確認課題40%、第14回の成果発表会60%で評価する。プチコンペ実施回で並行して、課題のフィードバックを行う。",
        "textbook": "授業ごとに公開する講義資料を使用する．",
        "referenceMaterials": "・ROSロボットで学ぶ次世代のIoTアーキテクチャ，田胡和哉著，コロナ社，2023・ROS2とPythonで作って学ぶAIロボット入門，出村公成／萩原良信／升谷保博／タンジェフリートゥチュアン・著，講談社，2022・基礎Python改訂2版，IMPRESSKISOSERIES，大津真著，インプレス刊，2021(1年次のPythonの教科書である)",
        "courseSchedule": "第1回：ガイダンス、Docker+ROSの環境構築と確認第2回：Docker,VSCode,gazebo,rviz等の基礎ツールの説明第3回：ROSの基礎知識1（コマンド等実行上の基礎、パッケージ作成、GitHubからのパッケージの持ってきかた、通信等）第4回：ROSの基礎知識2（通信、座標系等）第5回：シミュレータを用いた基本的な機能の実習第6回：actor_demo、BehaviorTree(BT)について、BTを用いたプログラミングの基礎第7回：actorとBTの接続、actor解説、actor_demo解説第8回：actor&BT演習課題の実施第9回：プチコンペのルール説明（グループワーク）第10回：プチコンペ用のコード開発1（設計）[グループワーク]第11回：プチコンペ用のコード開発2（実装1）[グループワーク]第12回：プチコンペ用のコード開発3（実装2）[グループワーク]第13回：プチコンペ用のコード開発4（検証）[グループワーク]第14回：コンペ（成果発表会）第10回～第14回はグループワークで実施、各回ではチームごとに実機のTurtleBot3Limeを用いたロボット制御について体験してもらう。",
        "courseDataUpdatedAt": "2025/01/08"
    },
    "updateAt": "2025/03/21"
}