{
    "lectureCode": "C23301",
    "courseName": "社会情報専門演習II[SI・1]",
    "lecturer": [
        "細野繁(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "2年",
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "片柳研究所Ｃ１００１"
    ],
    "courceDetails": {
        "courseOverview": "サービスを科学的・工学的な視点で捉え、分析、設計、構築、管理するための基本概念と工学手法を体系的に講義する。近年、ICT技術は、企業の業務システムや一般消費者向けのツール開発に向けた活用だけでなく、例えば大都市への人口流入に伴う、市民の安全確保、飲料水の確保、食料廃棄の低減など社会課題の解決に向けた活用が求められている。この課題解決には、漠然とした問題意識・課題に内在する真の課題を捉えることが必要である。続いて、課題に関わるステークホルダ、規制・法律などのビジネス制約、データ保護の暗号化などの技術制約を考慮したシステムデザインが必要である。さらに、既存のICTシステムとの共存など、多くの要素を考慮したリソース設計と実装が必要である。そこで，本科目では、多面からシステムを捉えて設計～提供まで行えるように、工学手法を体系的に学習する。従来の開発経験や勘所に頼って様々なIoT機器やAIなどのICT技術を導入し局所最適するのではなく、例えばサイバー空間とリアル空間が連携した系としてのシステムを先ず全体設計し、ICT技術を正しく組み合わせてICTを基盤としたサービスを設計できるようにする。この科目は、教員のICT企業における、サービスシステムの企画・開発に従事した実務経験に基づき、大学で学ぶ基礎的な技術や知識が実際のシステム開発の場面でどのように活用されるかについて演習する実践的科目である。講義では、システムの要求分析から概念設計とその具体化までの手法を演習しながら習得していく。さらに新しい開発方法としてAI駆動開発方法の実践に取り組む。この科目では主に実学に基づく専門能力、論理的な思考力を身につけることを目的とする。さらに、分析・評価能力、問題解決力を蓄えることを目指す。",
        "outcomesMeasuredBy": "サービスの概念と定義、デザイン思考とシステム思考の考え方を理解する。工学手法として、ペルソナ法、要求機能展開、デザインストラクチャマトリックス、アクターモデル、サービスブループリントなどの代表的なモデリング方法と、UML・SysMLなどの表記法を理解する。事例に基づくモデリングの実習を通して、実学に基づく専門能力と論理的な思考力を獲得する。作成したモデルの評価を通じ、分析・評価能力および問題解決力を高める。",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "各授業は、講師が用意する資料を用いて行う。授業前半は、講義を中心に基本的な考え方を学び、後半はサービスシステム工学の手法の理解を深めるため、AI・IoTサービスを題材に、企画・設計・構築のフェーズに沿ってグループワークでの演習を行う。ノートPC必携のこと。なお、論理的思考力の育成のため、授業及び課題取り組みにおいてサンプルコードの参照やAIによるコードの生成を一切認めないことがある。",
        "notices": "この科目は、設計学を軸に、システム工学、ソフトウェア工学、品質工学、経営工学などを複合した新しいエンジニアリングである。各授業では、開発工程に沿って、多面から工学手法を体系的に講義していく。科目全体の内容を1冊の参考書に対応付けられないため、欠かさずに講義を受講し復習することを奨める。",
        "preparatoryStudy": "参考書を事前に読んでおくことが望ましい。各演習回の事前学習として演習回のトピックと使用ツールについて調査を行っておくこと。授業後は、講義スライドと演習内容を復習し、チームごとの発表準備などを進めること。事前学習時間の目安は予習120分と復習120分を含む予復習計300分程度。",
        "gradingGuidelines": "全レポートを提出すること。チームでの共同検討と発表による理解度の評価（50％）、授業中に実施する理解度確認による評価（20％）、レポートによる理解度の評価（30％）授業中に実施する理解度確認については、実施後その解答例を提示する。",
        "textbook": "講義にて使用するスライド（Moodleから配布する）",
        "referenceMaterials": "・システム×デザイン思考で世界を変える慶應SDM「イノベーションの作り方」、前野隆司他(著)、日経BP社、1,980円(税込)・事業計画に落とせるビジネスモデルキャンバスの書き方、西田泰典(著)、翔泳社、1,738円(税込)・モダン・ソフトウェアエンジニアリング、IvarJacobson他(著)、翔泳社、3,960円(税込)・図解即戦力システム設計のセオリーと実践方法がこれ1冊でしっかりわかる教科書、石黒直樹(著)、技術評論社、2,530円(税込)・上流から下流まで生成AIが変革するシステム開発、酒匂寛(著)、日経BP、2,860円(税込)・AI駆動でサービスを創る、貞光久月(著)、技術評論社、3,080円(税込)",
        "courseSchedule": "第1回：サービスのデザイン‐デザイン思考・システム思考，サービスシステム工学手法の体系第2回：AI・IoTサービスの企画（顧客セグメント，ペルソナ・シナリオ，アイデアの発想と選択）第3回：AI・IoTサービスの概念設計1（要求機能展開，リソース割当て）第4回：AI・IoTサービスの概念設計2（アクターマップ，価値連鎖分析，デザインストラクチャマトリックス）第5回：AI・IoTサービスの概念設計3（サービスブループリント）第6回：モデル表記法（SysML、UML）第7回：設計の振り返り（アジャイル開発、KernelAlpha、スクラム）第8回：実装リテラシー1（Git・GitHubを用いた共同開発）第9回：実装リテラシー2（VSCode、GitHubCopilotを用いた開発）第10回：実装リテラシー3（Dockerコンテナ、docker-compose）第11回：AI・IoTサービスのプロトタイピング1（設計：AIエッジデバイス、ローコードツール等）、および総合演習第12回：AI・IoTサービスのプロトタイピング2（実装・配備：Heroku等）、および総合演習第13回：AI・IoTサービスのプロトタイピング3（MicrosoftAzureOpenAIService、サーバー仮想化：Hyper-V)、および総合演習第14回：理解度チェック、チーム発表と振り返り",
        "courseDataUpdatedAt": "2025/02/05"
    },
    "updateAt": "2025/03/21"
}