{
    "lectureCode": "C30103",
    "courseName": "先進情報プロジェクト実習I[IT・3]",
    "lecturer": [
        "串田高幸(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "講義実験棟１０１",
        "講義実験棟１０２"
    ],
    "courceDetails": {
        "courseOverview": "この授業は，少人数のグループによる実習を行なうことによって，サイト・リライアビリティ・エンジニアリング（SiteReliabilityEngineering,以下SREと略する）と関連する知識とスキルの習得を目的とする．SREは，Googleが最初に提唱したシステム管理とサービス運用の方法論である．SERは，この名前のようにシステムの信頼性に焦点をあてて，システム運用を正しく設計することでシステム管理を効率化することによって，システムの信頼性を高めることを目的としている．多くのITシステムがクラウド上で稼働するようになり，日々の運用業務は，主としてクラウドサービスプロバイダが行うようになってきている．そのため，運用技術や運用管理は，SREをもとにビジネスの非機能要件を迅速に取り入れて，よりよいサービスを提供することが必要になっている．SREは，可用性と信頼性を保ちながら，高パフォーマンスの分散システムを構築・運用するためのエンジニアリングの原則をもとにした方法論であって，クラウド上のシステムでは，必須の技術になっている．この授業では，SREの実習を通して，実学に基づく専門能力，論理的な思考力と問題解決力をつける．また，実習におけるグループワークと成果発表を通して，コミュニケーション能力を強化し，さらに実習結果のレポート作成と報告を通して分析・評価能力をつける．この授業は，企業においてクラウドのアーキテクチャとシステム設計に従事した実務経験がある教員が，SREをもとにビジネス価値を訴求することを目的とした実践的な科目である．",
        "outcomesMeasuredBy": "この授業の到達目標は，以下の項目である．・メンバーが協力して，グループワークによってSREの実習を完了させる．（コミュニケーション能力，実学に基づく専門能力）・クラウドネイティブ環境の技術と操作を習得する．（実学に基づく専門能力，論理的な思考力）・SREに関連する技術を実習を通して習得する．（実学に基づく専門能力，論理的な思考力）・実習において発生した問題や課題をグループメンバーが協力して解決する．（問題解決力，コミュニケーション能力）・SREの知識や経験をもとに，他のシステム構成や設定においてもSREを使えるようにする．（実学に基づく専門能力，論理的な思考力）・授業中の課題の結果発表によって，問題の解決方法とトラブルの解消方法について説明できるようにする．（分析・評価能力，実学に基づく専門能力，コミュニケーション能力）・レポート作成によって，実習での問題の解決方法と評価結果を文書にして報告できるようにする．（分析・評価能力，実学に基づく専門能力，コミュニケーション能力）",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ノートブックPCとサーバ使って実習形式で授業を行なう．実習は，小人数のグループを作って，それぞれのグループごとに行う．",
        "notices": "・出欠，遅刻，早退を記録する．授業の開始時間に遅刻しないように，出席すること．・無断欠席や理由不十分の欠席があった場合，「実習への積極的な取り組み」にならないために注意すること．・提出資料（レポート，パワーポイント，ソースコード）や小テストは，必ず期限内に提出すること．・Windowsが動作するノートブックPCを使って，実習とレポート作成を行なうので，毎回持参すること．・Windows以外のOSは，サポートがないので問題が発生した場合，自分自身で解決すること．・ノートブックPCは，大学のWirelessLANにアクセスできるようにすること．",
        "preparatoryStudy": "下記の項目を事前に学習をして習得しておくこと．また，それぞれの実習の内容に応じて，下記の項目を見直して完全に利用できるようにすること．１．参考書を使ってSREやクラウドを理解すること．２．Linuxのコマンドを理解して，操作の必要に応じて使用できるようにすること．３．TCP\/IPの知識（IPアドレス，ポート番号，経路制御）を実際に利用できるようにすること．４．Pythonプログラミングによる開発をできるようにすること．５．Container\/Dockerの作成および操作方法ができるようにすること．毎回授業の前までに，次の実習に対して，参考書やインターネット上の技術資料をもとに予習しておくこと．また，毎回授業後に，レポートの作成と授業回の復習を参考書やインターネット上の技術資料をもとに行なうことで，授業回の内容に対する理解を深めること．",
        "gradingGuidelines": "成績の評価は，以下によっておこなう．・すべての授業回での実習の参加とグループ内での積極的な取り組みに対する評価（50%）・期限までのレポート，課題演習，提出物，構築した成果（システム，ソフトウェア，構成ファイル）の内容に対する評価（50%）上記の評価によって，100点満点で60点を合格とする．学修内容の定着のため，各グループの成果発表とそれに対するフィードバックを行なう．また，演習でのトラブルや問題点に対応したフィードバックを口頭とMoodleで適宜行なう．",
        "textbook": "実習のため，教科書は特に指定しない．",
        "referenceMaterials": "BetsyBeyer,ChrisJones,JenniferPetoff,NiallRichardMurphy編,SREサイトリライアビリティエンジニアリング,O'Reilly社BetsyBeyer,NiallRichardMurphy,DavidK.Rensin,KentKawahara,StephenThorne編,サイトリライアビリティワークブック，O'Reilly社青山真也，Kubernetes完全ガイド第2版，インプレス社．北山晋吾，早川博，Kubernetes実践ガイドクラウドネイティブアプリケーションを支える技術，インプレス社．高良真穂，15Stepで習得Dockerから入るKubernetesコンテナ開発からK8s本番運用まで，リックテレコム",
        "courseSchedule": "第1回ガイダンス，SREの基礎第2回Kubernetes\/Container-基礎第3回Kubernetes\/Container-実践第4回Kubernetes\/Container-応用第5回Helm-実践第6回Automation-基礎第7回Automation-実践第8回Logging-基礎第9回Logging-実践第10回Logging-応用第11回Monitoring-基礎第12回Monitoring-実践第13回Alerting-基礎第14回まとめと前期の報告",
        "courseDataUpdatedAt": "2024\/01\/09"
    },
    "updateAt": "2024\/09\/13"
}