{
    "lectureCode": "C30105",
    "courseName": "先進情報プロジェクト実習I[共通2]",
    "lecturer": [
        "松下宗一郎(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "アートと計算科学を融合するSTEAM（Science,Technology,Engineering,Art,Mathematics）の手法により、様々な身体運動技巧をモチーフとした実習を行う。身体運動を数値にて扱うための科学と数学、運動を捉えるセンサ技術に関するフィジカルコンピューティングのテクノロジー、運動技巧による芸術表現、小型身体装着型デバイス等によるリアルな社会実装を目指すエンジニアリングを組み合わせることで、従来の文系・理系や芸術・テクノロジーの境界線を越えた学問体系を体験する。コンピュータサイエンスの側面からは、特にコンピュータインタラクションによる静的および動的な情報処理技術について、リアリティのある実装を4～6人程度の少人数にて構成されるプロジェクトチームの元での構築を通じて習得していく。",
        "outcomesMeasuredBy": "人間の身体運動に関わる数値解析理論、デバイス実装技術、コンピュータインタラクションシステム構築、実験計画ならびに結果解析について、広い視野と深い専門性の修得を図ることで、履修者個々人のベーススキルと成長志向に沿った高いレベルでの実学に基づく専門能力、論理的な思考力、分析・評価能力、問題解決力の獲得を目指す。また、プロジェクトチームでの役割分担や運営方法といったプロジェクトマネージメントのスキルを習得することで、最先端のテクノロジーに携わるために要求される高度なコミュニケーション能力、論理的な思考力、ならびに問題解決力の獲得を目指す。また、授業の成果を学会論文発表等により社会へと還元することを最終的な目標とする。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "STEAM教育における広範な知識やスキルを個々の履修者が能動的に獲得するプロジェクトベースドラーニング（PBL）の手法を用いる。4～6人程度のプロジェクトチームを行動単位とし、最終目標と、その到達に必要となる知識やスキルの獲得をマネージメントしていくことで、従来の画一的な教育スキームの限界突破を図る。",
        "notices": "このプロジェクト実習では到達目標設定ならびに進行スケジュールの立案、スケジュールの実施管理、必要となる知識やスキルの獲得、結果の集約といった一連のプロセスを履修者が自主性をもって実行していくことが求められる。すなわち、単に与えられた課題を実施していくだけでは本科目の価値ある履修に対しては全くをもって不十分であることに十分留意頂きたい。また、プログラミングならびにデータ分析を行うためノートPCを必携とする。",
        "preparatoryStudy": "このプロジェクトでは、対象となる運動技巧の理解といった従来はコンピュータサイエンス学部の範疇にはない知識やスキルを前提とはしていない。この一方で、予習段階としては、データ分析ならびにプログラミングに関わる十分なスキルを有していることに加え、科学と芸術を融合させることによる、能動的なコンピュータサイエンスへの参画についての関心を持ち続けることが求められている。また、履修者個々人の資質と志向性に基づき、数学、物理学、芸術（音楽）、プロジェクトマネージメントといった専門領域に対し、文献講読や技術動向調査等を通じた日常的なスキルアップを図っていく必要がある。",
        "gradingGuidelines": "定められた時間の中で自らが定めた目標を達成していくプロセスへの自主性をもった参画状況(50%)並びに、期末プレゼンテーション(50%)を総合して成績評価を行う。また、評価では既存の製品やサービスにとらわれないオリジナルな発想やアプローチを特に重視するとともに、授業内での講評を実施する。",
        "textbook": "特に指定しない。",
        "referenceMaterials": "講義の中で適宜紹介をしていく。なお、JMOOC（https:\/\/www.jmooc.jp\/)にて、入門者向けのオンライン大学講座「フィジカルコンピューティングの世界」を開講している。",
        "courseSchedule": "第1回：身体装着型運動センサとフィジカルコンピューティング第2回：身体装着型運動センサデバイスによる計測第3回：モーショントラッキングと座標レジストレーション第4回：運動の数値データ分析(1)データの可視化第5回：運動の数値データ分析（2）計算アルゴリズム第6回：インタラクションシステムプログラミング（1）対話システム第7回：インタラクションシステムプログラミング（2）リアルタイム処理第8回：インタラクションシステムプログラミング（3）運動の可視化第9回：分析対象および運動技量の検討第10回：STEAM実習1運動技量を向上させる方法の発見的考察第11回：STEAM実習2リアルタイム運動レッスンシステムの構築第12回：STEAM実習3運動レッスンシステム有効性の検証実験第13回：STEAM実習4運動レッスンシステム有効性の考察第14回：成果プレゼンテーション",
        "courseDataUpdatedAt": "2024\/02\/05"
    },
    "updateAt": "2024\/05\/29"
}