{
    "lectureCode": "C30102",
    "courseName": "先進情報プロジェクト実習I[IT・2]",
    "lecturer": [
        "金光永煥(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "研究棟Ａ３０２"
    ],
    "courceDetails": {
        "courseOverview": "私達の取り巻くネット社会では，ポータルサイトやショッピングサイト等のWebシステムを日常的に使っている．ユーザ側から見れば便利なものであるが，開発者側にとっては，日々新しい開発技術・設計思想が広まっており，その技術競争は激しい．Webシステムは主に，Webページ，業務ロジック，DBアクセス等，いくつかのコンポーネントから構成される．これらの仕組みの設計思想，デザインパターンの基本を習得し，さらには実践としてチームとして設計・実装を行うのが本授業の目的である．開発言語は問わないが，例えばPHPやJSP/Servletを用いてロジック部を実装し，そしてMySQL等のDB製品によってDBを実現する予定である．チームとしてはまず，どのようなWebシステムを実装するか，そしてどのように設計し，実装するかまでを実習を通して学ぶ．これにより，今後のWebエンジニアとして必須とされる知識・技術の習得を目的とする．この授業では主に実学に基づく専門能力，論理的な思考力，コミュニケーション能力，問題解決力を身につけることを目的としている．",
        "outcomesMeasuredBy": "・Webシステムの基本と設計思想を学ぶ（実学に基づく専門能力，論理的な思考力）・チームによる設計・開発工程を学ぶ（実学に基づく専門能力，コミュニケーション能力）・サーバサイド言語によるWebシステム実装方法を学ぶ（実学に基づく専門能力，論理的な思考力）・データベースを用いたWebシステム開発手法を学ぶ（実学に基づく専門能力，分析・評価能力，問題解決力）",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "基本的な部分はスライドにより説明した後は，グループワークとして，各チームによって議論や協同によってシステム設計・実装を行う．ノートPC必携．",
        "notices": "-毎回の授業で，進捗報告を行い，次の授業でフィードバックを行う．進捗報告では，チームの各メンバーがそれぞれ何を担当し，何を行ったかを報告してもらう．-前提知識は問わないが，サーバサイド言語の基本を予め知っていると，チームを先導できるかと思われる．-WordPress等のCMSは使わずに，PHPやJSP/Servlet等のサーバサイド言語を使って実装すること．-時間的な制約上，5ページ程度のシンプルなWebシステムを実装してもらう予定．-多機能なものを開発すれば評価は上がる．-実装の例として，ユーザ登録＋ログインシステム，大学の食堂検索（ダミー），サークル検索（ダミー）システム等が挙げられるが，これに限らない．-最低限実装してもらう部分は，授業内で説明する．",
        "preparatoryStudy": "進捗報告を通じて各チームの課題を明確にし，60分以上の復習を行ってから授業に望むこと．",
        "gradingGuidelines": "毎回の進捗報告(40%)と，成果発表の結果(60%)による評価とする．また，各回では，前回の進捗報告のフィードバックを行う．",
        "textbook": "使用しない．",
        "referenceMaterials": "必須ではないが，講義内容をより深く理解するのに役立つ本を記載する．・松浦：「基礎からのサーブレット/JSP新版」，SBCreative，2017．・大井：「ゼロからわかるサーブレット&JSP超入門」，技術評論社，2018．・山田：「独習PHP第3版」，2016．",
        "courseSchedule": "第1回：Webサイトの設計思想，実習環境の導入第2回：データベースに概要，SQL第3回：SQLの基本第4回：PHPの基本第5回：PHPとDBの連携，PHPによるMVC第6回：JSP/Servletの基本第7回：JSP/Servlet，DBの連携，JavaによるMVC第8回：グループワーク（Webシステムの企画の基本）第9回：グループワーク（外部設計）第10回：グループワーク（詳細設計）第11回：グループワーク（開発）第12回：グループワーク（開発・試験）第13回：グループワーク（デバッグ）第14回：成果発表会",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/05/29"
}