{
    "lectureCode": "C30202",
    "courseName": "先進情報プロジェクト実習II[IT・2]",
    "lecturer": [
        "金光永煥(兼任講師)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "研究棟Ａ３０２"
    ],
    "courceDetails": {
        "courseOverview": "ネットワーク分野の実験では多数のノード間の通信を想定するために，実環境での評価が難しいとされている．そこで，シミュレータやエミュレータを実装して評価を行う場合が多い．例えば動画コンテンツの閲覧の場合，コンテンツサーバの性能，数や視聴者の数によって，そのパフォーマンスは異なる．また，ショッピングサイトでは同時アクセス数やサーバの性能によってWebコンテンツ配送までの時間も異なる．すなわち，クライアントとサーバの「数」の関係だけでなく，帯域幅や処理能力によってその性能が決まる．これらの振る舞いを，教員が作成したネットワークシミュレータであるnwsim(https://github.com/ncl-teu/nwsim)の設計・実装を行う．そして，機能拡張を通してネットワークの本質を理解してもらうのが本授業の目的である．この授業では主に実学に基づく専門能力，論理的な思考力を身につけることを目的としている．さらに，コミュニケーション能力，問題解決力と分析・評価能力を修得することを目指している．",
        "outcomesMeasuredBy": "・通信時間の算出手法の理解（実学に基づく専門能力，分析・評価能力）・ネットワークシミュレータの基本を学ぶ（問題解決力）・シミュレータの設計をチームワークを通じて学ぶ（論理的な思考力，コミュニケーション能力）・ネットワークシミュレータ開発を通じて，スレッドについての理解を深める（実学に基づく専門能力，論理的な思考力）・ネットワーク性能の評価手法を学ぶ（実学に基づく専門能力，問題解決力）",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "基本事項をスライドで説明した後，グループワークにより，シミュレータの設計・実装を議論等を通じて行う．ノートPC必携．",
        "notices": "・毎回，チームとしての進捗報告を提出してもらい，次の授業にてフィードバックを行う．進捗報告では，誰が，どの部分を担当して何を行ったのかを報告してもらう．・ゼロから作成することが望ましいが，例えば，ns-2,ns-3，NetworkX2.0の上で実装しても良い．また，担当教員が実装したシミュレータ群（情報指向ネットワーク,HadoopMapReduce,ネットワーク仮想化等）があり，これらの上で実装しても良い．しかしながら，既存のシミュレータを使うには仕組み自体に対するある程度の勉強・把握が必要となる上，基本コンポーネントは用意されているが，どのように使うかについての勉強が必要となる．よって，ゼロから作るほうが自分達独自のシミュレータを作るという意味で，得られるものは多いと思われる．・シミュレータの例としては，TCPの振る舞いのシミュレータ，動画ストリーミング配信のシミュレータ，アドホックネットワーク等が考えられるが，これに限定されない．・開発言語は問わないが，ネットワーク系シミュレータは，オブジェクト指向言語（Java,C++等）で実装するのが効率が良い（もちろん，Pythonでも可能）．",
        "preparatoryStudy": "・進捗報告によって課題を明らかにした後，60分以上費やして解決法を検討するのが望ましい．・前提知識としては，TCP/IPの基本（特にIPアドレス，TCPの基本）を知っていることが望ましい．",
        "gradingGuidelines": "進捗報告（40%）と成果発表（60%）による．また，各回で，前回の進捗報告に対するフィードバックを行う．",
        "textbook": "使用しない．",
        "referenceMaterials": "チーム毎に実装内容が異なるため，授業内で適宜指示する．",
        "courseSchedule": "第1回：シミュレータの基本，既存のシミュレータの紹介第2回：スレッドプログラミング（基本）第3回：スレッドプログラミング（応用）第4回：Javaによるネットワークシミュレータ(nwsim)の設計第5回：nwsimにおけるARPの振る舞い第6回：nwsimにおけるルーティングの振る舞い第7回：nwsimにおけるパケットフィルタリング第8回：グループワーク（nwsim上の機能実装の企画）第9回：グループワーク（nwsim上の機能実装の設計）第10回：グループワーク（nwsim上の機能実装の開発）第11回：グループワーク（nwsim上の機能実装の検証・試験）第12回：グループワーク（nwsim上の機能実装の実験）第13回：グループワーク（nwsim上の機能実装の評価）第14回：最終発表会",
        "courseDataUpdatedAt": "2024/01/09"
    },
    "updateAt": "2024/09/13"
}