{
    "lectureCode": "C30201",
    "courseName": "先進情報プロジェクト実習II[IT・1]",
    "lecturer": [
        "宇田隆哉(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "講義実験棟４０１"
    ],
    "courceDetails": {
        "courseOverview": "本実習は、情報セキュリティに人工知能を組み合わせることで解決される新たな領域について実践を通して体験し、理解を深めることを目的とする。受講者は機械学習を扱う技術について学び、自ら実装することにより情報セキュリティへの応用方法を実体験する。情報セキュリティにおける機械学習は、情報セキュリティ以外における機械学習と注意すべき点が異なる点について学び、実際のデータを評価および分析することにより、問題点と解決策を知る。本実習では、実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力、問題解決力の鍛錬を目指している。",
        "outcomesMeasuredBy": "人工知能のひとつである機械学習を、情報セキュリティに適用する方法について学ぶ。（実学に基づく専門能力、論理的な思考力、問題解決力）情報セキュリティにおける機械学習は、情報セキュリティ以外における機械学習と注意すべき点が異なる点について学ぶ。（実学に基づく専門能力、論理的な思考力、分析・評価能力、問題解決力）擬似的なデータセットや、グループ内で作成したデータセットを用いて、情報セキュリティを目的とした機械学習を行う。（実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力、問題解決力）情報セキュリティを目的とした機械学習の結果について、グループ内およびグループ間で評価を行う。（実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力、問題解決力）これらの仕組みや専門知識は、論理的な構造を伴うものであり、目標に到達する過程で、実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力、問題解決力を養う。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "ノートPCの使用と、教室から学内および学外ネットワークへの接続を前提に、グループワークの実習形式で授業を行う。受講者はノートPC必携であり、仮想的にLinuxを実行できる環境を構築できるだけの空き容量を、SSDまたはHDDに確保している必要がある。実習においては、教員の説明に従って実践を行う回と、それまでに得た知識を用いてアクティブラーニングとして自由に実装を行う回がある。自由に実装を行う回においては正解はなく、人工知能が情報セキュリティに対して適切に用いられない方法を選択している可能性もある。",
        "notices": "ノートPCはWindows環境で動作すること。Windows環境以外は自己責任とし、教員およびTAはこれをサポートしない。Windows環境の上で、仮想的にLinuxを実行可能な性能を持つノートPCを持参する必要がある。例えば、WindowsOSが仮想的に実行されている場合には、Windowsの上で仮想的にLinuxが実行可能であること。提出方法を守らないレポート、および、やむを得ない事情無く期日に遅れて提出されたレポートは受理しない。各回の実習では、それまでの回の知識や設定を利用するため、やむを得ず欠席した場合には、欠席した回の復習を次の回の実習までに行わないと、次の回の実習が行えない。先進情報プロジェクト実習I[CS]と原則通年の実習であり、先進情報プロジェクト実習I[CS]の知識および実装を使用する。",
        "preparatoryStudy": "コンピュータ概論I、コンピュータ概論IIの内容を理解していることを前提に実習を行うので、これらの科目の単位取得有無にかかわらず、本実習の開始日までにその内容を理解していること。プログラミング基礎I、プログラミング基礎IIを修得していることを前提に実習を行うので、本実習の開始日までに当該科目で問われた内容にすべて答えられるように復習しておくこと。情報リテラシー演習のLinux操作を修得していることを前提に実習を行うので、本実習の開始日までに当該科目で問われた内容にすべて答えられるように復習しておくこと。先進情報プロジェクト実習I[CS]の実装を使用するので、自己責任で仮想環境のバックアップを行い、データが喪失されないようにする。予習として、次の回の授業に必要な内容を事前に公開するので、資料を確認して知識を身につけておくこと。復習として、その回の授業内容で、グループメンバーやTAの助けが必要だった項目において、何ができなかったのかを再確認し、解決方法を理解する。",
        "gradingGuidelines": "各回のレポートの合計点を成績評価の基礎得点とする。レポートのフィードバックはMoodleにて行う。最終回の発表にて、学生間の投票で上位のグループに加点を行う。なお、自分のグループには投票できず、投票を棄権すると減点される。グループに加点された得点は、同じグループ内の学生間による投票により、票数に応じて得点が配分される。これにより、グループワークに貢献するほどよい成績になり、個人で提出するレポートがよいほどよい成績となる。各回のレポートは3点満点であり、投票項目は3種類ある。それぞれの投票項目につき、1位5点、2位4点、3位3点、4位2点、5位1点がグループに加算される。",
        "textbook": "なし",
        "referenceMaterials": "なし",
        "courseSchedule": "第1回：環境構築第2回：情報セキュリティプログラミング-マウスの座標、文字のくせ第3回：情報セキュリティプログラミング-画像第4回：情報セキュリティプログラミング-データ抽出、HTML第5回：機械学習の実装-Numpy、SVM、CNN第6回：機械学習の実装-モデル、SVMとCNNの比較、RNN、LSTM第7回：機械学習の実装-DT、RF、NB、SPAM第8回：機械学習の応用-ランサムウェア、n-gram第9回：機械学習の応用-Apacheログ第10回：機械学習の応用-Word2Vec、XSS第11回：プロジェクト-役割第12回：プロジェクト-評価、論文第13回：プロジェクト-考察、プレゼンテーション第14回：プロジェクト発表",
        "courseDataUpdatedAt": "2023/12/26"
    },
    "updateAt": "2024/09/13"
}