{
    "lectureCode": "C30404",
    "courseName": "人工知能プロジェクト実習I[共通1]",
    "lecturer": [
        "山口淳(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "ビジネスや社会において価値を創造するためには、シーズ（技術）と顧客のニーズ（マーケティング）の適切な組み合わせを実現することが必要となる。本科目では、前期のI、後期のIIを通じて、シーズとニーズをどのように適切に組み合わせるかが中心的なテーマである。そして、後期IIの最終発表に向けて、現実のビジネス・社会への課題解決や価値創造となる実践的なソリューション案を構築する。前期の序盤から中盤にかけては、顧客ニーズを調査・分析するための方法の基礎知識を学ぶ。具体的には、ペルソナマーケティングやマーケティングリサーチ方法を学んだ上で、新たなサービスを構築するための枠組みであるバリュープロポジションキャンバスやビジネスモデルキャンバスの枠組みを習得する。その上でこれらの手法を総合的に用いて世の中にあるニーズに焦点を当てる仮課題の設定演習を行う。前期の終盤は、シーズ側の知識習得に入る。最先端のAIoTの技術を解説した上で，IoTデバイスを用いるために必要となる実験環境を構築し、そこで用いられる技術の基礎を学ぶ。",
        "outcomesMeasuredBy": "ICTエンジニアが価値創造を行うために、技術を現実にどのように活用するかをPDCAを実践しながらソリューションを構築する。その構築経験を通じて、特に養成したい能力は、実学に基づく専門能力、論理的な思考力、問題解決力である。加えて、定量・定性データの分析実習やグループワーク・グループ発表を通じて、分析・評価能力とコミュニケーション能力を身に付けることを目標としている。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "〇前期Ⅰは全員が指定された講義と実験を全て受講・実施する。演習テーマによってはチーム分けを行い、チームごとに課題検討を進める。このことによりアクティブラーニングの促進を図り、グループワークを実践する。〇全回、ノートＰＣ必携である。",
        "notices": "実験環境ではLinuxを使用する。技術パートの初回に環境準備については指示する。また、実験結果の整理や報告書作成に関しては、指導教員の指示に従うこと。",
        "preparatoryStudy": "〇予習配布された実験テキストを読み、疑問点を整理すること。〇復習実験の流れの振り返りとデータ整理を行うこと。実験を実施しての疑問点があればまとめておき、次の実験時に質問すること。また各回で、グループに制作物を課す。指定の期限内までに必ず提出をすること。",
        "gradingGuidelines": "この授業の評価は、提出課題の内容、発表内容と最終レポートによって評価する。前期の評価割合は提出課題の内容50%、発表内容と最終レポート50%である。演習内容やグループ発表に関してのフィードバックは都度行う。フィードバックされた内容を示唆とし、本科目後期の新サービス提案に活用すること。",
        "textbook": "指定なし。実験に用いるテキストはmoodle等で配布する。",
        "referenceMaterials": "〇マーケティング基礎＿酒井光雄・武田雅之『全史×成功事例で読む「マーケティング」大全』かんき出版,2014年〇ビジネスモデル構築＿アレックス・オスターワルダー＆イヴ・ピニュール、小山龍介訳「ビジネスモデル・ジェネレーションビジネスモデル設計書」翔泳社,2014年",
        "courseSchedule": "第1回:ガイダンス：実験の進め方、注意事項第2回:マーケティングの定義第3回:市場調査のフレームワーク第4回:ペルソナマーケティング概要第5回:マーケティングリサーチ（イントロダクション）第6回:マーケティングリサーチ（作成）第7回:マーケティングリサーチ（分析）第8回:バリュープロポジションキャンバス第9回:ビジネスモデルキャンバス第10回:仮課題の設定・検討と個人発表準備第11回:仮課題の設定・検討と個人発表第12回:実験環境構築第13回:開発プロジェクト管理第14回:通信プロトコルと前期のまとめ",
        "courseDataUpdatedAt": "2024/01/07"
    },
    "updateAt": "2024/09/13"
}