{
    "lectureCode": "C30403",
    "courseName": "人工知能プロジェクト実習I[AI・3]",
    "lecturer": [
        "伝保昭彦(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実習科目",
    "courseStart": "2025年度前期",
    "classPeriod": [
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "研究棟Ａ４０２"
    ],
    "courceDetails": {
        "courseOverview": "人間は常に外界から与えられる情報を取捨選択し、先天的に備わっているメカニズムや後天的に得た知識・経験を利用して必要な判断を行っている。しかし、このような認知的処理は必ずしも意識的でも言語化可能でもないため、どのような処理が行われているかを明らかにすることは容易ではない。そこで、認知心理学の分野では認知的処理の結果が外部から観察可能な行動に反映されていると想定し、課題に対する反応時間や正答率を取得することで、人間の内部で行われている処理を推測するという方法が取られてきた。本授業では認知心理学の分野で頻繁に使用される心理学的実験を題材とした演習を行う。これにより、人間の行動を客観的にデータとして取得し、分析する方法を身に付ける（分析・評価能力、実学に基づく専門能力）。また、実験により得られた成果を報告する方法も学ぶ（論理的な思考力）。加えて、グループワークにより人間の認知に関する実験の提案を行う。なお、授業中に心理学的実験の課題を制御するためのソフトウェアや統計的な分析を扱うが、それらのソフトウェアや統計的な知識は前提としない。",
        "outcomesMeasuredBy": "観察することが困難な人間の内的処理を客観的に記録可能な行動に反映させ、データとして取得する方法を学ぶ。また、そのデータを統計的に分析し、論理的に報告する方法を習得する。グループワークにおいては他の班員と協調しながら、自ら新たな問題を発見し、解決する能力を養う（コミュニケーション能力、問題解決力）。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義・演習およびグループワークを指定の教室内で行う。講義と演習は全員共通して行うが、グループワークにおいては各班でテーマを自ら設定する。データの整理および分析、提出物の作成、グループワークにおける調査などに使用するため、全回ノートPC必携とする。必要なソフトウェアやPCの設定などについては、その都度指示する。",
        "notices": "本授業を担当する教員の人工知能プロジェクトⅠ・Ⅱは互いに独立した内容となっており、それぞれの履修を前提としていない。一方を履修していなくても、もう一方の授業内容が理解できるように構成されている。本授業ではR、RStudioおよびPsychopyを使用する。インストール方法や設定については授業内で指示する。なお授業内で使用するソフトウェアなどについてはWindowsでの動作を前提としている。その他提出物など、授業に必要な行動については授業内での教員の指示に従うこと。",
        "preparatoryStudy": "〇予習授業中指示のあった宿題については、指示された通りに提出すること。〇復習配布されたテキストの内容をよく読み、理解しておくこと。また分からない部分は積極的に質問すること。",
        "gradingGuidelines": "本授業の評価は、提出課題、グループワークにおける貢献とその成果、および最終レポートによって評価する。それぞれの評価割合は提出課題60%、グループワーク20%、最終レポート20%とする。最終授業で全体に対するフィードバックを行う。",
        "textbook": "指定なし。",
        "referenceMaterials": "川端・岩間・鈴木(2018)Rによる多変量解析入門データ分析の実践と理論オーム社公益社団法人日本心理学会認定心理士資格認定委員会(2015)認定心理士資格準拠実験・実習で学ぶ心理学の基礎金子書房大和田・鈴木(2023)〈第2版〉心理学基礎実験を学ぶ-データ収集からレポート執筆まで",
        "courseSchedule": "第1回：ガイダンス：本授業の進め方、注意事項など第2回：心理学実験の体験と分析①平均値の比較第3回：分析の続きとレポート作成①第4回：心理学実験の体験と分析②一要因の分析第5回：分析の続きとレポート作成②第6回：心理学実験の体験と分析③回帰分析第7回：分析の続きとレポート作成③第8回：実験課題の決定第9回：実験課題の作成①第10回：実験課題の作成②第11回：データの取得と分析第12回：成果発表の準備第13回：成果発表①第14回：成果発表②・総まとめ",
        "courseDataUpdatedAt": "2025/01/06"
    },
    "updateAt": "2025/03/21"
}