{
    "lectureCode": "C30503",
    "courseName": "人工知能プロジェクト実習II[AI・3]",
    "lecturer": [
        "伝保昭彦(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実習科目",
    "courseStart": "2025年度後期",
    "classPeriod": [
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": 3,
    "classroom": [
        "講義棟Ｄ３０１"
    ],
    "courceDetails": {
        "courseOverview": "研究・教育場面やマーケティングにおいて、授業やサービスの主観的な満足度を計測したいといったように、ある心理的な現象を連続的な数値上に表現したい場面は枚挙に暇がない。しかし、個人の主観的な体験やパーソナリティ特性、精神的な状態などを直接的に計測することは困難である。そこで、心理学の分野では、このような抽象的で直接計測することができない概念を質問紙によって間接的に測定するための方法が考案されてきた。何らかの行動や活動の背景にあると想定される抽象的な概念のことを構成概念という。また、何らかの心理的な現象や概念を測定するために数値を割り当てたものを心理尺度という。心理尺度によって構成概念を測定することを目的として、多くの質問紙は作成されている。本授業では、日常の様々な場面において使用されている質問紙について、その理論的背景や実践を学ぶ。また、グループワークにより新規の心理尺度と質問紙を作成する。なお、授業内では統計処理やデータ分析のためにR言語を使用するが、統計的な知識やRの使用方法についての知識は前提としない。",
        "outcomesMeasuredBy": "直接的な測定が困難な心理的現象を測定するための技法について学ぶ（実学に基づく専門能力）。心理的現象を定量的に測定することがある程度可能であるということと、そのような測定方法には限界があることの両面を同時に理解する。また、グループワークにより未知の課題を見つけ出し、データを取得したり、分析したりする方法を身に着ける（分析・評価能力、問題解決力）。これらの過程を通して、データを取得し、分析することの困難さを学び、データの解釈が複数あり得る中で論理的思考力を駆使して説得的にコミュニケーションを行う能力を身に着けることを目標とする（論理的な思考力、コミュニケーション能力）。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "講義・演習およびグループワークを指定の教室内で行う。講義と演習は全員共通して行うが、グループワークにおいては各班でテーマを自ら設定する。データの整理および分析、提出物の作成、グループワークにおける調査などに使用するため、全回ノートPC必携とする。必要なソフトウェアやPCの設定などについては、その都度指示する。",
        "notices": "本授業を担当する教員の人工知能プロジェクトⅠ・Ⅱは互いに独立した内容となっており、それぞれの履修を前提としていない。即ち、一方を履修していなくても、もう一方の授業内容が理解できるように構成されている。本授業ではRおよびRStudioを使用する。インストール方法や設定については授業内で指示する。なお授業内で使用するソフトウェアなどについてはWindowsでの動作を前提としている。その他提出物など、授業に必要な行動については授業内での教員の指示に従うこと。",
        "preparatoryStudy": "〇予習授業中指示のあった宿題については、指示された通りに提出すること。〇復習配布された実験テキストの内容をよく読み、理解しておくこと。また分からない部分は積極的に質問すること。",
        "gradingGuidelines": "本授業の評価は、提出課題、グループワークにおける貢献とその成果、および最終レポートによって評価する。それぞれの評価割合は提出課題60%、グループワーク20%、最終レポート20%とする。最終授業で全体に対するフィードバックを行う。",
        "textbook": "指定なし。",
        "referenceMaterials": "川端・岩間・鈴木(2018)Rによる多変量解析入門データ分析の実践と理論オーム社小塩(2024)心理尺度構成の方法-基礎から実践まで誠信書房",
        "courseSchedule": "第1回：ガイダンス：本授業の進め方、注意事項など第2回：心理尺度とその理論第3回：主観指標の演習①代表的な尺度の体験第4回：レポート作成指導①第5回：主観指標の演習②主観指標と行動指標第6回：レポート作成指導②第7回：心理尺度開発の前準備第8回：心理尺度の開発①第9回：心理尺度の開発②第10回：心理尺度の開発③第11回：データの取得と分析第12回：成果発表の準備第13回：成果発表①第14回：成果発表②・総まとめ",
        "courseDataUpdatedAt": "2025/01/06"
    },
    "updateAt": "2025/03/21"
}