{
    "lectureCode": "C30504",
    "courseName": "人工知能プロジェクト実習II[共通1]",
    "lecturer": [
        "山口淳(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "実習科目",
    "courseStart": "2024年度後期",
    "classPeriod": [
        "金3",
        "金4",
        "金5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "ビジネスや社会において価値を創造するためには、シーズ（技術）と顧客のニーズ（マーケティング）の適切な組み合わせを実現することが必要となる。本科目では、前期のI、後期のIIを通じて、シーズとニーズをどのように適切に組み合わせるかが中心的なテーマである。そして、この後期IIでは、現実のビジネス・社会への課題解決や価値創造となる実践的なソリューション案を構築し、最終発表を行うことが最大の目的である。具体的な進め方としては、序盤にデータ予測と可視化、物体認識とトラッキングといったAI技術を習得する。その上で仮問題の設定とチーム編成を行いプロジェクトを開始する。プロトタイプ設計・実装を行いつつ、提案内容やニーズを深堀し、最終発表に向けた準備を進める。",
        "outcomesMeasuredBy": "ICTエンジニアが価値創造を行うために、技術を現実にどのように活用するかをPDCAを実践しながらソリューションを構築する。その構築経験を通じて、特に養成したい能力は、実学に基づく専門能力、論理的な思考力、問題解決力である。加えて、定量・定性データの分析実習やグループワーク・グループ発表を通じて、分析・評価能力とコミュニケーション能力を身に付けることを目標としている。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "〇後期IIでは、希望テーマ（プロジェクト）によりチーム分けを行い、チームごとにそれぞれのプロジェクトを推進する。〇本実習の授業方法は、学生によるチームが１つのプロジェクトを進め、最終的に登壇する発表会を行う。このことによりアクティブラーニングを促進し、グループワークを実践する。〇全回、ノートＰＣ必携である。",
        "notices": "実施に際してはグループワークが中心となる。また、フェーズや内容によっては、学生とも相談の上、グループの入替を行う場合もある。また、演習結果の整理や報告書作成については、指導教員の指示に従うこと。",
        "preparatoryStudy": "〇予習配布された実験テキストを読み、疑問点を整理すること。〇復習実験の流れの振り返りとデータ整理を行うこと。実験を実施しての疑問点があればまとめておき、次の実験時に質問すること。また各回で、グループに制作物を課す。指定の期限内までに必ず提出をすること。",
        "gradingGuidelines": "この科目の評価は、グループワーク制作物、発表、個人提出のレポートによって評価を行う。評価割合はそれぞれ30%、30％、40%である。また、各テーマの演習やチームの取組に対するフィードバックがなされるので、それらのフィードバックを最終発表に活用すること。",
        "textbook": "指定なし。実験に用いるテキストはmoodle等で配布する。",
        "referenceMaterials": "〇マーケティング基礎＿酒井光雄・武田雅之『全史×成功事例で読む「マーケティング」大全』かんき出版,2014年〇ビジネスモデル構築＿アレックス・オスターワルダー＆イヴ・ピニュール、小山龍介訳「ビジネスモデル・ジェネレーションビジネスモデル設計書」翔泳社,2014年",
        "courseSchedule": "第1回:講演、ガイダンス、AI基礎（データ予測、可視化）第2回:IoTハンズオン、AI応用（物体認識、トラッキング）第3回:仮問題の設定・検討、チーム編成、予備発表会第4回:プロジェクトの開始、問題設定・検討＿ウォーミングアップ第5回:プロトタイプ設計＿実験環境構築第6回:プロトタイプ実装＿コア機能実現第7回:プロトタイプ実装・追加機能検討＿追加機能実現第8回:プロトタイプ実装と振り返り＿コア機能実現と振り返り第9回:プロトタイプ実装・追加機能の実装＿セキュリティ及びプライバシー保護第10回:技術融合第11回:仮説の検証と総合検討第12回:仮説の検証と最終発表準備第13回:総合演習（最終発表とフィードバック）第14回:実験結果の整理、報告書作成、まとめ",
        "courseDataUpdatedAt": "2024\/01\/07"
    },
    "updateAt": "2024\/05\/29"
}