{
    "lectureCode": "C30603",
    "courseName": "人工知能専門演習II[AI・6]",
    "lecturer": [
        "福西広晃(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "講義・演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "木4",
        "木5"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "3年",
        "4年"
    ],
    "numberOfCredits": "3",
    "classroom": [
        "研究棟Ａ５０３"
    ],
    "courceDetails": {
        "courseOverview": "近年、データとデジタル技術でビジネスモデルや働き方に変革を起こすことを目的とした「DX（デジタルトランスフォーメーション）」が推進されている。DX時代において、企業の競争力を高めるためには、蓄積されたデータを分析し、データ駆動型の意思決定を行うことが不可欠である。そして、DX時代を牽引する人材とって、データサイエンスは重要なスキルである。本講義では、プログラミング言語Pythonを用いてデータ操作、データ可視化、統計解析、機械学習に関する実践的なデータ分析を学ぶ。まず、データ分析の手法や分析結果の解釈方法を学習することを通して、論理的な思考力、問題解決力、分析・評価能力を身に付ける。また、演習課題を通して、実践的なデータ分析に取り組み、実学に基づく専門能力を身に付ける。",
        "outcomesMeasuredBy": "・Pythonを用いたデータ分析が実行できるようになること（実学に基づく専門能力）・データ分析の評価指標を理解し、分析結果を解釈ができるようになること（分析・評価能力）・分析の目的に応じて分析手法を選択し、分析プロセスの設計ができるようになること（論理的な思考力、問題解決力）",
        "learningOutcomes": "実学に基づく専門能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "・講義時間では、データ分析手法の原理およびPythonによる実装方法の解説を行う。演習時間では、個々の学生がPythonを用いたデータ分析課題に取り組む。・本講義は、各自のノートPCでプログラミングを行うため、毎回の授業でノートPCおよびACアダプタを持参すること。",
        "notices": "Pythonの基本を理解している前提で授業を行う。サンプルコードや演習課題はJupyterNotebook形式のファイルで配布するため、各自のノートPCにこのファイル形式を利用できる環境を準備しておくこと。",
        "preparatoryStudy": "毎回の授業は、それまでの講義・演習の内容が身に付いていることを前提に行うため、授業前までに前回の講義資料および作成したプログラムを復習し、知識を定着させておくこと。前回の演習で未完了の課題がある場合は、それを完了させておくこと。",
        "gradingGuidelines": "平常授業の演習課題（30%）と最終の総合演習課題（70%）によって評価する。授業内でTAのチェックによる演習課題のフィードバックを行う。",
        "textbook": "教科書の指定はなし。毎回、Moodle上に講義資料と演習資料を掲載する。",
        "referenceMaterials": "参考書の指定はなし。参考資料が必要な場合は、Moodle上に掲載する。",
        "courseSchedule": "第01回：データ検索/抽出第02回：データ集計第03回：データ加工第04回：データクレンジング第05回：データ可視化第06回：データ取得第07回：仮説検定第08回：レコメンドシステム第09回：クラスタリング第10回：予測分析①（過学習対策）第11回：予測分析②（ハイパーパラメータ探索）第12回：予測分析③（説明可能な予測モデル）第13回：因果分析第14回：総合演習",
        "courseDataUpdatedAt": "2024/01/29"
    },
    "updateAt": "2024/05/29"
}