{
    "lectureCode": "C40110",
    "courseName": "卒業課題I[CS]",
    "lecturer": [
        "串田高幸(コンピュータサイエンス学部コンピュータサイエンス学科)"
    ],
    "regularOrIntensive": "専門教育科目",
    "courseType": "演習科目",
    "courseStart": "2024年度前期",
    "classPeriod": [
        "他"
    ],
    "targetDepartment": "コンピュータサイエンス学部コンピュータサイエンス学科",
    "targetGrade": [
        "4年"
    ],
    "numberOfCredits": "4",
    "classroom": [
        ""
    ],
    "courceDetails": {
        "courseOverview": "卒業課題は大学での学びを総括するものであり、担当教員の指導のもとに、自主的活動の訓練とともに創意工夫の実践を行う。卒業課題Iでは企画の立て方に重点をおき、目的（何のために）、目標（何を）、課題（問題点の抽出）、手法（問題点の解決手法）、スケジュールなどを明らかにする。これらについては研究室などの発表会、中間発表会で批判を仰ぎ、卒業課題の目標達成に反映させる。卒業課題Iの推進にあたっては研究ノートを作り、毎日の調査学習の要点、考えたアイディア、問題点などを記録する習慣を身につける。担当教員の指導に従って、主に実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力と問題解決力を身につけることを目的としている。",
        "outcomesMeasuredBy": "卒業課題終了までの具体的なスケジュールなどを含んだ企画を立て、中間発表を行うことが一般的な目標であるが、具体的には、各指導教員の指示による。卒業課題Iは担当教員の指導に従って、主に実学に基づく専門能力、コミュニケーション能力、論理的な思考力、分析・評価能力と問題解決力を身につけることを目的としている。",
        "learningOutcomes": "実学に基づく専門能力コミュニケーション能力論理的な思考力分析・評価能力問題解決力",
        "teachingMethod": "創成課題で配属された研究室で、教員から指導を受ける。原則として毎日、卒研室で卒業課題に取組むこと。定期的に（通常、週1、2回）研究室内での集まりをもち、進捗状況・成果を指導教員や研究室の他の学生に報告・説明し、それに基づき討論を行い、指導を受ける。卒業課題に関連する文献の調査あるいは論文の輪講も必要に応じて行う。具体的な進め方は、研究室ごとの方針に従うものとするが、例年概ね以下の［授業計画］に示す内容となっている。",
        "notices": "卒業課題Iでは、上記の研究室の集まりの他に、各自の日常の勉学・研究、研究室内、研究室間の学生間の交流・討議が重要である。特に、研究室の集まりに無断欠席は絶対に許されないので、必ず指導教員に連絡を取ること。卒業研究は多くの時間をかけて計画的に行う必要があるので、必要となる時間を確保し卒業課題に専念すること。就職試験における面接の質問や作文のテーマには、卒業課題に関するものが取りあげられることが多いので、そのためにも日頃から卒業課題に打ち込んでいる必要がある。創成課題の履修時から、卒業課題の取組を考えて準備を進めること。",
        "preparatoryStudy": "研究室内での集まり、発表会などのほかに、その準備などに十分な時間（予習・復習）をかけなければならない。予習として研究の準備（文献調査など）を実施し、指導を受けた内容に応じて復習すること。",
        "gradingGuidelines": "卒業課題の企画の取組や研究室内などの発表会の内容と共に、研究室の集まりへの参加、報告の提出、中間発表会での発表と質疑など、期間内の活動状況を総合的に評価する。特に、中間発表会での発表は必須である。中間発表での発表内容や質疑の内容から、課題の取組み・理解が不十分と判断された場合、再発表を行うことがある。発表の結果によっては、不合格と判定されることがある。研究室内の集まりや発表会などで、指導の形で研究への取組に対してフィードバックする。",
        "textbook": "各指導教員の指示による。",
        "referenceMaterials": "各指導教員の指示による。",
        "courseSchedule": "第1回:創成課題と同じ研究室で活動を開始第2回～第4回:卒業課題の取組内容の検討・実施第5回～第11回:テーマ設定、準備・調査・解析・実験など第12回～第13回：研究室内で企画発表会を行う。複数研究室合同で企画発表会を行う場合もある。第14回:中間発表会",
        "courseDataUpdatedAt": "2024\/02\/29"
    },
    "updateAt": "2024\/05\/29"
}